{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:12Z", "source": "BBC_Business", "title": "US in talks over 10% Intel stake, White House confirms", "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss", "id_key": "db3b887d40903675b2e43b69711f4135fe734515950516fbe73f272da07284eb", "summary": "The potential deal could involve swapping government grants for shares in the chip making giant.", "ingested_utc": "2025-08-20T03:30:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "Family of New Zealand fugitive on the run for almost four years with his children plead for his return", "url": "https://www.theguardian.com/world/2025/aug/20/new-zealand-fugitive-tom-phillips-children-hiding-nearly-four-years", "id_key": "3e2a057f2404fcd77b8d3b365f3cb2289cff02c09e7ba8904ae70bcf34d38bf2", "summary": "In a New Zealand television interview, relatives spoke of their anguish since Tom Phillips disappeared with his three children in late 2021 The family of a fugitive father who has been hiding for more than three years in New Zealand’s rugged wilderness with his three children has pleaded with the man to come home, in some of their first public comments since he vanished. Just before Christmas 2021, Tom Phillips fled into the Waikato wilderness with his children Ember, now 9, Maverick, 1o, and Jayda, 12, following a dispute with their mother. Phillips does not have legal custody of his children. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "Noel Gallagher opens up about his brother Liam on Oasis reunion tour: ‘He’s been amazing’", "url": "https://www.theguardian.com/music/2025/aug/20/noel-gallagher-brother-liam-oasis-reunion-tour", "id_key": "0fd9ba2e445c6a73cf181298b106d3dba52ec60d8f4774bbf9c266d145ca5ab2", "summary": "Noel says his long-estranged brother is ‘smashing it’ during the band’s stadium shows and that he’s ‘proud’ of him Noel Gallagher has opened up about his feelings towards his long-estranged brother Liam during Oasis’ sold-out global reunion tour for the first time, saying: “He’s been amazing … it’s great being back in the band with Liam.” Oasis announced they would be reuniting in August 2024, 15 years after their split in 2009 when Noel quit the band after a backstage brawl at the Rock en Seine festival in Paris, saying he “simply could not go on working with Liam a day longer”. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "Teach boys and girls together about menstruation, UCL study argues", "url": "https://www.theguardian.com/education/2025/aug/20/teaching-boys-and-girls-mixed-classes-menstruation-periods-ucl-study", "id_key": "5162f9782291736dc217e806f0f43c66ff4f9b6b5f3541bf391bcec71e62c6da", "summary": "Mixed classes would widen children’s understanding and reduce stigma and disinformation about periods, researchers say Boys and girls should be taught together in mixed classes about menstruation to help reduce the stigma, secrecy and disinformation which still surrounds periods, according to researchers. A new study by University College London (UCL) claims schoolchildren are being given insufficient information about periods, with many receiving just two lessons during their entire school career: one at primary level and one in secondary school. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "Trump’s tariffs replace diplomacy as other US tools of statecraft are discarded", "url": "https://www.theguardian.com/us-news/2025/aug/20/trump-tariffs-replace-diplomacy-us-statecraft-discarded", "id_key": "240ff5a4ad0a0c0e506cc8499cf76a4ab203e11626502f07f063bd9526fda6d0", "summary": "Measures meant to rebalance America’s economy are wielded instead against the likes of Canada, India and Brazil ‘to compel loyalty to the president’ On the campaign trail, Donald Trump pledged to use tariffs to revitalise American industry, bringing jobs home and helping to make America great again. But more than six months into his administration, experts say the president’s trade war is increasingly being wielded as a political cudgel, in lieu of more traditional forms of diplomacy. The president’s current target, India, has been unable to reach a trade agreement and Trump appears ready to follow through with his threat to impose a further 25% tariff on Delhi – bringing the total to 50% – the joint highest levy on any country, along with Brazil. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "Microsoft workers occupy HQ in protest against company’s ties to Israeli military", "url": "https://www.theguardian.com/technology/2025/aug/19/microsoft-workers-protest-washington-israel", "id_key": "9586403a21cfc2e27d060ef13fec47a1b0c3702fac8b9f5d60dbf977235fef16", "summary": "Employees outraged by report Azure platform used by Israel to store surveillance data collected on Palestinians Dozens of Microsoft employees occupied the company’s east campus in Redmond, Washington to protest against what they say is the use of its software by the Israeli military to carry out operations in Gaza and enable the surveillance of Palestinians. Three months after the company said it was launching an independent investigation into the use of its Azure software, current and former staff occupied a space they declared the “Free Zone”, holding placards that read “Join The Worker Intifada – No Labor for Genocide” and “Martyred Palestinian Children’s Plaza”. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "Texas Democrats tear ‘permission slips’ imposed by Republican house speaker", "url": "https://www.theguardian.com/us-news/2025/aug/19/texas-democrats-permission-slip-protest", "id_key": "cdb2ffd26ffb28800283bb066dbccff436d86292b113ba72c7519db7ad3532a0", "summary": "Lawmakers refuse to vacate house chamber to protest surveillance after they left state over GOP attempt to redraw maps Texas Democrats are tearing up “permission slips” they signed in order to leave the chamber, joining state representative Nicole Collier ahead of Wednesday’s vote on the controversial Texas congressional redistricting maps. The slips are part of new surveillance protocols set by Texas Republicans in the house chamber, stating that Democrats would “be granted written permission to leave only after agreeing to be released into the custody of a designated [Texas department of public safety] officer” who would ensure their return to the chamber. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "Homeland security secretary Kristi Noem announces new Ice jail in Nebraska amid Trump crackdown – as it happened", "url": "https://www.theguardian.com/us-news/live/2025/aug/19/texas-congressional-maps-democrats-republicans-donald-trump-us-politics-updates-news", "id_key": "adc55486de358e9d760dc2b5aa5b958db985380ba15f80c3d4796e29a0db04df", "summary": "This blog has now closed. Read our latest here The Republican governors of Louisiana and Tennessee will send hundreds of their national guard troops to assist federal law enforcement in DC – to help assist the president’s “crime crackdown”. They join Mississippi, Ohio, West Virginia and South Carolina – who have all sent national guard troops to DC. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:15Z", "source": "Guardian_World", "title": "White House launches official TikTok account after Trump vowed ban in 2020", "url": "https://www.theguardian.com/us-news/2025/aug/19/white-house-tiktok-account-trump", "id_key": "33c01ed347903060643a7e0d3d279f2dcc4c5dc30a876ffba41412276d6f59e7", "summary": "US president was concerned over app’s Chinese ownership, but has softened after believing it won him 2024 election The White House launched an official TikTok account on Tuesday, as Donald Trump continues to permit the Chinese-owned platform to operate in the US despite a law requiring its sale. “America we are BACK! What’s up TikTok?” read a caption on the account’s first post, a 27-second clip, on the popular video-sharing app. Continue reading...", "ingested_utc": "2025-08-20T03:30:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:36Z", "source": "CryptoBriefing", "title": "Bitcoin slides, Ether, XRP, Dogecoin move lower ahead of Fed Chair’s final Jackson Hole speech", "url": "https://cryptobriefing.com/crypto-market-decline-fed-speech/", "id_key": "6027facfaeb11bba1b189a22644ae612247a5795bd240715245ad2e863fb4a0f", "summary": "Crypto market volatility underscores investor anxiety over potential Fed policy shifts, highlighting broader economic uncertainty and risk. The post Bitcoin slides, Ether, XRP, Dogecoin move lower ahead of Fed Chair’s final Jackson Hole speech appeared first on Crypto Briefing .", "ingested_utc": "2025-08-20T03:30:36Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:30:40Z", "source": "CoinJournal", "title": "Crypto update: Bitcoin slips as analysts warn of ‘fragile’ market structure", "url": "https://coinjournal.net/news/bitcoin-slips-as-analysts-warn-of-fragile-market-structure/", "id_key": "4baf556b3b29be73a6b0c90d40d65791d97540989c2aea53ddc290ad9e4eeec1", "summary": "Bitcoin and Ether prices are falling despite positive industry news. A key disconnect exists between weak price action and strong fundamentals. Glassnode warns of market fragility and stretched leverage in the short term. A profound and unsettling disconnect is cleaving the cryptocurrency market in two as the trading day begins in Asia. While a torrent […] The post Crypto update: Bitcoin slips as analysts warn of ‘fragile’ market structure appeared first on CoinJournal .", "ingested_utc": "2025-08-20T03:30:40Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:32:32Z", "source": "MarketWatch_Bulletins", "title": "This economist misread bitcoin's future. Here’s what he says he got wrong.", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=3c8cab40-6716-4ec8-a202-d5a7b8852c81&mod=mw_rss_bulletins", "id_key": "d9c8a6216e7f629b1745a5fd54070f91aa7a2d159b654f78845d3c710594eacb", "summary": "", "ingested_utc": "2025-08-20T03:32:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:32:39Z", "source": "NYTimes_Business", "title": "Documents Add Detail to Fox Hosts’ Desire to Help Trump", "url": "https://www.nytimes.com/2025/08/19/business/media/fox-news-trump-election-documents.html", "id_key": "1bdf87b2e3042869d1bbc153bd824092c73feb054612fc661ab46c92669a1d42", "summary": "The documents were released as part of a defamation case against Fox Corporation filed by Smartmatic, an election technology company.", "ingested_utc": "2025-08-20T03:32:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:32:39Z", "source": "NYTimes_Business", "title": "He Tried to Endorse From the Pulpit. He Wound Up Without a Church.", "url": "https://www.nytimes.com/2025/08/19/us/politics/church-endorsements-irs-kenosha.html", "id_key": "7dada078e055bf48877ce3e19640da6b67ee230eb23f8b78071d209035587c1e", "summary": "The I.R.S. says churches can now support candidates during services, but many denominations still forbid it. A Wisconsin pastor learned the hard way.", "ingested_utc": "2025-08-20T03:32:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:32:39Z", "source": "NYTimes_Business", "title": "MSNBC’s Rebrand to MS NOW Invites Bemusement and Ridicule", "url": "https://www.nytimes.com/2025/08/19/business/msnbc-ms-now-rebranding.html", "id_key": "c3822fed202e09e0b872a54b5f50d37c6f4c4e38982e6070036ec4ce038346db", "summary": "The cable TV network’s new name, MS NOW, became the subject of mockery on social media soon after it was announced on Monday.", "ingested_utc": "2025-08-20T03:32:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:32:40Z", "source": "NYTimes_World", "title": "White House Presses Meeting, Security Guarantees That Russia Has Yet to Accept", "url": "https://www.nytimes.com/live/2025/08/19/us/trump-zelensky-ukraine-russia", "id_key": "eb542c4f6b67ba252db2d476716cb36a209ee13b2b70354ea61d766db9c47c9c", "summary": "A White House spokeswoman said Vladimir Putin had agreed to a meeting with Volodymyr Zelensky, but Russia has not confirmed. President Trump said American troops would not be deployed in Ukraine.", "ingested_utc": "2025-08-20T03:32:40Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:08Z", "source": "TheVerge_All", "title": "The White House just joined TikTok", "url": "https://www.theverge.com/politics/762031/trump-white-house-tiktok-account", "id_key": "ace7ced7620e204084734ab202a163b8f852cb014409be7050e292477da68487", "summary": "While it was President Joe Biden who signed the law that would force ByteDance to sell its stake in TikTok or face a ban, it’s his successor, Donald Trump, who has yet to fulfill his promise of arranging a deal to keep TikTok running, legally, in the United States. The current deadline for a deal […]", "ingested_utc": "2025-08-20T03:33:08Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:12Z", "source": "Engadget_All", "title": "The White House now has a TikTok account", "url": "https://www.engadget.com/social-media/the-white-house-now-has-a-tiktok-account-032420845.html?src=rss", "id_key": "a0296e704446e17dc13974e17c7161a4c70edd80f21c76f49a1d1de210ac8b82", "summary": "The White House has joined TikTok, the social media app that President Trump wanted to ban during his first term. Its first post shows clips of Trump in various events with Kendrick Lamar's track playing in the background. The New York Times notes that it references a popular video edit of Creed, a boxing movie starring Michael B. Jordan, on the app. In the TikTok post, Trump could be heard saying \"I am your voice,\" while the caption reads \"America we are BACK! What's up TikTok?\" Trump's administration believes TikTok helped him win over young voters in the 2024 Presidential election, with the account he used to campaign having over 15 million followers. \"President Trump's message dominated TikTok during his presidential campaign, and we're excited to build upon those successes and communicate in a way no other administration has before,\" White House press secretary Karoline Leavitt said in a statement . The president wasn't always fond of the platform. He once vowed to ban the app in the US and signed an executive order to outlaw any transaction between the app and its China-based parent company ByteDance for national security reasons. TikTok's \"data collection threatens to allow the Chinese Communist Party access to Americans' personal and proprietary information — potentially allowing China to track the locations of Federal employees and contractors, build dossiers of personal information for blackmail, and conduct corporate espionage,\" the executive order read . After taking office earlier this year, however, Trump quickly put a pause on the law that was supposed to ban TikTok in the US. He even delayed the ban a couple more times to give ByteDance more time to sell its US business. Trump previously claimed that a \"very wealthy\" group is poised to buy TikTok, but the administration has yet to reveal the identities of the people in it. This article originally appeared on Engadget at https://www.engadget.com/social-media/the-white-house-now-has-a-tiktok-account-032420845.html?src=rss", "ingested_utc": "2025-08-20T03:33:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:12Z", "source": "Engadget_All", "title": "Apple's new iOS 26 beta 2 has new features, but is your iPhone compatible? Check this list", "url": "https://www.engadget.com/mobile/apples-new-ios-26-beta-2-has-new-features-but-is-your-iphone-compatible-check-this-list-191854362.html?src=rss", "id_key": "db8d4f11c31d85a65e4e3d2ea3ab842efb07bc48193cf9172daf4122e7754cbc", "summary": "The wait for accessing iOS 26 and iPadOS 26 is getting shorter as the Apple iPhone event inches closer. The OS 26es are bringing huge upgrades to your iPhone and iPad's operating systems. One you've probably heard us talk about numerous times is the visual update: Liquid Glass . (It's like the better-executed version of Windows Vista .) We spent two weeks test-driving it — you can check out our detailed hands-on iOS 26 preview , or you can try it out yourself by downloading and installing the public beta 2 . That software is a more stable iteration of the separate developer version, which recently hit the beta 7 waypoint, and offers a few more flashy features not yet available in the public version. (While the public beta is open to everyone and quite stable, always remember there's a degree of risk involved with beta software.) Additionally, there are credible reports that iOS 26 could bring a new live translation feature to AirPods , too. Not sure if you want to upgrade your smartphone or tablet this year? No worries, we'll help you find out if your devices will be able to run iOS 26. While Apple didn't nix any iPhones from its eligibility list last year, that's not the case for 2025 — a few models are getting cut this time. All iPhone 8 models and the iPhone X were the last to get the boot in 2023, and this year the 2018 models are getting left behind. If you have an ineligible device, you won't be able to download iOS 26 when it becomes available this fall. We'll get to the bottom of which iPhones and iPads will support iOS 26 and iPadOS 26 this year. To see what's coming with the latest OSes, check out everything announced at Apple's WWDC June 9 event . One thing you shouldn't immediately expect is Apple's updated version of Siri , though the company is reportedly working on a 'stripped-down' AI chatbot to compete with ChatGPT. These three iPhones won't be compatible with iOS 26 Unlike last year, several iPhone models won't be eligible to download the newest iOS when it makes its debut this fall. This trio of models first released in 2018 won't be coming to the iOS 26 party: iPhone XR iPhone XS iPhone XS Max iPhones compatible with iOS 26 While we don't yet know the new iPhones Apple will be dropping this fall — though there are iPhone 17 rumors — we do know, per Apple's site , that the phones listed below will be compatible with iOS 26. Basically, if you have an iPhone that was announced in 2019 or later, you're in the clear: iPhone SE (second generation or later) iPhone 11 iPhone 11 Pro iPhone 11 Pro Max iPhone 12 iPhone 12 mini iPhone 12 Pro iPhone 12 Pro Max iPhone 13 iPhone 13 mini iPhone 13 Pro iPhone 13 Pro Max iPhone 14 iPhone 14 Plus iPhone 14 Pro iPhone 14 Pro Max iPhone 15 iPhone 15 Plus iPhone 15 Pro iPhone 15 Pro Max iPhone 16 iPhone 16 Plus iPhone 16 Pro iPhone 16 Pro Max iPhone 16e iPads compatible with iPadOS 26 The iPads listed below, and any iPads released later this year, are eligible to download iPadOS 26 . iPad Pro (M4) iPad Pro 12.9‑inch (3rd generation and later) iPad Pro 11‑inch (1st generation and later) iPad Air (3rd generation and later, including M2 and M3) iPad (8th generation and later, including A16) iPad mini (5th generation and later, including A17 Pro) What if I don't want to buy a new iPhone? If you want to continue using your older iPhone that isn't supported by iOS 26, that's fine. However, you'll miss out on security updates which could potentially put your phone at risk for malware and other threats. Additionally, some apps may stop working if they require a certain version of iOS or later. And of course, you won't be able to access the latest features iOS 26 offers. When will iOS 26 become available? Apple usually rolls out its latest iOS in mid-September, just a few days before the new iPhones hit store shelves. Last year, it released iOS 18 on Monday, Sept. 16. Expect a confirmation of the release date at the iPhone 17 event, expected in early September. iOS 26 features we're excited about Liquid Glass design : Your home screen is getting revamped with new app icons, including dark mode and all-clear options. You'll also notice buttons with a new floating design. Liquid Glass was designed to make all of Apple's OSes more cohesive. Phone app redesign: You'll finally be able to scroll through contacts, recent calls and voicemail messages all on one screen. It also comes with a new feature called Hold Assist that'll notify you when an agent comes to the phone so you can avoid the elevator music. Live Translate: iOS 26 is bringing the ability to have a conversation via phone call or text message with someone who speaks another language. Live Translate will translate your conversation in real time. Polls feature: Coming to group messages in the Messages app, chat members will be able to create polls. This can help prevent the unwanted 30+ messages when it comes to deciding which restaurant you're meeting at this weekend. This article originally appeared on Engadget at https://www.engadget.com/mobile/apples-new-ios-26-beta-2-has-new-features-but-is-your-iphone-compatible-check-this-list-191854362.html?src=rss", "ingested_utc": "2025-08-20T03:33:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:21Z", "source": "TheStreet_Top", "title": "Amazon is selling a $1,200 cloud-like sectional sofa for only $527", "url": "https://www.thestreet.com/deals/maxyoyo-l-shaped-modular-sectional-sofa-amazon-sale", "id_key": "571005c894af978798c12dd4b33dade2db0427bdcfdc134d2c42fdd992ef3f5e", "summary": "With a modular design, the seating options are endless.", "ingested_utc": "2025-08-20T03:33:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:21Z", "source": "TheStreet_Top", "title": "Mom-created clothing brand files Chapter 7 bankruptcy", "url": "https://www.thestreet.com/retail/fashion-brand-worn-by-kate-middleton-files-chapter-7-bankruptcy", "id_key": "015606f176693a4b0262e969f1c39ff1b505a41dfca65600850b526ebedf5edf", "summary": "The company has closed its doors and laid off all workers in a move that came after a long period of decline.", "ingested_utc": "2025-08-20T03:33:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:21Z", "source": "TheStreet_Top", "title": "Historic fast-food restaurant closing in Chapter 11 bankruptcy", "url": "https://www.thestreet.com/restaurants/harolds-chicken-locations-file-for-bankruptcy", "id_key": "e0c687215b3cf0de3cbb956c3082e5de9858ce39194eeaaf3d9a11a23acb149a", "summary": "\"We've made the decision to close this location,\" a voicemail for the restaurant now says.", "ingested_utc": "2025-08-20T03:33:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:21Z", "source": "TheStreet_Top", "title": "Tesla lands in more hot water over Elon Musk's Full Self Driving claims", "url": "https://www.thestreet.com/technology/tesla-in-hot-water-elon-musks-fsd-claims", "id_key": "d59e6a20a563d88976d73efc6a05bb02782608d17845967cf5ba387a3914b25b", "summary": "A California judge ruled against the company in an important civil suit.", "ingested_utc": "2025-08-20T03:33:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:22Z", "source": "AlJazeera_All", "title": "No US troops in Ukraine, Trump says", "url": "https://www.aljazeera.com/news/2025/8/20/no-us-troops-in-ukraine-trump-says?traffic_source=rss", "id_key": "6efde9fc65371002afef80be5bb56c7c2efde0974d26c9ec890c4c498069b944", "summary": "US president suggests security guarantees for Ukraine could see Washington provide air support.", "ingested_utc": "2025-08-20T03:33:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:22Z", "source": "AlJazeera_All", "title": "N Korea says S Korea ‘cannot be a diplomatic partner’ as US drills continue", "url": "https://www.aljazeera.com/news/2025/8/20/n-korea-says-s-korea-cannot-be-a-diplomatic-partner-as-us-drills-continue?traffic_source=rss", "id_key": "dbab01d472e0f75a30fd9159b7516d168fdcb7624ca42f6b26e6bb12cd863ac0", "summary": "North Korean leader's sister rejects peace overtures from South Korea, denouncing its ongoing military drills with US.", "ingested_utc": "2025-08-20T03:33:22Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:22Z", "source": "AlJazeera_All", "title": "Mbappe scores as Real Madrid beat Osasuna in La Liga season opener", "url": "https://www.aljazeera.com/sports/2025/8/19/mbappe-leads-real-madrid-to-narrow-osasuna-win-in-la-liga?traffic_source=rss", "id_key": "943d4676f144a3cbd5c207546de4b5aaf84ac0ed84fe48fad4c5f31fdd76354d", "summary": "Kylian Mbappe's goal secures the nervy 1-0 home win for Real Madrid against Osasuna in their La Liga season opener.", "ingested_utc": "2025-08-20T03:33:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:28Z", "source": "FinancialPost_Business", "title": "World’s Two Biggest Miners Meet With Trump Over Copper Project", "url": "https://financialpost.com/pmn/business-pmn/worlds-two-biggest-miners-meet-with-trump-over-copper-project", "id_key": "750b56820f72f66eae5742523afa0a982304af79ce02ce91c352b78f33a7b40f", "summary": "The chief executive officers of the world’s two biggest mining companies met President Donald Trump to discuss a copper project that could supply the US with a quarter of its demand for decades to come.", "ingested_utc": "2025-08-20T03:33:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:28Z", "source": "FinancialPost_Business", "title": "China Set to Tackle Petrochemicals Overcapacity With Overhaul", "url": "https://financialpost.com/pmn/business-pmn/china-set-to-tackle-petrochemicals-overcapacity-with-overhaul", "id_key": "d758c48d5c456596344ce91d3055520b500300dee36a33d85223ba365599f8bb", "summary": "The Chinese government is set to launch a sweeping overhaul of its petrochemicals and oil refining sector, phasing out smaller facilities and targeting outdated operations for upgrades, while redirecting investment to advanced materials.", "ingested_utc": "2025-08-20T03:33:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:28Z", "source": "FinancialPost_Business", "title": "Blue Moon Metals Secures up to US$140 Million Project Finance Package from Hartree/Oaktree to Advance Flagship Nussir Project in Norway", "url": "https://financialpost.com/globe-newswire/blue-moon-metals-secures-up-to-us140-million-project-finance-package-from-hartree-oaktree-to-advance-flagship-nussir-project-in-norway", "id_key": "6582988247af30b82a712fa8b71ff824894cbace0c204ae1eb5800420471c66a", "summary": "TORONTO, Ontario, Aug. 19, 2025 (GLOBE NEWSWIRE) — Blue Moon Metals Inc. (“Blue Moon” or the “Company“) (TSXV: MOON; OTCQX: BMOOF), is pleased to announce that it has entered into a memorandum of understanding with Hartree Partners, LP (“Hartree“) and funds managed by Oaktree Capital Management, L.P. (“Oaktree“, together with Hartree, the “Lenders“, and each […]", "ingested_utc": "2025-08-20T03:33:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:28Z", "source": "FinancialPost_Business", "title": "Richest Australian Rinehart Joins Push Against Costs of Net Zero", "url": "https://financialpost.com/pmn/business-pmn/richest-australian-rinehart-joins-push-against-costs-of-net-zero", "id_key": "dc1d3b8ece0a0184627f8d9e2cd20f8bf2f96bbcf2a6affce8eea3e5631a281e", "summary": "Mining tycoon Gina Rinehart, Australia’s richest person, has urged the country to ditch its pursuit of net zero emissions, insisting the costs of climate action will devastate sectors from healthcare to logistics and defense.", "ingested_utc": "2025-08-20T03:33:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:28Z", "source": "FinancialPost_Business", "title": "High Arctic Announces the Executive Management Changes", "url": "https://financialpost.com/globe-newswire/high-arctic-announces-the-executive-management-changes", "id_key": "caccffbc721c5a5b75280a3478a1d77dd502bd76ae0bf1ec4acad0457982fed8", "summary": "NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES. ANY FAILURE TO COMPLY WITH THIS RESTRICTION MAY CONSTITUTE A VIOLATION OF U.S. SECURITIES LAW CALGARY, Alberta, Aug. 19, 2025 (GLOBE NEWSWIRE) — High Arctic Energy Services Inc. (TSX: HWO) (the “Corporation” or “High Arctic”) announces the resignation of Mr. Mike […]", "ingested_utc": "2025-08-20T03:33:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Bangladesh garment makers gain orders on new US tariff", "url": "https://asia.nikkei.com/economy/trade-war/trump-tariffs/bangladesh-garment-makers-gain-orders-on-new-us-tariff", "id_key": "b722dec02b8bf3810969c6caf497c724e038fc0ca47f8912338d9fdb45bf7739", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Japan exports drop for third straight month as Trump tariffs bite", "url": "https://asia.nikkei.com/economy/trade-war/trump-tariffs/japan-exports-drop-for-third-straight-month-as-trump-tariffs-bite2", "id_key": "312db8067fa75ca336b18fa2d12df62d2b2ddcde0d047cec96b4bb819aab103d", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Japan PM signals alignment with NATO on Ukraine security", "url": "https://asia.nikkei.com/politics/international-relations/japan-pm-signals-alignment-with-nato-on-ukraine-security", "id_key": "211b0d834049b2f05ad738ab20b4331c81a5be157e90a90b62d3e0b130abd147", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Mitsui Chemicals to partner with Nigeria's Dangote on petrochemicals", "url": "https://asia.nikkei.com/business/companies/mitsui-chemicals-to-partner-with-nigeria-s-dangote-on-petrochemicals2", "id_key": "4c5aa318a8f2ba13d3bff0264b73039bfdb626ada81c12327827c3d0f7ef7b34", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "China's growing ties with Serbia point to new 'Silk Curtain' in Europe", "url": "https://asia.nikkei.com/politics/international-relations/china-s-growing-ties-with-serbia-point-to-new-silk-curtain-in-europe", "id_key": "70e4cd8b1bfada5cea2c77ae1e04626c41ffa98e43b20220b66b9c07acf089ca", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Huge Vietnam smart city backed by Japan's Sumitomo moves forward", "url": "https://asia.nikkei.com/business/markets/property/huge-vietnam-smart-city-backed-by-japan-s-sumitomo-moves-forward2", "id_key": "1535861563e6f0126b98f6f5a46caff38b7d7d2776cf0243d829e79affd618ee", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "LG Electronics chases bigger slice of India's red-hot appliance market", "url": "https://asia.nikkei.com/business/electronics/lg-electronics-chases-bigger-slice-of-india-s-red-hot-appliance-market", "id_key": "37be8980ff8dea2829fe59fdfe69819a5f986d6cca8cb9a953142169346c0bb4", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "US court tosses suit against Texas restricting Chinese property ownership", "url": "https://asia.nikkei.com/politics/international-relations/us-china-tensions/us-court-tosses-suit-against-texas-restricting-chinese-property-ownership", "id_key": "efeee9a6b9627152e3dbd6511c41b3850db080c234462c50acfe1d7248b835ac", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Kabuki family drama 'Kokuho' cracks anime's lock on Japan box office", "url": "https://asia.nikkei.com/business/media-entertainment/kabuki-family-drama-kokuho-cracks-anime-s-lock-on-japan-box-office", "id_key": "7b3a4ee7ad6f25cfffe630e19c7fb69fd04b9495c432fcf578850bc3ddeb87a1", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Daiwa Securities eyes turning pepper farms into financial products", "url": "https://asia.nikkei.com/business/agriculture/daiwa-securities-eyes-turning-pepper-farms-into-financial-products", "id_key": "213123620553f8e6dfbaf13e9c3f6b1b9ed20b269f0b7f2339cb998b3512b419", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Rakuten and Amazon race to bring satellite-based phone service to Japan", "url": "https://asia.nikkei.com/business/telecommunication/rakuten-and-amazon-race-to-bring-satellite-based-phone-service-to-japan", "id_key": "3a4709dada7850527fcb60649434a3f9f42742b24cb2f328e4b2add7337fecd5", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Closing arguments begin in mogul Jimmy Lai's Hong Kong security trial", "url": "https://asia.nikkei.com/spotlight/hong-kong-security-law/closing-arguments-begin-in-mogul-jimmy-lai-s-hong-kong-security-trial", "id_key": "e9f1e87204c19893e643a2af0f88740565cb9d8316bc39b76c4a7f99a57339a7", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "ASEAN braces for slower growth after 'front-loading' helped Q2 GDP", "url": "https://asia.nikkei.com/economy/asean-braces-for-slower-growth-after-front-loading-helped-q2-gdp", "id_key": "77b66d0252b733028c7244aba6e6b7bd94c49aa013f43c901d1be7c1e37aab31", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:35Z", "source": "Nikkei_Asia_Top", "title": "Japan to greenlight first yen-based stablecoin", "url": "https://asia.nikkei.com/spotlight/cryptocurrencies/japan-to-greenlight-first-yen-based-stablecoin", "id_key": "5e1e0d5a7a5e1090293f8bf1235c238765269ea257d576abf4779b287c239b53", "summary": "", "ingested_utc": "2025-08-20T03:33:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:44Z", "source": "HackerNews_Top", "title": "Tiny microbe challenges the definition of cellular life", "url": "https://nautil.us/a-rogue-new-life-form-1232095/", "id_key": "d48f9c0acbc4daa61df545df4a3d71010df349ee8ffc3e6a1896ca4522fbf4ff", "summary": "Comments", "ingested_utc": "2025-08-20T03:33:44Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:33:44Z", "source": "HackerNews_Top", "title": "Physically Based Rendering in Filament", "url": "https://google.github.io/filament/Filament.md.html", "id_key": "f044d3540702bb41d5cff62d0273db0e13aabda28e4d43daf1d6fa45fd88183a", "summary": "Comments", "ingested_utc": "2025-08-20T03:33:44Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:59:35Z", "source": "Guardian_World", "title": "Australian novel attracts controversy over fictionalised depiction of gay codebreaker Alan Turing", "url": "https://www.theguardian.com/science/2025/aug/20/alan-turing-protocol-book-novel-criticised-ntwnfb", "id_key": "9382769b7be06353955c02672e68ae60068e13ef23c1952d474ce22304fbb594", "summary": "Nick Croydon, the CEO of QBD Books, has faced criticism for his thriller The Turing Protocol A novel written by a prominent book industry figure in which persecuted gay man Alan Turing has sex with a woman and fathers a child has been criticised online for its portrayal of the codebreaker. The Turing Protocol was released in July and was written by Nick Croydon, the CEO of QBD Books, the largest Australian-owned bookshop chain, where the book is being heavily promoted. Continue reading...", "ingested_utc": "2025-08-20T03:59:35Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T03:59:58Z", "source": "CryptoNews", "title": "Trump-Linked Crypto Firm Thumzup to Take Over Dogecoin Mining Operation", "url": "https://cryptonews.com/news/trump-linked-thumzup-dogecoin-mining-operation/", "id_key": "9d89d5dc77f4f8a7ae8e7d1ef47d3a17cdc66bffaf71fb5e5bc86608add7818c", "summary": "Trump-linked Thumzup Media will acquire Dogehash in an all-stock deal, with the merged company to be renamed Dogehash Technologies Holdings. The post Trump-Linked Crypto Firm Thumzup to Take Over Dogecoin Mining Operation appeared first on Cryptonews .", "ingested_utc": "2025-08-20T03:59:58Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:01:50Z", "source": "NYTimes_World", "title": "Securing Postwar Ukraine, Even With Trump’s Pledge to Help, Is Complex", "url": "https://www.nytimes.com/2025/08/19/world/europe/ukraine-security-guarantees-trump.html", "id_key": "d5a7c34e5433d65736552bea5bc23f24934def68a874578dbec4ac907febefde", "summary": "Russia seems unlikely to agree to Western troops in Ukraine as part of any deal to end the war.", "ingested_utc": "2025-08-20T04:01:50Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:02:02Z", "source": "FT_Markets", "title": "Bank rally puts Shawbrook’s IPO ambitions in reach", "url": "https://www.ft.com/content/a9002595-fa50-48c7-9109-6c5269f5698d", "id_key": "83f41465b9fba48da2e08b4f3298287b7f33856d4977a97d77152dbdf6ceaa33", "summary": "Those debating the health of London’s capital markets seize on even the smallest listing to validate their thesis — good or bad", "ingested_utc": "2025-08-20T04:02:02Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:02:02Z", "source": "FT_Markets", "title": "Bessent bets on stablecoins to bolster demand for Treasuries", "url": "https://www.ft.com/content/1914c189-b4ed-46dd-adde-106b08a68183", "id_key": "1b6b7ddf5f8995bfbc198e25862a828425d2ca8b3864f05247f893e2942c2517", "summary": "Treasury secretary’s discussions with crypto groups have helped inform issuance decisions", "ingested_utc": "2025-08-20T04:02:02Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:02:02Z", "source": "FT_Markets", "title": "The Iranian connection: how China is importing oil from Russia", "url": "https://www.ft.com/content/19cebbc7-c6d7-4050-b80c-0b9f8d334d7a", "id_key": "fb61bacb554309ad081815b9d4ffda841c0dcea932fc2cf124fb4b12f8346b16", "summary": "Networks of brokers and shipowners from Panama to Switzerland are becoming expert at circumventing international sanctions", "ingested_utc": "2025-08-20T04:02:02Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:02:30Z", "source": "AlJazeera_All", "title": "Australia hits back at Netanyahu amid escalating diplomatic row over Gaza", "url": "https://www.aljazeera.com/news/2025/8/20/australia-hits-back-at-netanyahu-amid-escalating-diplomatic-row-over-gaza?traffic_source=rss", "id_key": "571da86cb937c5d7f48aa77cd8508141b22b12531fbe3651c5990bcc516db4b8", "summary": "Australia's Home Affairs minister says 'strength is not measured by how many people you can blow up'.", "ingested_utc": "2025-08-20T04:02:30Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:02:30Z", "source": "AlJazeera_All", "title": "North Korea slams South Korea’s peace overtures as US drills continue", "url": "https://www.aljazeera.com/news/2025/8/20/n-korea-says-s-korea-cannot-be-a-diplomatic-partner-as-us-drills-continue?traffic_source=rss", "id_key": "b16b6e231837fcfb0b2d2e2ae0e9c16270c533d33ef4a4a59613a5af8a986e46", "summary": "North Korean leader's sister says South Korea cannot be a diplomatic partner, denounces ongoing army drills with the US.", "ingested_utc": "2025-08-20T04:02:30Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:44:23Z", "source": "Guardian_World", "title": "Victoria’s urgent childcare review recommendations unveiled: major reforms but no ‘silver bullet’ to stop ‘dangerous individuals’", "url": "https://www.theguardian.com/australia-news/2025/aug/20/victoria-childcare-safety-review-recommendations-unveiled-ntwnfb", "id_key": "3af1b593a62a6a6d1e38326381767dbc5fdf667eeb2332558f4e5a0b363f9dc9", "summary": "Allan government commits to accepting all 22 recommendations, with several also directed at federal government Major reforms to working with children checks, a new database and regulator, more unannounced visits to childcare centres and an urgent rethink of how the entire early childhood education system is funded have been recommended as part of Victoria’s urgent review into the childcare sector. The review, written by former South Australian premier Jay Weatherill and senior bureaucrat Pam White, was released in full by the state government on Wednesday. Continue reading...", "ingested_utc": "2025-08-20T04:44:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:44:23Z", "source": "Guardian_World", "title": "‘It would be a terrible loss’: Ukrainian frontline troops sceptical of ceding land", "url": "https://www.theguardian.com/world/2025/aug/20/ukraine-frontline-troops-drones-dobropillia", "id_key": "3bfa6eb8df863f1aaf8cd730fc01bbd14e8f3f50de5b7cdbda001e27dbd2e73f", "summary": "Near Dobropillia new trenches are visible, drone attacks continue and there is no sign of the fighting easing Over dinner on Monday, a simple barbecue of meat and roasted vegetables, the soldiers of Ukraine’s 150th reconnaissance and strike battalion have other things on their mind. Volodymyr Zelenskyy is in the White House and Donald Trump has just promised to give Ukraine “very good protection”. When this development is passed on to the group around, one of the soldiers pipes up “From who?” and laughs, such is the uncertainty about who the US really supports. But in reality the troops are not following the news closely. After three and half years, the war has its own momentum, technology and schedule. Continue reading...", "ingested_utc": "2025-08-20T04:44:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:44:23Z", "source": "Guardian_World", "title": "‘Don’t call this racist’: row grows over motives behind England flag campaign", "url": "https://www.theguardian.com/uk-news/2025/aug/20/row-grows-over-motives-behind-england-flag-campaign-far-right-racist", "id_key": "19081b06db5c8dba5ee62e9c06c4d0c68ca31dd77bbb047044a118c58783e985", "summary": "Organisers say they are just being patriotic but some suspect far right is behind ‘dangerous’ lamp-post movement “This is NOT racist never has been never will be,” reads the fundraising page of a group calling itself the Wythall Flaggers, which by Tuesday afternoon had raised more than £2,000, mostly in small donations of £5 and £10. “We have members of the community of all ethnicities and religions stopping by and praising what we are doing so please don’t call this racist.” The money, according to the page’s organiser, will be used for “coating the local community in England flags as this is home and we should be patriotic and proud … We need help to cover every street in Wythall with our beautiful St George’s cross.” Continue reading...", "ingested_utc": "2025-08-20T04:44:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:44:23Z", "source": "Guardian_World", "title": "Shower gel ad gets UK ban for suggesting black skin is problematic", "url": "https://www.theguardian.com/media/2025/aug/20/shower-gel-ad-uk-ban-black-skin-problematic-watchdog-sanex", "id_key": "7a59a8be15da89ab80216e1a4cce683e7172e70cf16c4641dcf5b508b05b6273", "summary": "Watchdog says television advert for Sanex fed negative stereotypes and was likely to cause serious offence A television advert for Sanex shower gel has been banned in the UK for appearing to suggest that black skin is “problematic” and white skin is “superior”. The Advertising Standards Authority (ASA) acted after investigating two complaints that the Sanex fed negative stereotypes about people with darker skin tones. Continue reading...", "ingested_utc": "2025-08-20T04:44:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:44:23Z", "source": "Guardian_World", "title": "UK wasp numbers soar after unusually warm and dry spring", "url": "https://www.theguardian.com/environment/2025/aug/20/uk-wasp-numbers-soar-after-unusually-warm-and-dry-spring", "id_key": "9195e8c397db0bf9ba729e52c979667ad397350d79d6ae9d5bb1005302173f01", "summary": "The scourges of picnics have arrived early and in greater numbers amid ideal conditions for colonies to thrive If dodging swooping gulls trying to steal your chips wasn’t already enough, you might be spending your bank holiday trying to keep wasps away from your ice cream too. Britain is in the middle of a wasp boom. Not only have they arrived earlier than expected, but there are more of them than in recent summers. Experts say 2025 is an excellent year for them. Continue reading...", "ingested_utc": "2025-08-20T04:44:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:44:46Z", "source": "CryptoNews", "title": "Fed Top Official Urges Central Bank Staff to Hold ‘de Minimus’ Crypto", "url": "https://cryptonews.com/news/fed-top-official-urges-central-bank-staff-to-hold-de-minimus-crypto/", "id_key": "c738a84f283109e23944ef5df9e636cdd5d5b40c3aab37a292dfca5a1a970712", "summary": "US Fed Vice Chair for Supervision Michelle Bowman is suggesting allowing central bank employees to hold “de minimus” amounts. of crypto. The post Fed Top Official Urges Central Bank Staff to Hold ‘de Minimus’ Crypto appeared first on Cryptonews .", "ingested_utc": "2025-08-20T04:44:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:44:46Z", "source": "CryptoNews", "title": "[LIVE] Crypto News Today: Latest Updates for August 20, 2025 – Ethereum Sinks Below $4.1K, Bitcoin Trades at $113K as Market Ignores Positive Industry Moves", "url": "https://cryptonews.com/news/live-crypto-news-today-latest-updates-for-august-20-2025/", "id_key": "a9bdb68f9f08295dff8f7a97a793d21426c3073f4569ad3004cd8019ef9c4524", "summary": "Follow up to the hour updates on what is happening in crypto today, August 20. Market movements, crypto news, and more! The post [LIVE] Crypto News Today: Latest Updates for August 20, 2025 – Ethereum Sinks Below $4.1K, Bitcoin Trades at $113K as Market Ignores Positive Industry Moves appeared first on Cryptonews .", "ingested_utc": "2025-08-20T04:44:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:46:37Z", "source": "NYTimes_Technology", "title": "At China’s Humanoid Robot Games, Athletes Fell Down a Lot", "url": "https://www.nytimes.com/2025/08/18/world/asia/china-humanoid-robot-games.html", "id_key": "2b6f2c0b616e1064fa4e7b014f3b72ee5e49a5441305159834a46ae8a55bc0f0", "summary": "The Humanoid Robot Games in Beijing — featuring running, kickboxing and soccer — highlighted advancements in robotics. Limitations, too.", "ingested_utc": "2025-08-20T04:46:37Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:46:47Z", "source": "FT_Home", "title": "The Iranian connection: how China is importing oil from Russia", "url": "https://www.ft.com/content/19cebbc7-c6d7-4050-b80c-0b9f8d334d7a", "id_key": "fc2cee4f1697236251d5c36690474f74ab1dfc021591b8cc998f13d79f82d4e5", "summary": "Networks of brokers and shipowners from Panama to Switzerland are becoming expert at circumventing international sanctions", "ingested_utc": "2025-08-20T04:46:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:46:47Z", "source": "FT_Home", "title": "Europe’s rich are watching Norway’s election debate on wealth taxes", "url": "https://www.ft.com/content/0d853ed3-d1bc-4a6d-a892-b46a32c54d86", "id_key": "c50cbfeda0ecbb143972740a1814bc07dff02c2a838d5cf5451af4911df78174", "summary": "Changes to taxation are at the heart of the centre-right’s attempts to retake power in Norway", "ingested_utc": "2025-08-20T04:46:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:46:47Z", "source": "FT_Home", "title": "Why UK property taxes should be overhauled", "url": "https://www.ft.com/content/7ac808e7-637f-472a-9fd0-b96fffe6e7e0", "id_key": "4f6400b9f5ef0ee4072bb0e75303e9584a71982f17e21915bda1f457b1c71715", "summary": "Swapping outdated levies for an annual proportional property tax looks sensible", "ingested_utc": "2025-08-20T04:46:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:46:47Z", "source": "FT_Home", "title": "Bessent bets on stablecoins to bolster demand for Treasuries", "url": "https://www.ft.com/content/1914c189-b4ed-46dd-adde-106b08a68183", "id_key": "458b0eaede7c8e6132a3b21eb40b2d1311130dc77bb7b21005a0982d850ef0eb", "summary": "Treasury secretary’s discussions with crypto groups have helped inform issuance decisions", "ingested_utc": "2025-08-20T04:46:47Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:46:47Z", "source": "FT_Home", "title": "‘On another level’: crypto industry hosts rival gathering in Jackson Hole", "url": "https://www.ft.com/content/cf29f83f-6d26-494c-b367-101f7927aa97", "id_key": "da8016d531b55072fe6fac5d78ff160d5a7224e63fe711d55ea421b51d151f51", "summary": "Fed governors and SEC officials join executives at event ahead of central bankers’ annual gathering", "ingested_utc": "2025-08-20T04:46:47Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:47:06Z", "source": "Engadget_All", "title": "Black Myth: Zhong Kui is the next title from Game Science Studio", "url": "https://www.engadget.com/black-myth-zhong-kui-next-221537956.html?src=rss", "id_key": "65003527de342d31a9cfc2257c5e5e416f06b4c7181404256258996a535ba14b", "summary": "Game Science Studio isn't resting on its laurels after the success of Black Myth: Wukong . The developer teased a follow-up project as the closer to Gamescom's Opening Night Live showcase with a brief but beautifully detailed glimpse at Black Myth: Zhong Kui . There's no date attached to the cinematic teaser, and that's because the game is still very much a work in progress. According to the FAQ entry about a possible release window, the team says \"Well, to be honest—even Yocar himself has absolutely no idea\" when it'll be ready. But the same page does confirm that the plan is for Zhong Kui to launch on both PC and \"all mainstream console platforms\" whenever it is done. From the title and the previous Black Myth game, this new project will once again be drawing inspiration from Chinese mythology. Legends around Zhong Kui dub him a conqueror of ghosts and evil spirits, so perhaps there will be some supernatural vibes in this entry to the emerging game series. Pretty much the only other thing we know besides the name and character is that Black Myth: Zhong Kui will once again be a single-player ARPG and it will be \"following the same business model as before.\" This article originally appeared on Engadget at https://www.engadget.com/black-myth-zhong-kui-next-221537956.html?src=rss", "ingested_utc": "2025-08-20T04:47:06Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:47:22Z", "source": "FinancialPost_Business", "title": "Cenovus, Enbridge accused of ‘greenwashing’ under securities law in what may be a first for Canada", "url": "https://financialpost.com/commodities/energy/oil-gas/cenovus-enbridge-accused-greenwashing-under-securities-law", "id_key": "5a869baed5b9bee9852352926f0ddc0b613608ae66e76d1d8207bdbabd357f4a", "summary": "A complaint filed with Alberta's market watchdog says the two energy companies misled investors over net-zero commitments", "ingested_utc": "2025-08-20T04:47:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:47:28Z", "source": "Nikkei_Asia_Top", "title": "Myanmar's cybersecurity law comes into force, putting businesses on alert", "url": "https://asia.nikkei.com/spotlight/myanmar-crisis/myanmar-s-cybersecurity-law-comes-into-force-putting-businesses-on-alert", "id_key": "c5cb850a8204eaa80ea809ce7931251526d2cce34cdcbba06618334541452787", "summary": "", "ingested_utc": "2025-08-20T04:47:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:47:36Z", "source": "HackerNews_Top", "title": "Pre-Sputnik Earth-Orbit Glints", "url": "https://www.overcomingbias.com/p/many-big-pre-sputnik-earth-orbit", "id_key": "e1766e6cedf250bdf649866c9349bb203fe53343ba6b24e7596493b2e610a6b1", "summary": "Comments", "ingested_utc": "2025-08-20T04:47:36Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T04:58:06Z", "source": "FinancialPost_Business", "title": "Greenwashing Complaint Filed Against Canadian Fossil Fuel Companies", "url": "https://financialpost.com/pmn/business-pmn/greenwashing-complaint-filed-against-canadian-fossil-fuel-companies", "id_key": "7df46ae2a5c3b048428fedc30f798ee8e973d325069858eeff7f3d2a8b25d1c1", "summary": "The group Investors for Paris Compliance has accused Cenovus and Enbridge of overstating their efforts to reach net zero.", "ingested_utc": "2025-08-20T04:58:06Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:39:11Z", "source": "BBC_World", "title": "Six severed heads found on road in Mexico", "url": "https://www.bbc.com/news/articles/c8ry1m202nro?at_medium=RSS&at_campaign=rss", "id_key": "e9983be2269fe1605c53c5b50e95f0a65ea4a72f5c0c12f88609748b29f00b24", "summary": "Police have not given a motive for the killings in a large peaceful region of central Mexico.", "ingested_utc": "2025-08-20T05:39:11Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:39:11Z", "source": "BBC_World", "title": "Watch: Moment fireball lights up night sky in Japan", "url": "https://www.bbc.com/news/videos/cwy0x2dngj1o?at_medium=RSS&at_campaign=rss", "id_key": "3fd20250964e9f3e789f8a53295a868ed16133bc139c0f681006b1cc889fa95f", "summary": "The skies above southern Japan were illuminated late on Tuesday evening after dust or asteroid fragments burnt up in the atmosphere.", "ingested_utc": "2025-08-20T05:39:11Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:39:11Z", "source": "BBC_World", "title": "Watch: Competitors walk slackline 400m above Chinese gorge", "url": "https://www.bbc.com/news/videos/c4glq8d35n3o?at_medium=RSS&at_campaign=rss", "id_key": "4ce59ebe1427eb7c583df5453feb904e45f87796c0f239e4812b74cce1f33f09", "summary": "Participants walked between two peaks more than a kilometre apart on a slackline just 2cm wide.", "ingested_utc": "2025-08-20T05:39:11Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:39:12Z", "source": "BBC_Business", "title": "Dozens bidding for each available rental property", "url": "https://www.bbc.com/news/articles/c4gz2d71rn6o?at_medium=RSS&at_campaign=rss", "id_key": "86be91071718c7b21e631cca06cfac28078a32c2711bcbce6c361a6cefbb0020", "summary": "Demand for rented accommodation is far outstripping supply in East Yorkshire.", "ingested_utc": "2025-08-20T05:39:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:39:15Z", "source": "Guardian_World", "title": "Australia news live: NSW residents warned to ‘stay ready’ amid flood risk; tariffs force Breville to shift manufacturing", "url": "https://www.theguardian.com/australia-news/live/2025/aug/20/australia-news-live-bruce-lehrmann-federal-court-appeal-network-10-lisa-wilkinson-brittany-higgins-parliament-productivity-economic-reform-roundtable-ntwnfb", "id_key": "c052cc40a5371493ed06896ebf5bac16f0a2780599b7c6566417b8279f9f22c8", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast As I noted in my hello earlier, rain is on the brain in Sydney, with a deluge set to continue for days. Melbourne is cold, but lovely, and Adelaide and Hobart are both expecting sunshine today. Brisbane, Perth and Canberra are in for rain. Continue reading...", "ingested_utc": "2025-08-20T05:39:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:39:15Z", "source": "Guardian_World", "title": "Bruce Lehrmann has become a ‘national joke’ and can’t afford barrister for defamation appeal, his lawyer says", "url": "https://www.theguardian.com/australia-news/2025/aug/20/bruce-lehrmann-defamation-appeal-lisa-wilkinson-network-10-court-ntwnfb", "id_key": "fb69b770c81192b551b0fdcbc5ba2a22c2b7edc685c820983202c0a37526ad24", "summary": "Former Liberal staffer’s lawyer begins three-day appeal hearing by apologising to justices for her client’s failure to appoint an experienced barrister Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Bruce Lehrmann can’t afford a barrister to represent him in an appeal against his lost defamation case and deserves substantial damages because he is “a national joke”, the federal court has heard. Lehrmann is appealing Justice Michael Lee’s April 2024 judgment, which found the former Liberal staffer was not defamed by Lisa Wilkinson and Network 10 when The Project broadcast an interview with Brittany Higgins in 2021 in which she alleged she was raped in Parliament House. Continue reading...", "ingested_utc": "2025-08-20T05:39:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:39:40Z", "source": "CoinJournal", "title": "ADA could bounce back after retesting the $0.84 low; Check forecast", "url": "https://coinjournal.net/news/ada-could-bounce-back-after-retesting-the-0-84-low-check-forecast/", "id_key": "97cdb063054adbdb6fda1ed25bbec4cd386afeb943e9014251bd75eccf15520f", "summary": "Key takeaways Cardano’s ADA is the worst performer among the top 10, losing 8% of its value in the last 24 hours. The coin could recover above $1 soon after retesting the $0.84 low. ADA retests $0.84 amid bearish PA The cryptocurrency market has been bearish since the start of the week, and Cardano’s ADA […] The post ADA could bounce back after retesting the $0.84 low; Check forecast appeared first on CoinJournal .", "ingested_utc": "2025-08-20T05:39:40Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:41:49Z", "source": "FT_Markets", "title": "New Zealand dollar slumps on outlook for further rate cuts", "url": "https://www.ft.com/content/16e0cb5b-2992-4f6d-bc1e-ba65bb2ff79d", "id_key": "224ded074956f4a492aa9fcbe76819216bbdaa462390d53e38f09a35ec553fc4", "summary": "Central bank makes quarter-point cut to 3% with further lowering expected as economy stalls", "ingested_utc": "2025-08-20T05:41:49Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:42:17Z", "source": "AlJazeera_All", "title": "How will Trump’s semiconductor tariffs affect the global chip industry?", "url": "https://www.aljazeera.com/news/2025/8/20/how-will-trumps-semiconductor-tariffs-affect-the-global-chip-industry?traffic_source=rss", "id_key": "14f0d30015f79c5b40e805d26ab940a5743ec78bafc126ef49369a15ac693735", "summary": "The US president has threatened to impose a tariff of up to 300 percent on imports of semiconductors.", "ingested_utc": "2025-08-20T05:42:17Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T05:49:54Z", "source": "CryptoNews", "title": "Crypto Market Retreats, Bitcoin Down 8% Since Peak Ahead of Powell’s Jackson Hole Remarks", "url": "https://cryptonews.com/news/bitcoin-slips-crypto-market-in-red-before-powll-jackson-hole-speech/", "id_key": "7322a101eaacac7ae2c13bbc5ff14030cbdb0d2ca55d70a2cb0bd048e6cd69d9", "summary": "Bitcoin fell below $113,000, pulling the crypto market down 1.5% to $3.9 trillion as profit-taking deepened ahead of Powell’s Jackson Hole speech. The post Crypto Market Retreats, Bitcoin Down 8% Since Peak Ahead of Powell’s Jackson Hole Remarks appeared first on Cryptonews .", "ingested_utc": "2025-08-20T05:49:54Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:54:59Z", "source": "BBC_Business", "title": "Air fares and food prices push up inflation in July", "url": "https://www.bbc.com/news/articles/c741wkngndqo?at_medium=RSS&at_campaign=rss", "id_key": "845f1e08cf1eb93c0517f0298aeb1172cc034a6b049c878d69897e9f2e5b7344", "summary": "Prices are now rising at their fastest pace since last January.", "ingested_utc": "2025-08-20T06:54:59Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "There are risks in Australia’s row with Israel, but it’s Netanyahu who is trashing the relationship", "url": "https://www.theguardian.com/australia-news/2025/aug/20/australia-israel-relationship-albanese-netanyahu", "id_key": "75187c0febacd204619e36112a69349463dd9356fc0c41e278402c839fbacc96", "summary": "The Israeli prime minister has launched a diplomatic broadside against Albanese, adopting a similar playbook to his approach to UK, Canada and France Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast When Anthony Albanese announced Australia would formally recognise Palestinian statehood earlier this month, the prime minister let slip he had already discussed the decision with Israel’s Benjamin Netanyahu. A call between the leaders had been expected, but no statement or readout was released after it took place. Speaking alongside the foreign affairs minister, Penny Wong, a few days later, Albanese said it had been a civil conversation. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "New investigation into backpacker killer Ivan Milat possible after NSW premier leaves door open", "url": "https://www.theguardian.com/australia-news/2025/aug/20/new-investigation-into-backpacker-killer-ivan-milat-possible-after-photos-related-to-cold-case-surface-ntwnfb", "id_key": "80043f0da491c3f2690e18bde3561df9b71842fea59b952311dcc49bb2a530a2", "summary": "Chris Minns says he will seek to meet victims’ families after agreeing police sketch of cold case suspect ‘incredibly similar’ to serial killer The premier of New South Wales, Chris Minns, has said he is open to a parliamentary inquiry into Ivan Milat, after a state MP questioned whether the backpacker murderer could be responsible for many more deaths. Legalise Cannabis party MLC Jeremy Buckingham is pursuing whether Milat was responsible for dozens of unsolved murders throughout Australia, mainly of young women. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "India and China hail warming ties amid Trump-induced geopolitical shake-up", "url": "https://www.theguardian.com/world/2025/aug/20/india-and-china-hail-warming-ties-amid-trump-induced-geopolitical-shake-up", "id_key": "4ca53453d6ed74fe202fc343eae672fc17c519dae52a6e0d6a2991b3578e9e13", "summary": "Visit to Delhi by Wang Yi, China’s top diplomat, has seen both countries agree to resume trade ties and work towards resolving border dispute India’s prime minister and China’s foreign minister have hailed “steady” progress in their countries’ fractious relationship, agreeing to resume trade and other ties, as well as work towards resolving the long-running Himalayan border dispute, amid a global geopolitical shake-up instigated by Donald Trump’s tariff regime. According to statements from China’s foreign ministry, the two sides agreed to resume direct flights – reiterating a pledge made in January – as well as issuing visas to journalists and facilitating business and cultural exchanges. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "Rail fares in England expected to rise by 5.8% next year", "url": "https://www.theguardian.com/money/2025/aug/20/rail-fares-in-england-rise-next-year", "id_key": "cb257aa9e5aa2603c5210c2927a5ad34253ef2270b6f79bb03178d38447ee056", "summary": "Concern among passenger groups over usual calculation of ticket prices Business live – latest updates Train fares in England expected to rise by as much as 5.8% next year on the back of the latest inflation data release, sparking concern among passenger groups. Increases in rail ticket prices are usually calculated by adding one percentage point to July’s inflation reading on the retail prices index, which was 4.8%, according to figures from the Office for National Statistics. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "UK inflation rises by more than expected to 3.8% amid higher food prices", "url": "https://www.theguardian.com/business/2025/aug/20/inflation-rises-july-pause-interest-rate-cuts", "id_key": "4e0205b0e590a72ecdcb45b6f04cb0dc8c37b4782a4f87a40462d852c76eb873", "summary": "Annual July rate all but rules out possibility of a further Bank of England interest rate cut this year Business live – latest updates Inflation rose again last month to a higher than expected 3.8% amid higher food prices and travel costs, adding to fears that the Bank of England will delay further interest rate cuts. Figures showed the annual rate as measured by the consumer price index (CPI) climbed from June’s 3.6% reading , sitting above the central bank’s 2% target for the 10th consecutive month. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:23Z", "source": "CryptoNews", "title": "ALT5 Sigma Denies SEC Probe Rumors Amid $1.5B Trump Crypto Deal", "url": "https://cryptonews.com/news/alt5-sigma-denies-sec-probe-rumors-amid-1-5b-trump-crypto-deal/", "id_key": "8d78a41934355a7b3823c1f96cc8f8ecb1e0d963151f647de105a7aeaf1fab46", "summary": "ALT5 Sigma has pushed back against reports linking the firm and one of its executives to a fresh SEC investigation. The post ALT5 Sigma Denies SEC Probe Rumors Amid $1.5B Trump Crypto Deal appeared first on Cryptonews .", "ingested_utc": "2025-08-20T06:55:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:57:24Z", "source": "FT_Home", "title": "UK inflation rises more than expected to 3.8% in July", "url": "https://www.ft.com/content/7a75942f-9b40-4c49-b87f-e0ed3bed83f8", "id_key": "f31f9f75930177a497d0420738b3d2e04a36329dbce60c6fabd7ad7bf7aff58f", "summary": "Economists say figure casts doubt on prospect of further BoE rate cuts this year", "ingested_utc": "2025-08-20T06:57:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:58:02Z", "source": "FinancialPost_Business", "title": "World’s Two Biggest Miners Meet With Trump Over Copper Plans", "url": "https://financialpost.com/pmn/business-pmn/worlds-two-biggest-miners-meet-with-trump-over-copper-project", "id_key": "7a88a2e4ffd168a6384b85c4f6e8bae76e60fb3f42ea50b4dcc4dc0bd88a219b", "summary": "The chief executive officers of the world’s two biggest mining companies met President Donald Trump to discuss a copper project that could supply the US with a quarter of its demand for decades to come.", "ingested_utc": "2025-08-20T06:58:02Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:58:18Z", "source": "HackerNews_Top", "title": "Intel Foundry Demonstrates First Arm-Based Chip on 18A Node", "url": "https://hothardware.com/news/intel-foundry-demos-deer-creek-falls-reference-soc", "id_key": "8b161545ab4b69df8b4479e8c6f8123c0ffbe4ac7476dabdad4b0f88aea717ec", "summary": "Comments", "ingested_utc": "2025-08-20T06:58:18Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:43Z", "source": "BBC_World", "title": "Heavy rain paralyses life in India's financial capital Mumbai", "url": "https://www.bbc.com/news/articles/cx29jw7488go?at_medium=RSS&at_campaign=rss", "id_key": "933dd0e5a6246a21aa8306a53746573ba72454ed867ce70d609d5abd3548c691", "summary": "Nearly 600 people were rescued from a stalled monorail system and 350 others have been shifted to shelters.", "ingested_utc": "2025-08-20T07:32:43Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:46Z", "source": "Guardian_World", "title": "News live: Australia needs to escalate sanctions on Israel, Husic says; widespread flood warnings for NSW", "url": "https://www.theguardian.com/australia-news/live/2025/aug/20/australia-news-live-bruce-lehrmann-federal-court-appeal-network-10-lisa-wilkinson-brittany-higgins-parliament-productivity-economic-reform-roundtable-ntwnfb", "id_key": "89963dcee21afa844566d3d53c59571433639ca2dae19f6e114eb7ae8ebc7aa3", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast As I noted in my hello earlier, rain is on the brain in Sydney, with a deluge set to continue for days. Melbourne is cold, but lovely, and Adelaide and Hobart are both expecting sunshine today. Brisbane, Perth and Canberra are in for rain. Continue reading...", "ingested_utc": "2025-08-20T07:32:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:46Z", "source": "Guardian_World", "title": "Childcare needs a ‘fundamental reset’ to improve safety. These are Victoria’s key recommendations", "url": "https://www.theguardian.com/australia-news/2025/aug/20/victoria-childcare-safety-review-recommendations-unveiled-ntwnfb", "id_key": "49d9ea48cbd6fe79a576b3e8fa9c8f193ca2d822edfa5d56936139131abf2669", "summary": "State to accept all 22 recommendations as federal government releases names of 30 childcare centres subject to compliance action Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Major reforms to working with children checks, more unannounced visits to childcare centres and a rethink of the reliance on for-profit providers are among the recommendations of Victoria’s urgent review into childcare. The review, written by the former South Australian premier Jay Weatherill and senior Victorian bureaucrat Pam White, was released in full by the state government on Wednesday. Continue reading...", "ingested_utc": "2025-08-20T07:32:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:46Z", "source": "Guardian_World", "title": "Rail fares in England on path to rise by 5.8% next year on back of inflation data", "url": "https://www.theguardian.com/money/2025/aug/20/rail-fares-in-england-rise-next-year", "id_key": "b10a1811cdb81fd4d037f6fcb91dd393b91c17db8386d602f70afadee4112398", "summary": "Concern among passenger groups after reading that dictates regulated ticket prices came in higher than forecast UK inflation rises by more than expected to 3.8% Business live – latest updates Train fares in England expected to rise by as much as 5.8% next year on the back of the latest inflation data release, sparking concern among passenger groups. Increases in rail ticket prices are usually calculated by adding one percentage point to July’s inflation reading on the retail prices index, which was a higher than expected 4.8%, according to figures from the Office for National Statistics. Continue reading...", "ingested_utc": "2025-08-20T07:32:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:07Z", "source": "NPR_Top", "title": "Cobalt-free batteries reign in Chinese EVs. Why not the US?", "url": "https://www.npr.org/2025/08/20/nx-s1-5507156/cobalt-free-batteries-reign-in-chinese-evs-why-not-the-us", "id_key": "cda2dd8d877984ef7828aa12a9abbdd6bed6034186dc11bc24b8df0390fd3029", "summary": "There’s been an era-defining race underway between two types of batteries used in electric vehicles: lithium batteries that use cobalt, and ones that use iron phosphate. Cobalt, a metal with a checkered human rights record, has been in the lead. Until recently. Henry Sanderson’s book on the elements that build electric vehicles is Volt Rush: The Winners and Losers in the Race to Go Green . Related episodes: The race to produce lithium How batteries are already changing the grid How batteries are riding the free market rodeo in Texas How EV batteries tore apart Michigan (Update) Batteries are catching fire at sea For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Fact-checking by Sierra Juarez . Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter .", "ingested_utc": "2025-08-20T07:35:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:07Z", "source": "NPR_Top", "title": "What is the legacy of Yellowstone wolves 30 years after their reintroduction?", "url": "https://www.npr.org/2025/08/20/nx-s1-5507229/wolves-elk-predator-yellowstone-national-park-ecosystem", "id_key": "970bf2fc9e2f130f7b8d26fc90f42dd7ae3ffb04423599a4e7e9bcd8d761547a", "summary": "Thirty years ago, park rangers reintroduced grey wolves into Yellowstone National Park. They wanted to restore the ecosystem and get the elk population, which had decimated the plant community, in check. And it worked – or so the popular narrative suggests. But is it really so simple? Today on the show, we explore how the Yellowstone ecosystem has changed since wolves returned and whether those changes can really be pinned solely on wolves. Plus, how the narrative of the Yellowstone wolf legacy could affect wolf reintroduction elsewhere. Curious about other science controversies? Email us at shortwave@npr.org . Listen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at plus.npr.org/shortwave .", "ingested_utc": "2025-08-20T07:35:07Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:09Z", "source": "NPR_World", "title": "Spain battles record wildfires even as the end of a heat wave brings lower temperatures", "url": "https://www.npr.org/2025/08/19/g-s1-83505/spain-wildfires-record-heat-wave-galicia", "id_key": "e3f7ad80d35b899f7dea180aee9788d7cd2ff158c630c7fb338b825183d9beee", "summary": "The fires have ravaged small, sparsely populated towns in the country's northwest, forcing locals in many cases to act as firefighters. About 2,382 square miles have burned across Spain and Portugal.", "ingested_utc": "2025-08-20T07:35:09Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:09Z", "source": "NPR_World", "title": "Putin and Zelenskyy could meet. And, Trump wants to stop voting by mail", "url": "https://www.npr.org/2025/08/19/g-s1-83374/up-first-briefing-putin-zelenskyy-may-meet-mail-in-votings-future", "id_key": "5813625c8bfc01684ff8858ac4a0dfe9fb77cd4f98ca621fdb27ab278df7ac41", "summary": "Trump says there are plans underway for Putin and Zelenskyy to meet to discuss an end to the war between Russia and Ukraine. And, Trump wants to stop states from voting by mail.", "ingested_utc": "2025-08-20T07:35:09Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:26Z", "source": "TheVerge_All", "title": "Hyperkin’s DualSense-inspired Xbox controller is finally launching this fall", "url": "https://www.theverge.com/news/761638/hyperkin-competitor-xbox-wired-controller-sony-ps5-dualsense", "id_key": "0e4b391887d49bce0512c24a9d48f2bed69c0b18df70c09269148cc4aa113f80", "summary": "There’s good news if you’re an Xbox gamer who’s longingly stared at the sleeker design of Sony’s DualSense controller for the PlayStation 5. After revealing the final form of its Competitor gamepad at CES 2025, Hyperkin has announced it will be available sometime in October for $49.99 in black and white color options for North […]", "ingested_utc": "2025-08-20T07:35:26Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:30Z", "source": "Engadget_All", "title": "The best wireless mice for 2025", "url": "https://www.engadget.com/computing/accessories/best-wireless-mice-pc-gaming-mobile-150027822.html?src=rss", "id_key": "1585ab537d7dbdcf8c7ad566a74d2b95034ae57f23832183a2a27faf3dfad71d", "summary": "We may deliberate for days when buying a laptop or computer or spend hours lining up the most comfortable and stylish keyboard before aimlessly adding a utilitarian mouse to our basket. The impact of a good, feature-rich and — perhaps most importantly — ergonomic mouse can be huge. Not just to your productivity, but to the quality and comfort of your worklife overall. A good mouse has long offered some level of configuration and customization, but more modern options go beyond that with the ability to automate repetitive tasks or convoluted keypresses at the click of a button. Unsurprisingly, even mice haven’t escaped the wave of AI hype, with many flagship models bringing services like ChatGPT or Copilot to your fingertips. Beyond the fancy features, there’s still a lot to consider to find the best mouse for work, creativity or even play. Will the mouse fit your grip style or handedness? Do you prefer the convenience of Bluetooth or stability of a 2.4Ghz USB dongle? Can it connect to more than one device easily? Is the smoothness of the scroll wheel going to be a dealbreaker? Perhaps the companion software unlocks new functionality you never knew you needed? If you hadn’t considered all of those things, the good news is, we have (and more). Below are our picks for the best wireless productivity mice you can buy right now. Best wireless mice for 2025 This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-wireless-mice-pc-gaming-mobile-150027822.html?src=rss", "ingested_utc": "2025-08-20T07:35:30Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:39Z", "source": "AlJazeera_All", "title": "As UN agencies mull Kenya move, some fear exclusion from Nairobi’s growth", "url": "https://www.aljazeera.com/features/2025/8/20/as-un-agencies-mull-kenya-move-some-fear-exclusion-from-nairobis-growth?traffic_source=rss", "id_key": "008c19003f953a02199cfb165d69c031329872ceef34ac1dc8c7f8031987de90", "summary": "Kenyans veer between hope for prosperity and wariness as UN plans relocation of key offices from Western cities.", "ingested_utc": "2025-08-20T07:35:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:47Z", "source": "FinancialPost_Business", "title": "Trump Raises Stakes Over Copper Project With CEOs at White House", "url": "https://financialpost.com/pmn/business-pmn/worlds-two-biggest-miners-meet-with-trump-over-copper-project", "id_key": "c6d87729318856ef6ca16a6d6772adcc721a2437030bb99e7f524df89966f92c", "summary": "President Donald Trump met with the chief executive officers of the world’s two biggest mining companies to discuss a copper project that could supply the US with a quarter of its demand for decades to come, adding greater weight to his push to boost local output of the vital metal.", "ingested_utc": "2025-08-20T07:35:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:51:11Z", "source": "AlJazeera_All", "title": "Blazing fireball lights up the night sky in Japan", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/20/blazing-fireball-lights-up-the-night-sky-in-japan?traffic_source=rss", "id_key": "42f482bc65a93dffa6f1a143c0efaeebfa31684a6b11ec83d2b9ab18826dbe84", "summary": "Livestream cameras captured the moment a blazing fireball lit up the night sky across southern Japan.", "ingested_utc": "2025-08-20T07:51:11Z"}
