{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:38Z", "source": "BBC_World", "title": "Sony raises PlayStation 5 prices in US as tariff fears persist", "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss", "id_key": "cfe71307b8b51d5a745427db4e3013a5b6be3ea617ca179ba52061685180d619", "summary": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.", "ingested_utc": "2025-08-21T03:28:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:38Z", "source": "BBC_World", "title": "Tulsi Gabbard announces plans to cut intelligence staff by half", "url": "https://www.bbc.com/news/articles/c78mj2m85pno?at_medium=RSS&at_campaign=rss", "id_key": "4a4c7b683eb46760cc544477c4019c91d36407c5ef973962e94ef9ccf5fa19b1", "summary": "The director of national intelligence will also revoke the security clearances for 37 US intelligence officials who served under Biden and Obama.", "ingested_utc": "2025-08-21T03:28:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Brazil police file court documents accusing Bolsonaro of planning to flee to Argentina to seek asylum", "url": "https://www.theguardian.com/world/2025/aug/21/jair-bolsonaro-argentina-asylum-plan-brazil", "id_key": "ad1f3a8d5335b5a256fd1abe7b0fd28c12e2f4ce80ccbf985508693914159b1e", "summary": "Brazil’s former president is accused of allegedly plotting a military coup, but he denies the charges Brazilian police have claimed in court documents that they have found a document on the mobile phone of former president Jair Bolsonaro suggesting he had planned to flee to Argentina ahead of his judgment for allegedly plotting a military coup. The far-right populist is facing a jail term of over 40 years when Brazil’s supreme court convenes next month to decide whether he is guilty of conspiring to overturn the result of the 2022 presidential election, which Bolsonaro lost to his leftwing opponent Luiz Inácio Lula da Silva. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "New Zealand to spend $3bn upgrading helicopters and ‘embarrassing’ defence planes", "url": "https://www.theguardian.com/world/2025/aug/21/new-zealand-seahawk-helicopters-defence-spending-planes", "id_key": "77eb6f9ccf19019ba1350bbae4eabddb8e3eae949aff09ea47d02209419dd691", "summary": "Government says country will buy five Seahawk helicopters and two Airbus A321XLR aircraft New Zealand will spend nearly NZ$3bn ($1.7bn) upgrading its ageing defence fleet, including replacing its “embarrassing” planes that have left multiple prime ministers grounded during international travel, the government has announced. The defence minister, Judith Collins, said NZ$2bn would be spent buying five MH-60R Seahawk helicopters and another $700,000 to buy two Airbus A321XLR aircraft. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Australia news live: Lehrmann hearing takes early lunch break after lawyer pleads for more time; man rescued from NSW floodwaters", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "64f3626775cf67d586d3799c0da8e664b3b8b49382d1f4f5345131f3c4f0df07", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Netanyahu says Australian PM Albanese’s record ‘forever tarnished by weakness’ after Australian Jewish group urges calm", "url": "https://www.theguardian.com/australia-news/2025/aug/21/australian-pm-albanese-forever-tarnished-netanyahu-says", "id_key": "93a9cd6e6647738eae1a6aba371a870c103c57b5eab7439a97ae5954334bb9d9", "summary": "Israeli prime minister ignores pleas to resolve dispute with Australia through ‘diplomacy rather than public posturing’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Benjamin Netanyahu has ignored pleas from Australian Jewish groups to calm his feud with Anthony Albanese, further criticising the prime minister and escalating an ugly spat between the two leaders. Australia’s peak Jewish group, the Executive Council of Australian Jewry (ECAJ), on Wednesday labelled Israeli prime minister Netanyahu’s attack on Albanese as “inflammatory and provocative”, and a “clumsy intervention” which had affected Australia’s Jewish community. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Woman assisting police after infant found dead in Perth storm water drain", "url": "https://www.theguardian.com/australia-news/2025/aug/21/dead-infant-storm-water-drain-perth-woman-assisting-ntwnfb", "id_key": "0c9021a9b4673c109c348683708b8bc4376bc93d3d74db33612fb1d7e2411110", "summary": "Police say woman in her 30s ‘receiving appropriate care and support’ after workers made confronting discovery on Monday Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A woman is assisting police after a baby boy was found dead inside a storm water drain. Two workers carrying out routine maintenance made the confronting discovery in Alexander Heights in Perth’s northern suburbs on Monday afternoon. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Obama calls California’s redistricting plan ‘a responsible approach’", "url": "https://www.theguardian.com/us-news/2025/aug/20/obama-california-texas-redistricting", "id_key": "c12dc70a61af7c7ab12e51433e52b61535a086e06aba9e27f0e444c6aae36535", "summary": "Former US president wades into national conflict over House maps, as Texas lawmakers approve map to favor GOP Barack Obama waded into states’ efforts at rare mid-decade redistricting efforts, saying he agreed with California governor Gavin Newsom ’s plan to counter the new Texas congressional map by launching an effort to redraw his own state’s map and create more Democratic-friendly districts , calling it “a responsible approach”. “I believe that governor Newsom’s approach is a responsible approach. He said this is going to be responsible. We’re not going to try to completely maximize it,” Obama said at a Tuesday fundraiser on Martha’s Vineyard in Massachusetts. “We’re only going to do it if and when Texas and/or other Republican states begin to pull these maneuvers. Otherwise, this doesn’t go into effect.” Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Trump administration’s anti-woke campaign targets Smithsonian museums", "url": "https://www.theguardian.com/us-news/2025/aug/20/trump-administration-smithsonian-museum-review", "id_key": "8eb9edc309c91d3f03582f194f8ad43b7484ddef40757627a4d6904327643a16", "summary": "Exclusive: White House flags seven institutions including those for Latino, African and Asian art for review, document shows Amid the Donald Trump administration’s heavy-handed review of Smithsonian museums, the Guardian has seen a document compiled by the White House that details examples of how the widely visited cultural institutions have overly negative portrayals of US history. The document, based on public submissions shared with the administration, points to what it says are problematic exhibits at seven different museums, including a Benjamin Franklin exhibit that links his scientific achievements to his ownership of enslaved people and a film about George Floyd ’s murder that it says mischaracterizes the police. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Texas house passes Republican-drawn gerrymandered congressional map after weeks of protest – as it happened", "url": "https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates", "id_key": "364b31f4c1974fe4d5a8901562d544e7a83c152ae18cafa5ec5c2df411350748", "summary": "This liveblog is now closed The White House launched an official TikTok account on Tuesday, as Donald Trump continues to permit the Chinese-owned platform to operate in the US despite a law requiring its sale. “America we are BACK! What’s up TikTok ?” read a caption on the account’s first post, a 27-second clip, on the popular video-sharing app. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Trump has bought more than $100m in bonds while president, disclosure shows", "url": "https://www.theguardian.com/us-news/2025/aug/20/trump-bonds-disclosure", "id_key": "07085b0a304e9733fc2b98ab7c9bf90ea268b90714d2e21988427c127208d658", "summary": "Forms posted online show Trump made over 600 financial purchases the day after he was inaugurated for second term Donald Trump has bought more than $100m in company, state and municipal bonds since taking office in January, according to new disclosures which shed further light on the vast holdings of the US’s billionaire president. The forms, posted online on Tuesday, show the Republican former real estate mogul made more than 600 financial purchases since 21 January, the day after he was inaugurated for his second term in the White House. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:00Z", "source": "CryptoSlate", "title": "Bitcoin SOPR shows consistent profit realization despite price pullback", "url": "https://cryptoslate.com/bitcoin-sopr-shows-consistent-profit-realization-despite-price-pullback/", "id_key": "2eea66e59c2f26bfe76b607c4944d907f6e4190b5903e1fbacbd4113afc2b97e", "summary": "Bitcoin is trading just above $113,000, with realized cap rising steadily and spending activity led overwhelmingly by coins younger than three months. Profit realization remains positive, short-term holders hover around breakeven, and older supply shows little sign of distribution. Bitcoin closed Aug. 20 at $113,599, marking a 7.9% drop in the past week, a 3.3% […] The post Bitcoin SOPR shows consistent profit realization despite price pullback appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T03:29:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:00Z", "source": "CryptoSlate", "title": "Crypto groups endorse Brian Quintenz for CFTC amid regulatory standoff with banks", "url": "https://cryptoslate.com/crypto-groups-endorse-brian-quintenz-for-cftc-amid-regulatory-standoff-with-banks/", "id_key": "828093d7ec3b00f7e9f878cac50c5a619273d7db4e2cfa23e0666a72d3204d10", "summary": "The Crypto Council for Innovation (CCI) and the Blockchain Association jointly issued a letter on Aug. 20 endorsing Brian Quintenz for Chairman of the US Commodity Futures Trading Commission (CFTC). In the letter to President Donald Trump, the groups emphasized that confirming Quintenz promptly is critical to advancing his administration’s agenda to foster a “golden […] The post Crypto groups endorse Brian Quintenz for CFTC amid regulatory standoff with banks appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T03:29:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:01Z", "source": "CryptoBriefing", "title": "Kanye West drops YZY meme coin on Solana", "url": "https://cryptobriefing.com/yzy-meme-coin-solana-launch/", "id_key": "cc0be3e0683985fb9eb1db88bed1165c27ab3e67a60909c7e80d9f35c1a65aa6", "summary": "Kanye's YZY coin and payment system could revolutionize digital transactions, challenging traditional finance and boosting crypto adoption. The post Kanye West drops YZY meme coin on Solana appeared first on Crypto Briefing .", "ingested_utc": "2025-08-21T03:29:01Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:03Z", "source": "CryptoNews", "title": "Winklevoss Twins Donate $21 Million To Digital Freedom Fund PAC", "url": "https://cryptonews.com/news/winklevoss-twins-donate-more-than-21-million-to-digital-freedom-fund/", "id_key": "040cbb81de6cbc4097aac1515e6a0ecf0bd6c12c0173060613f56caafdc8e5d5", "summary": "Gemini co-founders Tyler and Cameron Winklevoss donated 188 Bitcoins to the Digital Freedom Fund PAC on Wednesday, the former revealed in a new X post.New Crypto PAC Sees A Boost From Crypto BillionairesAccording to the August 20 social media post, the twin billionaires donated the crypto lump sum in order to help bring about “America’s […] The post Winklevoss Twins Donate $21 Million To Digital Freedom Fund PAC appeared first on Cryptonews .", "ingested_utc": "2025-08-21T03:29:03Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:04Z", "source": "CoinJournal", "title": "The altcoin uprising: Ether, Solana, and BNB defy market fear as Bitcoin stalls", "url": "https://coinjournal.net/news/the-altcoin-uprising-ether-solana-and-bnb-defy-market-fear-as-bitcoin-stalls/", "id_key": "c5cd3138c3767c1b60ed9bdb4ae9de87f15c804db2c218ae84a897bc2df26efa", "summary": "Major altcoins like Ether and Solana are strongly outperforming Bitcoin. BNB, the token of BNB Chain, surged 6% to a new all-time high of 875. Bitcoin’s market dominance is on the verge of hitting a new six-month low. In a stunning display of defiance, a powerful cohort of major altcoins staged a dramatic comeback on […] The post The altcoin uprising: Ether, Solana, and BNB defy market fear as Bitcoin stalls appeared first on CoinJournal .", "ingested_utc": "2025-08-21T03:29:04Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Jair Bolsonaro Planned to Seek Asylum in Argentina, Brazil’s Police Say", "url": "https://www.nytimes.com/2025/08/20/world/americas/jair-bolsonaro-brazil-asylum-argentina.html", "id_key": "009816684ea1448db11a44c74f34b65969b6e4b53bedafb8acfe255aa28a5959", "summary": "The police said they found a request for asylum, addressed to Argentina’s leader, on the phone of the Brazilian ex-president, who is accused of plotting a coup.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "A Huge Cave in Kentucky Was a Smelly Disaster. Now It’s Spectacular.", "url": "https://www.nytimes.com/2025/08/20/climate/horse-hidden-river-cave-pollution-cleanup.html", "id_key": "e016b742459a2248c728a1631e1a50acce143fb582c04be2bf8f2696ce4a2eef", "summary": "Hidden River Cave was once filled with heavy metals and sewage that made the surrounding town smell awful. After a cleanup, it became a tourist draw.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Dusky Gopher Frogs Are Making a Comeback in Mississippi", "url": "https://www.nytimes.com/2025/08/20/climate/mississippi-dusky-gopher-frog.html", "id_key": "f8602a66cdf743e4a2a8eee1d8af41583ec7e05cd5d7cd6780e221a9a77c904e", "summary": "Fewer than 100 dusky gopher frogs were known to remain. Thanks to some very dedicated humans, numbers are now on the rise.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Why Shop? In Maine, the Library of Things Has It All (Almost)", "url": "https://www.nytimes.com/2025/08/20/climate/maine-library-of-things.html", "id_key": "6e73f16d4c460b580237ca444482a26b33d97680821c7decdd2b03896fd2146e", "summary": "One town’s effort to make pricey items accessible and encourage people to buy less stuff seems to be catching on.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Israel Approves Settlements, a Blow to Faded Hopes for a Palestinian State", "url": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-e1-settlement-west-bank.html", "id_key": "8c3e470820053bb7334e4d42bbe8e4a3f96e4b96da0738ae334d54f73aef5102", "summary": "The long-stalled project near Jerusalem, known as E1, further fragments West Bank lands envisioned as part of a Palestinian state, advancing a goal of Israeli hard-liners.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Why Georgia, Once on Democracy’s Vanguard, Is Drifting Toward Russia", "url": "https://www.nytimes.com/2025/08/20/magazine/georgia-russia-autocracy-dictatorship.html", "id_key": "1b3928c463e64becff35f15b55788f25d18b2e63be4e20ed138c3c2e14a31a08", "summary": "Two decades after the Rose Revolution, the former Soviet satellite is turning away from the West and back toward Russia. What happened?", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:12Z", "source": "FT_Home", "title": "China turns against Nvidia’s AI chip after ‘insulting’ Lutnick remarks", "url": "https://www.ft.com/content/b8e30c54-b71c-4113-8b3e-8f54bc36587d", "id_key": "342eaade33ac20b5e21a850478f814bcb543186af935fbe0356c3e6d3efde4b9", "summary": "Comments by US commerce secretary trigger Chinese regulatory effort to stop tech groups buying H20 processors", "ingested_utc": "2025-08-21T03:31:12Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "TheStreet_Top", "title": "Walmart is selling a $175 wicker patio set for $85 that's 'clean' and 'sophisticated'", "url": "https://www.thestreet.com/deals/homall-casual-3-piece-wicker-patio-set-amazon-sale", "id_key": "d180e73bfcf080d5582292fdfa6f1ae865192e1b6e6c3863595963b128764104", "summary": "\"It's a nice color and was simple enough to assemble.\"", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "TheStreet_Top", "title": "Home Depot and Lowe’s warn of higher prices", "url": "https://www.thestreet.com/retail/home-depot-lowes-quietly-raising-prices-due-to-tariffs", "id_key": "395685602f34af0bd80d63fa0deb69e48f84c31938e1e31d169a8d29a1dd9045", "summary": "Both home improvement companies have been reluctant to admit that some prices have already increased, and others will go up.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "AlJazeera_All", "title": "‘Moral imperative’: Hundreds of UK business leaders demand action on Israel", "url": "https://www.aljazeera.com/news/2025/8/21/moral-imperative-hundreds-of-uk-business-leaders-demand-action-on-israel?traffic_source=rss", "id_key": "092cc9e13794c10e442b7523dacca474b910e1ca0b806b4e2266df1dbeae63a7", "summary": "More than 700 acclaimed professionals call for arms embargo, sanctions and scrutiny as Gaza faces darkest days.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "AlJazeera_All", "title": "Europe must shoulder ‘lion’s share’ of Ukraine’s security, Vance says", "url": "https://www.aljazeera.com/news/2025/8/21/europe-must-shoulder-lions-share-of-ukraines-security-vance-says?traffic_source=rss", "id_key": "65fc7d3dbe81ff3cf6fc2e23a1439c601fa7bc16375eba57d6d4d3f1d22fe864", "summary": "US vice president says Europe will be expected to play the 'leading role' in guaranteeing Kyiv's post-war security.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "AlJazeera_All", "title": "Netherlands sending 300 troops, Patriot missile systems to Poland", "url": "https://www.aljazeera.com/news/2025/8/21/netherlands-sending-300-troops-patriot-missile-systems-to-poland?traffic_source=rss", "id_key": "13a40f87c2d33d3739f78f67031b4581b0ecd679bac3733a06b803ff3a0a58fa", "summary": "Dutch defence minister announces details of support for Poland as Polish authorities accuse Russia of 'provocation'.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "Actiontec Launches First Wi-Fi 7 Device Certified with Plume OpenSync 6.6", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/actiontec-launches-first-wi-fi-7-device-certified-with-plume-opensync-6-6", "id_key": "1b2c7c7549266767d1a703847f6909fc5b35bb7c5cfc21ea93990c9f2ed4c47b", "summary": "Breakthrough certification affirms company’s commitment to next-gen connected home experiences SANTA CLARA, Calif. — Actiontec, a leading provider of advanced broadband CPE solutions, today announced that its flagship WF-710G wireless gateway/extender has become the first Wi-Fi 7 device to receive OpenSync 6.6 certification from Plume, the cloud-based platform for smart home and small business services. […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "India Becomes Rare Hub for Green IPOs With $4 Billion of Deals", "url": "https://financialpost.com/pmn/business-pmn/india-becomes-rare-hub-for-green-ipos-with-4-billion-of-deals", "id_key": "bc451c27d08d2cdfad89ade6a264fb6759d62ae7b7dc1124a1e8ef3eb6a7353b", "summary": "India is seeing a revival in clean-energy initial public offerings as companies capitalize on Prime Minister Narendra Modi’s push for renewables.", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "Toshiba Releases Automotive Photorelay in a Small Package that Achieves Output Withstand Voltage of 1500V for Automotive Battery Systems", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/toshiba-releases-automotive-photorelay-in-a-small-package-that-achieves-output-withstand-voltage-of-1500v-for-automotive-battery-systems", "id_key": "47b4cf5839f278e7c56febb6751b8a856d85f855ad90ccfbfcc5d3c84c04d1f5", "summary": "KAWASAKI, Japan — Toshiba Electronic Devices & Storage Corporation (“Toshiba”) has launched an automotive photorelay[1], ” TLX9161T,” in a small SO12L-T package, that achieves an output withstand voltage of 1500V (min), the level required to support high voltage automotive batteries. Volume shipments start today. Key challenges in popularizing electric vehicles include reducing charging times and […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "MedX Health Corp. Names Meghan Geary as Senior Vice President of Operations", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/medx-health-corp-names-meghan-geary-as-senior-vice-president-of-operations", "id_key": "e8a1ee5fe0cf8a5c81e37c6e5023bf1b3affb82e517b7cdc21f78cb1f8a3f186", "summary": "MISSISSAUGA, Ontario — MedX Health Corp. (“MedX” or the “Company”) (TSXV: MDX), the global leader in teledermatology solutions, confirms the appointment of Meghan Geary as the Company’s Senior Vice President of Operations, effective immediately. With over 10 years experience in building scalable programs across SaaS and high-growth healthcare companies, Geary will oversee strategic operations, drive […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "Plethora Precious Metals Files Early Warning Report for Kingfisher Metals Corp.", "url": "https://financialpost.com/globe-newswire/plethora-precious-metals-files-early-warning-report-for-kingfisher-metals-corp", "id_key": "ca188bbe02dc6a39d0e72f542e3e5211601d6acabaa968b97ce8c0857a389f02", "summary": "UTRECHT, Netherlands, Aug. 20, 2025 (GLOBE NEWSWIRE) — Plethora Precious Metals Fund (“Plethora”) announces an update to its ownership of common shares (the “Shares”) of Kingfisher Metals Corp. (the “Company”) in satisfaction of the requirements of National Instrument 62-104 – Take-Over Bids and Issuer Bids (“NI 62-104”) and National Instrument 62-103 – The Early Warning […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "China approvals for IPOs outside mainland slow to a trickle", "url": "https://asia.nikkei.com/business/markets/ipo/china-approvals-for-ipos-outside-mainland-slow-to-a-trickle", "id_key": "46ad4f383fbc478fb780fc66d2d588546b7a4ccbd7e219e2e2258cd60c5f10a8", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Taiwan needs nuclear restart for security, urges opposition party chief", "url": "https://asia.nikkei.com/editor-s-picks/interview/taiwan-needs-nuclear-restart-for-security-urges-opposition-party-chief", "id_key": "9cd2b0649e37dbd73ca47ac6121a3ab508854cf476d4d19d48dba862547552bf", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan automakers start to pass on Trump tariff costs to US consumers", "url": "https://asia.nikkei.com/business/automobiles/japan-automakers-start-to-pass-on-trump-tariff-costs-to-us-consumers", "id_key": "cfd09ffd048494b9e068cd99cb9dbd7d0f0e8bd1b672aa32c868b68aea699fc4", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Indonesia central bank delivers surprise cut amid tariff concerns", "url": "https://asia.nikkei.com/economy/indonesia-central-bank-delivers-surprise-cut-amid-tariff-concerns", "id_key": "6666be922ad015fc8b05a7e2119e8076bfd2d87c607ec07f7ecc26cc23c88616", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan and South Korea to allow second working holiday visas", "url": "https://asia.nikkei.com/politics/international-relations/japan-and-south-korea-to-allow-second-working-holiday-visas", "id_key": "2aaad7aae3368fbd5943471fa3055d546f0e85dc5c358edae6d634433587b02f", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Myanmar's cybersecurity law comes into force, putting businesses on alert", "url": "https://asia.nikkei.com/spotlight/myanmar-crisis/myanmar-s-cybersecurity-law-comes-into-force-putting-businesses-on-alert", "id_key": "489280374443a3caddb4b5e293379c38f73b139c1f8b49c5b2989325a3ca1eb0", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Bangladesh garment makers gain orders on new US tariff", "url": "https://asia.nikkei.com/economy/trade-war/trump-tariffs/bangladesh-garment-makers-gain-orders-on-new-us-tariff", "id_key": "c89995b0abeb24ebd2fdbfb4dd3cf1eb9d1aa1ef0dcb88d2de8fbba19b49190d", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan exports drop for third straight month as Trump tariffs bite", "url": "https://asia.nikkei.com/economy/trade-war/trump-tariffs/japan-exports-drop-for-third-straight-month-as-trump-tariffs-bite2", "id_key": "ae28db04ea0fe7219fe4f6c8fd236a8782305ed03e94155e9c081f525cd5e042", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan PM signals alignment with NATO on Ukraine security", "url": "https://asia.nikkei.com/politics/international-relations/japan-pm-signals-alignment-with-nato-on-ukraine-security", "id_key": "4fa7ebee8d24d0a934468a5551739427a6024dc42e6ae05466e204fe057f389d", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Mitsui Chemicals to partner with Nigeria's Dangote on petrochemicals", "url": "https://asia.nikkei.com/business/companies/mitsui-chemicals-to-partner-with-nigeria-s-dangote-on-petrochemicals2", "id_key": "107c912bd32bd39bbd19bf3fc0f82911196ac1bd9e5851f4f6b2e2aeae79d692", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "China's growing ties with Serbia point to new 'Silk Curtain' in Europe", "url": "https://asia.nikkei.com/politics/international-relations/china-s-growing-ties-with-serbia-point-to-new-silk-curtain-in-europe", "id_key": "811dc1f27719ca7112c422556bc4942db607ad62d2c085454f37488b1f122137", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Huge Vietnam smart city backed by Japan's Sumitomo moves forward", "url": "https://asia.nikkei.com/business/markets/property/huge-vietnam-smart-city-backed-by-japan-s-sumitomo-moves-forward2", "id_key": "b61c3147deb4e3584a28965a16eabcfe56ba49b1acc245fc66f527b3d719fc96", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "LG Electronics chases bigger slice of India's red-hot appliance market", "url": "https://asia.nikkei.com/business/electronics/lg-electronics-chases-bigger-slice-of-india-s-red-hot-appliance-market", "id_key": "37cab27c9ca8a16aa89411d5860e07431dbfa449b09243feb1d85f6b0843c435", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "US court tosses suit against Texas restricting Chinese property ownership", "url": "https://asia.nikkei.com/politics/international-relations/us-china-tensions/us-court-tosses-suit-against-texas-restricting-chinese-property-ownership", "id_key": "05ffcd8da3fc0787b7684f830428aee9a3ac0d0f7215758a76874803666b9773", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:32:06Z", "source": "HackerNews_Top", "title": "How to stop feeling lost in tech: the wafflehouse method", "url": "https://www.yacinemahdid.com/p/how-to-stop-feeling-lost-in-tech", "id_key": "46d6dfeb3658f118efd3f6cf83d316ba6b104b113f08ec0835a7beed406897b3", "summary": "Comments", "ingested_utc": "2025-08-21T03:32:06Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:32:06Z", "source": "HackerNews_Top", "title": "SK hynix dethrones Samsung as world’s top DRAM maker", "url": "https://koreajoongangdaily.joins.com/news/2025-08-15/business/tech/Thanks-Nvidia-SK-hynix-dethrones-Samsung-as-worlds-top-DRAM-maker-for-first-time-in-over-30-years/2376834", "id_key": "0e8122010f81fa77e249c6014925a6a56593973f2b40232319405ea3cee6b86e", "summary": "Comments", "ingested_utc": "2025-08-21T03:32:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:32:06Z", "source": "HackerNews_Top", "title": "ICE Budget Now Bigger Than Most of the Militaries", "url": "https://www.newsweek.com/immigration-ice-bill-trump-2093456", "id_key": "7b709f2f2fa0eca98d3041ae226c30edac17d350e11d885990a852cb68e33c7b", "summary": "Comments", "ingested_utc": "2025-08-21T03:32:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:01:16Z", "source": "FT_Markets", "title": "Securitisation as the baddie? Europe can flip that script", "url": "https://www.ft.com/content/137a4930-a136-4ea9-8bef-817a84c7729f", "id_key": "35c685ad135d69aef1e3b7ca26de934d30241077947c9fa562bb3641b63515a9", "summary": "European Commission proposals include clear improvements such as new punishments on investors who fall short", "ingested_utc": "2025-08-21T04:01:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:01:16Z", "source": "FT_Markets", "title": "Ukrainian attacks disrupt Russian petrol supplies and push up prices", "url": "https://www.ft.com/content/1a22515d-f0e2-4f11-8e1f-6d7b9d30ef13", "id_key": "adcb0be74b0b21b7cec331defa0ff73fbc4b412d65c4e0b2a790402418fe5d9c", "summary": "Moscow has banned exports following drone strikes on oil refineries", "ingested_utc": "2025-08-21T04:01:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:01:16Z", "source": "FT_Markets", "title": "Gold, gangs and the rise of narco-miners", "url": "https://www.ft.com/content/cc4f6203-4d78-4b1d-a431-82d0e10e7c47", "id_key": "5f31b1d193e3b561235d96b3be02f454b433edc6d19dc3f34ed3eecab1ad0ed0", "summary": "Historic price rally lures criminals and paramilitaries into illicit mining from the Amazon to Sudan", "ingested_utc": "2025-08-21T04:01:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:01:16Z", "source": "FT_Markets", "title": "US oilfield services group expands Russian unit despite new sanctions", "url": "https://www.ft.com/content/19f61bbf-f2e9-4cd0-9400-3801dd8c05c9", "id_key": "cc2e9c3594b5f161bfdfe362646fc89d5ed4393a817f5e317d81b93e84a9b15a", "summary": "Weatherford International along with other companies continue to provide critical equipment to the country", "ingested_utc": "2025-08-21T04:01:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:01:43Z", "source": "AlJazeera_All", "title": "Brazil’s ex-President Bolsonaro planned asylum in Argentina, police say", "url": "https://www.aljazeera.com/news/2025/8/21/brazils-ex-president-bolsonaro-planned-asylum-in-argentina-police-say?traffic_source=rss", "id_key": "4b583d59b8796019b0c92e93a6ec7647ebda95b0e1665c67cc77a9701294d4bc", "summary": "Police claim Brazil's ex-President Jair Bolsonaro wrote letter seeking asylum in Argentina amid coup probe.", "ingested_utc": "2025-08-21T04:01:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:01:49Z", "source": "FinancialPost_Business", "title": "Students face new cellphone restrictions in 17 states as school year begins", "url": "https://financialpost.com/pmn/students-face-new-cellphone-restrictions-in-17-states-as-school-year-begins", "id_key": "78f2be6dd8c4fde43620433976e5ada53efa4d999f1f7e6bf20bd037f57419e9", "summary": "Jamel Bishop is seeing a big change in his classrooms as he begins his senior year at Doss High School in Louisville, Kentucky, where cellphones are now banned during instructional time. In previous years, students often weren’t paying attention and wasted class time by repeating questions, the teenager said. Now, teachers can provide “more one-on-one […]", "ingested_utc": "2025-08-21T04:01:49Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:02:04Z", "source": "HackerNews_Top", "title": "Advice for Tech Non-Profits", "url": "https://mitchellh.com/writing/advice-for-tech-nonprofits", "id_key": "89f9571a585e40efec8dabeebacb2573605d4912aceab3ffdfd3a12fb81e335e", "summary": "Comments", "ingested_utc": "2025-08-21T04:02:04Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:44:18Z", "source": "Guardian_World", "title": "Australia news live: trapped man rescued from NSW flood waters; ASX hits historic high", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "de21baba1e3375a2b8951e59cf51367455dafbf48e273d2495039e3cb39945ff", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T04:44:18Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:44:18Z", "source": "Guardian_World", "title": "European leaders scramble to shield Ukraine in high-stakes Trump talks – but did they?", "url": "https://www.theguardian.com/world/2025/aug/20/european-leaders-scramble-to-shield-ukraine-in-high-stakes-trump-talks-but-did-they", "id_key": "bfd220fe7749101740fa3d846cb9440959bd4dc64e400501c7f882caff51498f", "summary": "The shifting loyalties of the White House have inadvertently bound Europe closer together, how long can that unity last? It was dubbed the “Great European Charm Offensive”. Hours before Volodymyr Zelenskyy headed to Washington for a Monday meeting with Donald Trump, announcements came pouring in from across Europe, making it clear that the president of Ukraine would not be going alone. Continue reading...", "ingested_utc": "2025-08-21T04:44:18Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:44:41Z", "source": "CryptoNews", "title": "[LIVE] Crypto News Today: Latest Updates for August 21, 2025 – Bitcoin, Ethereum Hold Key Levels as Demand Cools, CeFi Tokens Rally", "url": "https://cryptonews.com/news/live-crypto-news-today-latest-updates-for-august-21-2025/", "id_key": "37c222f5565a67ad0883ffbb64be335e70c0bde1582cd1d16b7506f9446c8787", "summary": "Follow up to the hour updates on what is happening in crypto today, August 21. Market movements, crypto news, and more! The post [LIVE] Crypto News Today: Latest Updates for August 21, 2025 – Bitcoin, Ethereum Hold Key Levels as Demand Cools, CeFi Tokens Rally appeared first on Cryptonews .", "ingested_utc": "2025-08-21T04:44:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:44:41Z", "source": "CryptoNews", "title": "Coinbase CEO Brian Armstrong Projects Bitcoin Price Explosion to $1M by 2030", "url": "https://cryptonews.com/news/coinbase-ceo-brian-armstrong-bitcoin-price-projection-1-million-2030/", "id_key": "d41ad958480043315261dca1fc679606adbfe22b028522c275a5f272f64093ee", "summary": "Coinbase CEO Brian Armstrong predicted Bitcoin could hit $1 million by 2030, a rare price target from the exchange boss. The post Coinbase CEO Brian Armstrong Projects Bitcoin Price Explosion to $1M by 2030 appeared first on Cryptonews .", "ingested_utc": "2025-08-21T04:44:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:46:32Z", "source": "NYTimes_World", "title": "Thursday Briefing: Israeli Troops Near Gaza City", "url": "https://www.nytimes.com/2025/08/21/briefing/gaza-city-offensive-west-bank-settlements-ukraine-russia-china-tibet.html", "id_key": "d726c2dca2c8207efaef962eb25e0257eeef4571e4dc91e6c4cf22c116c2d926", "summary": "Also, Africa’s push for a new world map.", "ingested_utc": "2025-08-21T04:46:32Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:46:43Z", "source": "FT_Home", "title": "US oilfield services group expands Russian unit despite new sanctions", "url": "https://www.ft.com/content/19f61bbf-f2e9-4cd0-9400-3801dd8c05c9", "id_key": "d9ba2b57d81d1fc7651386af0869899200b814f25c07fb25765e323a5cfd8709", "summary": "Weatherford International along with other companies continue to provide critical equipment to the country", "ingested_utc": "2025-08-21T04:46:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:46:43Z", "source": "FT_Home", "title": "Councils move to close off key alternative to asylum hotels in England", "url": "https://www.ft.com/content/a8be6719-6ef6-47fc-bcb1-8584c1db418f", "id_key": "682c0cdf84410c166437cdfcdca7e58451636cbec18d180026982f11afe40247", "summary": "Local authorities tighten controls on houses in multiple occupation amid fears for community cohesion", "ingested_utc": "2025-08-21T04:46:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:47:00Z", "source": "ArsTechnica_All", "title": "Humans intervened every 9 minutes in AAA test of driver assists", "url": "https://arstechnica.com/cars/2025/08/humans-intervened-every-9-minutes-in-aaa-test-of-driver-assists/", "id_key": "e267b39da4f29573af6d1b2769b9294cface7785bd8f36da7abe23210ea0224b", "summary": "AAA tested a number of different systems in Los Angeles highway traffic.", "ingested_utc": "2025-08-21T04:47:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:47:18Z", "source": "FinancialPost_Business", "title": "Prosecutors link LA contract to Smartmatic ‘slush fund’ as voting tech firm battles Fox in court", "url": "https://financialpost.com/pmn/prosecutors-link-la-contract-to-smartmatic-slush-fund-as-voting-tech-firm-battles-fox-in-court", "id_key": "dab3e40fab0c9bdb5275fa19edc7b4d8c53e969c47af70dd4645a530f0c42676", "summary": "MIAMI (AP) — Smartmatic, the elections-technology company suing Fox News for defamation, is now contending with a growing list of criminal allegations against some of its executives — including a new claim by federal prosecutors that a “slush fund” for bribing foreign officials was financed partly with proceeds from the sale of voting machines in […]", "ingested_utc": "2025-08-21T04:47:18Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T04:47:33Z", "source": "HackerNews_Top", "title": "Home Depot sued for 'secretly' using facial recognition at self-checkouts", "url": "https://petapixel.com/2025/08/20/home-depot-sued-for-secretly-using-facial-recognition-technology-on-self-checkout-cameras/", "id_key": "1247b238baf3e6b4fcc7fb138f08a2883f2a8965d610f7f4d5c572b64cdd9dba", "summary": "Comments", "ingested_utc": "2025-08-21T04:47:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:39:41Z", "source": "BBC_World", "title": "Palestinians flee Gaza City as Israel says first stages of assault have begun", "url": "https://www.bbc.com/news/articles/clyr7l0z9edo?at_medium=RSS&at_campaign=rss", "id_key": "8549acb15d503a06fe093d028370ae9e973460778bd1cf0ba8b5e16f5349e313", "summary": "An Israeli military spokesman says troops will deepen the damage to the \"terror infrastructure\" held by Hamas.", "ingested_utc": "2025-08-21T05:39:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:39:41Z", "source": "BBC_World", "title": "'Bear attack victim' was actually killed by son, Japan police say", "url": "https://www.bbc.com/news/articles/c62n5gv72j5o?at_medium=RSS&at_campaign=rss", "id_key": "f8b38d2a2eb852b25d0498fd0e6967f83360cb3a91be3367c64ad3ed04841aba", "summary": "A man police believed was killed by a bear had in fact been stabbed to death by his son, they say.", "ingested_utc": "2025-08-21T05:39:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:39:42Z", "source": "BBC_Business", "title": "County's 'secret' festival marks 25th anniversary", "url": "https://www.bbc.com/news/articles/cr5r793lvggo?at_medium=RSS&at_campaign=rss", "id_key": "9a2c57683d0bc833af1cfeb7e431675300b79bf50ab1ac7d2846de64b69d76c7", "summary": "The four-day Shambala Festival is set to welcome about 15,000 people to Northamptonshire.", "ingested_utc": "2025-08-21T05:39:42Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:39:44Z", "source": "Guardian_World", "title": "Australia news live: two dead bodies found by police divers after car crash into NSW river; ASX hits historic high", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "d26d9375348a1270eabf11e29f97ee216e8af9f6332a76c3f07188734477ad69", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T05:39:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:39:44Z", "source": "Guardian_World", "title": "NSW weather: heavy rain and flooding as Sydney records wettest day of the year", "url": "https://www.theguardian.com/australia-news/2025/aug/21/nsw-weather-sydney-rainfall-flood-flooding-warnings", "id_key": "44212dc8fc6c7c11d1f4fa8a24ce2701ffb025d3aabb50be72164919943f584b", "summary": "Weather and flood warnings stretch from south of Sydney to the state’s north-west, as elevated river levels, full dams and more rainfall pose risks to communities Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Hundreds of New South Wales residents have made calls for help as heavy rainfall lashes the state, leaving huge swathes at risk of flooding, as Sydney experienced its wettest day of the year to date. Bodies have been found in the search for two men missing after a car entered a river 20km north of Wisemans Ferry, on Sydney’s northern outskirts, on Wednesday night. NSW police said earlier heavy rainfall was impacting the multi-agency effort. Continue reading...", "ingested_utc": "2025-08-21T05:39:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:40:09Z", "source": "CryptoNews", "title": "Rapper Kanye West Launches Solana-Based Meme Coin ‘YZY’", "url": "https://cryptonews.com/news/rapper-kanye-west-launches-solana-based-meme-coin-yzy/", "id_key": "184d949de3700dcab19c2d6ec2fcc08bbde3ff3eb165bfcf900c367c46bd9e65", "summary": "Kanye West launched Solana-based meme coin YZY, which briefly hit a $3B market cap before plunging within hours. The post Rapper Kanye West Launches Solana-Based Meme Coin ‘YZY’ appeared first on Cryptonews .", "ingested_utc": "2025-08-21T05:40:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:40:09Z", "source": "CryptoNews", "title": "Hong Kong’s Ming Shing Enters Bitcoin Purchase Agreement to Buy 4,250 BTC", "url": "https://cryptonews.com/news/hong-kongs-ming-shing-enters-bitcoin-purchase-agreement-to-buy-4250-btc/", "id_key": "7e177b2e8b2e62e1d7129e9b2bcdc9780993aa93af8c675c2835b447e117d746", "summary": "Ming Shing has entered a Bitcoin purchase agreement with Winning Mission Group to purchase 4,250 Bitcoin, valued at $483 million. The post Hong Kong’s Ming Shing Enters Bitcoin Purchase Agreement to Buy 4,250 BTC appeared first on Cryptonews .", "ingested_utc": "2025-08-21T05:40:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:42:10Z", "source": "NPR_Top", "title": "Brazilian police say ex-President Bolsonaro had planned to flee to Argentina", "url": "https://www.npr.org/2025/08/21/nx-s1-5509434/brazil-bolsonaro-argentina-coup-asylum", "id_key": "3f312987ed376f0df9c126dde23cc73a8c09254880d04b8de1051b087e347747", "summary": "Bolsonaro is awaiting a Supreme Court ruling about an alleged coup attempt and learned Wednesday he might face another case as police formally accused him and one of his son of obstruction of justice", "ingested_utc": "2025-08-21T05:42:10Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:42:15Z", "source": "FT_Markets", "title": "BlackRock tells investors to put more money into hedge funds", "url": "https://www.ft.com/content/8bef7573-357d-4d0e-b1b4-acaf30b472a6", "id_key": "48a8315a1f05ee246d8483149ff96cc6198b4300b06ae39d740321ca5069f8d0", "summary": "This is the biggest allocation increase to the sector ever recommended by the world’s largest asset manager’s institute", "ingested_utc": "2025-08-21T05:42:15Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:42:41Z", "source": "AlJazeera_All", "title": "Trump has bought more than $100m in bonds in office, disclosure shows", "url": "https://www.aljazeera.com/economy/2025/8/21/trump-has-bought-more-than-100m-in-bonds-in-office-disclosure-shows?traffic_source=rss", "id_key": "7cdad8261770546fda967fa25e0eebed1b5a65a533c6a0919e48c4c18ae227ae", "summary": "Trump's investments include Meta, Wells Fargo, Morgan Stanley, Citigroup, and T-Mobile, according to filing.", "ingested_utc": "2025-08-21T05:42:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:42:48Z", "source": "FinancialPost_Business", "title": "This Ukrainian startup makes drones – and soon, cruise missiles – to strike deep inside Russia", "url": "https://financialpost.com/pmn/this-ukrainian-startup-makes-drones-and-soon-cruise-missiles-to-strike-deep-inside-russia", "id_key": "f18bddb3cd26eea2dddad4a3ad8eb5f606c353cf4674743ec47ac76ce96d4199", "summary": "When a Ukrainian-made drone attacked an ammunition depot in Russia last September, it showcased Kyiv’s determination to strike deep behind enemy lines and the prowess of its defense industry. The moment was especially gratifying for the woman in charge of manufacturing the drones that flew more than 1,000 kilometers (620 miles) to carry out this […]", "ingested_utc": "2025-08-21T05:42:48Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:42:55Z", "source": "Nikkei_Asia_Top", "title": "The likely winners and losers from Trump's threatened 300% chip tariff", "url": "https://asia.nikkei.com/business/technology/the-likely-winners-and-losers-from-trump-s-threatened-300-chip-tariff", "id_key": "60ba5497d231f531ec976797f31a16471deb1cf6b6581b09963f10f7788c5810", "summary": "", "ingested_utc": "2025-08-21T05:42:55Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T05:51:58Z", "source": "NYTimes_World", "title": "Soccer Game in Argentina Is Canceled After Violence in Stands", "url": "https://www.nytimes.com/2025/08/21/world/americas/argentina-chile-soccer-violence.html", "id_key": "137e9e685f8e525a65ab50dcf2f8368fd04b9c5ca11689d573c336ec98f1d8e0", "summary": "Fans were hospitalized and detained after violent attacks during a match in a stadium near Buenos Aires, prompting officials to cancel the game.", "ingested_utc": "2025-08-21T05:51:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_World", "title": "Palestinians flee Gaza City districts as Israel says first stages of assault have begun", "url": "https://www.bbc.com/news/articles/clyr7l0z9edo?at_medium=RSS&at_campaign=rss", "id_key": "90ed7cd51f22503d9075466d63c04ca8b962717d19f687a347f09f213c2cdeb5", "summary": "An Israeli military spokesman says troops will deepen the damage to the \"terror infrastructure\" held by Hamas.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_World", "title": "ICC 'deplores' new US sanctions on judges and prosecutors", "url": "https://www.bbc.com/news/articles/c620l3y7ydro?at_medium=RSS&at_campaign=rss", "id_key": "1cc7c3bea03902f818c46649268db829481b251da12f89e3f043dbc36498ffa2", "summary": "Secretary of State Marco Rubio denounces the court as \"an instrument of lawfare\" against the US and Israel.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_World", "title": "Frank Caprio: 'Nicest judge in the world' dies aged 88", "url": "https://www.bbc.com/news/articles/c87ewp437e2o?at_medium=RSS&at_campaign=rss", "id_key": "23505778f4df83ff5f878e5db09b13b0a6b879b806c3729b9b385abe44d3953c", "summary": "The US celebrity judge and social media star has been remembered for his \"unique brand of compassion\".", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_Business", "title": "Government borrowing lower than expected in July", "url": "https://www.bbc.com/news/articles/cj6ydlk4e1no?at_medium=RSS&at_campaign=rss", "id_key": "2c0eb2192e097245274a56ce0fbc7d7efb7f10167da07a9a0241a3d333e72f64", "summary": "Borrowing last month was the lowest July figure for three years, following rises in tax and National Insurance receipts.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_Business", "title": "Sony raises PlayStation 5 prices in US as tariff fears persist", "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss", "id_key": "132415b752184da4da2e0fa5097b72d4cf9f5ed08eeb288ef5b7361fc4d6daa0", "summary": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Australia news live: Lehrmann’s lawyer argues Network Ten mischaracterised attack on Higgins as a violent assault; Queensland court bans pro-Palestine bridge rally", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "2f2b8ff49a5cef7c60f6d63b770d0e300cb595c513f2b1ebd359b5282b2f47c9", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Bruce Lehrmann’s lawyer asks defamation appeal for more time to prepare but justices tell her ‘start now’", "url": "https://www.theguardian.com/australia-news/2025/aug/21/bruce-lehrmann-defamation-appeal-lawyer-ntwnfb", "id_key": "9fbfff347c5f2bdabd2af28ef068443c7662e921ebf8a6dabc9a68371e805248", "summary": "Zali Burrows told she has had ‘plenty’ of opportunity to consider issue in case despite repeated requests to adjourn early Bruce Lehrmann’s defamation appeal lawyer has repeatedly asked the federal court to adjourn early to give her more time to prepare, but the justices refused, telling the solicitor she has had “plenty” of time. Sydney criminal solicitor Zali Burrows is representing Lehrmann, who is appealing Justice Michael Lee’s April 2024 judgment, which found the former Liberal staffer was not defamed by Lisa Wilkinson and Network 10 when The Project broadcast an interview with Brittany Higgins in 2021 in which she alleged she was raped in Parliament House. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "European leaders scrambled to shield Ukraine in high-stakes Trump talks – but did they?", "url": "https://www.theguardian.com/world/2025/aug/20/european-leaders-scramble-to-shield-ukraine-in-high-stakes-trump-talks-but-did-they", "id_key": "08d5fcf5dac94dc001bd5d490ca5d10f59aa9d8a358a77616d6d66a5d01a4bf2", "summary": "The shifting loyalties of the White House have inadvertently bound Europe closer together – how long can that unity last? It was dubbed the “Great European Charm Offensive”. Hours before Volodymyr Zelenskyy headed to Washington for a Monday meeting with Donald Trump, announcements came pouring in from across Europe, making it clear that the president of Ukraine would not be going alone. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Israel to call up 60,000 reservists as it launches ‘first stages’ of attack on Gaza City – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/21/israel-gaza-city-middle-east-palestinians-latest-live-news-updates", "id_key": "0843d54dd381a9744d08ff5e5540dc298770893b991e80cce20142c7d621163e", "summary": "Troops already holding outskirts of territory’s capital, military says, while Israel approves huge new illegal settlement splitting West Bank Israel expands Gaza City offensive A group of 17 US Senators sent a letter to Secretary of State Marco Rubio on Wednesday calling for the United States to press Israel to grant access and protection to journalists in Gaza. The letter comes one week after an Israeli strike killed a group of Palestinian journalists in the besieged territory. Israeli defence minister Israel Katz’s order to send more troops into Gaza City came despite international criticism of the offensive , with fears of significant casualties and more mass displacement amid widening conditions of starvation in the territory. The situation in Gaza City was “catastrophic” and “large numbers” were fleeing eastern neighbourhoods , according to the Gaza municipality’s emergency committee chief, Mustafa Qazzaat. Resident Anis Daloul, 64, told the AFP news agency the Israeli military had “destroyed most of the buildings in Zeitoun and displaced thousands of people”. The additional Israeli reserve soldiers would not report for duty until September, a military official said on Wednesday, giving mediators time to bridge gaps between Hamas and Israel over the terms of any ceasefire and hostage deal. Hamas said Israel’s plans to conquer Gaza City showed its “blatant disregard” for efforts to broker a truce . The Israeli talk of a large-scale operation could primarily be intended to put pressure on the militant group in ceasefire talks, reports Peter Beaumont . More than 62,000 Palestinians have been killed in the Israeli war in Gaza since Hamas’s deadly attacks in October 2023, according to Gaza health officials. British UK foreign secretary David Lammy condemned Israel’s approval of the new settlement block in the West Bank as a “flagrant breach of international law”. The plan would split the West Bank into two with the intention – Israeli far-right minister Bezalel Smotrich has said – of ending any prospect of a Palestinian state. The Israeli military said on Thursday it has received a report about a security incident near the settlement of Malachei HaShalom in the West Bank , adding that details were under review. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "UK government borrowed less than expected in July in lift for Rachel Reeves", "url": "https://www.theguardian.com/business/2025/aug/21/government-borrowed-less-than-expected-in-july-in-lift-for-rachel-reeves", "id_key": "231045b8d8c22ebec10866c2ecbc1ec66d9ff7ce859c8b91639f10c96968b7f7", "summary": "Public sector net borrowing falls to £1.1bn as chancellor explores tax-raising options in autumn budget Business live – latest updates The UK government borrowed less than expected in July, official figures show, in a boost to the chancellor, Rachel Reeves, as she faces pressure ahead of her autumn budget. Figures from the Office for National Statistics (ONS) showed public sector net borrowing – the difference between public spending and income – fell to £1.1bn, down by £2.3bn from the same month a year earlier. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Stella Creasy and Richard Tice call for scrutiny over which EU laws UK ditches", "url": "https://www.theguardian.com/politics/2025/aug/21/stella-creasy-richard-tice-eu-laws-committee-brexit-labour-reform", "id_key": "0b214693601394cace0f8deb02d1ed643353bdc86bc169e9c3b813d05d800c88", "summary": "Labour MP says she and Reform MP want a committee set up, after news of UK’s post-Brexit environmental rollbacks Stella Creasy and Richard Tice are pushing for Labour to allow a Brexit scrutiny committee to be formed in parliament, after the Guardian revealed environmental protections had been eroded since the UK left the EU. The Labour and Reform UK MPs argue that there is no scrutiny or accountability over how Brexit is being implemented. Creasy, the MP for Walthamstow and chair of the Labour Movement for Europe, said the UK needed a “salvage operation” to clear up the environmental and regulatory havoc caused by Brexit. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:01:29Z", "source": "CryptoNews", "title": "BNB Treasury Firm Windtree Plunges 77% as Nasdaq Moves to Delist Over Compliance Failure", "url": "https://cryptonews.com/news/windtree-plunges-77-as-nasdaq-moves-to-delist-biotech-over-compliance-failure/", "id_key": "38a115a224fb6da1a685efa95177c4f838db85cd4bbf0f353d3a5f7cc2f3fd79", "summary": "Windtree Therapeutics saw its shares collapse on Wednesday after Nasdaq said it would delist the biotech for failing to comply with listing standards. The post BNB Treasury Firm Windtree Plunges 77% as Nasdaq Moves to Delist Over Compliance Failure appeared first on Cryptonews .", "ingested_utc": "2025-08-21T07:01:29Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:01:30Z", "source": "CoinJournal", "title": "BNB price forecast: BNB sets a new ATH, targets $1k", "url": "https://coinjournal.net/news/bnb-price-forecast-bnb-sets-a-new-ath-targets-1k/", "id_key": "9a34269a1d5a09f84b6c98437709dcf1713fcce7be97c729c6b59e97dcc63dd1", "summary": "Key takeaways BNB surged by over 4% in the last 24 hours to hit a new all-time high of $882. Binance’s native coin could rally to the $1k psychological level in the medium term. Binance’s BNB hits a new all-time high The cryptocurrency market performed positively on Wednesday following two days of steady decline. Bitcoin […] The post BNB price forecast: BNB sets a new ATH, targets $1k appeared first on CoinJournal .", "ingested_utc": "2025-08-21T07:01:30Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:03:25Z", "source": "NYTimes_World", "title": "With Moves on West Bank and Gaza City, Israel Defies Global Outcry", "url": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-hamas-gaza-city.html", "id_key": "c6d54a7fae4faa7d7fb580e28736d69ebdf9ff960fe01e7abd0afd6a7fc01dfc", "summary": "Israel approved new settlements in the occupied West Bank, while its troops have reached the outskirts of Gaza City. The developments raise questions about the viability of a cease-fire proposal.", "ingested_utc": "2025-08-21T07:03:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:03:37Z", "source": "FT_Home", "title": "China turns against Nvidia’s AI chip after Lutnick’s ‘insulting’ remarks", "url": "https://www.ft.com/content/b8e30c54-b71c-4113-8b3e-8f54bc36587d", "id_key": "a146d78c8de494dde2a6587b16fa61c9f2eaf428c9cfe3a34f42bcb5c39981e0", "summary": "Comments by US commerce secretary trigger Chinese regulatory effort to stop tech groups buying H20 processors", "ingested_utc": "2025-08-21T07:03:37Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:14Z", "source": "FinancialPost_Business", "title": "Norway Economic Growth Tops Forecasts, Denting Rate Cut Bets", "url": "https://financialpost.com/pmn/business-pmn/norway-economy-grows-more-than-forecast-denting-rate-cut-bets", "id_key": "817ef76596a96f5e29fab281685adbee09fa1acce04fabbaee9ccec80101b9ab", "summary": "Norway’s economy surprised with faster-than-expected growth for a second quarter in a row, adding pressure on the nation’s central bank to reconsider its plans for more easing.", "ingested_utc": "2025-08-21T07:04:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:14Z", "source": "FinancialPost_Business", "title": "A Ukrainian startup develops long-range drones and missiles to take the battle to Russia", "url": "https://financialpost.com/pmn/this-ukrainian-startup-makes-drones-and-soon-cruise-missiles-to-strike-deep-inside-russia", "id_key": "3ff838a6c36e951c794bf0461e3e59acb77080fe8383693d1d58716dd0c53838", "summary": "When a Ukrainian-made drone attacked an ammunition depot in Russia last September, it showcased Kyiv’s determination to strike deep behind enemy lines and the prowess of its defense industry. The moment was especially gratifying for the woman in charge of manufacturing the drones that flew more than 1,000 kilometers (620 miles) to carry out this […]", "ingested_utc": "2025-08-21T07:04:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:21Z", "source": "Nikkei_Asia_Top", "title": "Taiwan to hike 2026 defense budget above 3% of GDP amid US pressure", "url": "https://asia.nikkei.com/politics/international-relations/taiwan-tensions/taiwan-to-hike-2026-defense-budget-above-3-of-gdp-amid-us-pressure", "id_key": "023e09bd7032a4212295b0b8a056b6d58534e68a0e717d66fc1ee12793377fbb", "summary": "", "ingested_utc": "2025-08-21T07:04:21Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:29Z", "source": "HackerNews_Top", "title": "Show HN: I replaced vector databases with Git for AI memory (PoC)", "url": "https://github.com/Growth-Kinetics/DiffMem", "id_key": "9225b6ebc272b92a7ef698145c5d98021c038230e6031e7c24e1cb421c4cbd7a", "summary": "Comments", "ingested_utc": "2025-08-21T07:04:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:36:13Z", "source": "BBC_World", "title": "Denmark ending letter deliveries is a sign of the digital times", "url": "https://www.bbc.com/news/articles/c3v37plv2edo?at_medium=RSS&at_campaign=rss", "id_key": "d1062e8c904b95c326643a74ac91e62c91fcd4698a622ecea740c16447e62280", "summary": "PostNord blames sharply falling demand - will other post firms around the world follow suit?", "ingested_utc": "2025-08-21T07:36:13Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:36:16Z", "source": "Guardian_World", "title": "Australia news live: Queensland court bans pro-Palestine bridge rally; Lehrmann’s lawyer argues Network Ten mischaracterised attack on Higgins as a violent assault", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "0099f1ceba1341583a852ff3f31e4d9c4aad821285b185db76ee938ce76d8488", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T07:36:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:36:16Z", "source": "Guardian_World", "title": "UK borrowed less than expected in July in lift for Rachel Reeves", "url": "https://www.theguardian.com/business/2025/aug/21/government-borrowed-less-than-expected-in-july-in-lift-for-rachel-reeves", "id_key": "6d1af35ed00c28a05172ef5105ed3f29162d87647844825c6a64563b96497151", "summary": "Public sector net borrowing falls to £1.1bn as chancellor explores tax-raising options in autumn budget Business live – latest updates The UK government borrowed less than expected in July, official figures show, in a boost to the chancellor, Rachel Reeves, as she faces pressure ahead of her autumn budget. Figures from the Office for National Statistics (ONS) showed public sector net borrowing – the difference between public spending and income – fell to £1.1bn, down by £2.3bn from the same month a year earlier. Continue reading...", "ingested_utc": "2025-08-21T07:36:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:36:16Z", "source": "Guardian_World", "title": "Frank Caprio, US judge who found fame online for his compassion, dies aged 88", "url": "https://www.theguardian.com/us-news/2025/aug/21/frank-caprio-us-judge-caught-in-providence-dies", "id_key": "33e679320724b5f38fb12444f7a5ba008cc36533bbb431feb2787365459e4ba7", "summary": "Host of TV show Caught in Providence billed his courtroom as a place ‘where people and cases are met with kindness’ Frank Caprio, a retired municipal judge in Rhode Island who found online fame for his compassionate nature as host of the reality courtroom series Caught in Providence, has died aged 88. Caprio’s official social media accounts said that he “passed away peacefully” after “a long and courageous battle with pancreatic cancer”. Continue reading...", "ingested_utc": "2025-08-21T07:36:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:36:39Z", "source": "CryptoNews", "title": "Singapore’s DBS Bank to Issue Tokenized Crypto Notes on Ethereum Blockchain", "url": "https://cryptonews.com/news/singapores-dbs-bank-to-issue-tokenized-crypto-notes-on-ethereum-blockchain/", "id_key": "11aa5af74d13a19094c3b840443349c217b7a2600f84665aa980bd2989a0b597", "summary": "DBS will initially rollout tokenized notes to eligible investors of digital platforms, including ADDX, DigiFT and HydraX. The post Singapore’s DBS Bank to Issue Tokenized Crypto Notes on Ethereum Blockchain appeared first on Cryptonews .", "ingested_utc": "2025-08-21T07:36:39Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:38:28Z", "source": "NYTimes_World", "title": "Soccer Match in Argentina Ends Early After Violence in Stands", "url": "https://www.nytimes.com/2025/08/21/world/americas/argentina-chile-soccer-violence.html", "id_key": "678d6be6717ee8a3a09e5d1829b5ac4374cbd1c6dfce12034642134bedfc3ae1", "summary": "Fans were hospitalized and detained after violent attacks during a match in a stadium near Buenos Aires, prompting officials to cancel the game.", "ingested_utc": "2025-08-21T07:38:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:38:40Z", "source": "FT_Markets", "title": "Tech stocks slip as investors rotate towards defensive sectors", "url": "https://www.ft.com/content/b6c96fc7-ab27-42f1-a8f3-aae7937dc939", "id_key": "d25f677cb1c26bc24bf50f1aa536314589b852afd64c05e7871e86a90eff5607", "summary": "Concerns about durability of AI rally dent sentiment for second day", "ingested_utc": "2025-08-21T07:38:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:39:06Z", "source": "AlJazeera_All", "title": "Armed men on motorbikes keep conflict in motion in the Sahel", "url": "https://www.aljazeera.com/features/2025/8/21/armed-men-on-motorbikes-keep-conflict-in-motion-in-the-sahel?traffic_source=rss", "id_key": "681d7842c1d2275a4bc32b4efb0ec151abc6e1788cf09b1243152292b987bf1a", "summary": "In Benin and across West Africa, riders viewed with suspicion as motorcycles now synonymous with armed fighters.", "ingested_utc": "2025-08-21T07:39:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:47:47Z", "source": "CryptoNews", "title": "Ancient Bitcoin Whale Swaps Over 400 BTC to ETH on Hyperliquid", "url": "https://cryptonews.com/news/ancient-bitcoin-whale-swaps-over-400-btc-to-eth-on-hyperliquid/", "id_key": "99bbb141b3017062efdf070dc8eda5a93911ce1d82e1e488b221bd3364ec48f1", "summary": "An early Bitcoin whale has resurfaced with major moves, shifting hundreds of millions in crypto between Bitcoin and Ethereum. The post Ancient Bitcoin Whale Swaps Over 400 BTC to ETH on Hyperliquid appeared first on Cryptonews .", "ingested_utc": "2025-08-21T07:47:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:54Z", "source": "BBC_World", "title": "'Nicest judge in the world' Frank Caprio dies aged 88", "url": "https://www.bbc.com/news/articles/c87ewp437e2o?at_medium=RSS&at_campaign=rss", "id_key": "95a032de01dbfcebe07d8ddc7f7e599cd62967f4ab67aff88cd3321eae43c549", "summary": "The US celebrity judge and social media star has been remembered for his \"unique brand of compassion\".", "ingested_utc": "2025-08-21T08:47:54Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:54Z", "source": "BBC_World", "title": "Fast-food giant Jollibee blames fraudsters for raffle row in Philippines", "url": "https://www.bbc.com/news/articles/c4gzdk25dr6o?at_medium=RSS&at_campaign=rss", "id_key": "2169ce590c0663554f0ad1597e32a70f24e6046805c7375fb67747a7997b756b", "summary": "The raffle winners have AI-sounding names like Hobby Dynamics and Noble Beer, social media users say.", "ingested_utc": "2025-08-21T08:47:54Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:56Z", "source": "BBC_Technology", "title": "Investigation into 'horrifying' death of French streamer", "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss", "id_key": "598f3943bf331cb119d67076977ffaf5b8ec8de124be98a266e2720f9e6e3f18", "summary": "Raphaël Graven, also known as Jean Pormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.", "ingested_utc": "2025-08-21T08:47:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:58Z", "source": "Guardian_World", "title": "Queensland court bans pro-Palestine bridge rally; Chalmers reveals list of 10 priorities from the economic roundtable – as it happened", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "b972478318f8ab329f911bdc4d19d52e2e01e68cde0b30a852fe53b94f25406e", "summary": "This blog has now closed Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T08:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:58Z", "source": "Guardian_World", "title": "US will only offer minimal security guarantees for Ukraine, says defence adviser – Ukraine war live", "url": "https://www.theguardian.com/world/live/2025/aug/21/us-minimal-security-guarantees-ukraine-russia-diplomacy-europe-latest-updates-news", "id_key": "5f3216b4f11c3fb8a63dc7dd3dbaea8f1e02518943f92605135ba583473bbe9a", "summary": "Elbridge Colby, US undersecretary of defence for policy, tells European allies that the bulk of responsibility will fall on Europe, say reports In further comments from Zelenskyy this morning, reported by Reuters, he said it was unclear what concessions regarding territory Moscow was willing to make to end the war. Trump has previously said Kyiv and Moscow will both need to cede land. Continue reading...", "ingested_utc": "2025-08-21T08:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:58Z", "source": "Guardian_World", "title": "Kemi Badenoch calls for Conservative councils to launch legal challenges over asylum hotels – UK politics live", "url": "https://www.theguardian.com/politics/live/2025/aug/21/kemi-badenoch-conservative-councils-legal-challenge-asylum-hotel-uk-politics-latest-updates-news", "id_key": "f1d6edd670e480762cbd3a6e738d5d816aa7c35816c3646aa40be1f70a93f532", "summary": "Conservative party leader writes letter ‘encouraging’ councils to ‘take the same steps’ as Epping ‘if your legal advice supports it’ A total of 32,059 asylum seekers were being housed temporarily in UK hotels at the end of Labour’s first year in government, up 8% on the same point 12 months ago, Home Office data released today shows. The UK government borrowed less than expected in July, official figures show, in a boost to the chancellor, Rachel Reeves , as she faces pressure ahead of her autumn budget. Continue reading...", "ingested_utc": "2025-08-21T08:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:58Z", "source": "Guardian_World", "title": "Why radical tax reform may be only way for Reeves to balance the books", "url": "https://www.theguardian.com/politics/2025/aug/21/radical-tax-reform-rachel-reeves-balance-books-growth-downgrades", "id_key": "2936643b2a0f61d3439f54387c9bbc273b89444a5bc404f992ae37d479bad5b7", "summary": "Size of the task remains unclear but the chancellor will have to act in the face of expected growth downgrades Despite a good month for the public finances , the Treasury won’t be putting in any champagne orders. Higher self-assessment tax receipts and an increase in national insurance payments by employers filled the government’s coffers by more than expected in July. The result was that Rachel Reeves’s spending deficit fell to £1.1bn, down by £2.3bn from the same month a year earlier. Continue reading...", "ingested_utc": "2025-08-21T08:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:47:58Z", "source": "Guardian_World", "title": "GCSE results: pupils in England bounce back from pandemic as top grades rise", "url": "https://www.theguardian.com/education/2025/aug/21/pupils-england-top-grades-gcse-results-rises", "id_key": "401325286cd7e9ef56316d76ce834e58040e75fb3137bf6f564055908ead0d1c", "summary": "Proportion awarded grades 7 or above is up on last year despite concerns over Covid era’s affect on cohort GCSE results – live Pupils in England who were thought to have been among the worst affected by Covid have bounced back in their GCSE results with more achieving top grades despite the disruption of the pandemic. There had been fears that this cohort, who were in the final year of primary when the pandemic hit in 2020, cancelling their key stage 2 tests and disrupting their transition to secondary school, would be severely impacted going forward in their education. Continue reading...", "ingested_utc": "2025-08-21T08:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:48:17Z", "source": "CryptoSlate", "title": "BlackRock’s Bitcoin and Ethereum ETFs leads market exodus of over $500 million", "url": "https://cryptoslate.com/insights/blackrocks-bitcoin-and-ethereum-etfs-leads-market-exodus-of-over-500-million/", "id_key": "c7961a5c83da540728d3072805645876d0a35ca0f088ac2578ceb9326f3c8425", "summary": "US spot Bitcoin and Ethereum exchange-traded funds (ETFs) posted another round of withdrawals on Aug. 20, extending their streak of consecutive net outflows to a fourth straight trading day. According to SoSoValue data, Spot Bitcoin ETFs recorded $311.57 million in outflows for the day, pushing their four-day total to nearly $1 billion. BlackRock’s iShares Bitcoin […] The post BlackRock’s Bitcoin and Ethereum ETFs leads market exodus of over $500 million appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T08:48:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:50:21Z", "source": "NYTimes_World", "title": "Zelensky, Back From Washington, Projects More Confidence in Peace Talks", "url": "https://www.nytimes.com/2025/08/21/world/europe/zelensky-ukraine-russia-trump-peace-talks.html", "id_key": "5e204e4a1de0af5160e80ad37c67fd9ecc75241f87f67379d64eeb350e2cd6e0", "summary": "The Ukrainian leader returned with a U.S. commitment to participate in security guarantees for Kyiv in a postwar settlement.", "ingested_utc": "2025-08-21T08:50:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:50:33Z", "source": "FT_Home", "title": "What are Reeves’ options for raising property taxes?", "url": "https://www.ft.com/content/7cc6840c-3233-4042-b5f4-0a711f0c8928", "id_key": "88e0519a1c26493959a1e32ae94d18625f1f3d8f01860dae454e0683b0bd679e", "summary": "UK chancellor examines case for ‘mansion tax’ that would be technically workable but politically combustible", "ingested_utc": "2025-08-21T08:50:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:50:33Z", "source": "FT_Home", "title": "UK asylum applications hit record of 111,000 in Starmer’s first year in office", "url": "https://www.ft.com/content/c10e76a3-4cf0-4e5a-bf2a-68becf0f8bd2", "id_key": "23d70e0ba373719880e66db4f804f8ca8f67f6f6f749a0e60e1fbb025d24b43a", "summary": "Figure reflects surge in small boat arrivals to the country", "ingested_utc": "2025-08-21T08:50:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:51:02Z", "source": "AlJazeera_All", "title": "North Korea’s Kim lauds ‘heroic’ troops deployed with Russia in Ukraine war", "url": "https://www.aljazeera.com/news/2025/8/21/north-korea-leader-kim-lauds-heroic-troops-deployed-with-russia?traffic_source=rss", "id_key": "8d67221484f8aa58cf37fafb17210f46fe95a9dede92145a48d3288d691494e8", "summary": "Kim Jong Un 'conveyed warm encouragement' to the officers and the soldiers serving in Russia's Kursk region.", "ingested_utc": "2025-08-21T08:51:02Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:51:09Z", "source": "FinancialPost_Business", "title": "China is expanding into digital currencies, hoping to promote use of its ‘people’s money’", "url": "https://financialpost.com/pmn/china-is-expanding-into-digital-currencies-hoping-to-promote-use-of-its-peoples-money", "id_key": "7de5bce0a9f3557850ae3dcfb5e6f0d3c6f4aca211f4fde9abaa754c78e8951a", "summary": "BANGKOK (AP) — China has been expanding use of digital currencies as it promotes wider use of its yuan, or renminbi, to reflect its status as the world’s second-largest economy and challenge the overwhelming sway of the U.S. dollar in international trade and finance. However, restrictions on access to Chinese financial markets and limits on […]", "ingested_utc": "2025-08-21T08:51:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T08:51:24Z", "source": "HackerNews_Top", "title": "Australia Post halts transit shipping to US as 'chaotic' tariff deadline looms", "url": "https://www.abc.net.au/news/2025-08-21/australia-post-suspends-transit-shipping-parcels-us-trump-tariff/105680456", "id_key": "3fcce4aa3b9a4d905cbff6962c512ecdbb959c9fcd4d89c6d086d775a9335dbe", "summary": "Comments", "ingested_utc": "2025-08-21T08:51:24Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "Uganda reaches agreement with US to take in some of its failed asylum seekers", "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers", "id_key": "e04a885da0b835ff524eb68953f8b08762620a644013658259806169b9ecdaf8", "summary": "African country’s foreign ministry says the two countries are working on the details of a deal over deportees Uganda has reached an agreement with the US to take in deportees from third countries who may not get asylum, but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry. Uganda won’t accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​ the foreign ministry’s permanent secretary said in a statement . He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "Appeal judges ‘struggle to understand’ case by Bruce Lehrmann’s lawyer over distinctions in rape", "url": "https://www.theguardian.com/australia-news/2025/aug/21/bruce-lehrmann-defamation-appeal-lawyer-ntwnfb", "id_key": "45b49efa017ab04c6a86a27f3d5cadfc743e777379f6e3cf198a06130bf381f1", "summary": "Zali Burrows told she has had ‘plenty’ of opportunity to consider issue in case despite repeated requests to adjourn early Appeal judges have “struggled to understand” the case made by Bruce Lehrmann’s lawyer, who says the federal court judgment that her client raped Brittany Higgins in Parliament House in 2019 found the action was a “soft rape” but was characterised in a Network Ten broadcast as a “violent” assault. Sydney criminal solicitor Zali Burrows – representing Lehrmann because, as the court heard Wednesday, he “couldn’t afford” his chosen barrister – submitted that her client was not given an opportunity to be questioned about the type of rape found by Justice Michael Lee. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "ACTU claims of agreement with tech firms over training AI dismissed by creative peak bodies", "url": "https://www.theguardian.com/australia-news/2025/aug/21/actu-claims-of-agreement-with-tech-firms-over-training-ai-dismissed-by-creative-peak-bodies", "id_key": "980446f70f7f1c44ea2af543fc36c57c1b3c3f478650a330207d1dd1ef45ac4b", "summary": "CEO of Australian Recording Industry Association says tech companies should simply comply with existing copyright law Get our breaking news email , free app or daily news podcast The Australian Council of Trade Unions claims that it has reached a “breakthrough” agreement with the tech sector on a model for payment for using creative content in training AI has triggered alarm among bodies representing creative professionals. Speaking on the sidelines of the economic reform roundtable , the secretary of the ACTU, Sally McManus, said “there was discussion with the Tech Council and ACTU about wanting to address the issue of paying creatives, journalists and academics for their data (and) their creative work that they do”. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "There’s an app for that: finding a sunny cafe in Paris, the city of light", "url": "https://www.theguardian.com/technology/2025/aug/21/sunniest-cafe-paris-app-jveuxdusoleil", "id_key": "afc2cf643a569210a31cd8a143540a4885e8a451cea4889e256dae0c3689bfa3", "summary": "Jveuxdusoleil (I want sun) taps into a key part of Parisian culture: drinks on the terrasse, as many fear the extinction of the bistrot In August, Paris is uncharacteristically quiet as hordes of residents scatter to the country’s beaches and coasts for a yearly month of vacation. Businesses close and the city nearly grinds to a halt. Among those who remain, there is an eternal, quintessentially Parisian quest: hunting for a balmy terrasse bathed in sunlight for an evening apéritif. Finding the perfect seat on the pavement outside a cafe may be a matter of a chance stroll or a timely text from a friend. This summer, though, a digital solution has gained popularity in an extremely French instance of the old Apple slogan “there’s an app for that”: Jveuxdusoleil, an app that tracks the sun’s movement through the city’s maze of buildings to pinpoint exactly where you can claim a sunny spot on a terrace for your coffee. It arrives at a precarious moment for this particularly Parisian pursuit. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "Number of asylum seekers housed in UK hotels up 8% on 12 months ago – UK politics live", "url": "https://www.theguardian.com/politics/live/2025/aug/21/kemi-badenoch-conservative-councils-legal-challenge-asylum-hotel-uk-politics-latest-updates-news", "id_key": "322ec890ca14c039e7e41981f5d7a4ec4d213119f264845bb4130e9c613d6e37", "summary": "A total of 32,059 people were being housed temporarily in UK hotels at the end of Labour’s first year in government, Home Office data shows Despite a good month for the public finances , the Treasury won’t be putting in any champagne orders, writes the Guardian’s senior economics writer, Phillip Inman . You can read his analysis, on why radical tax reform may be only way for chancellor Rachel Reeves to balance the books, at the link below: Everyone deserves dignity and security in retirement, but too many retired women have been left without enough to get by. We must make sure that these inequalities are addressed for future generations. That’s why reviving the pensions commission – bringing together unions, employers and independent experts – is a vital step forward. We’re determined to close the gender pensions gap, and the new state pension has already reduced historic inequalities faced by women and low earners. Alongside this, the pensions commission will tackle barriers to close the gender pensions gap in private pensions to ensure women have the dignity and security they deserve in retirement. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "WH Smith cuts profit forecasts after £30m accounting error", "url": "https://www.theguardian.com/business/2025/aug/21/wh-smith-cuts-profit-forecasts-after-30m-accounting-error", "id_key": "d241a479298b65bb616a0ad00fa9c676fa251d9249b2e20bb4c7d42b70290a7c", "summary": "Retailer launches independent review after mistake relating to North American arm was discovered WH Smith shares have plunged as it cut financial forecasts and launched an independent review after discovering an accounting blunder that led it to overstate profits by £30m. Investors wiped nearly £500m off the retailer’s market value on Thursday morning as it reported the multimillion-pound accounting error, sending the stock price down as much as 36% to £7.06 a share. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:45Z", "source": "CryptoNews", "title": "[LIVE] DOGE Price Tracker: Latest Dogecoin News and Price Updates for August 21, 2025", "url": "https://cryptonews.com/news/live-doge-price-tracker-latest-dogecoin-news-and-price-updates-for-august-21-2025/", "id_key": "279e549c43c702c3ef219baeb34c502ca1f5a96ff3658572743be371d742b18d", "summary": "Dogecoin (DOGE) is staging a notable rebound on August 21, 2025, following a sharp intraday low of $0.21. In the 24 hours through 04:00 UTC, DOGE surged approximately 5%, settling around $0.22. This recovery was fueled in part by significant whale activity—on‑chain data reveals that around 680 million DOGE were accumulated throughout August, underscoring growing […] The post [LIVE] DOGE Price Tracker: Latest Dogecoin News and Price Updates for August 21, 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-21T09:38:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:36Z", "source": "NYTimes_Business", "title": "Behind Powell’s Big Gamble in Final Jackson Hole Speech", "url": "https://www.nytimes.com/2025/08/21/business/jerome-powell-fed-jackson-hole.html", "id_key": "bd6ef244368932b86a4b8aaed61ed48fba3657819818efb5e059ed41eb01ac3e", "summary": "Jerome Powell, the Federal Reserve chair, is managing a high-stakes balancing act as he grapples with a cooling labor market, rising inflation and White House pressure to cut interest rates.", "ingested_utc": "2025-08-21T09:40:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:36Z", "source": "NYTimes_World", "title": "Brazil-U. S. Talks on Mining Rare Earth Minerals Are Complicated by Trump’s Tariffs", "url": "https://www.nytimes.com/2025/08/21/world/americas/brazil-us-rare-earth-minerals-tariffs.html", "id_key": "aaf25fba3bc8c1878704c75fa73e886965c25e2652181f88230f0f4101535f14", "summary": "Tensions between President Trump and Brazil’s leader could derail a promising alliance to unlock the world’s second largest reserve of the minerals.", "ingested_utc": "2025-08-21T09:40:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:36Z", "source": "NYTimes_World", "title": "Ukraine Works to Identify 6,000 Bodies Sent From Russia in Makeshift Rail Platform Lab", "url": "https://www.nytimes.com/2025/08/21/world/europe/ukraine-russia-war-exchange-soldier-bodies.html", "id_key": "355663864ff635cf6d2f7ac13a9e7e5f9eabf3dadbd25a048e4dd77b58a089b2", "summary": "The mass return of fallen soldiers is one of the few concrete results of U.S.-orchestrated truce negotiations.", "ingested_utc": "2025-08-21T09:40:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:44Z", "source": "NPR_Top", "title": "Try this when your doctor says 'yes' to a preventive test but insurance says 'no'", "url": "https://www.npr.org/2025/08/21/nx-s1-5501533/preventive-care-health-insurance-denial-appeal", "id_key": "40239831cc067ed0064df142c2fe0ed20c32069689a33cd368b7c80ba7a6588b", "summary": "Health insurance wouldn't cover one child's hearing tests. Reporters with Health Care Helpline investigated and share this advice for what to do if preventive care gets denied.", "ingested_utc": "2025-08-21T09:40:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:44Z", "source": "NPR_Top", "title": "A 'black moon' will appear in the sky this weekend, but you won't see it. Here's why", "url": "https://www.npr.org/2025/08/21/nx-s1-5505395/black-new-moon-explainer", "id_key": "c2860026045e3f5be980d35bd007d336964913ce57b89d9b10a8d901bd93176c", "summary": "A black moon is a type of new moon, when the moon is nearly between Earth and the sun.", "ingested_utc": "2025-08-21T09:40:44Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:44Z", "source": "NPR_Business", "title": "Trump calls for resignation of Fed governor in latest line of attack", "url": "https://www.npr.org/2025/08/20/nx-s1-5508276/trump-calls-for-resignation-of-fed-governor-in-latest-line-of-attack", "id_key": "e6e69078997da8aae42fe52d58670f2052cbe66544c34e37856c23b59dddbd79", "summary": "President Trump is calling for the resignation of Federal Reserve governor Lisa Cook after a Trump ally accused her of making false statements on mortgage applications.", "ingested_utc": "2025-08-21T09:40:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:45Z", "source": "NPR_World", "title": "Morning news brief", "url": "https://www.npr.org/2025/08/21/nx-s1-5505973/morning-news-brief", "id_key": "84e81c2422c587e109b60dae079509218f6759786fcc97a3214ea9362a4a1add", "summary": "Israeli military to call up 60,000 reservists as it plans to seize Gaza City, Pentagon officials meet with European counterparts over Ukraine security guarantees, Hurricane Erin lashes North Carolina.", "ingested_utc": "2025-08-21T09:40:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:47Z", "source": "FT_Home", "title": "Ukrainian attacks disrupt Russian petrol supplies and push up prices", "url": "https://www.ft.com/content/1a22515d-f0e2-4f11-8e1f-6d7b9d30ef13", "id_key": "f556655d9a298bdcc84f7537899f2cf08a067fdd0fc25634eabd915096b560fd", "summary": "Moscow has banned exports following drone strikes on oil refineries", "ingested_utc": "2025-08-21T09:40:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:48Z", "source": "FT_Markets", "title": "Tech stocks slip as investors rotate towards defensive sectors", "url": "https://www.ft.com/content/b6c96fc7-ab27-42f1-a8f3-aae7937dc939", "id_key": "4338717d3aedbed7f49ef65aabeb83e90d937d94c7e5d818fe1f7c8818894bd6", "summary": "Concerns about durability of AI rally dent sentiment for second day", "ingested_utc": "2025-08-21T09:40:48Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:07Z", "source": "Engadget_All", "title": "The best MacBook for 2025: Which Apple laptop should you buy?", "url": "https://www.engadget.com/computing/laptops/best-macbook-140032524.html?src=rss", "id_key": "de87071369f2f55938ab780b7a5cc0950c3c5353808433025d34b18f8202efd5", "summary": "Apple’s next big to-do for 2025 will be the upcoming iPhone 17 event , which will likely happen some time in September. Historically, the company uses those events to announce new iPhones, AirPods and Apple Watches — MacBooks tend to get their own, separate shindig (though we do expect the new macOS 26 software to come out around that time). For now, the most recent MacBooks are the M4 MacBook Air and the M4 MacBook Pro. Deciding between just two models may seem easy, but there are still plenty of variables to consider before you add one to your cart — screen size, chip capabilities, price and memory configurations will all come into play. We’ve reviewed every MacBook model to come out in the last 17 years or so , so we compiled this guide to help you pick the best MacBook for you. Table of contents Best MacBooks for 2025 What about budget MacBooks? Factors to consider when buying a MacBook MacBooks specs comparison chart Best MacBook FAQs Best MacBooks for 2025 What about budget MacBooks? Historically, Apple kept the previous year’s MacBook Air in its lineup as a sort of budget option. But the company took a different approach with the release of the M4 MacBook Air. Instead of continuing to sell the older model, Apple discontinued the M3 Air and gave its newest computer a $100 price cut. Now, if you can even find a brand new M3 MacBook Air (typically from retailers like Amazon or B&H), it’s often more expensive than the M4 version. During sales like Amazon Prime Day, we’ve seen the newest M4 Air go for as little as $799. That effectively makes our overall pick a budget pick as well. Of course, $800 isn’t exactly a small investment either for college students or others on a budget. Especially when you can find some decent PCs for under $500 . If you’re looking to save even more on a MacBook, we recommend checking out refurbished options directly from Apple , or even third party sellers like BackMarket. There are a few guidelines to keep in mind, which we go over in our refurbished guide , but mainly, you’ll want to shop from a reputable source that has a stated process and offers at least a year-long warranty. Using your old gear as a trade-in will bring down your final cost as well. Factors to consider when buying a MacBook Compared to PCs, Apple computers tend to have more streamlined specifications. The company has long been known for this simplicity, and the M-series “system-on-a-chip” condenses things even further. Prior to the M1 chip, Apple used Intel chips in its laptop and desktop computers. The M2 and M3 generations followed that first chip and currently sells MacBooks equipped with M4-series chips. You’ll find the standard M4 processor in the Air and the base-model Pro and the upgraded M4 Max and M4 Pro chips as options for the MacBook Pro (currently there is no M4 Ultra chip, as there was with the M3 series in the Mac Studio). All M-series chips combine, among other technologies, the CPU, graphics card and unified memory (RAM). Apple’s Neural Engine is included too, which is a specialized group of processor cores that handles machine learning tasks such as image analysis and voice recognition. While a unified chip means you have fewer decisions to make when picking a MacBook, there are still a few factors to consider, including specs like the number of CPU cores, amount of RAM, storage capacity, screen size, and, obviously, price. The finish color may be a minor consideration, but it's worth pointing out that the Pro comes in just two colors (Silver or Space Black) but the Air comes in four hues (Midnight, Starlight, Sky Blue and Silver). CPU cores The lowest-specced chip in a current-lineup MacBook is the standard M4 chip, which is found in all models of the MacBook Air and the base model MacBook Pro 14-inch. That chip houses a 10-core CPU and either an 8- or 10-core GPU. In total, there are three versions of the M4 chip: standard M4, M4 Pro and M4 Max (which are each a step up from their predecessors, the M3, M3 Pro and M3 Max chips). The burliest chip, the M4 Max is built with either a 14- or 16-core CPU and a 32- or 40-core GPU. Cores are, in essence, smaller processing units that can handle different tasks simultaneously. Having more of them translates to the computer being able to run multiple programs and applications at once, while also smoothly processing demanding tasks like video and photo editing and high-level gaming. In short, more cores allow for more advanced computing and better performance. But if your processing power needs fall below professional-level gaming and cinematic video and audio editing, getting the highest number of cores is likely overkill — and after all, more cores equals higher cost and more power usage. Photo by Devindra Hardawar/Engadget RAM Your options for RAM, or in Apple’s terminology, unified memory, varies, but with the switch to the M4 chip in all laptops, the lowest amount of RAM you can get is now 16GB. That’s a necessary spec-bump to accommodate the tech world’s favorite feature of the moment: AI or, in this case, Apple Intelligence (still AI, but Cupertino’s version). The M4 Pro chip has 24 or 48GB memory options, while the M4 Max chip supports 48, 64 or a whopping 128GB of RAM. You’ve likely heard the analogy comparing memory to the amount of workspace available on a literal desktop surface, whereas storage is the amount of drawers you have to store projects to work on later. The larger the worktop surface, the more projects you can work on at once. The bigger the drawers, the more you can save for later. In addition to supporting Apple Intelligence, more RAM is ideal for people who plan to work in multiple apps at once. And the more demanding each program is, the more RAM will be required. Extra memory can also come in handy if you’re the type who likes to have infinite numbers of tabs open on your browser. If your daily workflow doesn’t involve simultaneously using a vast number of memory-intensive programs, you can save yourself money and buy the RAM configuration that you’re most likely to actually use. For a long time, Apple continued to offer MacBooks with just 8GB of RAM, and we recommended upgrading to at least 16GB of RAM. With this being the standard today, grabbing a base model should be fine for most non-pro-level users. One thing to note is that, unlike most PCs, the RAM in a MacBook is not user-upgradable since it’s tied into the system-on-a-chip. If you think you might end up needing more memory, you should go for the spec upgrade up front. Storage capacity (SSD) Storage options range from 256GB of SSD for the base-model MacBook Air and 8TB of storage for the MacBook Pros with the M4 Max chip. If you want to rotate between a long roster of game titles or keep lots of high-res videos on hand, you’ll want more storage. If you’re mostly working with browser- and cloud-based applications, you can get away with a smaller-capacity configuration. That said, we recommend springing for 512GB of storage or more, if it’s within your budget. You’ll quickly feel the limits of a 256GB machine as it ages since the operating system alone takes up a good portion of that space. Having 1TB will feel even roomier and allow for more data storage over the life of your laptop. When Apple announced the iPhone 15 , the company also announced new iCloud+ storage storage plans , with subscriptions that allow up to 12TB of storage shared among your iOS and MacOS devices. You could also transfer files to an external storage device. But if you don’t want to pay for a monthly subscription and prefer the convenience of having immediate access to your files, it’s best to get the highest amount of storage space your budget allows for at the outset. Screen size The MacBook Air comes in 13- or 15-inch sizes. Pro models have either 14- or 16-inch screens. A two-inch delta may not seem like much but, as Engadget’s Nathan Ingraham noted when he reviewed the then-new 15-inch M2-powered MacBook Air, a larger screen \"makes a surprising difference.” That’s especially true if you plan to use your laptop as an all-day productivity machine and won’t be using an external monitor. More space means you can more clearly view side-by-side windows and have a more immersive experience when watching shows or gaming. But screen size is one of the main factors influencing weight. The 13-inch MacBook Air M4 weighs 2.7 pounds, whereas the top-end 16-inch MacBook Pro with the Max chip weighs 4.7 pounds. If you plan to travel a lot or swap your work locations regularly, a smaller screen will make life easier in the long run. All MacBooks feature IPS LCD panels ( in-plane switching , liquid crystal display), which Apple markets as Retina displays. The MacBook Air M4 has a Liquid Retina display and the Pro models have Liquid Retina XDR displays. “Liquid” refers to the way the lighted portion of the display “flows” within the contours of the screen, filling the rounded corners and curving around the camera notch. “XDR” is what Apple calls HDR (high dynamic range). You also get the option of a standard or nano-texture display on the MacBook Pro. The glass, which reduces glare and is also available on the Studio Display, iMac and iPad Pro, comes with a $150 price increase, but if you really don’t like reflections on your screen, it could be worth it. Compared to most other laptops, MacBook displays are notably bright, sharp and lush. But one feature worth pointing out is another Apple marketing term: ProMotion. It’s the company’s term to describe a screen with a higher, 120Hz refresh rate, which results in smoother scrolling and more fluid-looking graphics. Only MacBook Pros offer ProMotion; the Air maxes out at 60Hz, which is perfectly fine for everyday browsing and typical workdays. But if you want buttery-smooth motion from your display, you’ll have to shell out more money for an upgrade. Operating systems Software considerations won’t make much of a difference when deciding between MacBook models — all come with macOS installed. But if you’re switching from, say, a Windows PC, the operating system may be something to factor into your decision — though it’s probably less of an issue than it once was. Now that so much of the work we do on our computers is browser- and cloud-based, the learning curve between the two platforms isn’t as steep. Apps and programs like Gmail perform similarly regardless of what computer you’re using. Apple machines have historically had more limited support of AAA gaming titles, but even that is changing with more AAA games and better graphics coming to Macs. As for macOS, it’s getting better too. With macOS Tahoe 26 , the Spotlight function is more advanced, making it easier to find apps and perform tasks straight from your keyboard. The software also implements Apple's unifying Liquid Glass design for a modern look that looks consistent across iOS and iPad devices. New enhanced iPhone continuity features also make MacBooks and the handset work better together. A revamped Shortcuts app is more powerful as well, giving users custom automations that leverage Apple Intelligence (the company’s own AI). Price When Apple announced the MacBook Air M4, it also delivered a bit of refreshing news: The latest model now starts $100 cheaper than the previous generation. So now, the least expensive MacBook is the 13-inch, M4-powered Air with 16GB of RAM and 256GB of storage for $999. Alternatively, you can spend up to $7,349 for the 16-inch MacBook Pro M4 Max with the nano-texture glass, 128GB of RAM and 8TB of storage. Chip type, screen size, memory and storage capacity all influence the final price, which is why guides like this can help you determine just what you need (and what you don’t) so you can get the most cost-effective machine for you. AppleCare is another cost to consider. The extended warranty plan from Apple covers repairs from accidents and offers free battery replacement and starts at $3.50 per month or $35 per year for MacBooks. We recommend the MacBook Air M4 for most people, and thanks to that $100 price cut, it’s also a good budget option. If you want something even cheaper, we recommend looking at refurbished M-series models from Apple. We think the 14- or 16-inch MacBook Pros are best for professionals. If you have extra money to spare once you’ve picked your machine, we recommend upgrading to at least 512GB of storage to make your machine as future-proof as possible. Of course, if you're just after the M4 chip and want the cheapest route to get it, you might consider the M4 Mac mini , which starts at $599 (though you'll have to supply the screen, mouse and keyboard). Best MacBooks spec comparison chart Product Superlative Tested configuration Tested battery life Rated battery life Apple MacBook Air M4 (13-inch) Best MacBook overall Apple M4, 16GB RAM, 256GB SSD 18.25 hours Up to 18 hours Apple MacBook Pro M4 (14-inch) Best MacBook for creatives Apple M4, 16GB RAM, 512GB SSD 34.25 hours Up to 22 hours Best MacBook FAQs What's the difference between MacBook Air and Pro? Both the MacBook Air and Pro models come with the M4 chip. MBP models have the option of more powerful M4 Pro or M4 Max chips. The Pro has a higher resolution screen with a higher peak brightness that supports up to 120Hz adaptive refresh rates and XDR (extreme dynamic range). The battery life on most Pro models is longer than on the Air models as well. Pro models also have more ports and more speakers. In short, the MacBook Air is aimed at everyday users looking for good productivity and entertainment capabilities, while Pro models are aimed at professionals who need a high-performance computer. What's the difference between macOS and Windows? MacOS is the operating system developed by Apple and used in all of its desktop and laptop computers. It can only be found in hardware made by Apple including MacBooks and iMacs. Microsoft’s Windows operating system can be found in the company’s own Surface laptops as well as computers made by a wide array of manufacturers, like Acer, Asus, Dell and Razer. This article originally appeared on Engadget at https://www.engadget.com/computing/laptops/best-macbook-140032524.html?src=rss", "ingested_utc": "2025-08-21T09:41:07Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:16Z", "source": "AlJazeera_All", "title": "ICE agents use pepper spray while detaining protester in San Francisco", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/21/ice-agents-use-pepper-spray-while-detaining-protester-in-san-francisco?traffic_source=rss", "id_key": "15174153a88d70ba6ff3696095bbe05f6fb8b38661da7b0cef1f52a6af8470cd", "summary": "Federal immigration agents have been filmed using pepper spray and zip ties against a protester in San Francisco.", "ingested_utc": "2025-08-21T09:41:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:16Z", "source": "AlJazeera_All", "title": "Match abandoned in Argentina with 10 hurt, 90 arrested as violence erupts", "url": "https://www.aljazeera.com/sports/2025/8/21/match-abandoned-in-argentina-with-ten-hurt-90-arrested-as-violence-erupts?traffic_source=rss", "id_key": "1992232f120f2d5490a89b46ff935838d9beaf4d87d55d1f8047b84e683a82b2", "summary": "The match in Buenos Aires between Independiente and visiting Universidad de Chile was abandoned in the second half.", "ingested_utc": "2025-08-21T09:41:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:22Z", "source": "FinancialPost_Business", "title": "DSR Bank Development Group Welcomes Søren Elbech and Matthew Westerman to Its Board", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/dsr-bank-development-group-welcomes-soren-elbech-and-matthew-westerman-to-its-board", "id_key": "d99e1fa31c36e9d2ca9d2dac80f19b697d5d9ef88241af431a14175d7fdd8229", "summary": "LONDON — The Defence, Security and Resilience Bank (DSRB) Development Group today announced the appointment of Søren Elbech and Matthew Westerman to its Board, strengthening the institution’s financial and capital markets leadership as it advances toward formal establishment. Søren Elbech brings unique multilateral banking expertise to the DSRB Board. Since September 2023, Elbech serves as […]", "ingested_utc": "2025-08-21T09:41:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:22Z", "source": "FinancialPost_Business", "title": "Nexstar Media Group buying Tegna in deal worth $6.2 billion", "url": "https://financialpost.com/pmn/nexstar-media-group-buying-tegna-in-deal-worth-6-2-billion", "id_key": "d85746149473c4e9b2f0052c24c62f880df551ac75d56df193eec8f86c974a1e", "summary": "NEW YORK (AP) — Nexstar Media Group is buying broadcast rival Tegna for $6.2 billion, bringing together two major players in U.S. television and the country’s local news landscape. If the transaction is approved, Nexstar will pay $22 in cash for each share of Tegna’s outstanding stock. And the regulatory greenlight could be likely under […]", "ingested_utc": "2025-08-21T09:41:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:22Z", "source": "FinancialPost_Business", "title": "Precore Gold Announces up to C$2 Million Private Placement", "url": "https://financialpost.com/globe-newswire/precore-gold-announces-up-to-c2-million-private-placement", "id_key": "d58f3b8001eca53c19a7ff032c3ab48737f15e03e95b14a0eb3e94ee7e6fa449", "summary": "VANCOUVER, British Columbia, Aug. 21, 2025 (GLOBE NEWSWIRE) — Precore Gold Corp. (CSE: PRCG) (the “Company” or “Precore Gold”) is pleased to announce that it has arranged, subject to receipt of regulatory approval, a non-brokered private placement (the “Private Placement”) to raise gross proceeds of up to $2,000,000. The Private Placement will consist of the […]", "ingested_utc": "2025-08-21T09:41:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:37Z", "source": "MIT_TechReview", "title": "On the ground in Ukraine’s largest Starlink repair shop", "url": "https://www.technologyreview.com/2025/08/21/1122035/ukraines-largest-starlink-repair-shop/", "id_key": "d4e33ebaee2120bf7eeaff212d633da6e72326343b54f5667247e2ac013fde59", "summary": "Oleh Kovalskyy thinks that Starlink terminals are built as if someone assembled them with their feet. Or perhaps with their hands behind their back. To demonstrate this last image, Kovalskyy—a large, 47-year-old Ukrainian, clad in sweatpants and with tattoos stretching from his wrists up to his neck—leans over to wiggle his fingers in the air…", "ingested_utc": "2025-08-21T09:41:37Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:37Z", "source": "HackerNews_Top", "title": "Basic dependency injection in OCaml with objects", "url": "https://gr-im.github.io/a/dependency-injection.html", "id_key": "12e30e9e18e7c0c1f9bd437c2a01efe22891015f7b5f0a81374683c2a0df54e1", "summary": "Comments", "ingested_utc": "2025-08-21T09:41:37Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:49:49Z", "source": "Guardian_World", "title": "WH Smith shares crash after retailer’s £30m accounting error", "url": "https://www.theguardian.com/business/2025/aug/21/wh-smith-cuts-profit-forecasts-after-30m-accounting-error", "id_key": "9cd841dacd5fb8ca27d7f363c6043ea048821c2f2a1797b4acbfc742fc364885", "summary": "Group cuts profit forecasts and launches review after mistake relating to North American arm Business live – latest updates WH Smith shares have plunged as it cut financial forecasts and launched an independent review after discovering an accounting blunder that led it to overstate profits by £30m. Investors wiped nearly £500m off the retailer’s market value on Thursday morning as it reported the multimillion-pound accounting error, sending the stock price down as much as 36% to £7.06 a share. Continue reading...", "ingested_utc": "2025-08-21T09:49:49Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:50:13Z", "source": "CryptoNews", "title": "Asian Family Offices Pour $100M Into Crypto as Demand Surges", "url": "https://cryptonews.com/news/asian-family-offices-pour-100m-into-crypto-as-demand-surges/", "id_key": "0c46403a85e30d031987924e7d563c1513353b61eecfef507c62f70d91cdf3f0", "summary": "Wealthy Asian families and their investment arms are rapidly increasing their exposure to cryptocurrencies, driven by strong market returns. The post Asian Family Offices Pour $100M Into Crypto as Demand Surges appeared first on Cryptonews .", "ingested_utc": "2025-08-21T09:50:13Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:52:41Z", "source": "TheStreet_Top", "title": "Walmart is selling a 'classic' $320 wooden storage cabinet for only $138 that's 'sturdy and attractive'", "url": "https://www.thestreet.com/deals/sauder-two-door-storage-cabinet-walmart-sale", "id_key": "03a0b5ee007002277e9d403d6287219d68c3a310dedb6990f0f88b79e03f43fe", "summary": "Reviewers say assembly is a breeze: \"If you can put Legos together, you can do this.\"", "ingested_utc": "2025-08-21T09:52:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:52:49Z", "source": "FinancialPost_Business", "title": "Sinopec Reports Slump in First-Half Profit on Lower Oil Prices", "url": "https://financialpost.com/pmn/business-pmn/sinopec-reports-slump-in-first-half-profit-on-lower-oil-prices", "id_key": "58d6449776144814258dbb3d38d8960bce06027c4d35479d90d2ac4dd9779a88", "summary": "Sinopec posted a slump in first-half profit as declining oil prices, lower output of some products, and weaker margins combined to hurt China’s biggest refiner.", "ingested_utc": "2025-08-21T09:52:49Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:15Z", "source": "BBC_World", "title": "Ghanaian music star Shatta Wale detained over Lamborghini purchase", "url": "https://www.bbc.com/news/articles/cq68j92yjd9o?at_medium=RSS&at_campaign=rss", "id_key": "ebe189be1fbf3f81fd5fc056c9a97e20156e839431c62ee0fe1e2103c7f3e2d9", "summary": "US authorities have linked Wale's car to an alleged criminal enterprise operating stateside.", "ingested_utc": "2025-08-21T10:42:15Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:16Z", "source": "BBC_Business", "title": "Tesco meal deal price rises 25p to £3.85", "url": "https://www.bbc.com/news/articles/clyr7renp51o?at_medium=RSS&at_campaign=rss", "id_key": "4786866d200a89a2ace4c49330fd716bcb7f8f01d549a122939f9e6c714acb79", "summary": "The supermarket said its meal deal \"remains great value\" despite the 25p increase.", "ingested_utc": "2025-08-21T10:42:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:19Z", "source": "Guardian_World", "title": "Zelenskyy says he wants to see an agreement on security guarantees before meeting Vladimir Putin – Ukraine war live", "url": "https://www.theguardian.com/world/live/2025/aug/21/us-minimal-security-guarantees-ukraine-russia-diplomacy-europe-latest-updates-news", "id_key": "a12646ea3f985288922fc3ba1d34184a4289df482611c8d58516753534dfe774", "summary": "Amid US offering minimal security a group of allies led by Britain and France are putting together a military coalition Zelenskyy also told reporters that he would want to see an agreement on security guarantees for Ukraine before meeting Russia’s Vladimir Putin , AFP said. He warned that in the meantime both sides were preparing for further fighting , with Russia building up troops on the southern frontline and Ukraine test launching a new long-range cruise missile. Continue reading...", "ingested_utc": "2025-08-21T10:42:19Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:19Z", "source": "Guardian_World", "title": "‘Proxy war’ – Turkish TikTok makeup row exposes tensions with German diaspora", "url": "https://www.theguardian.com/world/2025/aug/21/proxy-war-turkish-tiktok-makeup-row-exposes-tensions-with-german-diaspora", "id_key": "f9607712e198ac60ee875d7653293b24f567ef4553bc80706ddfcfbd2ee618f6", "summary": "When an influencer mocked the makeup of Turkish German women, the ensuing debate reopened old wounds It all began when Meri, a TikTok influencer from Turkey, mocked the makeup of Turkish women living in Germany. They were, she claimed, instantly recognisable by their bronzer, thick blush, false eyelashes and plumped lips. And the look favoured by the diaspora, she added, waspishly, had “nothing to do with how real Turkish women look”. Reaction from the diaspora was swift and stinging. “You’re just jealous because we live in Germany,” one said. “If we stop coming (to Turkey from Germany), your economy will collapse.” Soon a full-blown social media feud had erupted, with insults and mutual mockery flowing. And, although it started with makeup, the row has gone far deeper, exposing old and bitter rifts over gender, class, politics, nationalism and economic power. Continue reading...", "ingested_utc": "2025-08-21T10:42:19Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:19Z", "source": "Guardian_World", "title": "Israel keeps up military pressure on Gaza City ahead of planned offensive – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/21/israel-gaza-city-middle-east-palestinians-latest-live-news-updates", "id_key": "984901f1f58c63a5cbef627e25fbb744516fa6400d0cb8e420ab0d3685322c04", "summary": "Hamas says Israel’s plans to attack Gaza City show ‘blatant disregard’ for efforts to broker a ceasefire and hostage deal Iran was seeking to reassert an image of strength on Thursday after suffering heavy losses, when Israel largely destroyed Iran’s air defences during the war and much of its stockpile of ballistic weapons is believed to have been damaged by Israeli strikes. The Iranian Defence Ministry said in a statement on Thursday: “Any new adventure by the enemy will be faced with a strong slap.” Continue reading...", "ingested_utc": "2025-08-21T10:42:19Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:19Z", "source": "Guardian_World", "title": "US woman jailed for 30 years for attempted murder of Birmingham man", "url": "https://www.theguardian.com/uk-news/2025/aug/21/us-woman-jailed-for-30-years-for-attempted-of-birmingham-man", "id_key": "01832a68f49d1c53fb2dc651e9e5798b312f7e95746b60bfbad5a6d121be8a55", "summary": "Aimee Betro, 45, was found guilty of conspiracy to murder earlier this month after a two-week trial An American “hitwoman” who attempted to murder a Birmingham business owner before going on the run in Armenia has been jailed for 30 years at Birmingham crown court. Earlier this month, Aimee Betro, 45, from Wisconsin was found guilty of conspiracy to murder , possession of a firearm with intent to cause fear of violence, and an offence relating to the importation of ammunition into the UK, after a two-week trial. Continue reading...", "ingested_utc": "2025-08-21T10:42:19Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:19Z", "source": "Guardian_World", "title": "Texas house passes redrawn electoral map aiming to help Republicans keep majority in 2026 midterms – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/21/texas-house-redrawn-electoral-map-republicans-us-politics-latest-updates-news", "id_key": "c7475e97aeb48398ad3888149e93e2a98a6aa078c88ef63b5afc13ee66bc78c7", "summary": "Lower chamber passed vote following two-week delay after Democratic lawmakers walked out in attempt to stop plan to define five new Republican-friendly districts Barack Obama waded into states’ efforts at rare mid-decade redistricting efforts, saying he agreed with California governor Gavin Newsom ’s plan to counter the new Texas congressional map by launching an effort to redraw his own state’s map and create more Democratic-friendly districts , calling it “a responsible approach”. “I believe that governor Newsom’s approach is a responsible approach. He said this is going to be responsible. We’re not going to try to completely maximize it,” Obama said at a Tuesday fundraiser on Martha’s Vineyard in Massachusetts. “We’re only going to do it if and when Texas and/or other Republican states begin to pull these maneuvers. Otherwise, this doesn’t go into effect.” Continue reading...", "ingested_utc": "2025-08-21T10:42:19Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:40Z", "source": "CryptoSlate", "title": "Bearish wave hits crypto as Bitcoin and Ethereum faced sharp declines over past week", "url": "https://cryptoslate.com/bearish-wave-hits-crypto-as-bitcoin-and-ethereum-faced-sharp-declines-over-past-week/", "id_key": "f7b90e241acc063d70fb0f733384608939068f3ea56a444d080623b488ac586b", "summary": "Crypto traders are turning bearish after Bitcoin and Ethereum struggled to maintain recent gains, according to several on-chain metrics. According to CryptoSlate data, Bitcoin has fallen nearly 7% over the past week, trading at $113,479 as of press time. Ethereum has experienced an even sharper drop, losing 10% in the same time frame and hovering […] The post Bearish wave hits crypto as Bitcoin and Ethereum faced sharp declines over past week appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T10:42:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:43Z", "source": "CryptoNews", "title": "Crypto Giants Unite to Launch ‘Beacon Network’ Kill Switch for Criminal Funds", "url": "https://cryptonews.com/news/crypto-giants-unite-to-launch-beacon-network-kill-switch-for-criminal-funds/", "id_key": "58cf89baf687c21ead138be175acd1c8beb80589e3ff759308dafb88c0ed98f8", "summary": "Major crypto exchanges including Coinbase, Binance, PayPal, Robinhood, Stripe, and Kraken unite to launch Beacon Network, the first real-time crypto crime response system designed to prevent illicit funds from leaving blockchain through instant alerts and freezing capabilities targeting the $47B annual crime problem. The post Crypto Giants Unite to Launch ‘Beacon Network’ Kill Switch for Criminal Funds appeared first on Cryptonews .", "ingested_utc": "2025-08-21T10:42:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:44Z", "source": "CoinJournal", "title": "XRP price forecast as bulls and bears face off near $3", "url": "https://coinjournal.net/news/xrp-price-forecast-as-bulls-and-bears-face-off-near-3/", "id_key": "7dfeaabb670c4b8fc2fc41f843476626de83b43b467a53257f731b9d062aa00f", "summary": "XRP price hovered around $2.88 after this week’s dip. After a broader market downswing, XRP losses have hit 10% for the past seven days. Bulls face pressure near $3 but tailwinds could help them rip to a new peak. XRP trader around $2.88 with buyers trying to flip positive amid downside pressure, with sellers having […] The post XRP price forecast as bulls and bears face off near $3 appeared first on CoinJournal .", "ingested_utc": "2025-08-21T10:42:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:42:44Z", "source": "CoinJournal", "title": "OKB price hits new all-time high amid a 50% spike", "url": "https://coinjournal.net/news/okb-price-hits-new-all-time-high-amid-a-50-spike/", "id_key": "dd8a7d37c5381421d7703f1552fcdffcd94e53a8e0c33c33a247f39faebd6d40", "summary": "OKB price rose 50% to hit a new all-time high of $195. The altcoin is outpacing peers as investors react to tokenomics changes. OKB is seeing traction as altcoins bid to break higher. OKB, the native token of the OKX exchange, has soared to a new all-time high of $195, with intraday gains of over […] The post OKB price hits new all-time high amid a 50% spike appeared first on CoinJournal .", "ingested_utc": "2025-08-21T10:42:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:44:34Z", "source": "NYTimes_World", "title": "Wisconsin Woman Who Flew to UK to Try to Kill a Man Gets 30-Year Sentence", "url": "https://www.nytimes.com/2025/08/21/world/europe/aimee-betro-assassination-attempt-sentence.html", "id_key": "9bb61bcb8e81ed8fdcfa369ed347d7102ef46da0b1acb11344b6c81caa91c8c6", "summary": "Aimee Betro, 45, was convicted this month of attempting to shoot a man near Birmingham, England, in 2019.", "ingested_utc": "2025-08-21T10:44:34Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:44:34Z", "source": "NYTimes_World", "title": "Brazil-U.S. Talks on Mining Rare Earth Minerals Are Complicated by Trump’s Tariffs", "url": "https://www.nytimes.com/2025/08/21/world/americas/brazil-us-rare-earth-minerals-tariffs.html", "id_key": "6157b654abda5654c3e87b468d95fd4c8d0e8a2b2e41c128921b8ce3625e1acd", "summary": "Tensions between President Trump and Brazil’s leader could derail a promising alliance to unlock the world’s second largest reserve of the minerals.", "ingested_utc": "2025-08-21T10:44:34Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:44:41Z", "source": "NPR_Top", "title": "Far fewer Canadians are visiting the U.S. this year, new numbers show", "url": "https://www.npr.org/2025/08/21/nx-s1-5508461/fewer-canadians-visiting-us", "id_key": "3cbd20e54310bf9246785a4626f7f729657fc3f027396077f570fbfb1ce2250c", "summary": "Canadian residents made just 1.7 million return trips by motor vehicle back into their country from the U.S. in July, a nearly 37% decline over the same month in 2024, according to Statistics Canada.", "ingested_utc": "2025-08-21T10:44:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:44:43Z", "source": "NPR_World", "title": "Brazilian police say ex-President Bolsonaro had planned to flee to Argentina", "url": "https://www.npr.org/2025/08/21/nx-s1-5509434/brazil-bolsonaro-argentina-coup-asylum", "id_key": "1368ce51cf4a02a121fbdc5e85a6d6a35b1965cf26602df4b3a7a43653a98454", "summary": "Bolsonaro is awaiting a Supreme Court ruling about an alleged coup attempt and learned Wednesday he might face another case as police formally accused him and one of his son of obstruction of justice", "ingested_utc": "2025-08-21T10:44:43Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:44:43Z", "source": "NPR_World", "title": "Massacres in eastern Congo cast doubt on U.S. mediated peace deal", "url": "https://www.npr.org/2025/08/20/nx-s1-5508633/drc-rwanda-hrw-trump", "id_key": "b9a26d62cca00cff0e6f56a2ba3a90e9738a9eaa4b2c03129998a2580897ac80", "summary": "Rwanda backed M23 rebels in eastern Democratic Republic of Congo killed hundreds of villagers in July, according to Human Rights Watch, raising doubts about Trump backed peace process.", "ingested_utc": "2025-08-21T10:44:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:44:45Z", "source": "FT_Home", "title": "UK asylum applications hit record 111,000 in Starmer’s first year in office", "url": "https://www.ft.com/content/c10e76a3-4cf0-4e5a-bf2a-68becf0f8bd2", "id_key": "51b13baeca57a1fd796e9ecb6ca128a7122fde89115673e55de638348bd53bac", "summary": "Figure reflects surge in small boat arrivals to the country", "ingested_utc": "2025-08-21T10:44:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:01Z", "source": "TheVerge_All", "title": "Apple Watch’s restored blood oxygen tracking attracts another lawsuit", "url": "https://www.theverge.com/news/763291/apple-masimo-blood-oxygen-patent-customs-lawsuit", "id_key": "c6a7c19e1f2bc9c486c5cf2e224870a7757efb4d3c986c96db89dc7b70c1857c", "summary": "Medical tech company Masimo is suing US Customs and Border Protection (CBP) in an attempt to overturn the agency’s decision to allow Apple to restore the blood oxygen tracking feature on Apple Watches. Apple has been embroiled in legal disputes over Masimo’s blood oxygen sensor patent since 2020, disabling the feature on supported US Apple […]", "ingested_utc": "2025-08-21T10:45:01Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:06Z", "source": "TheEconomist_Finance", "title": "Where has the worst inflation problem?", "url": "https://www.economist.com/finance-and-economics/2025/08/17/where-has-the-worst-inflation-problem", "id_key": "dfa268167345ed6ad8fc1fcf8c348ebb0426b261e639c669a4900658e24fe3e2", "summary": "We update our entrenchment measure", "ingested_utc": "2025-08-21T10:45:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "Nigeria $17 Billion Pension Industry Eyes Investment Flexibility", "url": "https://financialpost.com/pmn/business-pmn/nigeria-17-billion-pension-industry-eyes-investment-flexibility", "id_key": "ad4aee2e446248ed4357f2887f2e91e8bb4828c402fb44986d5f8e7181391f18", "summary": "Nigeria’s pension fund managers have asked the industry regulator to grant them greater flexibility to invest so they have greater scope to boost returns that have been eroded by high inflation and currency depreciation.", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "lululemon athletica inc. Announces Second Quarter Fiscal 2025 Earnings Conference Call", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/lululemon-athletica-inc-announces-second-quarter-fiscal-2025-earnings-conference-call", "id_key": "8341fa9ed0ea9d09a9e865bf0aee447c2a9edacb6941195bc6c78f3de459f70e", "summary": "VANCOUVER, British Columbia — lululemon athletica inc. (NASDAQ: LULU) today announced that its financial results for the second quarter fiscal 2025 will be released Thursday, September 4, 2025. The company will host a conference call at 4:30 p.m. Eastern time to discuss the financial results. If you would like to participate in the call, please […]", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "Azimut and KGHM Resume Drilling on the Perseus High-Grade Nickel-PGE Discovery at Kukamas, James Bay Region, Quebec", "url": "https://financialpost.com/globe-newswire/azimut-and-kghm-resume-drilling-on-the-perseus-high-grade-nickel-pge-discovery-at-kukamas-james-bay-region-quebec", "id_key": "d4c860760ed3243380c313e0e541617b7a8e7dd5d05b118adee5e7102de5aca0", "summary": "LONGUEUIL, Quebec, Aug. 21, 2025 (GLOBE NEWSWIRE) — Azimut Exploration Inc. (“Azimut” or the “Company”) (TSXV: AZM) (OTCQX: AZMTF) is pleased to announce that a minimum 4,000-metre diamond drilling program has started in order to further define the Perseus high-grade nickel-PGE discovery and test additional targets on the Kukamas Property (the “Property”) in the Eeyou Istchee James […]", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "Kraken Robotics Reports Q2 2025 Financial Results and Reiterates Annual Financial Guidance", "url": "https://financialpost.com/globe-newswire/kraken-robotics-reports-q2-2025-financial-results-and-reiterates-annual-financial-guidance", "id_key": "a6a3cc8a0555708164a62fe3d103c83d5eeff7c74acc5de866e0e3ba09860b60", "summary": "ST. JOHN’S, Newfoundland and Labrador, Aug. 21, 2025 (GLOBE NEWSWIRE) — Kraken Robotics Inc. (TSX-V: PNG, OTCQB: KRKNF) (“Kraken” or the “Company”), announced it has filed its financial results for the quarter ended June 30, 2025 (“Q2 2025”). Please refer to the unaudited Condensed Consolidated Interim Financial Statements and Management’s Discussion and Analysis (“MD&A”) for […]", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "Ukrainian suspected in the Nord Stream pipeline blasts arrested in Italy, German prosecutors say", "url": "https://financialpost.com/pmn/ukrainian-suspected-in-the-nord-stream-pipeline-blasts-arrested-in-italy-german-prosecutors-say", "id_key": "22e4cc1d2e1245187b735c535c3161a937b97c721f95b5798b56a34b7d213611", "summary": "BERLIN (AP) — A Ukrainian citizen suspected of participating in the undersea explosions in 2022 that damaged the Nord Stream gas pipelines between Russia and Germany has been arrested, German prosecutors said Thursday. The suspect, identified only as Serhii K. in line with German privacy rules, was arrested overnight in Italy’s Rimini province, federal prosecutors […]", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "Ohio’s Southwest Local School District Modernizes Procurement and Invoicing with Euna Solutions", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/ohios-southwest-local-school-district-modernizes-procurement-and-invoicing-with-euna-solutions", "id_key": "f4fb4ee42e56a26d621bff55cc79dff9e2084f811f835fe0818c629f3165725a", "summary": "SWLSD achieves faster approvals, 25% cost savings, and full digitization with Euna’s cloud-based tools ATLANTA & TORONTO — Euna Solutions®, a leading provider of best-in-class SaaS solutions, purpose-built for the public sector, today announced that Southwest Local School District (SWLSD) in Ohio has successfully modernized its procurement and invoicing operations using Euna Procurement’s Marketplace and […]", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "European Commission Approves Tablet Formulation of BeOne Medicines’ BRUKINSA® for All Approved Indications", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/european-commission-approves-tablet-formulation-of-beone-medicines-brukinsa-for-all-approved-indications", "id_key": "78b954f5268a1e0d137b0c00b0cc1158b80ab415516c110c89a5c52d67b5683c", "summary": "Tablets will advance treatment simplicity and convenience to meet patient needs across Europe SAN CARLOS, Calif. — BeOne Medicines Ltd. (Nasdaq: ONC; HKEX: 06160; SSE: 688235), a global oncology company, today announced that the European Commission has approved a new film-coated tablet formulation of BRUKINSA® (zanubrutinib) for all approved indications. “Developed to meet the real-world […]", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:20Z", "source": "FinancialPost_Business", "title": "AI or die: Canada’s existential moment in the age of augmented intelligence", "url": "https://financialpost.com/technology/ai-canada-existential-moment-age-augmented-intelligence", "id_key": "3b6b571ac0d7bcc786a7e52f3d4f1e32da4e304427db1d565e554f8d7bd6b6cb", "summary": "Louis Tétu: If we don’t adopt much faster, our companies will fail and our standard of living will massively erode", "ingested_utc": "2025-08-21T10:45:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:33Z", "source": "MIT_TechReview", "title": "Why recycling isn’t enough to address the plastic problem", "url": "https://www.technologyreview.com/2025/08/21/1122247/recycling-climate-emissions/", "id_key": "5f473cff7070eb04fedf910ee6065611e93e3720cc25b063b8f17ceaa6254eb7", "summary": "I remember using a princess toothbrush when I was little. The handle was purple, teal, and sparkly. Like most of the other pieces of plastic that have ever been made, it’s probably still out there somewhere, languishing in a landfill. (I just hope it’s not in the ocean.) I’ve been thinking about that toothbrush again…", "ingested_utc": "2025-08-21T10:45:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:45:34Z", "source": "HackerNews_Top", "title": "Dev Reveals Secrets Behind New \"3D\" Platformer for the ZX Spectrum", "url": "https://www.timeextension.com/news/2025/08/dev-reveals-secrets-behind-stunning-new-3d-platformer-for-the-zx-spectrum", "id_key": "590d6e5d8062b96e3e0378dfbae543bbb2921d1326d8782cd11b39d0a50f71c4", "summary": "Comments", "ingested_utc": "2025-08-21T10:45:34Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:52:57Z", "source": "CoinJournal", "title": "Morpho price jumps 12% to lead market gainers", "url": "https://coinjournal.net/news/morpho-price-jumps-12-to-lead-market-gainers/", "id_key": "53da9f861650d503fe7b68a438bbee617853f3f18a973c4f318cd718f1c1a368", "summary": "Morpho price rose 12% to hit a six-month high of $2.38. Ecosystem developments and market sentiment has helped MORPHO up. Bulls could target the peak of $4.17 reached in January. Morpho (MORPHO), native to the decentralized lending protocol, has climbed more than 12% in the past 24 hours to emerge as one of the top […] The post Morpho price jumps 12% to lead market gainers appeared first on CoinJournal .", "ingested_utc": "2025-08-21T10:52:57Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:54:45Z", "source": "NYTimes_Business", "title": "The Trade That Binds the Indian and American Economies", "url": "https://www.nytimes.com/2025/08/21/business/trump-tariffs-india.html", "id_key": "ee1cb0050fd3bbbc41ebe4ca22902defe1f0269e91c88e1d17ca6cf4448bcfb4", "summary": "President Trump focuses on the trade in manufactured goods, where India sells more to the U.S. than it buys. But the countries share a balanced trade in services.", "ingested_utc": "2025-08-21T10:54:45Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:55:17Z", "source": "TheEconomist_Business", "title": "How AI-powered hackers are stealing billions", "url": "https://www.economist.com/business/2025/08/19/how-ai-powered-hackers-are-stealing-billions", "id_key": "fa629e77908f0220d7737c1c4961e1c609296ad7e9bc82be1be5dbecf73b9c97", "summary": "Business is booming for cyber-security firms", "ingested_utc": "2025-08-21T10:55:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:55:18Z", "source": "TheEconomist_Finance", "title": "Economists disagree about everything. Don’t they?", "url": "https://www.economist.com/finance-and-economics/2025/08/21/economists-disagree-about-everything-dont-they", "id_key": "6c2e30f1f9b9fb387992930007f5f5296245691b9e0bdf92cf2d997d94350379", "summary": "Their discipline is famous for its fissiparousness", "ingested_utc": "2025-08-21T10:55:18Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T10:55:32Z", "source": "FinancialPost_Business", "title": "A Ukrainian suspected in the Nord Stream pipeline blasts is arrested in Italy", "url": "https://financialpost.com/pmn/ukrainian-suspected-in-the-nord-stream-pipeline-blasts-arrested-in-italy-german-prosecutors-say", "id_key": "25d1baefddf465d27eadde204afa43303caf3ac752c01b58f469e060a4a31fc0", "summary": "BERLIN (AP) — A Ukrainian citizen man suspected to be one of the coordinators of the undersea explosions in 2022 that damaged the Nord Stream gas pipelines between Russia and Germany has been arrested, German prosecutors said Thursday. The suspect, identified only as Serhii K. in line with German privacy rules, was arrested overnight by […]", "ingested_utc": "2025-08-21T10:55:32Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:27:57Z", "source": "BBC_World", "title": "Ukrainian held in Italy over Nord Stream gas pipelines blast mystery", "url": "https://www.bbc.com/news/articles/crkz1jl5j06o?at_medium=RSS&at_campaign=rss", "id_key": "02d32ee47ca6fd8d924e5d00946e0c592eb7790e9a27e5d1626ad96255af74d8", "summary": "German prosecutors say the man was in a group that planted explosives in the Baltic Sea.", "ingested_utc": "2025-08-21T11:27:57Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:27:57Z", "source": "BBC_World", "title": "Palestinians flee Gaza City districts as Israel says first stages of offensive have begun", "url": "https://www.bbc.com/news/articles/clyr7l0z9edo?at_medium=RSS&at_campaign=rss", "id_key": "cb8e59d256c4f2fd6b8eda18e7ebf75aa22ee0d12329cddcc644498d1747aa65", "summary": "An Israeli military spokesman says troops will deepen the damage to the \"terror infrastructure\" held by Hamas.", "ingested_utc": "2025-08-21T11:27:57Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:27:58Z", "source": "BBC_Business", "title": "Tesco meal deal price rises by 25p", "url": "https://www.bbc.com/news/articles/clyr7renp51o?at_medium=RSS&at_campaign=rss", "id_key": "8a50a688507d2feb1c4584e5a20fda927660064943447ce7a91e314f11ca4661", "summary": "The supermarket said its meal deal \"remains great value\" despite the 25p increase.", "ingested_utc": "2025-08-21T11:27:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:28:00Z", "source": "Guardian_World", "title": "Has Israel begun its Gaza City offensive or will there be yet more ‘approvals’?", "url": "https://www.theguardian.com/world/2025/aug/21/has-israel-begun-gaza-city-offensive", "id_key": "e65f73f156ff171b6aa6f279490420ca2cfc5a93a7bd6dfb78f0612184d432d8", "summary": "Despite daily announcements about its plan, Israel knows any major new campaign will have serious consequences Middle East crisis – latest updates Has Israel begun its offensive to conquer Gaza City, or is it hype? Following several weeks of threats of a new large-scale offensive, strongly opposed by the majority of the international community, Israeli officials have made announcements daily saying the plan to conquer Gaza City has been “approved”; it has been approved by the Israel Defense Forces, by the security cabinet, by the defence minister. Continue reading...", "ingested_utc": "2025-08-21T11:28:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:28:00Z", "source": "Guardian_World", "title": "Number of asylum seekers housed in hotels up 8% in a year, Home Office data shows", "url": "https://www.theguardian.com/uk-news/2025/aug/21/number-of-asylum-seekers-housed-in-hotels-rises-8-percent-on-a-year-ago-shows-data", "id_key": "2f6c470ea25a3f63bb8b9fd2850b7583ded20e4afa0b7b13ff3d6f171e2cacba", "summary": "Applications being processed much quicker than two years ago, as councils threaten legal action to stop use of hotels UK politics live – latest updates The number of asylum seekers who are being housed in hotels has risen by 8% to 32,059 in a year, according to new data. The data also shows that the government is processing asylum applications much quicker, with 71,000 cases awaiting approval, relating to 91,000 people, compared with 134,000 two years ago. Continue reading...", "ingested_utc": "2025-08-21T11:28:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:28:00Z", "source": "Guardian_World", "title": "CEO-to-worker pay gap surges to 632 to 1 at US’s lowest-paying large firms, study shows", "url": "https://www.theguardian.com/us-news/2025/aug/21/ceo-worker-salaries", "id_key": "bd7ff86e22f7a7ccbf27f642e65c1c5f5b6da6686ce09183736b2454714722fc", "summary": "At 100 firms in S&P 500 with lowest median pay, executives’ comp increased by average of nearly 35% over five years Some of the US’s lowest-paying large firms increased their CEOs’ compensation by an average of almost 35% over five years, according to new research . Their workers’ salaries did not keep up. As executive remuneration ballooned, the average CEO-to-worker pay gap across the 100 companies in the S&P 500 with lowest median worker pay – dubbed the Low-Wage 100 by the Institute for Policy Studies – widened by 12.9% between 2019 and 2024, from 560 to 1 to 632 to 1. Continue reading...", "ingested_utc": "2025-08-21T11:28:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:28:19Z", "source": "CryptoSlate", "title": "Kanye’s YZY launch rockets into Top 35 tokens then crashes 95% in hours", "url": "https://cryptoslate.com/kanyes-yzy-launch-rockets-into-top-35-tokens-then-crashes-95-in-hours/", "id_key": "5401d50f4a3ad453a37c38a843c6f07d4518d740eac7c71620426ecf65704f7d", "summary": "Kanye West continued his controversy-filled era with his YZY token launch on Solana this week, where trading activity drove its market capitalization near $3 billion before collapsing within hours. The token, listed under multiple pool tickers on Raydium, initially saw rapid inflows that pushed its fully diluted valuation into multibillion territory before prices retreated more […] The post Kanye’s YZY launch rockets into Top 35 tokens then crashes 95% in hours appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T11:28:19Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:28:22Z", "source": "CryptoNews", "title": "Bitcoin’s Historic 4-Year Cycle May Still Be Intact – Here’s Why", "url": "https://cryptonews.com/news/bitcoins-historic-4-year-cycle-may-still-be-intact-glassnode-analysis-shows/", "id_key": "7e505ad87e9cbbba83c400c45f7f789f3193f0d7c1fb89a5dab9c2967a202e17", "summary": "Glassnode analysis suggests Bitcoin's traditional 4-year cycle remains structurally intact despite widespread analyst claims that institutional adoption has broken the pattern, finding that current cycle duration and long-term holder profit-taking levels closely mirror previous cycles, with a 273-day profitable supply duration ranking second-longest on record. The post Bitcoin’s Historic 4-Year Cycle May Still Be Intact – Here’s Why appeared first on Cryptonews .", "ingested_utc": "2025-08-21T11:28:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:28:22Z", "source": "CryptoNews", "title": "Why Is Crypto Up Today? – August 21, 2025", "url": "https://cryptonews.com/news/why-is-crypto-up-today-august-21-2025/", "id_key": "63b67d9126bd1534f2c76cb70a6041bf1176ec2c54440367d85763db6d7257ca", "summary": "The market is up today. ETH outperformed BTC in 24 hours. All eyes are on the US Fed rate cut decision: if as expected, \"crypto could see sideways to slightly bearish action,\" an analyst says. The post Why Is Crypto Up Today? – August 21, 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-21T11:28:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:29:58Z", "source": "Guardian_World", "title": "Americans worry democracy in danger amid gerrymandering fights, new poll finds – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/21/texas-house-redrawn-electoral-map-republicans-us-politics-latest-updates-news", "id_key": "5c029174f2524f5d23c5c1127a046ad53edb076d380c5d3e377f19d3ac152d59", "summary": "Fifty-seven percent of respondents say they feared US democracy was in danger, a view held by eight in 10 Democrats and four in 10 Republicans Texas Republicans pass gerrymandered congressional map Donald Trump has called on a Federal Reserve governor to immediately resign, renewing his extraordinary attack on the central bank’s independence as officials mull next steps on interest rates. A close Trump ally accused Lisa Cook, an appointee of Joe Biden , of “potentially committing mortgage fraud” and urged the US Department of Justice to investigate. Any California school district that doesn’t adhere to our Transgender policies, will not be funded. Thank you for your attention to this matter! Continue reading...", "ingested_utc": "2025-08-21T11:29:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:30:09Z", "source": "MarketWatch_Bulletins", "title": "Walmart posts a rare profit miss for the second quarter", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=d23b46f8-2104-4a4a-860e-92ecc5f5498f&mod=mw_rss_bulletins", "id_key": "951e6abff39ae63c8fa02b623c57c8fed0fb92b839698cc8016138473f9b37ea", "summary": "", "ingested_utc": "2025-08-21T11:30:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:30:16Z", "source": "NYTimes_Business", "title": "Walmart Sees Sales ‘Momentum’ Despite Tariffs", "url": "https://www.nytimes.com/2025/08/21/business/walmart-sales-retail-tariffs.html", "id_key": "96d1314bdea241e60a9225732dd4b493c66a8eb753f7379a585c0c936470d49e", "summary": "After mixed reports from retail rivals, Walmart reported better-than-expected quarterly results and raised its sales forecast for the year.", "ingested_utc": "2025-08-21T11:30:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:30:16Z", "source": "NYTimes_Business", "title": "Europe Gets a Written Trump Trade Deal, With a Caveat for Automakers", "url": "https://www.nytimes.com/2025/08/21/us/politics/eu-us-trump-trade-deal.html", "id_key": "8b4ae0266843c6339814abef4db8c3a59c608f93bf4149043cf3c1adac082b5d", "summary": "The European Union and United States have been negotiating the joint text for weeks. The deal is much as expected, but it will delay tariff relief for European cars.", "ingested_utc": "2025-08-21T11:30:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:30:25Z", "source": "NPR_Top", "title": "The kids missing the most amount of school may surprise you: kindergartners", "url": "https://www.npr.org/2025/08/21/nx-s1-4974733/the-kids-missing-the-most-amount-of-school-may-surprise-you-kindergarteners", "id_key": "b5fc52245d19f2a0e658278af3a70468acc229d42f0a7b49e5eba06bb079d11a", "summary": "A California school district fights chronic absenteeism in kindergarten by helping parents decide whether their kid is too sick to go to school.", "ingested_utc": "2025-08-21T11:30:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:30:25Z", "source": "NPR_Top", "title": "Pakistan is tapping into solar power at an 'unprecedented' rate. Here's why", "url": "https://www.npr.org/sections/goats-and-soda/2025/08/21/g-s1-82369/solar-power-panels-boom-pakistan", "id_key": "069ed7e095f60bdde814946abb690167ab34ed11e4a0aaa098ad7a036712f469", "summary": "Solar experts say there's never been a faster adoption of solar, with panels popping up on rooftops.", "ingested_utc": "2025-08-21T11:30:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:30:29Z", "source": "FT_Home", "title": "US to keep high tariffs on European cars until Brussels moves to lower its levies", "url": "https://www.ft.com/content/90aee728-b7f1-4380-a278-9a7ffbe3b353", "id_key": "677a884592413973aafbcfb6c83af706710b802fb67065e921d2711d96c5a75d", "summary": "Germany had pressed for a swift deal to reduce 27.5% rate on cars", "ingested_utc": "2025-08-21T11:30:29Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:30:30Z", "source": "FT_Markets", "title": "Will expanded access to US federal lands spur oil and gas output?", "url": "https://www.ft.com/content/eecfbac8-b6e3-4f58-96e2-029d361b67d3", "id_key": "458ed50adb989f301107f5ef37314e32a225f77ef6090704b04ed396e492a1d6", "summary": "The Trump administration policy may not be enough to fulfil the president’s ‘drill, baby, drill’ agenda", "ingested_utc": "2025-08-21T11:30:30Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "Blackline Safety Begins Rollout with ADNOC Under Multi-Year Purchase Agreement", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/blackline-safety-begins-rollout-with-adnoc-under-multi-year-purchase-agreement", "id_key": "304ffee8ed22291b2315543d5d7e414e84a2fbfdd64ca838096a0a610d936dd6", "summary": "Initial order received under new long-term purchase agreement for up to 28,000 connected gas detectors with four-year service CALGARY, Alberta — Blackline Safety Corp. (TSX: BLN), a global leader in connected safety technology, today announced that the Abu Dhabi National Oil Company (ADNOC), one of the world’s leading energy producers, has placed its first purchase […]", "ingested_utc": "2025-08-21T11:31:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "EU, US Reach Agreement on Joint Statement Outlining Trade Deal", "url": "https://financialpost.com/pmn/business-pmn/eu-us-reach-agreement-on-joint-statement-outlining-trade-deal", "id_key": "cbd93c9d249d4af7aa95622fe3942b5764d5412912b091cd972ef168fef1876a", "summary": "The US and European Union took the next steps to formalize their trade pact, detailing plans that could reduce tariffs on European automobiles within weeks while opening the door to new potential discounts for steel and aluminum.", "ingested_utc": "2025-08-21T11:31:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "Walmart reports solid second-quarter sales and profits despite a challenging tariff environment", "url": "https://financialpost.com/pmn/walmart-reports-solid-second-quarter-sales-and-profits-despite-a-challenging-tariff-environment", "id_key": "57fe6caf572406d65f6e4f76e5943c87b63cae2845b376478dd1b22c0d764c15", "summary": "NEW YORK (AP) — Walmart Inc. reported increases in second-quarter profits and sales Thursday as it continues to pull in price-sensitive shoppers for everyday essentials like groceries despite a challenging tariff environment. The Bentonville, Arkansas-based company, the nation’s largest retailer, also increased its annual profit and sales outlook. It’s among the first group of major […]", "ingested_utc": "2025-08-21T11:31:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "Edgewater Wireless CEO to join “Catalysts of Innovation” Event in Silicon Valley", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/edgewater-wireless-ceo-to-join-catalysts-of-innovation-event-in-silicon-valley", "id_key": "0cd346b49efcfbcfb9a512e4fa2a6b399a421173ace07a31e5132933c5e3a9f4", "summary": "OTTAWA, Ontario & SAN JOSE, Calif. — Edgewater Wireless Systems Inc. (TSXV: YFI) (OTC: KPIFF), the industry pioneer of Wi-Fi Spectrum Slicing™ technology, today announced that President & CEO Andrew Skafel will join the “Catalysts of Innovation: Building Enduring Semiconductor Companies” panel hosted by Silicon Catalyst in collaboration with Arm Holdings Plc (NASDAQ: ARM) on […]", "ingested_utc": "2025-08-21T11:31:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "Covalon Reports Strong Sequential Quarter on Quarter and Trailing Twelve Months Performance", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/covalon-reports-strong-sequential-quarter-on-quarter-and-trailing-twelve-months-performance", "id_key": "97bbc9352846f94d5757fa6307d10a9ba4b56c47a7d33bcfeaf6d844a1960192", "summary": "Sequential QoQ Revenue Growth of 10.4%, Adjusted EBITDA Growth of 52% Trailing Twelve Months Revenue Growth of 13%, Adjusted EBITDA Growth of 116% MISSISSAUGA, Ontario — Covalon Technologies Ltd. (the “Company” or “Covalon”) (TSXV: COV; OTCQX: CVALF), an advanced medical technologies company, today announced its fiscal 2025 third quarter results for the period ended June […]", "ingested_utc": "2025-08-21T11:31:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "Regenx Provides Bi-Weekly Update on Status of Management Cease Trade Order", "url": "https://financialpost.com/globe-newswire/regenx-provides-bi-weekly-update-on-status-of-management-cease-trade-order-5", "id_key": "7014e580e25d47fc955f326cb394a1f25a9c7295cb3d78cfd09a50d10c6022a3", "summary": "EDMONTON, Alberta, Aug. 21, 2025 (GLOBE NEWSWIRE) — Regenx Tech Corp., (the “Corporation” or “Regenx“) (CSE: RGX) (OTCQB: RGXT) (FSE: YRS WKN: A2DSW3) is providing this bi-weekly update on the status of the management cease trade order granted on July 30, 2025, by its principal regulator, the Alberta Securities Commission, under National Policy 12-203 -‎‎ […]", "ingested_utc": "2025-08-21T11:31:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "Quantum BioPharma Announces Corporate Updates", "url": "https://financialpost.com/globe-newswire/quantum-biopharma-announces-corporate-updates", "id_key": "5a4b3816d8873b9524ac0b9b588e09e69f39df597f306c6bde457c0c60c51056", "summary": "TORONTO, Aug. 21, 2025 (GLOBE NEWSWIRE) — Quantum BioPharma Ltd. (NASDAQ: QNTM) (CSE: QNTM) (FRA: 0K91) (Upstream: QNTM) (“Quantum BioPharma” or the “Company”), a biopharmaceutical company dedicated to building a portfolio of innovative assets and biotech solutions for the treatment of challenging neurodegenerative and metabolic disorders and alcohol misuse disorders with drug candidates in different […]", "ingested_utc": "2025-08-21T11:31:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T11:31:06Z", "source": "FinancialPost_Business", "title": "Cannara Announces Amendment and Upsize of BMO Credit Facility to Support Facility Expansion at Valleyfield", "url": "https://financialpost.com/globe-newswire/cannara-announces-amendment-and-upsize-of-bmo-credit-facility-to-support-facility-expansion-at-valleyfield", "id_key": "9c52a0522a28c98ccb6efb9269542afc068bdfa6c4963888a49f05e66cd93be4", "summary": "Expanded credit facility to fund initial post-harvest buildout at Valleyfield, supporting the Company’s long-term goal of reaching 100,000 kg annual capacity MONTREAL, Aug. 21, 2025 (GLOBE NEWSWIRE) — Cannara Biotech Inc. (“Cannara”, “the Company”, “us” or “we”) (TSXV: LOVE) (OTCQB: LOVFF) (FRA: 8CB0), a vertically integrated producer of premium-grade cannabis products at disruptive prices with […]", "ingested_utc": "2025-08-21T11:31:06Z"}
