{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:38Z", "source": "BBC_World", "title": "Sony raises PlayStation 5 prices in US as tariff fears persist", "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss", "id_key": "cfe71307b8b51d5a745427db4e3013a5b6be3ea617ca179ba52061685180d619", "summary": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.", "ingested_utc": "2025-08-21T03:28:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:38Z", "source": "BBC_World", "title": "Tulsi Gabbard announces plans to cut intelligence staff by half", "url": "https://www.bbc.com/news/articles/c78mj2m85pno?at_medium=RSS&at_campaign=rss", "id_key": "4a4c7b683eb46760cc544477c4019c91d36407c5ef973962e94ef9ccf5fa19b1", "summary": "The director of national intelligence will also revoke the security clearances for 37 US intelligence officials who served under Biden and Obama.", "ingested_utc": "2025-08-21T03:28:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Brazil police file court documents accusing Bolsonaro of planning to flee to Argentina to seek asylum", "url": "https://www.theguardian.com/world/2025/aug/21/jair-bolsonaro-argentina-asylum-plan-brazil", "id_key": "ad1f3a8d5335b5a256fd1abe7b0fd28c12e2f4ce80ccbf985508693914159b1e", "summary": "Brazil’s former president is accused of allegedly plotting a military coup, but he denies the charges Brazilian police have claimed in court documents that they have found a document on the mobile phone of former president Jair Bolsonaro suggesting he had planned to flee to Argentina ahead of his judgment for allegedly plotting a military coup. The far-right populist is facing a jail term of over 40 years when Brazil’s supreme court convenes next month to decide whether he is guilty of conspiring to overturn the result of the 2022 presidential election, which Bolsonaro lost to his leftwing opponent Luiz Inácio Lula da Silva. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "New Zealand to spend $3bn upgrading helicopters and ‘embarrassing’ defence planes", "url": "https://www.theguardian.com/world/2025/aug/21/new-zealand-seahawk-helicopters-defence-spending-planes", "id_key": "77eb6f9ccf19019ba1350bbae4eabddb8e3eae949aff09ea47d02209419dd691", "summary": "Government says country will buy five Seahawk helicopters and two Airbus A321XLR aircraft New Zealand will spend nearly NZ$3bn ($1.7bn) upgrading its ageing defence fleet, including replacing its “embarrassing” planes that have left multiple prime ministers grounded during international travel, the government has announced. The defence minister, Judith Collins, said NZ$2bn would be spent buying five MH-60R Seahawk helicopters and another $700,000 to buy two Airbus A321XLR aircraft. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Australia news live: Lehrmann hearing takes early lunch break after lawyer pleads for more time; man rescued from NSW floodwaters", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "64f3626775cf67d586d3799c0da8e664b3b8b49382d1f4f5345131f3c4f0df07", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Netanyahu says Australian PM Albanese’s record ‘forever tarnished by weakness’ after Australian Jewish group urges calm", "url": "https://www.theguardian.com/australia-news/2025/aug/21/australian-pm-albanese-forever-tarnished-netanyahu-says", "id_key": "93a9cd6e6647738eae1a6aba371a870c103c57b5eab7439a97ae5954334bb9d9", "summary": "Israeli prime minister ignores pleas to resolve dispute with Australia through ‘diplomacy rather than public posturing’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Benjamin Netanyahu has ignored pleas from Australian Jewish groups to calm his feud with Anthony Albanese, further criticising the prime minister and escalating an ugly spat between the two leaders. Australia’s peak Jewish group, the Executive Council of Australian Jewry (ECAJ), on Wednesday labelled Israeli prime minister Netanyahu’s attack on Albanese as “inflammatory and provocative”, and a “clumsy intervention” which had affected Australia’s Jewish community. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Woman assisting police after infant found dead in Perth storm water drain", "url": "https://www.theguardian.com/australia-news/2025/aug/21/dead-infant-storm-water-drain-perth-woman-assisting-ntwnfb", "id_key": "0c9021a9b4673c109c348683708b8bc4376bc93d3d74db33612fb1d7e2411110", "summary": "Police say woman in her 30s ‘receiving appropriate care and support’ after workers made confronting discovery on Monday Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A woman is assisting police after a baby boy was found dead inside a storm water drain. Two workers carrying out routine maintenance made the confronting discovery in Alexander Heights in Perth’s northern suburbs on Monday afternoon. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Obama calls California’s redistricting plan ‘a responsible approach’", "url": "https://www.theguardian.com/us-news/2025/aug/20/obama-california-texas-redistricting", "id_key": "c12dc70a61af7c7ab12e51433e52b61535a086e06aba9e27f0e444c6aae36535", "summary": "Former US president wades into national conflict over House maps, as Texas lawmakers approve map to favor GOP Barack Obama waded into states’ efforts at rare mid-decade redistricting efforts, saying he agreed with California governor Gavin Newsom ’s plan to counter the new Texas congressional map by launching an effort to redraw his own state’s map and create more Democratic-friendly districts , calling it “a responsible approach”. “I believe that governor Newsom’s approach is a responsible approach. He said this is going to be responsible. We’re not going to try to completely maximize it,” Obama said at a Tuesday fundraiser on Martha’s Vineyard in Massachusetts. “We’re only going to do it if and when Texas and/or other Republican states begin to pull these maneuvers. Otherwise, this doesn’t go into effect.” Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Trump administration’s anti-woke campaign targets Smithsonian museums", "url": "https://www.theguardian.com/us-news/2025/aug/20/trump-administration-smithsonian-museum-review", "id_key": "8eb9edc309c91d3f03582f194f8ad43b7484ddef40757627a4d6904327643a16", "summary": "Exclusive: White House flags seven institutions including those for Latino, African and Asian art for review, document shows Amid the Donald Trump administration’s heavy-handed review of Smithsonian museums, the Guardian has seen a document compiled by the White House that details examples of how the widely visited cultural institutions have overly negative portrayals of US history. The document, based on public submissions shared with the administration, points to what it says are problematic exhibits at seven different museums, including a Benjamin Franklin exhibit that links his scientific achievements to his ownership of enslaved people and a film about George Floyd ’s murder that it says mischaracterizes the police. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Texas house passes Republican-drawn gerrymandered congressional map after weeks of protest – as it happened", "url": "https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates", "id_key": "364b31f4c1974fe4d5a8901562d544e7a83c152ae18cafa5ec5c2df411350748", "summary": "This liveblog is now closed The White House launched an official TikTok account on Tuesday, as Donald Trump continues to permit the Chinese-owned platform to operate in the US despite a law requiring its sale. “America we are BACK! What’s up TikTok ?” read a caption on the account’s first post, a 27-second clip, on the popular video-sharing app. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:28:41Z", "source": "Guardian_World", "title": "Trump has bought more than $100m in bonds while president, disclosure shows", "url": "https://www.theguardian.com/us-news/2025/aug/20/trump-bonds-disclosure", "id_key": "07085b0a304e9733fc2b98ab7c9bf90ea268b90714d2e21988427c127208d658", "summary": "Forms posted online show Trump made over 600 financial purchases the day after he was inaugurated for second term Donald Trump has bought more than $100m in company, state and municipal bonds since taking office in January, according to new disclosures which shed further light on the vast holdings of the US’s billionaire president. The forms, posted online on Tuesday, show the Republican former real estate mogul made more than 600 financial purchases since 21 January, the day after he was inaugurated for his second term in the White House. Continue reading...", "ingested_utc": "2025-08-21T03:28:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:00Z", "source": "CryptoSlate", "title": "Bitcoin SOPR shows consistent profit realization despite price pullback", "url": "https://cryptoslate.com/bitcoin-sopr-shows-consistent-profit-realization-despite-price-pullback/", "id_key": "2eea66e59c2f26bfe76b607c4944d907f6e4190b5903e1fbacbd4113afc2b97e", "summary": "Bitcoin is trading just above $113,000, with realized cap rising steadily and spending activity led overwhelmingly by coins younger than three months. Profit realization remains positive, short-term holders hover around breakeven, and older supply shows little sign of distribution. Bitcoin closed Aug. 20 at $113,599, marking a 7.9% drop in the past week, a 3.3% […] The post Bitcoin SOPR shows consistent profit realization despite price pullback appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T03:29:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:00Z", "source": "CryptoSlate", "title": "Crypto groups endorse Brian Quintenz for CFTC amid regulatory standoff with banks", "url": "https://cryptoslate.com/crypto-groups-endorse-brian-quintenz-for-cftc-amid-regulatory-standoff-with-banks/", "id_key": "828093d7ec3b00f7e9f878cac50c5a619273d7db4e2cfa23e0666a72d3204d10", "summary": "The Crypto Council for Innovation (CCI) and the Blockchain Association jointly issued a letter on Aug. 20 endorsing Brian Quintenz for Chairman of the US Commodity Futures Trading Commission (CFTC). In the letter to President Donald Trump, the groups emphasized that confirming Quintenz promptly is critical to advancing his administration’s agenda to foster a “golden […] The post Crypto groups endorse Brian Quintenz for CFTC amid regulatory standoff with banks appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T03:29:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:01Z", "source": "CryptoBriefing", "title": "Kanye West drops YZY meme coin on Solana", "url": "https://cryptobriefing.com/yzy-meme-coin-solana-launch/", "id_key": "cc0be3e0683985fb9eb1db88bed1165c27ab3e67a60909c7e80d9f35c1a65aa6", "summary": "Kanye's YZY coin and payment system could revolutionize digital transactions, challenging traditional finance and boosting crypto adoption. The post Kanye West drops YZY meme coin on Solana appeared first on Crypto Briefing .", "ingested_utc": "2025-08-21T03:29:01Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:03Z", "source": "CryptoNews", "title": "Winklevoss Twins Donate $21 Million To Digital Freedom Fund PAC", "url": "https://cryptonews.com/news/winklevoss-twins-donate-more-than-21-million-to-digital-freedom-fund/", "id_key": "040cbb81de6cbc4097aac1515e6a0ecf0bd6c12c0173060613f56caafdc8e5d5", "summary": "Gemini co-founders Tyler and Cameron Winklevoss donated 188 Bitcoins to the Digital Freedom Fund PAC on Wednesday, the former revealed in a new X post.New Crypto PAC Sees A Boost From Crypto BillionairesAccording to the August 20 social media post, the twin billionaires donated the crypto lump sum in order to help bring about “America’s […] The post Winklevoss Twins Donate $21 Million To Digital Freedom Fund PAC appeared first on Cryptonews .", "ingested_utc": "2025-08-21T03:29:03Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:29:04Z", "source": "CoinJournal", "title": "The altcoin uprising: Ether, Solana, and BNB defy market fear as Bitcoin stalls", "url": "https://coinjournal.net/news/the-altcoin-uprising-ether-solana-and-bnb-defy-market-fear-as-bitcoin-stalls/", "id_key": "c5cd3138c3767c1b60ed9bdb4ae9de87f15c804db2c218ae84a897bc2df26efa", "summary": "Major altcoins like Ether and Solana are strongly outperforming Bitcoin. BNB, the token of BNB Chain, surged 6% to a new all-time high of 875. Bitcoin’s market dominance is on the verge of hitting a new six-month low. In a stunning display of defiance, a powerful cohort of major altcoins staged a dramatic comeback on […] The post The altcoin uprising: Ether, Solana, and BNB defy market fear as Bitcoin stalls appeared first on CoinJournal .", "ingested_utc": "2025-08-21T03:29:04Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Jair Bolsonaro Planned to Seek Asylum in Argentina, Brazil’s Police Say", "url": "https://www.nytimes.com/2025/08/20/world/americas/jair-bolsonaro-brazil-asylum-argentina.html", "id_key": "009816684ea1448db11a44c74f34b65969b6e4b53bedafb8acfe255aa28a5959", "summary": "The police said they found a request for asylum, addressed to Argentina’s leader, on the phone of the Brazilian ex-president, who is accused of plotting a coup.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "A Huge Cave in Kentucky Was a Smelly Disaster. Now It’s Spectacular.", "url": "https://www.nytimes.com/2025/08/20/climate/horse-hidden-river-cave-pollution-cleanup.html", "id_key": "e016b742459a2248c728a1631e1a50acce143fb582c04be2bf8f2696ce4a2eef", "summary": "Hidden River Cave was once filled with heavy metals and sewage that made the surrounding town smell awful. After a cleanup, it became a tourist draw.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Dusky Gopher Frogs Are Making a Comeback in Mississippi", "url": "https://www.nytimes.com/2025/08/20/climate/mississippi-dusky-gopher-frog.html", "id_key": "f8602a66cdf743e4a2a8eee1d8af41583ec7e05cd5d7cd6780e221a9a77c904e", "summary": "Fewer than 100 dusky gopher frogs were known to remain. Thanks to some very dedicated humans, numbers are now on the rise.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Why Shop? In Maine, the Library of Things Has It All (Almost)", "url": "https://www.nytimes.com/2025/08/20/climate/maine-library-of-things.html", "id_key": "6e73f16d4c460b580237ca444482a26b33d97680821c7decdd2b03896fd2146e", "summary": "One town’s effort to make pricey items accessible and encourage people to buy less stuff seems to be catching on.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Israel Approves Settlements, a Blow to Faded Hopes for a Palestinian State", "url": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-e1-settlement-west-bank.html", "id_key": "8c3e470820053bb7334e4d42bbe8e4a3f96e4b96da0738ae334d54f73aef5102", "summary": "The long-stalled project near Jerusalem, known as E1, further fragments West Bank lands envisioned as part of a Palestinian state, advancing a goal of Israeli hard-liners.", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:00Z", "source": "NYTimes_World", "title": "Why Georgia, Once on Democracy’s Vanguard, Is Drifting Toward Russia", "url": "https://www.nytimes.com/2025/08/20/magazine/georgia-russia-autocracy-dictatorship.html", "id_key": "1b3928c463e64becff35f15b55788f25d18b2e63be4e20ed138c3c2e14a31a08", "summary": "Two decades after the Rose Revolution, the former Soviet satellite is turning away from the West and back toward Russia. What happened?", "ingested_utc": "2025-08-21T03:31:00Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:12Z", "source": "FT_Home", "title": "China turns against Nvidia’s AI chip after ‘insulting’ Lutnick remarks", "url": "https://www.ft.com/content/b8e30c54-b71c-4113-8b3e-8f54bc36587d", "id_key": "342eaade33ac20b5e21a850478f814bcb543186af935fbe0356c3e6d3efde4b9", "summary": "Comments by US commerce secretary trigger Chinese regulatory effort to stop tech groups buying H20 processors", "ingested_utc": "2025-08-21T03:31:12Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "TheStreet_Top", "title": "Walmart is selling a $175 wicker patio set for $85 that's 'clean' and 'sophisticated'", "url": "https://www.thestreet.com/deals/homall-casual-3-piece-wicker-patio-set-amazon-sale", "id_key": "d180e73bfcf080d5582292fdfa6f1ae865192e1b6e6c3863595963b128764104", "summary": "\"It's a nice color and was simple enough to assemble.\"", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "TheStreet_Top", "title": "Home Depot and Lowe’s warn of higher prices", "url": "https://www.thestreet.com/retail/home-depot-lowes-quietly-raising-prices-due-to-tariffs", "id_key": "395685602f34af0bd80d63fa0deb69e48f84c31938e1e31d169a8d29a1dd9045", "summary": "Both home improvement companies have been reluctant to admit that some prices have already increased, and others will go up.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "AlJazeera_All", "title": "‘Moral imperative’: Hundreds of UK business leaders demand action on Israel", "url": "https://www.aljazeera.com/news/2025/8/21/moral-imperative-hundreds-of-uk-business-leaders-demand-action-on-israel?traffic_source=rss", "id_key": "092cc9e13794c10e442b7523dacca474b910e1ca0b806b4e2266df1dbeae63a7", "summary": "More than 700 acclaimed professionals call for arms embargo, sanctions and scrutiny as Gaza faces darkest days.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "AlJazeera_All", "title": "Europe must shoulder ‘lion’s share’ of Ukraine’s security, Vance says", "url": "https://www.aljazeera.com/news/2025/8/21/europe-must-shoulder-lions-share-of-ukraines-security-vance-says?traffic_source=rss", "id_key": "65fc7d3dbe81ff3cf6fc2e23a1439c601fa7bc16375eba57d6d4d3f1d22fe864", "summary": "US vice president says Europe will be expected to play the 'leading role' in guaranteeing Kyiv's post-war security.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:44Z", "source": "AlJazeera_All", "title": "Netherlands sending 300 troops, Patriot missile systems to Poland", "url": "https://www.aljazeera.com/news/2025/8/21/netherlands-sending-300-troops-patriot-missile-systems-to-poland?traffic_source=rss", "id_key": "13a40f87c2d33d3739f78f67031b4581b0ecd679bac3733a06b803ff3a0a58fa", "summary": "Dutch defence minister announces details of support for Poland as Polish authorities accuse Russia of 'provocation'.", "ingested_utc": "2025-08-21T03:31:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "Actiontec Launches First Wi-Fi 7 Device Certified with Plume OpenSync 6.6", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/actiontec-launches-first-wi-fi-7-device-certified-with-plume-opensync-6-6", "id_key": "1b2c7c7549266767d1a703847f6909fc5b35bb7c5cfc21ea93990c9f2ed4c47b", "summary": "Breakthrough certification affirms company’s commitment to next-gen connected home experiences SANTA CLARA, Calif. — Actiontec, a leading provider of advanced broadband CPE solutions, today announced that its flagship WF-710G wireless gateway/extender has become the first Wi-Fi 7 device to receive OpenSync 6.6 certification from Plume, the cloud-based platform for smart home and small business services. […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "India Becomes Rare Hub for Green IPOs With $4 Billion of Deals", "url": "https://financialpost.com/pmn/business-pmn/india-becomes-rare-hub-for-green-ipos-with-4-billion-of-deals", "id_key": "bc451c27d08d2cdfad89ade6a264fb6759d62ae7b7dc1124a1e8ef3eb6a7353b", "summary": "India is seeing a revival in clean-energy initial public offerings as companies capitalize on Prime Minister Narendra Modi’s push for renewables.", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "Toshiba Releases Automotive Photorelay in a Small Package that Achieves Output Withstand Voltage of 1500V for Automotive Battery Systems", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/toshiba-releases-automotive-photorelay-in-a-small-package-that-achieves-output-withstand-voltage-of-1500v-for-automotive-battery-systems", "id_key": "47b4cf5839f278e7c56febb6751b8a856d85f855ad90ccfbfcc5d3c84c04d1f5", "summary": "KAWASAKI, Japan — Toshiba Electronic Devices & Storage Corporation (“Toshiba”) has launched an automotive photorelay[1], ” TLX9161T,” in a small SO12L-T package, that achieves an output withstand voltage of 1500V (min), the level required to support high voltage automotive batteries. Volume shipments start today. Key challenges in popularizing electric vehicles include reducing charging times and […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "MedX Health Corp. Names Meghan Geary as Senior Vice President of Operations", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/medx-health-corp-names-meghan-geary-as-senior-vice-president-of-operations", "id_key": "e8a1ee5fe0cf8a5c81e37c6e5023bf1b3affb82e517b7cdc21f78cb1f8a3f186", "summary": "MISSISSAUGA, Ontario — MedX Health Corp. (“MedX” or the “Company”) (TSXV: MDX), the global leader in teledermatology solutions, confirms the appointment of Meghan Geary as the Company’s Senior Vice President of Operations, effective immediately. With over 10 years experience in building scalable programs across SaaS and high-growth healthcare companies, Geary will oversee strategic operations, drive […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:51Z", "source": "FinancialPost_Business", "title": "Plethora Precious Metals Files Early Warning Report for Kingfisher Metals Corp.", "url": "https://financialpost.com/globe-newswire/plethora-precious-metals-files-early-warning-report-for-kingfisher-metals-corp", "id_key": "ca188bbe02dc6a39d0e72f542e3e5211601d6acabaa968b97ce8c0857a389f02", "summary": "UTRECHT, Netherlands, Aug. 20, 2025 (GLOBE NEWSWIRE) — Plethora Precious Metals Fund (“Plethora”) announces an update to its ownership of common shares (the “Shares”) of Kingfisher Metals Corp. (the “Company”) in satisfaction of the requirements of National Instrument 62-104 – Take-Over Bids and Issuer Bids (“NI 62-104”) and National Instrument 62-103 – The Early Warning […]", "ingested_utc": "2025-08-21T03:31:51Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "China approvals for IPOs outside mainland slow to a trickle", "url": "https://asia.nikkei.com/business/markets/ipo/china-approvals-for-ipos-outside-mainland-slow-to-a-trickle", "id_key": "46ad4f383fbc478fb780fc66d2d588546b7a4ccbd7e219e2e2258cd60c5f10a8", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Taiwan needs nuclear restart for security, urges opposition party chief", "url": "https://asia.nikkei.com/editor-s-picks/interview/taiwan-needs-nuclear-restart-for-security-urges-opposition-party-chief", "id_key": "9cd2b0649e37dbd73ca47ac6121a3ab508854cf476d4d19d48dba862547552bf", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan automakers start to pass on Trump tariff costs to US consumers", "url": "https://asia.nikkei.com/business/automobiles/japan-automakers-start-to-pass-on-trump-tariff-costs-to-us-consumers", "id_key": "cfd09ffd048494b9e068cd99cb9dbd7d0f0e8bd1b672aa32c868b68aea699fc4", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Indonesia central bank delivers surprise cut amid tariff concerns", "url": "https://asia.nikkei.com/economy/indonesia-central-bank-delivers-surprise-cut-amid-tariff-concerns", "id_key": "6666be922ad015fc8b05a7e2119e8076bfd2d87c607ec07f7ecc26cc23c88616", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan and South Korea to allow second working holiday visas", "url": "https://asia.nikkei.com/politics/international-relations/japan-and-south-korea-to-allow-second-working-holiday-visas", "id_key": "2aaad7aae3368fbd5943471fa3055d546f0e85dc5c358edae6d634433587b02f", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Myanmar's cybersecurity law comes into force, putting businesses on alert", "url": "https://asia.nikkei.com/spotlight/myanmar-crisis/myanmar-s-cybersecurity-law-comes-into-force-putting-businesses-on-alert", "id_key": "489280374443a3caddb4b5e293379c38f73b139c1f8b49c5b2989325a3ca1eb0", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Bangladesh garment makers gain orders on new US tariff", "url": "https://asia.nikkei.com/economy/trade-war/trump-tariffs/bangladesh-garment-makers-gain-orders-on-new-us-tariff", "id_key": "c89995b0abeb24ebd2fdbfb4dd3cf1eb9d1aa1ef0dcb88d2de8fbba19b49190d", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan exports drop for third straight month as Trump tariffs bite", "url": "https://asia.nikkei.com/economy/trade-war/trump-tariffs/japan-exports-drop-for-third-straight-month-as-trump-tariffs-bite2", "id_key": "ae28db04ea0fe7219fe4f6c8fd236a8782305ed03e94155e9c081f525cd5e042", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Japan PM signals alignment with NATO on Ukraine security", "url": "https://asia.nikkei.com/politics/international-relations/japan-pm-signals-alignment-with-nato-on-ukraine-security", "id_key": "4fa7ebee8d24d0a934468a5551739427a6024dc42e6ae05466e204fe057f389d", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Mitsui Chemicals to partner with Nigeria's Dangote on petrochemicals", "url": "https://asia.nikkei.com/business/companies/mitsui-chemicals-to-partner-with-nigeria-s-dangote-on-petrochemicals2", "id_key": "107c912bd32bd39bbd19bf3fc0f82911196ac1bd9e5851f4f6b2e2aeae79d692", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "China's growing ties with Serbia point to new 'Silk Curtain' in Europe", "url": "https://asia.nikkei.com/politics/international-relations/china-s-growing-ties-with-serbia-point-to-new-silk-curtain-in-europe", "id_key": "811dc1f27719ca7112c422556bc4942db607ad62d2c085454f37488b1f122137", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "Huge Vietnam smart city backed by Japan's Sumitomo moves forward", "url": "https://asia.nikkei.com/business/markets/property/huge-vietnam-smart-city-backed-by-japan-s-sumitomo-moves-forward2", "id_key": "b61c3147deb4e3584a28965a16eabcfe56ba49b1acc245fc66f527b3d719fc96", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "LG Electronics chases bigger slice of India's red-hot appliance market", "url": "https://asia.nikkei.com/business/electronics/lg-electronics-chases-bigger-slice-of-india-s-red-hot-appliance-market", "id_key": "37cab27c9ca8a16aa89411d5860e07431dbfa449b09243feb1d85f6b0843c435", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:31:58Z", "source": "Nikkei_Asia_Top", "title": "US court tosses suit against Texas restricting Chinese property ownership", "url": "https://asia.nikkei.com/politics/international-relations/us-china-tensions/us-court-tosses-suit-against-texas-restricting-chinese-property-ownership", "id_key": "05ffcd8da3fc0787b7684f830428aee9a3ac0d0f7215758a76874803666b9773", "summary": "", "ingested_utc": "2025-08-21T03:31:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:32:06Z", "source": "HackerNews_Top", "title": "How to stop feeling lost in tech: the wafflehouse method", "url": "https://www.yacinemahdid.com/p/how-to-stop-feeling-lost-in-tech", "id_key": "46d6dfeb3658f118efd3f6cf83d316ba6b104b113f08ec0835a7beed406897b3", "summary": "Comments", "ingested_utc": "2025-08-21T03:32:06Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:32:06Z", "source": "HackerNews_Top", "title": "SK hynix dethrones Samsung as world’s top DRAM maker", "url": "https://koreajoongangdaily.joins.com/news/2025-08-15/business/tech/Thanks-Nvidia-SK-hynix-dethrones-Samsung-as-worlds-top-DRAM-maker-for-first-time-in-over-30-years/2376834", "id_key": "0e8122010f81fa77e249c6014925a6a56593973f2b40232319405ea3cee6b86e", "summary": "Comments", "ingested_utc": "2025-08-21T03:32:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T03:32:06Z", "source": "HackerNews_Top", "title": "ICE Budget Now Bigger Than Most of the Militaries", "url": "https://www.newsweek.com/immigration-ice-bill-trump-2093456", "id_key": "7b709f2f2fa0eca98d3041ae226c30edac17d350e11d885990a852cb68e33c7b", "summary": "Comments", "ingested_utc": "2025-08-21T03:32:06Z"}
