{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "US Treasury secretary Bessent says Japan is ‘behind the curve’ on rates", "url": "https://www.ft.com/content/5fa8c360-dcb3-4cb2-a2ef-14898131fb4c", "id_key": "9e7f750a665d44a9e0e1f0a1bf45a764bb20a55a15a43f6f40782f270c956c75", "summary": "US Treasury secretary’s comments mark rare intrusion into Asian ally’s monetary policy", "ingested_utc": "2025-08-14T06:45:37Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "The moneymen funding Big Tech’s AI dreams", "url": "https://www.ft.com/content/cf7cf196-9b83-409c-92c9-ecd1f4d83253", "id_key": "e37578bd068bde78be3ab045c555db655c750885bba872b69182d22fc3b078b5", "summary": "Plus, the blockbuster IPOs putting bankers under the microscope", "ingested_utc": "2025-08-14T06:45:37Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "Opec pops US shale’s balloon", "url": "https://www.ft.com/content/e561c647-5176-4162-b502-0c05cd4bc48a", "id_key": "293188d887784d04f58ff224fd5ccc2c36857fa18fa0938d57b17b2e1eaca319", "summary": "American output expected to drop next year as Opec’s supplies soar", "ingested_utc": "2025-08-14T06:45:37Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "‘If in doubt, do nothing’: how the Wellcome Trust’s investments outshone its peers", "url": "https://www.ft.com/content/ac8f4216-39ea-477f-8082-5c70ad2256ab", "id_key": "cec2fd37efedd65ac2949c76e0cf060d79ab46cbc52283bbb062a9e10b661fa0", "summary": "Under outgoing chief investment officer Nick Moakes the foundation made just a handful of big investment calls", "ingested_utc": "2025-08-14T06:45:37Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FT_Home", "title": "UK economy grows 0.3% in second quarter", "url": "https://www.ft.com/content/4cc19d3c-9ae1-4671-aefd-84355f1950ec", "id_key": "9706ac334c227655d22386e1994e8857d4ca5ae4d57f0a7d554621cbb4a27d89", "summary": "Better than expected GDP figure comes as chancellor Rachel Reeves prepares for Autumn Budget", "ingested_utc": "2025-08-14T06:45:35Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Thursday briefing: ​How the colonial legacy has created a toxic beauty industry", "url": "https://www.theguardian.com/world/2025/aug/14/thursday-briefing-how-the-colonial-legacy-has-created-a-toxic-beauty-industry", "id_key": "75bc8ef3eb87be580b9f69acbe6ab2f512883b70021f2b181c4f79a26e1cd980", "summary": "In today’s newsletter: Doctors are sounding the alarm over a surge in cancers and irreversible skin damage linked to bleaching creams, as colourism continues to shape beauty ideals from Africa to Asia Good morning. The slogan “black is beautiful” rang out from civil rights marches in the US and UK during the 1960s and echoed through liberation struggles across the global south. It became a rallying cry against racist beauty standards that had long cast Black skin, facial features and hair as undesirable. These movements urged pride in what had been denigrated for centuries, and their message was not limited to people of African or Caribbean heritage. Calls to embrace natural beauty resonated across Asia and much of the global south, directly challenging the colonial belief that lighter skin conferred greater worth. Ukraine | Donald Trump told European leaders on Wednesday he would be seeking a ceasefire in Ukraine at his summit with Vladimir Putin on Friday and gave reassurances that he would not make any territorial concessions without Kyiv’s full involvement. UK news | David Lammy has referred himself to the environment watchdog after going fishing with JD Vance without the required licence during the US vice-president’s trip to the UK. Immigration | At least 20 people have died after a boat capsized off the southern Italian island of Lampedusa, a United Nations agency and local media reported on Wednesday. UK politics | Keir Starmer is to formally revive Northern Powerhouse Rail this autumn with an announcement expected before the Labour conference. Palestine | The United Nations special rapporteur for the occupied territories has warned that moves to recognise a Palestinian state should not distract member states from stopping mass death and starvation in Gaza. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Baby Shark song: South Korean court rejects US composer’s claim catchy tune was plagiarised", "url": "https://www.theguardian.com/world/2025/aug/14/baby-shark-song-south-korean-court-rejects-us-composers-claim-catchy-tune-was-plagiarised", "id_key": "16e2e1e1e8fb661cacf11bda572450904f926060adb2f998c0d2ec83c15c1edb", "summary": "Supreme court upholds ruling that there was insufficient evidence of copyright infringement on song that is YouTube’s most viewed video South Korea’s top court ruled on Thursday that the globally popular South Korean children’s song Baby Shark was not plagiarised, rejecting a copyright claim filed by a US-based composer. With its catchy lyrics, the Baby Shark Dance video is the most viewed on YouTube, with more than 16bn views, roughly double those of the runner-up, Despacito, and third-place Wheels on the Bus. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Australia news live: NSW man charged over alleged AI-generated child abuse material; Asic takes Mercer Super to court", "url": "https://www.theguardian.com/australia-news/live/2025/aug/14/news-live-australia-cybercrime-ev-electric-vehicle-road-tax-anthony-albanese-jim-chalmers-productivity-summit-ntwnfb", "id_key": "5a142aa2cec27a01d36946aa9ab2e6e8fac8e9990c1664a11fa5d6f7bcb40a4a", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Melburnians may have woken up to some light temblors early this morning after a small, 3.2 magnitude earthquake hit the Mornington Peninsula around 4.40am. Geoscience Australia said more than 500 people reported feeling the quake, stretching from Mornington to central Melbourne over to Geelong. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Childcare workers with ‘red flags’ should be on database to prevent them ‘shopping around’ for lax centres, inquiry told", "url": "https://www.theguardian.com/australia-news/2025/aug/14/childcare-workers-with-red-flags-should-be-on-database-to-prevent-them-shopping-around-for-lax-centres-inquiry-told", "id_key": "1519b5f80728a5d2742908268d7ae4202b6c788a4764c5c1ae8fa82d38ff7804", "summary": "Head of NSW police child sex abuse squad also advises parents to report concerns directly to police – not their childcare centre Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The head of the New South Wales police child sexual abuse squad has called for the creation of a national database of childcare workers who have had “red flags” raised that fall short of criminal prosecution. Giving evidence before a government inquiry into the early childhood education sector in NSW, Det Supt Linda Howlett said such a database would allow centres to share intelligence about former employees who have faced serious allegations that didn’t result in criminal charges. They are still allowed to work with children. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "David Stratton, esteemed Australian film critic, dies aged 85", "url": "https://www.theguardian.com/film/2025/aug/14/david-stratton-esteemed-australian-film-critic-dies-aged-85", "id_key": "2fb8ab53a3a2e732cdbcdbd8c393a1f16cbfa0ab0508b77956b2ba6d7bef9d3d", "summary": "The international cinema expert was beloved for his film reviews, particularly on television with Margaret Pomeranz David Stratton’s closing credits: ‘I’ve done the best I could’ David Stratton on a life reviewing films – and the one TV show he thinks is ‘pretty damn good’ David Stratton, the revered Australian film critic and beloved co-host of television programs The Movie Show and At The Movies with fellow critic Margaret Pomeranz, has died aged 85. Stratton died in hospital near his home in the Blue Mountains, his family confirmed in a statement to the ABC . Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "‘Footie players in town and want bags’: pilot who flew for Outback Wrangler denies supplying cocaine, court hears", "url": "https://www.theguardian.com/australia-news/2025/aug/14/pilot-who-flew-for-outback-wrangler-denies-supplying-cocaine-court-ntwnfb", "id_key": "ed32f7e1b76b43d9cae3d4ff1161555dafe21efcf7f4b1f67c99694193755478", "summary": "Text messages from Sebastian Robinson’s phone were read out in Darwin’s supreme court, detailing regular exchanges about the alleged supply of cocaine Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A pilot who was critically injured in a deadly helicopter crash has been grilled over his cocaine use when he flew for the reality TV star Matt Wright. Sebastian Robinson was left a paraplegic after the February 2022 crash that killed Outback Wrangler co-star Chris “Willow” Wilson in Arnhem Land in the Northern Territory. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Keir Starmer to meet Volodymyr Zelenskyy in Downing Street", "url": "https://www.theguardian.com/world/2025/aug/14/keir-starmer-to-meet-volodymyr-zelenskyy-in-downing-street", "id_key": "58040533c1f3016e664e3db66f0620b4a8a54eddc7547f5abb2f592fdf19c9f6", "summary": "London meeting comes as PM says Britain ready to ‘increase pressure’ on Moscow with further sanctions Keir Starmer will be joined by the Ukrainian president at Downing Street on Thursday morning, as Europe braces for the outcome of Donald Trump’s face-to-face discussions with his Russian counterpart later this week. The UK prime minister’s meeting with Volodymyr Zelenskyy comes after he said Britain stood ready to “increase pressure” on Russia if necessary. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Anchorage abuzz ahead of Trump-Putin summit – but ‘please don’t sell us back’", "url": "https://www.theguardian.com/us-news/2025/aug/14/anchorage-alaska-trump-putin-summit", "id_key": "53b68724877e0752048f89350b981b750baac5784259191d7d2280760eb784af", "summary": "Residents torn between excitement over high-profile visit and trepidation over what US-Russian leaders might agree It is set to be one of the last good summer weekends in Anchorage, Alaska – the peak of the salmon run and the middle of berry season – and residents hope that Friday’s summit between Donald Trump and Vladimir Putin isn’t going to ruin it for them. “I’m looking forward to taking my boat out on the water at Prince William Sound – that’s my plan,” said Andy Moderow, who works at a conservation nonprofit in Anchorage. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "‘No country is safe’: deadly Nordic heatwave supercharged by climate crisis, scientists say", "url": "https://www.theguardian.com/environment/2025/aug/14/nordic-heatwave-climate-crisis-sweden-norway-finland", "id_key": "53937a85e243aca412a3225cc36bd069ef1ef32e5c2494fc728aa99fb7ba2cca", "summary": "Historically cool nations saw hospitals overheating and surge in drownings, wildfires and toxic algal blooms The prolonged Nordic heatwave in July was supercharged by the climate crisis and shows “no country is safe from climate change”, scientists say. Norway, Sweden and Finland have historically cool climates but were hit by soaring temperatures, including a record run of 22 days above 30C (86C) in Finland. Sweden endured 10 straight days of “tropical nights”, when temperatures did not fall below 20C (68F). Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Staying cool in Europe’s record-breaking heat – podcast", "url": "https://www.theguardian.com/science/audio/2025/aug/14/staying-cool-in-europes-record-breaking-heat-podcast", "id_key": "b0fdbbfcf7dbbe9d19c584b51dbce99cb9492a434632bb12e6788956807329dc", "summary": "Europe is suffering from another heatwave as deadly temperatures of up to 44C hit the continent and wildfires blazed across the Mediterranean. To find out why Europe is heating faster than anywhere else, Madeleine Finlay speaks to the Guardian’s Europe environment correspondent, Ajit Niranjan, and to Adam Taylor, professor of anatomy at Lancaster University, to find out how we can try to stay cool as the temperature rises Clips: ITV News, France 24 Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "As Ukraine battles to hold lines, Trump may find Putin difficult to persuade", "url": "https://www.theguardian.com/world/2025/aug/14/as-ukraine-battles-to-hold-lines-trump-may-find-putin-difficult-to-persuade", "id_key": "bc3c2a940ea3e05652483e8a31c7d211c59c138a1cb9069b429b084dc0bb733c", "summary": "Despite huge numbers of casualties, Russian leader believes he is slowly winning war – so he can afford to string talks out For Ukraine, the break in the frontline is unfortunately timed. Lightly armed Russian saboteur groups – three on one count – cut though Ukrainian positions in the Donbas countryside east of the key junction at Dobropillia. Though one group has been eliminated, as of Tuesday two were thought to remain at large – and although their numbers are small for now, perhaps 20 to 30, the breach is significant. At the beginning of the year it was safe to visit Dobropillia, which had become a bustling market centre busy with soldiers and locals, nearly 15 miles north of the frontline in Pokrovsk. But since then the town, where once busy supply roads from Pokrovsk to Kramatorsk split, has come under sustained attack with glide bombs, while FPV (first person view) drones strike targets on the move. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Israeli airstrikes on Tehran killed inmates in ‘apparent war crime’ – report", "url": "https://www.theguardian.com/world/2025/aug/14/israeli-airstrikes-tehran-war-crime", "id_key": "566dcce5c8b895f6d5c82c2eadf431dc01a1cca916e4bf34e493dd47a7495e9b", "summary": "Human Rights Watch also finds that Iran abused survivors of June attack, which killed 80 people Israeli airstrikes on Tehran’s Evin prison in June killed scores of detainees, visitors and staff in what Human Rights Watch (HRW) has called an “apparent war crime”. Iranian authorities have since subjected survivors to abuse, enforced disappearances and inhumane detention conditions, the rights group said on Wednesday. HRW’s investigation, based on satellite imagery, videos and witness accounts, found the 23 June Israeli airstrikes destroyed visitation halls, prison wards, the central kitchen, the medical clinic and administrative offices. No evident military targets were identified in the facility, which held more than 1,500 prisoners at the time, many of whom had been jailed for peaceful activism. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "London museum tells forgotten story of African and Indian troops in second world war", "url": "https://www.theguardian.com/artanddesign/2025/aug/14/london-museum-african-indian-troops-world-war-two-beyond-burma-forgotten-armies", "id_key": "a4905225ebaf267d554fc496eeaa686fc428e8c10cbce1b49eae485fe97125dd", "summary": "National Army Museum’s Beyond Burma exhibition examines stories of soldiers from Britain’s colonies The forgotten story of African and Indian troops who fought in south Asia against Japanese forces during the second world war and who have largely been omitted from the official history is to be brought to life in a London exhibition. The National Army Museum’s Beyond Burma: Forgotten Armies show includes rare items from Indian and African soldiers who toiled in some of the harshest conditions seen anywhere during the conflict. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "‘Censorship’: over 115 scholars condemn cancellation of Harvard journal issue on Palestine", "url": "https://www.theguardian.com/education/2025/aug/14/harvard-journal-israel-gaza-cancellation", "id_key": "36a4f6205cb6f5fe925bea56de5424e4f20bcc248be0d1f4aeff0c0d016b0c6a", "summary": "In an open letter, writers denounced abrupt scrapping of a Harvard Educational Review issue dedicated to Palestine More than 115 education scholars have condemned the cancellation of an entire issue of an academic journal dedicated to Palestine by a Harvard University publisher as “censorship”. In an open letter published on Thursday, the scholars denounced the abrupt scrapping of a special issue of the Harvard Educational Review – which was first revealed by the Guardian in July – as an “attempt to silence the academic examination of the genocide, starvation and dehumanisation of Palestinian people by the state of Israel and its allies.” Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Father of New Zealand woman held in US by Ice along with six-year-old son voices hope for release", "url": "https://www.theguardian.com/world/2025/aug/14/father-of-new-zealand-woman-held-in-us-by-ice-along-with-six-year-old-son-voices-hope-for-release-ntwnfb", "id_key": "b76a8f86ed04821ac2ce39ac9372c3b2d9faf929df576e13cce6c6d952b66d2e", "summary": "Rod Price recounts ‘frantic’ call he received from Sarah Shaw after her detention at US border while returning from Canada The father of a New Zealand woman who has been held in a US immigration detention centre for three weeks with her six-year-old son is hopeful the pair will be released by the end of the week. US Immigration and Customs Enforcement (Ice) detained Sarah Shaw and her youngest son after they attempted to re-enter the US from Canada on 24 July. Continue reading...", "ingested_utc": "2025-08-14T06:45:29Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "UK economy posts surprise 0.3% growth in three months to June", "url": "https://www.theguardian.com/business/2025/aug/14/uk-economy-avoids-flatlining-slowdown-tax-rises-trump-trade-war", "id_key": "339b97d2e70e3e7b685b12469e1d4ad2dda58964715eda88cf2a0c9597006d16", "summary": "GDP figure slower than previous quarter but beats expectations thanks to 0.4% expansion last month The UK economy grew at a faster rate than expected in the second quarter, official figures show, despite a slowdown from a strong start to the year amid pressure from tax increases and Donald Trump’s global trade war. Figures from the Office for National Statistics showed growth in gross domestic product (GDP) slowed to 0.3% in the three months to the end of June, down from a rate of 0.7% in the first quarter. Continue reading...", "ingested_utc": "2025-08-14T06:45:28Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Drop in new properties for rent is steepest since Covid, says Rics", "url": "https://www.theguardian.com/money/2025/aug/14/drop-new-properties-rent-steepest-covid-says-rics-prices", "id_key": "a533d7ddfeaaf1b54050295ec5a3c1487c75b4cdcf7bb5b6664c562a0a212df3", "summary": "Monthly report from surveyors’ body sees ‘firmly negative trend’ that is expected to push up rental prices The flow of new rental properties coming on to the market has fallen at the fastest rate since the first Covid lockdown five years ago, according to research by Britain’s property surveyors. Although the demand for properties is steady, there are fewer new rentals from landlords coming available, the Royal Institution of Chartered Surveyors (Rics) found. Continue reading...", "ingested_utc": "2025-08-14T06:45:28Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "StubHub allowed prolific tout to list 300 tickets for sold-out Lewis Capaldi show", "url": "https://www.theguardian.com/business/2025/aug/14/stubhub-allowed-prolific-tout-to-list-300-tickets-for-sold-out-lewis-capaldi-show", "id_key": "7c75b06c6f1b0411d4f328678802cce0adb2e721cd7b886580b87f53af849fd1", "summary": "Expert says ‘reason to suspect industrial-scale criminality’ as TGCES lists 306 Sheffield tickets for up to £248 each The ticket resale website StubHub may have failed to prevent breaches of consumer law on its platform when it allowed a prolific tout to advertise more than 300 tickets for a Lewis Capaldi concert, experts have said. StubHub and fellow secondary ticketing platform Viagogo are under intense scrutiny from ministers, who are considering whether to ban for-profit ticket resale in an effort to protect fans. Continue reading...", "ingested_utc": "2025-08-14T06:45:28Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "How Israel used Microsoft technology to spy on Palestinians – podcast", "url": "https://www.theguardian.com/news/audio/2025/aug/14/how-israel-used-microsoft-technology-to-spy-on-palestinians-podcast", "id_key": "cace4009aa70574b0239e2531b24afa56c1bd30f7c9b08058879efb3e276716d", "summary": "Harry Davies on how Microsoft’s cloud was used to facilitate mass surveillance of Palestinians Yossi Sariel was in charge of one of the branches of Israel’s intelligence agency. When he took over Unit 8200 he arrived with ambitious plans – to use tech to change the way intelligence was gathered and analysed. The Guardian’s Harry Davies tells Nosheen Iqbal about an investigation he carried out with Yuval Abraham, the Israeli-Palestinian publication +972 magazine and the Hebrew-language outlet Local Call . It found Sariel had a plan to transfer large amounts of Unit 8200’s data, including top-secret information, into Microsoft’s cloud platform, which is called Azure. Having this much data storage would allow Sariel to fulfil his plans to carry out mass surveillance on Palestinians in the West Bank and Gaza. Continue reading...", "ingested_utc": "2025-08-14T06:45:28Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "BBC_World", "title": "Rain warning delays landmark trial of Hong Kong's rebel mogul Jimmy Lai", "url": "https://www.bbc.com/news/articles/cgm2z7497yko?at_medium=RSS&at_campaign=rss", "id_key": "4b43dfa9623a002f3178b12156d80cc309344f78100d93937855851b125a1a85", "summary": "Lai is accused of colluding with foreign forces under a Beijing-imposed national security law.", "ingested_utc": "2025-08-14T06:45:25Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "BBC_World", "title": "Taylor Swift gushes over 'good kind of crazy' boyfriend Travis Kelce", "url": "https://www.bbc.com/news/articles/cedv5dy9v8lo?at_medium=RSS&at_campaign=rss", "id_key": "42498956f05210ace46f59e146891815ef8e2ee84293f0a7c35b090e307ef2da", "summary": "The pop superstar gives a rare insight into their life together and reveals details of her new album.", "ingested_utc": "2025-08-14T06:45:25Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Decrypt", "title": "Justin Sun Sues Bloomberg Over Plans to Publish 'Confidential' Crypto Holdings", "url": "https://decrypt.co/335165/justin-sun-sues-bloomberg-plans-publish-confidential-crypto-holdings", "id_key": "579999006a707c4589ee808333fd26c4ed8fd66bb8bf72f9bd307d13f7b8a741", "summary": "The lawsuit alleges publishing Sun’s crypto details would put him at “significant and imminent risk\" of theft, hacking or kidnapping.", "ingested_utc": "2025-08-14T06:45:08Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Decrypt", "title": "Ethereum ETF Inflows Outperform Bitcoin for the Third Day Straight", "url": "https://decrypt.co/335154/ethereum-etf-inflows-outperform-bitcoin-for-the-third-day-straight", "id_key": "1f70508d4e02934c276191552c2391e48a3c8e9111ebd275ddb393824309891d", "summary": "Ethereum ETFs are attracting record institutional inflows, narrowing the gap with Bitcoin and intensifying upward price pressure.", "ingested_utc": "2025-08-14T06:45:08Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Decrypt", "title": "Crypto Market Conditions ‘Exceptionally Strong’ as Bitcoin, Ethereum, XRP Advance", "url": "https://decrypt.co/335152/crypto-market-exceptionally-strong-bitcoin-ethereum-xrp", "id_key": "8e2e8bd78faa1ad870976cfb399662f3a0b0344913db617f94e57be621a68a9e", "summary": "Bitcoin’s record run underscores strong market underpinnings, though some warn optimism over Fed easing may be premature.", "ingested_utc": "2025-08-14T06:45:08Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Decrypt", "title": "Estonian Banker's Lost Ethereum Wallet Now Holds Over $1 Billion in ETH", "url": "https://decrypt.co/335150/estonian-bankers-lost-ethereum-wallet-now-holds-over-1-billion-in-eth", "id_key": "ced88c11a86d5923961c0149389a6d216b3286150aba87a03f808973209e22b5", "summary": "Two years after Rain Lõhmus admitted he lost access to a presale wallet, the stash is now worth over a billion, at least on paper.", "ingested_utc": "2025-08-14T06:45:08Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Cointelegraph", "title": "Ethereum is the ‘biggest macro trade’ for next 10-15 years: Fundstrat", "url": "https://cointelegraph.com/news/ethereum-the-biggest-macro-trade-over-the-next-10-15-years-fundstrat", "id_key": "a10fa5318b406361ea631f6b30c19ed83f85b7cfac8e2af2bd86909ac9d4afe7", "summary": "Fundstrat has forecasted a five-figure price range of $12,000 to $15,000 for Ether by the end of this year, as it has “plenty of upside.”", "ingested_utc": "2025-08-14T06:45:07Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Cointelegraph", "title": "AI agents will become Ethereum&#039;s ‘biggest power user,’ Coinbase devs say", "url": "https://cointelegraph.com/news/ai-agents-ethereums-biggest-power-user", "id_key": "81862f4cb01c65250e1a59e7792308c8cebe60d69c27a1b69e70f4ba60de5da9", "summary": "Ethereum’s future will be dominated by AI agents leveraging a once-dormant web standard to make real-world payments in crypto without human input, two Coinbase devs said.", "ingested_utc": "2025-08-14T06:45:07Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Cointelegraph", "title": "Bitcoin will either ‘Godzilla’ up or drop on ‘alt mania,’ Samson Mow says", "url": "https://cointelegraph.com/news/bitcoin-will-godzilla-up-or-sell-off-as-alt-mania-peaks-samson-mow", "id_key": "57869933629062c7afdd97f3fd27e7f176ba2dd7f8d83db1dfebd85e5080f228", "summary": "Bitcoin hit a new peak of $124,500 and now has two possible paths ahead, according to Bitcoin OG Samson Mow.", "ingested_utc": "2025-08-14T06:45:07Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Cointelegraph", "title": "Chainlink&#039;s back: LINK up 44% as traders eye ‘round 2’ rally", "url": "https://cointelegraph.com/news/chainlink-link-price-rally-crypto-analysts-speculate-next-move", "id_key": "32154a0ae2754b4a5a4322ddee4a20c1ab8e0ef0a5ca44bf6920bdbdd3206c5b", "summary": "A crypto trader says Chainlink may be “the most obvious large cap play for this cycle” that most people will miss.", "ingested_utc": "2025-08-14T06:45:07Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Cointelegraph", "title": "Trump Jr.-tied firm raises $50M for crypto, mining as Bitcoin peaks", "url": "https://cointelegraph.com/news/trump-jr-tied-firm-raises-50m-crypto-buys-mining-rigs", "id_key": "e20b2f3e9da052aad0ce0005791e77163df1e105db2f3bbad8a8ea8544bd0ed2", "summary": "Thumzup, a social marketing firm in which Donald Trump Jr. holds shares, will spend $50 million to buy crypto and mining rigs.", "ingested_utc": "2025-08-14T06:45:07Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Cointelegraph", "title": "Someone counter-hacked a North Korean IT worker: Here’s what they found", "url": "https://cointelegraph.com/news/someone-counter-hacked-a-north-korean-it-worker-here-s-what-they-found", "id_key": "9f14c124ce8d4921e892bd69d69785fbb06ba0aebf246bf2d3d93ec0beac818a", "summary": "A team of North Korean IT operatives behind 31 fake identities has been linked to the $680,000 hack of fan-token marketplace Favrr in June.", "ingested_utc": "2025-08-14T06:45:07Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CoinDesk", "title": "DOGE Jumps 7% on $200M Whale Buys as Futures Bets Top $3B", "url": "https://www.coindesk.com/markets/2025/08/14/doge-jumps-7-on-usd200m-whale-buys-as-futures-bets-top-usd3b", "id_key": "0b222b934972b575ea214ca3ab0fcc89ea868c87f6738be3f32d6171d379c424", "summary": "", "ingested_utc": "2025-08-14T06:45:06Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CoinDesk", "title": "Who is Cashing Out of Bitcoin at Record Highs Above $120K?", "url": "https://www.coindesk.com/markets/2025/08/14/who-is-cashing-out-of-bitcoin-at-record-highs-above-usd120k", "id_key": "e99ed5d07340bbcf54e69a45efb17947337bd40107597113e4c031100acbe93b", "summary": "", "ingested_utc": "2025-08-14T06:45:06Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CoinDesk", "title": "Coinbase Loses $300K in MEV Exploit After Misstep With 0x Swapper Contract", "url": "https://www.coindesk.com/markets/2025/08/14/coinbase-loses-usd300k-in-mev-exploit-after-misstep-with-0x-swapper-contract", "id_key": "a141161197f2488d1dd8087cd7807e4509d2f1f5033d2467d9a119728305a5bf", "summary": "", "ingested_utc": "2025-08-14T06:45:06Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CoinDesk", "title": "XRP Breaks Key Resistance After Ripple-SEC Win — Is $8 Next?", "url": "https://www.coindesk.com/markets/2025/08/14/xrp-breaks-key-resistance-after-ripple-sec-win-is-usd8-next", "id_key": "f57682fc270f26a54be0c99adb40abbf74eb60381f862b975bd4ece9f0a59f0b", "summary": "", "ingested_utc": "2025-08-14T06:45:06Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CoinDesk", "title": "Bitcoin Crosses Google to Become Fifth-Largest Asset as Fed Rate Cut Bets Rise", "url": "https://www.coindesk.com/markets/2025/08/14/bitcoin-crosses-google-to-become-fifth-largest-asset-as-fed-rate-cut-bets-rise", "id_key": "94112b48ea9740406ff32b384043e87e8d14d0e92b514ba65bcb5deac5b56450", "summary": "", "ingested_utc": "2025-08-14T06:45:06Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "ESMA publishes data for quarterly bond liquidity assessment", "url": "https://www.esma.europa.eu/press-news/esma-news/esma-publishes-data-quarterly-bond-liquidity-assessment-0", "id_key": "39340e9e0d18504df37a83008433fff3278d3377548bff6d57a5ecbb1576a394", "summary": "ESMA publishes data for quarterly bond liquidity assessment 01 August 2025 Market data Trading The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, has today published the new quarterly liquidity assessment of bonds . As indicated in the public statement of 27 March 2024, the quarterly liquidity assessment of bonds will continue to be published by ESMA. Further details are provided on the relevant webpages of the calculations. Bonds quarterly liquidity assessment ESMA has published the latest quarterly liquidity assessment for bonds available for trading on EU trading venues. For this period, there are currently 1,346 liquid bonds subject to MiFID II transparency requirements. ESMA’s liquidity assessment for bonds is based on a quarterly assessment of quantitative liquidity criteria, which includes the daily average trading activity (trades and notional amount) and the percentage of days traded per quarter. ESMA updates the bond market liquidity assessments quarterly. However, additional data and corrections submitted to ESMA may result in further updates within each quarter, published in ESMA’s Financial Instruments Transparency System (FITRS) , which shall be applicable the day following publication . The full list of assessed bonds is now available through FITRS in the XML files with publication date from 1 August 2025 ( see here ) and through the Register web interface ( see here ). ESMA also publishes two completeness indicators related to bond liquidity data. The transparency requirements for bonds deemed liquid today will apply from 18 August to 16 November 202 5. The application dates reflect the provisions of the RTS 2 ( see the news item for more details).", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "ESMA prepares for switch toward single volume cap in October 2025", "url": "https://www.esma.europa.eu/press-news/esma-news/esma-prepares-switch-toward-single-volume-cap-october-2025", "id_key": "52889ced1ac906a707031b036b2a27e56fd5d011d043e830f8079804d9a2b67a", "summary": "ESMA prepares for switch toward single volume cap in October 2025 24 July 2025 Market data Trading The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, announced today the update of the volume cap system, that will pass from the previous double volume cap mechanism (DVCM) to a “single” volume cap mechanism (VCM) in October, according to the changes introduced by the Markets in Financial Instruments Regulation Review (MiFIR Review). The new VCM limits at 7% the trading volume under the reference price waiver in the EU, compared to the total aggregated trading volume in the EU over the last 12 months for each equity and equity-like financial instrument. If the limit is exceeded, trading venues will need to suspend the use of the waiver for the concerned instrument for a period of three months. Trading venues must base their decision to suspend the waiver use on the data published by ESMA under the dedicated VCM webpage. Technical reporting changes To reduce reporting burden of entities, the future VCM calculations will be based on transaction reporting data collected by National Competent Authorities (NCAs). Therefore, the DVCM reporting system will be decommissioned in January 2026. To reflect these changes, ESMA has submitted for adoption the amendment to the Regulatory Technical Standard 3 (RTS 3). Even in case the RTS 3 revision is not yet in place at that moment, the VCM switch will occur at the announced date. ESMA is currently preparing the new VCM data system. For more details about the formats and templates, please consult the dedicated VCM webpage. Next steps ESMA encourages all interested parties to prepare for the change in requirements in line with the new VCM becoming active in Q4 2025. The first publication of the calculation results is expected for 9 October 2025. Further information: Cristina Bonillo Olivares Senior Communications Officer press@esma.europa.eu", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "New Q&As available", "url": "https://www.esma.europa.eu/press-news/esma-news/new-qas-available-23", "id_key": "931e83b3e6c3137771ffc1d1b5195c9a2eb35638b3a79dc7589d98727d0d5ede", "summary": "New Q&As available 18 July 2025 Digital Finance and Innovation Fund Management The European Securities and Markets Authority (ESMA), the EU's securities markets regulator, has published or updated the following Questions and Answers: Markets in Crypto-Assets Regulation (MiCA) Staking on own account (2607) Pre-funding clients’ orders with clients’ crypto-assets (2608) Undertakings for Collective Investment in Transferable Securities Directive (UCITS) Performance fees for feeder funds (2609) ▸ Questions and Answers section", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "ESMA publishes latest edition of its newsletter", "url": "https://www.esma.europa.eu/press-news/esma-news/esma-publishes-latest-edition-its-newsletter-39", "id_key": "2c328f8a2f7cfc355da3031bec86bed769d6df69981782fbcb50462d52fa280c", "summary": "ESMA publishes latest edition of its newsletter 18 July 2025 ESMA newsletter The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, has today published its latest edition of the Spotlight on Markets Newsletter. Your one-stop-shop in the world of EU financial markets in its June and July edition highlights our efforts towards streamlining financial transaction reporting. We are gathering feedback on how to simplify financial reporting and funds’ data reporting . Moving to the crypto area, ESMA identified opportunities to strengthen MiCA authorisation. The latest Peer Review analysed the approaches adopted by the Malta Financial Services Authority (MFSA). While there is overall a good level of supervisory engagement within the authority, we underlined certain areas for improvement. Moreover, the thematic notes outline four guiding principles on making sustainability claims used in non-regulatory communications. It also offers practical do’s and don’ts, illustrated through concrete examples of good and poor practices, based on observed market practices. In the course of 2023 and 2024, ESMA, together with the National Competent Authorities (NCAs), carried out the Common Supervisory Action (CSA) on the integration of sustainability risks and disclosures in the investment management sector. The level of compliance with the framework on the integration of sustainability risks and disclosures is overall satisfactory, but there remain opportunities for improvement. Other key publications: Ediphy (fairCT) to become the first Consolidated Tape Provider for bonds Advice on eligible assets for UCITS Report on the functioning and review of the DLT Pilot Regime Final report on the active account requirement under EMIR 3 Advice and recommendations to streamline prospectuses Statement warning investors of the risk when CASPs offer both regulated and unregulated products Final Report on the Guidelines for the criteria on the assessment of knowledge and competence under the MiCA The newsletter also features an overview of open consultations. For updates, follow us on LinkedIn and X . 18/07/2025 ESMA Newsletter Newsletter June and July 2025", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "ESAs publish a guide on DORA Oversight activities", "url": "https://www.esma.europa.eu/press-news/esma-news/esas-publish-guide-dora-oversight-activities", "id_key": "0bc8fab2a5ca7f3042eda7e48a0b966651fc46bd5a3d9ee17446ab000948004a", "summary": "ESAs publish a guide on DORA Oversight activities 15 July 2025 Digital Finance and Innovation Joint Committee The European Supervisory Authorities (EBA, EIOPA, ESMA – the ESAs) today published a guide on oversight activities under the Digital Operational Resilience Act (DORA). The aim of this guide is to provide an overview of the processes used by the ESAs through the Joint Examination Teams (JET) to oversee critical Information and communication technology (ICT) third party service providers (CTPPs). This guide provides high-level explanations to external stakeholders regarding the CTPP Oversight framework. Furthermore, it provides an overview of the governance structure, the oversight processes, the founding principles and the tools available to the overseers. However, the guide is not a legally binding document and does not replace the legal requirements laid down in the relevant applicable EU law. The ESAs invite the public, financial entities and, crucially, third-party providers to use this document to prepare for the oversight implementation. Additional information on the oversight implementation: For more information on the implementation of the DORA Oversight framework, please refer to this presentation . Further information: Cristina Bonillo Olivares Senior Communications Officer press@esma.europa.eu 15/07/2025 JC 2025 29 DORA Guide on oversight activities", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "Knowledge and competence of staff providing information on crypto-assets – ESMA criteria published", "url": "https://www.esma.europa.eu/press-news/esma-news/knowledge-and-competence-staff-providing-information-crypto-assets-esma", "id_key": "c50f81a9e474c5ec8b04cd0326c07a1d9454a1eae3923fa2fcacc002f39ab859", "summary": "Knowledge and competence of staff providing information on crypto-assets – ESMA criteria published 11 July 2025 Digital Finance and Innovation Guidelines and Technical standards The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, has published today the guidelines specifying the criteria for assessing the knowledge and competence of staff at crypto-asset service providers (CASPs) who provide information or advice on crypto-assets and services under the Markets in Crypto-Assets Regulation (MiCA). Concretely, the document: provides guidance on the minimum level of knowledge and competence of staff through examples (including on professional qualification and appropriate experience for the provision of information or advice); and addresses specific features and risks of crypto-assets markets and services (e.g. high volatility of crypto-assets and cyber security risks) through the criteria for the assessment of the relevant staff’s knowledge and competence. The guidelines will help CASPs to meet their obligations and act in the best interest of their clients. They also support competent authorities in adequately assessing how CASPs meet these obligations. The objective is to enhance investor protection and trust in the crypto-asset markets. ESMA conducted a public consultation on these guidelines to gather the views of stakeholders, including the Securities and Markets Stakeholder Group (SMSG). The final report includes feedback to the comments received during the consultation. Next steps The guidelines will be translated into all EU languages and published on ESMA’s website. They will start applying six months after that publication. Within two months of the date of publication of the guidelines on ESMA’s website in all EU official languages, competent authorities to which these guidelines apply must notify ESMA whether they comply, do not comply, but intend to comply, or do not comply and do not intend to comply with the guidelines. Further information: Cristina Bonillo Olivares Senior Communications Officer press@esma.europa.eu 11/07/2025 ESMA35-1872330276-2380 Final Report on the Guidelines for the criteria on the assessment of knowledge and competence under MiCA", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "Investors should consider risks of unregulated products offered by regulated crypto assets entities", "url": "https://www.esma.europa.eu/press-news/esma-news/investors-should-consider-risks-unregulated-products-offered-regulated-crypto", "id_key": "6fe345eb940c489e49e221424bef8cf5dc3a6d7cb9a4c2ffda05b08076f130b0", "summary": "Investors should consider risks of unregulated products offered by regulated crypto assets entities 11 July 2025 Digital Finance and Innovation Investor protection The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, issued today a public statement warning investors of the ‘halo effect’ that can lead to overlooking risk when authorised crypto-asset service providers (CASP’s) offer both regulated and unregulated products and/or services. The statement also reminds CASPs of the issues that they should consider when providing unregulated products and services, recommending that they should be particularly vigilant about avoiding any client confusion regarding the protections attached to unregulated products and/or services. To avoid any misunderstanding CASPs should clearly communicate the regulatory status of each product or service in all client interactions and at every stage of the sales process. In addition, ESMA reminds crypto-assets entities of their obligation to act fairly, professionally and in the best interests of their clients, ensuring that all information, including marketing communications, is fair, clear and not misleading. Further information: Cristina Bonillo Olivares Senior Communications Officer press@esma.europa.eu 11/07/2025 ESMA35-1872330276-2329 Statement on Avoiding Misperceptions: Guidance for Crypto-Asset Service Providers Offering Unregulated Services", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "ESMA identifies future and potential data contributors for the equity CTP", "url": "https://www.esma.europa.eu/press-news/esma-news/esma-identifies-future-and-potential-data-contributors-equity-ctp", "id_key": "ea3afd2c8b4e4cba3245e67d3c0e8db20f2c1c84b92da4e762df6aabba7e2460", "summary": "ESMA identifies future and potential data contributors for the equity CTP 10 July 2025 Trading The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, has published today the list of data contributors to the equity Consolidated Tape Provider (CTP), based on the transaction reporting data collected. The list also includes trading venues that can choose to transmit data to the equity CTP and opt-in to the mandatory data contribution regime. As specified in the Market in Financial Instruments Regulation (MiFIR) the trading venues opting-in will need to contribute data to the CTP within 30 days from the notification to ESMA. ESMA will immediately update the list once a trading venue starts or ends operations and when a trading venue decides to voluntary opt-in. Next steps The entities that decide to opt-in will communicate their decision to ESMA, at the following email address: secondary-markets@esma.europa.eu . Additionally, they will notify to their National Competent Authority (NCA). The next publication of the list will be in January 2026. Background According to MiFIR, ESMA must publish on its website and keep up to date a list identifying: investment firms operating small and medium enterprises (SME) growth markets and market operators that are mandated to contribute data to the CTP, investment firms that are not obliged to contribute but can opt-in to the mandatory regime, and investment firms that decided to opt-in. Not all trading venues will be required to contribute data to the equity CTP, once it will be established. Specifically, smaller trading venues that either do not belong to a large group or have a high concentration of instruments first listed on their platforms are not obligated to submit data to the CTP, unless they choose to participate in the regime. Further information: Cristina Bonillo Olivares Senior Communications Officer press@esma.europa.eu 06/08/2025 ESMA74-276584410-11027 List of data contributors to the equity CTP", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "ESMA identifies opportunities to strengthen MiCA authorisations", "url": "https://www.esma.europa.eu/press-news/esma-news/esma-identifies-opportunities-strengthen-mica-authorisations", "id_key": "9a84f6454f5736ca8703fd07c3d7ebbbb1ce59e6dc1395f550ec852a3a0b534c", "summary": "ESMA identifies opportunities to strengthen MiCA authorisations 10 July 2025 Digital Finance and Innovation Supervisory convergence The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, published today the results of a peer review looking at the authorisation of Crypto Asset Service Providers (CASPs) in Malta under the Market in Crypto Assets Regulation (MICA). The peer review analyses the approaches adopted by the Malta Financial Services Authority (MFSA) in the authorisation and early supervision of a CASP and provides recommendations to strengthen these processes. It identifies overall a good level of resources and supervisory engagement within the authority, with some areas for improvement related to the assessment of authorisations. Key findings: Some material issues where not fully resolved when MFSA granted the CASP authorisation; Some risks areas were not adequately assessed during the authorisation process; The MFSA has demonstrated a good level of expertise and supervisory cooperation. The peer review also recommends to all NCAs currently in the process of authorising CASPs to pay particular attention to certain areas of risk, including business growth, conflicts of interests, governance and intragroup arrangements, ICT architecture, Web3, decentralised products, and the promotion of unregulated services. While focused on an individual case, the review aims to foster the sound authorisation of CASPs by all NCAs in the EU. Its conclusions should be on-boarded by all NCAs to ensure that the authorisations they grant are well assessed in this new and high-risk sector, where supervisory knowledge is still being built. This exercise is also an opportunity to reinforce EU supervisors’ role as gatekeepers of the EU single market in the crypto space. Next steps The objective of peer reviews is to enhance convergence and harmonisation in the process across the EU, and the NCAs are expected to integrate the recommendations in their internal processes, as well as in their on-going and future authorisations. ESMA will continue promoting further discussion on the recommendations and cross border cooperation. Further information: Cristina Bonillo Olivares Senior Communications Officer press@esma.europa.eu 10/07/2025 ESMA42-2004696504-8164 Fast-track peer review on a CASP authorisation and supervision in Malta", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ESMA_News", "title": "ESMA publishes its first Climate Transition Plan", "url": "https://www.esma.europa.eu/press-news/esma-news/esma-publishes-its-first-climate-transition-plan", "id_key": "6b293e1d1abc156ce38cf66a0d5c41354753f7f1d56fd9ae3ed3ece803371541", "summary": "ESMA publishes its first Climate Transition Plan 08 July 2025 About ESMA The European Securities and Markets Authority (ESMA), the EU’s financial markets regulator and supervisor, published today its first Climate Transition Plan , an important milestone in aligning ESMA’s own operations with the European Union climate objectives. Under this plan, and in line with the Paris Agreement, ESMA commits to reducing its gross greenhouse gas (GHG) emissions by 15.4% in 2027 and 31.4% in 2030, compared to 2023. Through the implementation of the Climate Transition Plan, ESMA aims to reduce the carbon footprint of its operations, particularly in relation to staff business travel, energy use, and food consumption. In the short term, progress towards this goal will be achieved through: introduction of an annual GHG budget to manage emissions from air travel, optimising floor occupancy during certain periods of the year to reduce energy consumption, and implementing incentives to shift to lower-carbon practices in the purchase of goods and services. This first plan has been put in place with the data currently available. It will be regularly reviewed, adapted, and improved. Next steps ESMA will implement decarbonisation levers and measures identified under this Climate Transition Plan and will report on the progress achieved annually, via its Annual Report and its Environmental Statement. Further information: Cristina Bonillo Olivares Senior Communications Officer press@esma.europa.eu 08/07/2025 ESMA36-1079078717-2989 Transition Plan to mitigate climate change impacts of ESMA's own operations", "ingested_utc": "2025-08-14T06:45:05Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "Beware car finance scam calls, FCA warns", "url": "https://www.fca.org.uk/news/news-stories/beware-car-finance-scam-calls-fca-warns", "id_key": "e9879f48e584b253be98a1953df67d15e08c4b228d11a6d87f3042dc3ffba550", "summary": "Scammers are pretending to be car finance lenders and falsely claiming that people are owed compensation. Following our announcement that we’ll consult on a potential car finance compensation scheme, we've received reports of scammers contacting people.These fraudsters are asking individuals for personal information including their name, address, date of birth and bank details. They then falsely claim that these people are owed compensation.It's important to remember:There's no car finance compensation scheme in place yet.Car finance lenders are not yet contacting customers about compensation.How to protect yourselfIf you receive a call like this, hang up immediately and do not share any information.Report scam calls and texts to Ofcom by forwarding them to 7726. More information on how to do this is available on Ofcom’s website.Find out how to protect yourself from scams.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "Leveraging the non-bank sector – in good times and bad", "url": "https://www.fca.org.uk/news/blogs/leveraging-non-bank-sector-good-times-and-bad", "id_key": "8eb7ca5a19b1b92a14df4bb2e579c38557047ab292500b0c31e92df6d4afef3b", "summary": "Non-banks encompass a wide range of business models, including pension funds, insurers, hedge funds, and many others. The activities of these firms are vital for the financial health and growth of the UK economy.Therefore, making sure these firms are resilient and financially stable ensures they provide consumers and businesses with the services they need – in both good times and bad.Non-banks use leverage (borrowing to invest) to increase exposure, boost returns or hedge potential losses. This can be achieved in various ways, ranging from taking out loans to using complex derivatives. The use of leverage is an essential component of the deep and efficient capital markets that we have in the UK.In good times, this leverage provides extra liquidity to the system and helps maximise returns. But in periods of market stress, leverage that is poorly managed, concentrated, or hard to spot can raise instability. This is particularly true in markets that are core to the functioning of the real economy. For example, UK government debt markets, or when highly leveraged non-banks risk transferring stress to institutions like banks, which are central to the stability of the financial system.As the regulator, our role is to ensure that markets work well. Leverage is not inherently a cause for concern. But to ensure that leverage can continue to play its part in supporting the UK economy in good times and bad, we need to find ways to identify and address systemic risks - without impeding market efficiency or disproportionately burdening firms.FSB recommendationsTwo years ago, I took up a role as co-chair of the Financial Stability Board's (FSB’s) working group on non-bank leverage. This group recently published policy recommendations (PDF) seeking to identify and address financial stability risks created by non-bank leverage.Effective risk management depends on having the right information at the right time. Without it, both market participants and regulators are essentially flying blind. The report addresses this fundamental challenge by recommending stronger risk monitoring and greater market transparency.The proposed measures put forward by the FSB focus on improving how firms share critical information – both publicly and with their trading partners. These measures should give firms better insight into their own exposures and broader market conditions, helping them manage investment risks more effectively. The improvements should also provide authorities with a comprehensive view of the entire system. Having this birds-eye view enables authorities to spot risks that individual firms might not see – such as dangerous concentrations of investments or overcrowded market positions.The FSB report also provides policy options for authorities to consider once they address risks to financial stability. Given the complex and diverse nature of the non-bank sector, there's no one-size-fits-all approach – so the report sets out a number of different alternatives that authorities may wish to consider. This approach is a good one - what matters is that all jurisdictions have sufficient measures to manage systemic risk, even if different authorities choose a different set of policy tools or measures to do so.What's next for the UK?We are already working to become a smarter regulator, and we're focusing on how we collect and use data to spot risks early.To do our job, which is to make sure that markets function well, we know we need data that provides the practical insights we need to make effective, proportionate decisions.The FSB recommendations are well timed for us. We are already taking steps to evaluate what data we need and switching off regulatory reporting returns that are no longer relevant. There is an ongoing programme of work looking at our data needs – and we’ll think carefully about which risk metrics are most useful for us going forward, including how we can align with other jurisdictions.Working with our international partnersAs much of the non-bank sector operates across borders, it’s crucial that we also collaborate with our international counterparts to spot risks and potential spillovers effectively.This means engaging bilaterally on issues like information sharing and risk monitoring, while continuing to take an active role in international standard-setting bodies. In this way, we can strive for internationally consistent outcomes and be confident that we’re safeguarding the system, while still ensuring that the UK remains competitive.My time leading this FSB working group has highlighted that non-bank leverage is a particularly tricky issue to tackle, demanding in-depth knowledge, industry perspective, and extensive international cooperation. The publication of the FSB’s recommendations is a major step forward in this space – and I’m proud that the FCA has been able to play such a leading role in advancing this work.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA shares feedback on the new standard setting body for open banking", "url": "https://www.fca.org.uk/news/news-stories/fca-shares-feedback-new-standard-setting-body-open-banking", "id_key": "4ea9bd244016aef3c0ebda30e20d5607389d70fff88d87d638efdc8b31d06f31", "summary": "The ‘Future Entity’ is expected to be the main standards body for open banking in the UK. There has been significant progress in open banking over the past 6 months, and we want to build upon that momentum. This includes the industry-led work to establish a new organisation that will support the rollout of variable recurring payments for some types of household bills later this year. Open banking has the potential to support economic growth in the UK by making payments faster, cheaper and more efficient for people and businesses. It will also enable firms to develop products and services, which make it easier for consumers to manage their finances and pay for goods. The open banking standards provided by the Future Entity are expected to be used by commercial open banking schemes promoting innovation in the sector.The Future Entity is expected to monitor the quality and consistency of technologies used in open banking. This should help inform our supervision of firms.We will be engaging with industry and other stakeholders to decide upon the best way forward to standing up the Future Entity, helping to create a more thriving and innovative open banking industry.Matthew Long, director of payments and digital finance at the FCA, said: 'This is the next step in realising our vision of a more innovative, safe and competitive payments sector, which embraces technological change to better serve people and businesses.'We expect the Future Entity to play a central role in the next phase of open banking, setting and monitoring the standards that underpin the industry.'However, we can't realise this future alone. Our engagement and support from industry continues to play a vital role in the future of open banking, as we build on the momentum we’ve seen in the past 6 months.'More informationRead the Feedback Statement 25/4: Design of the Future Entity for UK open banking.The feedback statement follows a JROC policy paper setting out proposals for the design of the future entity for UK open banking.Open banking is a focus area for the us as set out in our recent strategy.The Future Entity is expected to provide the core standards for open banking services – API standards and oversight. We expect this body to be not for profit, and to collect revenue on an equitable basis to recover costs and invest. We plan to discuss this with industry. Separately, there will be a competitive layer of open banking schemes, which operate commercially. We expect these schemes to utilise the common API standards developed and overseen by the Future Entity, but they may innovate above these standards to provide premium services. APIs allow different firms’ software applications to communicate and interact with each other, exchanging data quickly and securely. This allows for greater data sharing.Underlying payments infrastructure provides the payments rails for open banking payments. The future of this infrastructure layer (including the governance and potential upgrades) is being led by the Payments Vision Delivery Committee and the Vision Engagement Group.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA secures convictions against individual for £1.3m Ponzi scheme", "url": "https://www.fca.org.uk/news/press-releases/fca-secures-convictions-individual-ponzi-scheme", "id_key": "4807e92e9ea2edbeed186d37febb175c9c184c0e0b0569fe4d25fcbb17aed584", "summary": "Daniel Pugh has been found guilty of fraud, following a prosecution by the FCA. Mr Pugh, aged 35 and of Devon, set up a Ponzi scheme that netted over £1m. Through his fraudulent Imperial Investment Fund (IIF), Mr Pugh took money from 238 investors he targeted largely through Facebook adverts. They were offered impossibly high returns of 1.4% a day, 7% a week or 350% a year.The FCA will commence confiscation proceedings in order to recover the proceeds of crime.Steve Smart, joint executive director of enforcement and market oversight at the FCA, said: 'Mr Pugh deliberately defrauded unsuspecting investors. Fighting financial crime is a priority for the FCA and we are committed to holding fraudsters to account.’Mr Pugh was today found guilty of one count of conspiracy to defraud. At the start of the trial he pleaded guilty to carrying out unauthorised regulated activity which breached sections 19 and 21 of the Financial Services and Markets Act 2000.A further individual remains wanted in relation to the same offences. Notes to editorsDaniel Pugh’s date of birth is 19 April 1990.The FCA has attempted to contact investors who lost out. Anyone who was scammed by IIF and has not heard from the FCA should call or email ophainesconsumercontact@fca.org.uk.The FCA’s ScamSmart page has advice on how to spot and avoid investment scams.Mr Pugh was charged on 18 July 2023.Mr Pugh’s trial took place at Southwark Crown Court.Conspiracy to defraud is an offence under common law with a maximum sentence of 10 years’ imprisonment.Under section 19 of FSMA, a person cannot carry on a regulated activity in the UK unless they are FCA authorised or exempt. Any person who breaches this is committing a criminal offence for which the maximum sentence is two years’ imprisonment.Under section 21 of FSMA, a person must not communicate an invitation or inducement to invest unless they are FCA authorised or the content of the communication is approved by an authorised person. Any person who breaches this is committing a criminal offence for which the maximum sentence is two years’ imprisonment.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA sets out changes to payment safeguarding rules", "url": "https://www.fca.org.uk/news/press-releases/payment-safeguarding-rules-changes", "id_key": "2e894613c03131080b23a3221b05b8600edfbac51e60f5e3487afce6d45ef3c0", "summary": "Consumers will be better protected when they use payment firms, with the introduction of new rules to protect their money from May 2026. These changes will improve safeguarding practices among payment firms. Safeguarding means that customer money must be kept separate from the firm’s own money so that it is available to be returned if the firm fails.Following constructive engagement with industry, the FCA has confirmed that the new rules will kick in after 9 months, giving industry time to prepare. It has also made changes to ensure that rules are proportionate for smaller firms, such as by removing the requirement for audits if a firm holds less than £100,000 in customer funds.These rules mean that consumers are better protected, and if a payment or e-money firm fails they are more likely to get a full refund and with fewer delays.The new rules require:Annual audits by qualified auditors.Monthly reporting for payment firms.Firms to conduct daily checks to make sure the right amount of money is being safeguarded to protect customers.Better planning if firms fail so customers receive their money back sooner.These rules will address issues the regulator has found in previous failures of payment firms.Payment firms that became insolvent between Q1 2018 and Q2 2023 had average shortfalls of 65% of their customers’ funds.Matthew Long, director of payments and digital assets, FCA, said: 'People rely on payment firms to help manage their financial lives. But too often, when those firms fail, their customers are left out of pocket.'Most of those who responded to our consultation agreed we need to raise standards to protect people’s money and build trust, but any changes needed to be proportionate, especially for smaller firms.'We’ll be watching closely to see if firms seize the opportunity and make effective improvements that their customers rightly deserve – this will help us to determine whether any further tightening of rules is necessary.'Notes to editorsPS25/12: Changes to the safeguarding regime for payments and e-money firms.Intended amendments to Payment Services and Electronic Money - Our Approach, May 2026 draft version.The FCA will be actively supporting industry through the implementation period to help them make changes, with webinars, events and our day-to-day supervisory work.Funds held by payment and e-money firms are not directly protected by the Financial Services Compensation Scheme (FSCS). Instead, firms must safeguard funds which can mean customers lose money or experience delays to funds being returned if the firm fails.The rules will come into effect on 7 May 2026.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA update on ‘all or nothing’ investment fraud case", "url": "https://www.fca.org.uk/news/statements/fca-update-all-or-nothing-investment-fraud-case", "id_key": "2541526eed7811f01a97315bae8698aed5e7757bd962b683ae702d01e370fec9", "summary": "We have secured a confiscation order against Reuben Akpojaro for his role in the investment fraud.In May 2025 we announced confiscation orders against Raheel Mirza, Cameron Vickers and Opeyemi Solaja. Cameron Vickers made a successful application to reduce his confiscation order. As a result, the confiscation orders secured by the FCA against the defendants total £293,726.16. This amounts to all their remaining assets.Between June 2016 and January 2020, the defendants cold called people to convince them to invest in a shell company and used the money to bankroll their lifestyles. In 2023 they were convicted and sentenced to a combined 24 and a half years for investment fraud.The money will be returned to investors at the earliest opportunity. Failure to pay can lead to imprisonment. Notes to editorsWe previously published details of the FCA's confiscation orders.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA issues fines of nearly £46m for failures managing the Woodford Equity Income Fund", "url": "https://www.fca.org.uk/news/press-releases/fca-fines-over-woodford-equity-income-fund", "id_key": "7199fc858df1389e88b388a68e8a58b89cd0684f9eca0765d9c38cd4eba8e7a9", "summary": "The FCA has decided to fine both Neil Woodford and Woodford Investment Management (WIM) for failures in their management of the Woodford Equity Income Fund (WEIF). The FCA has decided to fine Mr Woodford £5,888,800 and ban him from holding senior manager roles and managing funds for retail investors.The FCA has also decided to fine WIM £40,000,000.WEIF was an investment fund managed by Mr Woodford and WIM. They were responsible for managing the liquidity of the fund, so that investors could redeem their investments and be repaid.The fund was suspended in June 2019, leaving investors – a significant majority of whom were ordinary retail customers – unable to access their money. The value of the WEIF had fallen from a high of over £10.1bn in May 2017 to just £3.6bn in the run-up to its suspension.The FCA has concluded that between July 2018 and June 2019 WIM and Mr Woodford made unreasonable and inappropriate investment decisions. They disproportionately sold more liquid investments (those that are easier to sell) and bought less liquid ones over this period. This meant that at the time of suspension only 8% of the investments held by WEIF could be sold within 7 days. Under rules in place at the time, investors should have been able to access their funds within 4 days.WIM and Mr Woodford did not react appropriately as the fund’s value declined, its liquidity worsened and more investors withdrew their money. This disadvantaged investors who remained in the fund, compared to those who had withdrawn their investment before the fund was suspended.The FCA has concluded that Mr Woodford held a defective and unreasonably narrow understanding of his responsibilities. Despite his senior role, he did not accept that he had a responsibility to oversee the management of the fund’s liquidity, including in interviews conducted by the FCA. He also failed to provide proper oversight of WIM’s relationship with Link Fund Solutions (Link), the WEIF’s authorised corporate director, including after Link raised concerns about the fund’s liquidity.The FCA considers Mr Woodford’s and WIM’s failings led to a significantly increased risk of the fund being suspended.Steve Smart, joint executive director of enforcement and market oversight at the FCA, said:'Being a leader in financial services comes with responsibilities as well as profile. Mr Woodford simply doesn’t accept he had any role in managing the liquidity of the fund. The very minimum investors should expect is those managing their money make sensible decisions and take their senior role seriously. Neither Neil Woodford nor Woodford Investment Management did so, putting at risk the money people had entrusted them with.’The FCA previously set out its findings against Link for its role in the suspension of the WEIF. This included securing a £230m redress scheme for those investors stuck in the fund when it was suspended.Notes to editorsDecision Notice 2025: Neil Woodford (PDF)Decision Notice 2025: Woodford Investment Management Limited (PDF)", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA to consult on motor finance compensation scheme", "url": "https://www.fca.org.uk/news/press-releases/fca-consult-motor-finance-compensation-scheme", "id_key": "c6105d047fc77222d59c4d7178c034997460336e42213b0af275090279f00d20", "summary": "Motor finance customers could receive a pay out after the FCA announced it will consult on an industry-wide compensation scheme. Many motor finance firms were not complying with rules or the law by not providing customers with relevant information about commission paid by lenders to the car dealers who sold the loans.The FCA has moved quickly on steps to set up a proposed compensation scheme because it wants to provide clarity and certainty to consumers, firms and investors as quickly as possible.It also wants to ensure the integrity of the motor finance market so it works well for consumers now and in the future. The compensation scheme would balance principles including fairness, timeliness, and certainty.Nikhil Rathi, chief executive of the FCA, said:'It is clear that some firms have broken the law and our rules. It’s fair for their customers to be compensated. We also want to ensure that the market, relied on by millions each year, can continue to work well and consumers can get a fair deal.'Our aim is a compensation scheme that’s fair and easy to participate in, so there’s no need to use a claims management company or law firm. If you do, it will cost you a significant chunk of any money you get.'It will take time to establish a scheme but we hope to start getting people any money they are owed next year.'The announcement follows Friday’s landmark ruling by the Supreme Court, on cases in which the FCA had intervened. While some motor finance customers won’t get compensation because in many cases commission payments were legal, the Court ruled that in certain circumstances the failure to properly disclose commission arrangements could be unfair and therefore unlawful.The FCA will propose rules on how lenders should consistently, efficiently and fairly decide whether someone is owed compensation and how much. It will monitor if firms are following the rules and act if they’re not.The FCA currently estimates that most individuals will probably receive less than £950 in compensation per agreement.The final total cost of any compensation scheme will depend on the final design. That makes it hard to estimate precisely. Any estimates are only indicative at this stage and may change. The FCA thinks it unlikely the cost of the scheme, including to run it, would be much lower than £9 billion. And it could be higher, up to £18 billion in some scenarios though the FCA doesn’t believe these are the most likely. A total cost midway in the range, as forecast by some analysts, is more plausible.The consultation will launch by early October. If the compensation scheme goes ahead, the first payments should be made in 2026.People who have already complained don’t need to do anything. Consumers who are concerned that they were not told about commission and think they may have paid too much for their motor finance should complain now. Consumers do not need to use a claims management company or law firm and doing so could cost them around 30% of any compensation paid.The FCA recognises that consumers want to receive any compensation owed quickly and firms and investors want certainty. The regulator will be working intensively and engaging widely over the coming weeks on the detail of how a scheme would work.Notes to editors The full market statement: FCA to consult on a compensation scheme for motor finance customersThe Supreme Court judgment", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA to consult on a compensation scheme for motor finance customers", "url": "https://www.fca.org.uk/news/statements/fca-consult-compensation-scheme-motor-finance-customers", "id_key": "40c6f63cfaeab4a472402f254aec4091a42d4dc94255266a239381faf325be20", "summary": "We will consult on an industry-wide scheme to compensate motor finance customers who were treated unfairly. Any redress scheme must be fair to consumers who have lost out and ensure the integrity of the motor finance market, so it works well for future consumers.We will publish the consultation by early October and finalise any scheme in time for people to start receiving compensation next year.Why are we proposing a redress scheme?Our detailed review of the past use of motor finance has shown that many firms were not complying with the law or our disclosure rules that were in force when they sold loans to consumers. Where consumers have lost out, they should be appropriately compensated in an orderly, consistent and efficient way.Some consumers have challenged their agreements with lenders through the courts. On Friday the Supreme Court ruled that in many cases commission payments could be legal, but a lender did act unfairly – and therefore unlawfully - due in part to the size of the commission it paid to the motor dealer and how it was disclosed.The Supreme Court agreed with several factors we had identified which could point towards an unfair relationship and fall foul of the Consumer Credit Act (CCA), whilst recognising it depends on the facts of each case.Such factors could include:the size of the commission relative to the charge for creditthe nature of the commission, for example, whether it is discretionarythe characteristics of the consumercompliance with regulatory rulesthe extent and manner of disclosureThis clarity helps us because we have been looking at what is unfair and, prior to this judgment, there were different interpretations of the law coming from different courts.We will now consult on a redress scheme. Redress would depend on non-disclosure of the factors above and the interaction between them.The principles underpinning a redress schemeWe set out in June the principles that would guide a redress scheme. These are:comprehensivenessfairnesscertaintysimplicity and cost effectivenesstimelinesstransparencymarket integrityThere may be tensions between these principles, which will require us to strike the right balance. We will explore these during the consultation.Scope and design of redress schemeWe have been carefully analysing the Supreme Court’s judgment and how it may affect the scope and structure of a redress scheme. While that work is ongoing, we want to provide as much clarity and certainty to consumers and firms as quickly as possible.Our consultation will cover how firms should assess whether the relationship between the lender and borrower was unfair for the purposes of our scheme and if so, what compensation should be paid.In the Supreme Court case and our review of past practices, the unfairness to consumers has arisen from the non-disclosure of particular features of the commission arrangements. But many of these features are not themselves unfair. And the Supreme Court said that non-disclosure or partial disclosure of the commission will not necessarily make the relationship unfair.Our consultation will, therefore, need to consider how a range of factors must be assessed together when deciding on whether the relationship was unfair. As we prepare the consultation, we will consider if and how factors such as the non-disclosure of the nature and size of the commission, tied commercial relationships and customer sophistication should be factored in.Discretionary commission arrangements and non- discretionary commission arrangementsWe will propose that the scheme covers discretionary commission arrangements (DCAs) – where the broker could adjust the interest rate offered to a customer – if they were not properly disclosed.We will also consult on which non-discretionary commission arrangements should be included. This is because the Supreme Court decision in the Johnson case, which did not include the payment of any discretionary commission, makes clear that non-disclosure of other facts relating to the commission can make the relationship unfair.Redress calculationOur methodology for calculating redress will be informed by the degree of harm suffered by the consumer and the need to ensure consumers continue to be able to access affordable loans for motor vehicles.The Supreme Court decided that the appropriate remedy in the Johnson case was the payment of the commission. We will consider this option alongside alternative approaches. It is unlikely any alternative would lead to higher remedies overall than full repayment of commission. Some could lead to lower payments.We will consult on whether there should be a de minimis threshold to be eligible for a compensation payment.InterestInterest is normally paid on redress awards. This should be fair and proportionate. In the case it upheld, the Supreme Court required a commercial rate of interest to be paid.We plan to consult on an interest rate for each year of the scheme based on the average base rate that year plus 1%. This would be in the ballpark of a simple interest rate of 3% per annum.TimeframeWe think the scheme should cover agreements dating back to 2007, to be consistent with the complaints the Financial Ombudsman can consider and to ensure the scheme is comprehensive. This would mean consumers would not need to use other routes to secure compensation and prevent large numbers of ongoing disputes in the courts. We are discussing with the Government the best way of doing this.Opt in / opt outWe have not yet decided whether to propose an opt-in or opt-out scheme. There are pros and cons to either approach and a range of views, which will be explored thoroughly through the consultation.Whichever approach we propose, we anticipate requiring firms as far as possible to make customers aware they may be eligible and what they may need to do.High commissionThe Supreme Court found that a high and undisclosed commission – in this case 55% of the total cost of the credit – was ‘a powerful indication’ of an unfair relationship. The court also found that this was a breach of our rules, as disclosure of so high a commission would have had a ‘material impact’ on the customer’s decision.We will, therefore, need to consider what size of commission in the context of the overall finance arrangements may point towards unfairness if not disclosed.Total cost of redressThe final cost of any redress scheme will depend on the final design and the factors, including those set out above.This makes it hard to estimate precisely at this stage the total cost to industry of the scheme. Any estimates are highly indicative and susceptible to change.The final cost will also depend on the take-up rate, the methodology to calculate redress and the mix of discretionary and non-discretionary arrangements ultimately included.At this stage, we think it is unlikely that the cost of any scheme, including administrative costs would be materially lower than £9bn and it could be materially higher. While there are plausible scenarios which underpin estimates of a total cost as high as £18bn, we do not consider those scenarios to be the most likely and analyst estimates in the mid point of this range are more plausible.The FCA currently estimates that most individuals will probably receive less than £950 in compensation per agreement.Market impactWe have been analysing the potential impact of a redress scheme on firms and the motor finance market. We expect a healthy finance market for new and used cars to continue notwithstanding any redress scheme we propose. We will set out more detailed analysis in our consultation and continue to monitor market functioning.Advice to firmsFirms must comply with the law and our rules. We also welcomed the industry-led practices to enhance the information provided to customers following the Court of Appeal judgment of 25 October 2024 on motor commission arrangements. Under the Consumer Duty, we increasingly monitor outcomes consumers are receiving as well as compliance with rules. Our view is that these updated practices are contributing to better consumer outcomes.Prudential rules require regulated firms to maintain adequate financial resources. Firms with listed securities must also keep the market properly informed. Each firm must make their own assessment of potential liabilities, as many have done.Firms should now refresh their estimates, ensuring they cover both liability for compensation and the administrative costs. There will remain a degree of uncertainty about these estimates until a redress scheme is finalised, but it is important that firms act and make sufficient provisions, increasing them where necessary.Complaints deadlineFirms currently do not have to provide a final response to relevant motor finance complaints before 4 December 2025. We will consult on further extending this deadline to align with the timetable for compensation payments of the proposed redress scheme.This will prevent disorderly, inconsistent and inefficient outcomes for consumers and knock-on effects on firms and the market.Advice to consumersPeople who have already complained don’t need to do anything. Our advice remains that consumers concerned that they were not told about commission and who think they may have paid too much for the finance, should complain now.We aim to make any scheme easy to participate in, without needing to use a claims management company (CMC) or law firm. Using a CMC or law firm may end up costing them up to 30% in fees of any compensation they receive.Over the last year, the FCA has required 225 promotions from CMCs on motor finance to be amended or withdrawn, including some which were highly speculative in suggesting the compensation consumers may get.We will continue to act against firms using clickbait-style promotions or language that suggests a guaranteed outcome before any investigation into a consumer’s claim has taken place. Firms must ensure that all financial promotions are clear, fair, and not misleading, and that they accurately reflect the nature and status of any potential claims.We will ensure firms handle claims consistently, efficiently and fairly.Next stepsWe recognise that consumers want to receive any compensation owed quickly and firms and investors want certainty.We will be working intensively and engaging widely over the coming weeks on the detail of how a scheme would work.We aim to publish the consultation by early October and for it to be open for 6 weeks. No final decisions have yet been taken in relation to the scheme. We aim to finalise the rules such that the scheme can launch in 2026, with consumers starting to receive compensation next year.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA reaction to Supreme Court motor finance judgment", "url": "https://www.fca.org.uk/news/statements/fca-reaction-supreme-court-motor-finance-judgment", "id_key": "0b22f5351ca448a0f646453dc05f8b291a77c65d4a04e66a5e5d7337aaa978e4", "summary": "We are working to analyse the judgment and determine our next steps. An FCA spokesperson said:'We welcome that the Supreme Court has clarified the law and are grateful to the Court for delivering the judgment after the market closed.'It will take time to digest the judgment.'We want to bring greater certainty for consumers, firms and investors as quickly as possible.'We will be working through the weekend to analyse the judgment and determine our next steps.'We said we would set out within 6 weeks whether we would consult on a redress scheme. But we want to provide clarity as quickly as possible.'So, we will confirm whether we will consult on a redress scheme before markets open on Monday 4 August.'Our aims remain to ensure that consumers are fairly compensated and that the motor finance market works well, given around 2 million people rely on it every year to buy a car.'If we do decide to propose a redress scheme, we'll consult widely. In designing a redress scheme, as we have previously said, we will balance principles including fairness, timeliness, and certainty.'", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA opens retail access to crypto ETNs", "url": "https://www.fca.org.uk/news/press-releases/fca-opens-retail-access-crypto-etns", "id_key": "924a8aefbb09565b2e02312800647b8a0f62772672a52d1878022561c7ff661e", "summary": "Firms will soon be able to give retail consumers access to crypto exchange traded notes (cETNs), under changes announced by the FCA. Crypto ETNs that retail consumers can access must be traded on an FCA-approved, UK-based investment exchange (a Recognised Investment Exchange or RIE). Financial promotion rules will apply so consumers get the right information and aren’t offered inappropriate incentives to invest. David Geale, executive director of payments and digital finance at the FCA, said:'Since we restricted retail access to cETNs, the market has evolved, and products have become more mainstream and better understood. In light of this, we’re providing consumers with more choice, while ensuring there are protections in place. This should mean people get the information they need to assess whether the level of risk is right for them.'The Consumer Duty will apply to firms offering these products to retail investors. However, there won’t be coverage from the Financial Services Compensation Scheme (FSCS). Consumers should ensure they understand the risks before deciding to invest.This is the latest development as the FCA continues to establish a regulatory framework for crypto. We have outlined our crypto roadmap and recently published proposals on stablecoins as well as other aspects of the regime.The FCA’s ban on retail access to cryptoasset derivatives will remain in place. The FCA will continue to monitor market developments and consider its approach to high-risk investments.Notes to editorsIn January 2021, the FCA banned the sale, marketing and distribution of derivatives and ETNs that reference unregulated transferable cryptoassets to retail clients.In March 2024, the FCA announced we would not object to requests from recognised investment exchanges (such as Cboe or the London Stock Exchange) to create a UK listed market segment for cryptoasset-backed exchange traded notes (cETNs) for professional investors. In June 2025, the FCA launched a consultation on proposals to lift the ban on retail access to cETNs.The FCA grants recognition orders to investment exchanges in the UK to make sure they meet regulatory standards. This power is provided under the Financial Services and Markets Act 2000 for the FCA to consider applications from UK entities (a body corporate or an unincorporated association) for recognition as a UK recognised body. Examples of recognition requirements include equivalent protection for investors. The change will come into force on 8 October 2025.Read Handbook Notice 132 (PDF).", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "AI Live Testing: The use of AI in UK financial markets - from promise to practice", "url": "https://www.fca.org.uk/news/blogs/ai-live-testing-use-ai-uk-financial-markets-promise-practice", "id_key": "76c83dd30a223e3796c57fc4fe74b11f3f02e3289276b3992eaa409325b863fa", "summary": "Artificial Intelligence (AI) is reshaping industries, including financial services. It has the potential to transform decision-making and customer experiences in UK financial services for the better. But it also raises concerns about how it can be used safely and responsibly. This can slow the pace of innovation if left unanswered as well as introduce new risks.That's why we’re proposing AI Live Testing – a practical, collaborative way for firms and the FCA to explore methods to assure AI systems together. Here, we set out why you should apply to take part. The promise of AI Using AI can result in: Smarter decision-making: Models can process huge volumes of data to assess risk, automate compliance, and tailor financial products.Stronger protections: Machine learning systems are spotting anomalies and stopping fraud before it affects consumers. Better experiences: Natural language models and predictive analytics can personalise financial products to better meet consumer needs. But this innovation depends on more than just computing power and data. Crucially, it also depends on confidence that AI can be used safely and responsibly in UK financial markets. Otherwise, innovation will stall. We want the UK to be a place where beneficial technological innovation can thrive to support growth and competitiveness. The question then becomes: how can we build confidence in AI so that consumers and markets benefit? The regulatory challenge: clarity without closureYet, this is where financial services regulators face a tricky balance. On the one hand, at the FCA we recognise that firms need regulatory clarity on AI – a predictable framework to guide their investments, operations, and risk management.On the other hand, we also recognise that if we, as the UK's financial services regulator, move too quickly or narrowly, we could unintentionally stifle innovation. Also, any regulatory action could potentially become out-dated very quickly as the technology evolves at pace. A collaborative path forward: AI Live TestingAI Live Testing is a practical, hands-on way to build trust, reduce risk, and accelerate safe and responsible innovation. This isn’t a compliance exercise. It’s a partnership. It provides a structured but flexible space where firms can test AI-driven services in real-world conditions, with appropriate regulatory support and oversight (see the Terms of Reference (PDF)). It will help firms who are further along in AI development and are ready to use in markets. This will allow both sides to:Understand how an AI system performs in live market contexts – in practice and not just in theory.Identify potential risks early and adapt controls accordingly.Explore potential assurance methods that are grounded in how AI is used in a specific market context; not just what’s ideal on paper.Share insights that feed into smarter, more future-proof AI approaches.AI Live Testing complements the FCA's Supercharged Sandbox, which is focused on firms who are in the discovery and experiment phase of their AI product's development. This joined-up approach mirrors the spirit of innovation itself: test, learn, iterate, improve. It's a core part of the FCA's AI innovation offering through the AI Lab and set out in our Engagement Paper on AI Live Testing.Why you should take partWe know that complex questions around how AI systems will perform in the real world can significantly slow the pace of innovation. That's why we want to help firms by providing a place where they can test. AI Live Testing can offer you:Clarity on expectations: Get early, practical feedback on what regulators are looking for when it comes to, for example, considerations around explainability, fairness, performance, and controls. Less guesswork. Confidence in deployment: Test how your AI system behaves under real operating conditions to ensure it works in a safe and responsible way. A chance to shape best practice: Your experience in AI Live Testing helps inform insights and best practice for the rest of industry. You can help make sure that regulatory approaches are grounded in operational reality and make a genuine difference for the better for consumers and markets.What AI Live Testing isn't FCA AI Live Testing is not designed to become a tool to approve or certify that an AI model is OK to use. We don’t believe this is within the FCA's remit. It also isn't an enforcement or supervisory function – it's entirely voluntary.From model evaluation to AI system evaluation Much of the broader AI assurance debate has focused on how AI models operate. But when it comes to AI deployment, the model is just one part of a broader AI system. This is particularly true for financial services, where we need to understand how AI systems behave in real-world market situations. We define an AI system as an ecosystem of people, processes and technologies designed to deliver intended outcomes. It includes the model, data pipeline, human oversight, testing and governance. Considering the AI system as a whole is key to reducing bias, improving accuracy, and increasing transparency.And yet, our work to date suggests that some of the most important questions are more fundamental and even come before considering issues such as bias or accuracy. They are: What is the intended goal and outcome for the AI system – at a point in time and over time?What are the key risks relative to use case context, as well as considerations around regulatory compliance?How can these risks be best mitigated and what residual risks are acceptable? Do we have a shared framework to assess these risks? These are not academic questions. They’re about ensuring that the AI system is tested for its real-world impact – including its impact on consumers and markets (see ‘AI for growth – how the FCA can help’). These are live issues that respondents to our Engagement Paper on AI Live Testing are considering. We will be sharing more details when we publish the Feedback Statement in September 2025. AI Live Testing is a bridge between beneficial innovation and assurance. It gives you a structured way to take bold steps forward, with the reassurance that you're building on solid ground.We’re inviting financial firms of all sizes to take part. If you’re building something ambitious and want to get it right, this is your chance to test, learn, and lead.Join us in shaping the safe and responsible future of AI in UK financial markets.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA fines Sigma Broking Limited for transaction reporting failures", "url": "https://www.fca.org.uk/news/press-releases/fca-fines-sigma-broking-limited-transaction-reporting-failures", "id_key": "2a903aacb09851b18b0e4856b7b06f2b17034caea182de7da9765ccccd042d24", "summary": "Sigma Broking Limited (Sigma) has been fined £1,087,300 for failing to submit complete and accurate transaction reports for 5 years. The FCA’s monitoring systems identified issues with the transaction reports submitted by Sigma, which were raised with the firm in May 2023.In January 2024, Sigma told the FCA that around 984,000 incorrect reports had been submitted. Following an independent review, Sigma confirmed in February 2025 that the total number of incorrect reports was 924,584, close to 100% of transactions handled by the firm between 1 December 2018 and 1 December 2023.These failures were caused by incorrect system setup and persisted uncorrected due to weaknesses in their reporting processes.Steve Smart, joint executive director of enforcement and market oversight, said: 'The transaction reports we receive are crucial to the work we do in combatting financial crime. Sigma’s failures were serious, sustained and showed a lack of care.'We will take action whenever we identify such failures.'This is the second enforcement action against Sigma for inadequate transaction reports, which affects the FCA’s ability to detect and investigate market abuse effectively.In October 2022, the FCA fined Sigma £531,600 for failing to report on 56,000 transactions and identify 97 suspicious trades between December 2014 and August 2016. The regulator also took action against 3 directors with fines totalling over £200,000, 2 of whom were banned.This case took 16 months from opening in April 2024 to achieving a public outcome - compared to an average of 42 months for cases closed in 2023/24. The FCA continues to improve the pace of its enforcement investigations.Notes to editorsFinal Notice: Sigma Broking Limited (PDF).Sigma agreed to resolve the case at an early stage and qualified for a 30% discount on the penalty imposed. Without this discount, the fine would have been £1,553,300.This is the second enforcement action against a firm for a breach of transaction reporting requirements in the UK Markets in Financial Instruments Regulation (MiFIR) legislation, the first action having been published against Infinox Capital Limited 6 months ago.Sigma breached Article 26 of MiFIR and Principle 3 of the FCA's Principles for Businesses.Article 26 of MiFIR means the obligation to report transactions.Principle 3 of the FCA's Principles for Businesses requires firms to take reasonable care to control their affairs responsibly and effectively.Transaction reports are submitted to the FCA when a transaction is executed in a financial instrument. Transaction reports include, but are not limited to, information on the financial instrument traded, the price and the participants involved. Read more information about transaction reporting.The FCA uses the information from transaction reports for:monitoring market abusefirm supervisionmarket supervisionsharing with certain external parties, such as the Bank of England", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA seeks improvement to digital loan processes", "url": "https://www.fca.org.uk/news/press-releases/fca-seeks-improvement-digital-loan-processes", "id_key": "d5472d87047c57895fb94358bc684299ef3ffd7885d6d8b6ed5d899b3c883afc", "summary": "The FCA found that the design of some digital loan processes lacks positive friction and excludes information consumers need, for example, on cost. Lenders' online and in-app application processes can help prospective borrowers understand what they’re signing up for, a review by the FCA has found. However, improvements could be made to these digital processes, so consumers are able to make informed decisions about their finances.The FCA's review is part of its strategic focus on helping consumers navigate their financial lives. It has shared examples of good and poor practice with lenders to help them better support their customers.The regulator found some lenders were using shorter, simplified language and providing explainer videos that helped customer understanding.However, the design of some digital loan processes lacked 'positive friction', which slows decision-making, and excluded information consumers needed, for example, on costs.Alison Walters, director of consumer finance at the FCA, said:'Online and app-based applications can make it easier for people to get the credit they need to navigate their financial lives. But poorly designed applications could mean people bypass important information. We're sharing examples of what works and what doesn't, so lenders can better support their customers.'Notes to editorsDigital design in customers' online journeys: good practice and areas for improvementResearch Note: Consumer impact of sludge, deceptive design, timeliness and simplification.Positive frictions are sections of a consumer journey that can encourage consumers to pause and reflect, which can lead to better consumer outcomes. For example, FCA research (PDF) has tested positive frictions in the form of check boxes, time delays and requirements for evidence declaration in the context of high-risk investing.The findings of this review relate to consumer credit providers only, but there is good and poor practice that might be of interest more broadly to those firms with a digital presence.We've made various changes in the consumer credit sector in recent years.In 2022, the FCA published research into how trading apps were allowing sludge and gamification practices.The FCA's Financial Lives 2024 survey found that digital exclusion in the UK has significantly declined in recent years. In May 2024, only 2% of adults (1.2 million) were digitally excluded, a dramatic improvement from 14% (6.9 million) in 2017. Digital exclusion includes those who never or rarely use the internet, are unsure that they use it, or have poor digital skills.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA acts over alleged £23 million unauthorised collective investment scheme", "url": "https://www.fca.org.uk/news/press-releases/fca-acts-alleged-23-million-unauthorised-collective-investment-scheme", "id_key": "ff8ae6ebeebbb22e4350f99512e9514bfab25aef0c1c0cf0b21b22413629991a", "summary": "The FCA has begun High Court proceedings against Concept Capital Group (CCG), Ian Anthony Elliott, Adrian Felix, Ayub Swaibu, Edmund Brew, Ernest Kargbo, Raymondip Bedi, Riverrun Consulting Limited and Gateridge Consulting Limited over an alleged unauthorised investment scheme involving consumer investments of more than £23 million in static homes. CCG has given undertakings to the Court which have the effect of freezing its assets, pending the outcome of the trial or further order of the Court. These undertakings also prohibit the promotion or sale of the scheme.The FCA claims that CCG promoted investments in static homes, which were said to be let to social housing tenants placed by local councils. Investors were promised fixed returns and told the scheme was backed by the UK Government, claims the FCA considers were false or misleading.The FCA alleges that the scheme operated as an unauthorised collective investment scheme with CCG carrying on regulated activities in the UK without the required authorisation or exemption.The FCA also alleges that the firm issued unauthorised financial promotions and made false or misleading statements and/or impressions, in breach of the Financial Services and Markets Act 2000 (FSMA) and the Financial Services Act 2012 (FSA 2012).Alongside Ian Elliott, the FCA claims that Adrian Felix and his company Gateridge Consulting, Ayub Swaibu, Edmund Brew, Ernest Kargbo, and Raymondip Bedi and his company Riverrun Consulting were knowingly concerned in CCG’s breaches. Mr Bedi was sentenced on 4 July 2025 for a separate fraud uncovered by the FCA.The FCA is seeking:Restitution orders in favour of affected investors.Declarations of contraventions.Injunctions to prevent further breaches.These proceedings are at an early stage and no trial date has yet been set.Notes to editorsThe alleged breaches are:s.19 FSMA – carrying on regulated activities in the UK without FCA authorisation or exemption.s.21 FSMA – issuing unauthorised financial promotions.s.89 FSA 2012 – making false or misleading statements.s.90 FSA 2012 – creating false or misleading impressions.In a separate case, Raymondip Bedi was sentenced at Southwark Crown Court to a total of 5 years and 4 months imprisonment, following guilty pleas to conspiracy to defraud, conspiracy to breach s.19 FSMA, and money laundering offences. More about unregulated collective investment schemes.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA appoints Liam Coleman as interim chair of the Financial Ombudsman Service", "url": "https://www.fca.org.uk/news/press-releases/fca-appoints-liam-coleman-interim-chair-financial-ombudsman-service", "id_key": "b7cc61fe7cf8445c9b216cc9f4445962d019ae5656ec764b1d96fdc113182865", "summary": "Liam Coleman has been appointed interim chair of the Financial Ombudsman Service. He will take up the role on 10 October 2025. Liam has over 30 years' extensive financial services, public sector and board experience. He was formerly chief executive officer of The Co-operative Bank, deputy group treasurer and group head of capital management at RBS and group director, treasury at Nationwide Building Society.Liam currently chairs Great Western Hospitals NHS Foundation Trust and London and Quadrant Housing Trust, and is interim chair of Royal United Hospitals Bath NHS Foundation Trust.Liam will succeed Baroness Zahida Manzoor CBE, who is stepping down after 2 terms in post. Liam will chair the Financial Ombudsman’s board until a permanent appointment is made, after the initial recruitment campaign proved unsuccessful. Ashley Alder, chair of the FCA, commented: 'I am delighted that someone with Liam's depth of experience will lead the Financial Ombudsman’s board during what is a pivotal time for the organisation.'I want to thank Baroness Manzoor for all she's done to steer an ambitious improvement programme at the Ombudsman over the last 6 years.'Commenting on his appointment, Liam Coleman said: 'I am honoured to take on the role of interim chair at the Financial Ombudsman Service. It plays a vital role in upholding fairness and trust in the financial system. 'I look forward to working closely with the board, executive team, and our wider stakeholders – including the Treasury and the FCA.'The FCA and the Financial Ombudsman are currently seeking to modernise the financial services redress system to help prevent delays to compensation. As part of this, the Financial Ombudsman plans to consult later this summer on different levels of case fees for financial firms, to make the system fairer and support early resolution.Notes to editors The FCA is required by the Financial Services and Markets Act 2000 (FSMA) to appoint the chair of the Financial Ombudsman, with the appointment being approved by the Treasury. The board of the Financial Ombudsman is entirely non-executive and is responsible for ensuring that the service is properly resourced and able to carry out its work effectively and independently. Liam Coleman joined the FCA board in November 2019. Liam will leave his current position as non-executive director at the FCA to take up his role at the Financial Ombudsman. He has over 30 years' experience in the banking industry in a variety of roles spanning retail and commercial banking and wholesale banking in his role as treasurer at 3 banking organisations. Current roles include chairman of Great Western Hospitals NHS Foundation Trust and London and Quadrant Housing Trust, interim chair of Royal United Hospitals Bath NHS Foundation Trust, associate of the London Institute of Banking and Finance (ACIB) and an associate of the Association of Corporate Treasurers. He also holds an MBA from Warwick Business School. Previous board and leadership roles include chief executive officer of The Co-operative Bank plc, and deputy group treasurer and group head of capital management at RBS and group director, treasury at Nationwide Building Society.The Financial Ombudsman was set up to resolve complaints between financial businesses and their customers. It can help with most financial services – including banking, insurance, fraud and scams, PPI, loans, mortgages, pensions and investments. From 1 April 2019, its remit was extended to cover complaints from larger small and medium sized businesses and about claims management companies.Find out more information about the FCA. Find out more information about the FOS.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "Discontinuance of FCA proceedings against Tom Hayes and revocation of Carlo Palombo’s prohibition order", "url": "https://www.fca.org.uk/news/statements/discontinuance-proceedings-tom-hayes-revocation-carlo-palombos-prohibition-order", "id_key": "4a645c9e2bbd198fe5ad4e2750a250ca14801c42ff01ca493856f3a69056b2fd", "summary": "The FCA has revoked Carlo Palombo's ban from the financial services industry and is ending its action against Tom Hayes following the recent Supreme Court judgment quashing their criminal convictions.Both of these convictions formed the basis upon which the FCA took its action, with Mr Palombo being banned from November 2022 and Mr Hayes referring the FCA’s decision to the Upper Tribunal.The FCA will take no further action against either individual.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "H2O Deputy CEO fined £1m and banned from financial services for deliberately misleading FCA", "url": "https://www.fca.org.uk/news/press-releases/h2o-deputy-ceo-fined-1m-banned-financial-services-misleading-fca", "id_key": "9c393b086c43f895940179c626b7b77b039d5e1059569c3026ef737494d3fef1", "summary": "The former deputy chief executive officer of asset manager H2O AM LLP (H2O), Jean-Noel Alba, has been fined £1,049,500 by the FCA and banned from the financial services industry. An FCA investigation found that Mr Alba lacked integrity because he misled the FCA.Between April 2015 and November 2019, H2O failed to carry out proper due diligence on investments relating to the Tennor Group of companies owned by Lars Windhorst, or companies he introduced.The investments were high risk and hard to sell, leaving investor money trapped. In 2024, the FCA agreed that H2O would pay those investors €250 million.During the FCA’s investigation into H2O, Mr Alba provided false and misleading statements and documentation to the regulator. Mr Alba was the principal point of contact with the FCA during its investigation.Mr Alba asked junior colleagues to create minutes, including records and minutes of committees, where no formal meetings had taken place. Mr Alba also provided due diligence materials, such as investment research, to the FCA that had been created years after the investments had been made, when he had claimed they were produced at the time.Steve Smart, joint executive director of enforcement and market oversight, said:'Senior leaders in financial services need to act with integrity. Mr Alba fell well short of those basic standards.'He has no place in the industry. This ban and substantial fine should serve as a warning to others that if you mislead the FCA, you will face the consequences.'Notes to editorsRead the final notice (PDF)The FCA investigation found that Mr Alba breached APER Statement of Principle 1 (failed to act with integrity) and Statement of Principle 4 (failed to deal with the FCA in an open and cooperative way); and Individual Conduct Rule 1 (failed to act with integrity) and Individual Conduct Rule 3 (failed to deal with the FCA in an open and cooperative way).The FCA previously announced H2O would pay €250 million to affected investors following its investigation. Following its application to voluntarily cancel its permissions in the UK, H2O is no longer authorised in the UK. Mr Alba was previously identified in the final notice as 'Senior Manager A'.The French financial services regulator, the Autorité des marchés financiers (AMF), is the designated regulator in respect of the collective investments, which H2O had managed on a cross-border basis pursuant to the UCITS Directive.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "FCA helps unlock market access for UK and Swiss firms", "url": "https://www.fca.org.uk/news/news-stories/unlock-market-access-uk-swiss-firms", "id_key": "f8bbdaf0ed5a21c0ac9defbb5b3a1eb8e4950677d6a3e2874820e73f73d0ff32", "summary": "The FCA is inviting UK and Swiss firms to submit interest in providing cross-border services as part of the Berne Financial Services Agreement (BFSA). This will help reduce regulatory barriers and boost the international competitiveness of UK financial markets.The agreement will make it easier for some UK businesses to provide wholesale financial services into the Swiss domestic market – removing the need to navigate Swiss rules as reliance on UK rules will be sufficient.Ruairi O’Connell, Director for International at the FCA, said: 'This agreement will reduce barriers and ensure open access between the UK and Switzerland for decades to come.'It is part of our work to support growth, by enabling investment, innovation and ensuring the continued competitiveness of our world leading financial services.'We are working closely with our Swiss counterparts to put in place mutual supervisory arrangements and creating a streamlined process for both Swiss and UK firms to register their interest.'In 2024 alone, UK-Swiss financial services trade amounted to just under £5bn, making Switzerland one of the UK’s top financial services trading partners.The agreement forms part of our wider commitment to strengthen the UK's position in global wholesale markets, supporting growth.Under the treaty, UK insurance companies will be able to provide wholesale insurance services into the Swiss domestic market without requiring Swiss authorisation. Swiss firms will also be able to provide investment services to UK high net worth clients, professional clients and eligible counterparties, without requiring authorisation in the UK.Firms can express interest in the BFSA and find out more on our new BFSA page.Further informationThe Berne Financial Services Agreement.", "ingested_utc": "2025-08-14T06:45:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FCA_News", "title": "Fund Ourselves Limited enters administration", "url": "https://www.fca.org.uk/news/news-stories/fund-ourselves-limited-enters-administration", "id_key": "f49cabf1478609d7e6dd7f41822dc60050b1e8225c05c24c7eae3b5e56493936", "summary": "On 21 July 2025, Fund Ourselves Limited (FOL) was placed into administration. Louise Brittain and Robert Young of Azets Holdings Limited were appointed as Joint Administrators. Fund Ourselves Limited mainly operated as a lender of high-cost short-term credit loans. It also operated a small peer-to-peer lending platform and facilitated crowdfunded loans that were used to finance high-cost short-term credit loans.The Joint Administrators have been appointed to wind down the firm in an orderly way in the interests of its creditors. They will be writing to all known creditors shortly to explain what this means and how to make a claim.On 11 April 2025, we took action against FOL to restrict its assets and its permissions to carry out regulatory activities.The firm is no longer lending or accepting peer-to-peer investments. However, all existing loan agreements remain in place and the Joint Administrators will update customers as soon as possible. Any payment arrangements currently in place will not be affected and customers should continue to make payments as normal.We are engaging with the firm and the Joint Administrators to seek to ensure the best outcomes for customers. Customers who are struggling financially can get free and impartial guidance from MoneyHelper.Customers and retail investors of FOL are generally not covered by the Financial Services Compensation Scheme (FSCS). The Joint Administrators will give more details about how any complaints will be dealt with in due course.Who to contactIf you believe you have a claim against FOL, or have any questions about your loan or investments, please contact the Joint Administrators' customer support team via:Email: fundourselves@azets.co.ukDedicated phone number: 07858 969 574Secondary London office number: 0207 403 1877", "ingested_utc": "2025-08-14T06:45:04Z"}
