{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T07:49:21Z", "source": "Guardian_World", "title": "Will Labor’s major expansion to first-home guarantee scheme ‘drive prices higher’?", "url": "https://www.theguardian.com/australia-news/2025/aug/25/labor-expansion-to-first-home-guarantee-scheme-impact-on-houses-prices", "id_key": "0f0933a4a789bef8571acd49fdc760f2b589da2581227c03a2b5bebc38862cca", "summary": "Treasury estimates new policy will only add 0.5% to home prices over six years, but some experts disagree Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Labor’s major new expansion to the home guarantee scheme will help first-time buyers who would have bought anyway, experts say, and is likely to push prices higher. The scheme, which has been around since 2020 , helps eligible first-time buyers get into the market with a deposit of as little as 5%, without the need to pay tens of thousands in lender’s mortgage insurance and taking years off the time required to save for a deposit. Continue reading...", "ingested_utc": "2025-08-25T07:49:21Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T07:49:21Z", "source": "Guardian_World", "title": "Former Wiggles CEO sues children’s entertainment group over alleged bonus and fair work breaches", "url": "https://www.theguardian.com/australia-news/2025/aug/25/former-wiggles-ceo-luke-oneill-suing-group-federal-court-ntwnfb", "id_key": "6bfd6787648f06d730aa7fc75475f05efab49c1713a6d13348b2f8b0df53257f", "summary": "Luke O’Neill claims blue Wiggle Anthony Field ‘undermined him’ and was responsible for ‘unnecessary costs’ and budget overruns Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The former Wiggles CEO has claimed in federal court documents that the blue Wiggle “undermined him” in front of other staff and excluded him from a meeting with Kmart to discuss selling their toys. According to documents provided by the court to Guardian Australia, the former CEO Luke O’Neill is suing Wiggles Holdings Pty Ltd, blue Wiggle Anthony Field and general counsel Matthew Salgo for not being paid a bonus relating to his work and for multiple alleged breaches of the Fair Work Act. Continue reading...", "ingested_utc": "2025-08-25T07:49:21Z"}
