{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:33:50Z", "source": "Guardian_World", "title": "Air Canada flight attendants to defy back-to-work order and remain on strike", "url": "https://www.theguardian.com/world/2025/aug/17/government-orders-striking-air-canada-flight-attendants-return-work", "id_key": "7c4715fdf16179a158132a29ca7eb85b5149c1d49ddb7f39c0704fee81d9cf46", "summary": "Union to challenge order issued less than 12 hours after start of action that has left more than 100,000 travellers stranded Air Canada’s flight attendants plan to remain on strike, their union has said, defying government efforts to force them back to work and into binding arbitration over a dispute that has left more than 100,000 travellers stranded around the world during the peak summer travel season. About 10,000 flight attendants who work for Canada’s largest airline walked out on the job early on Saturday amid an increasingly bitter dispute over what the union has described as “poverty wages” and unpaid labour. Continue reading...", "ingested_utc": "2025-08-17T15:33:50Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:33:50Z", "source": "Guardian_World", "title": "Northern Beaches hospital agrees settlement after claims newborn left with lifelong disabilities", "url": "https://www.theguardian.com/australia-news/2025/aug/18/northern-beaches-hospital-agrees-settlement-after-claims-newborn-left-with-lifelong-disabilities-ntwnfb", "id_key": "5a885b5fd0243e93cd19963fc9412568b2df30b998c0c000455d09aa616aa292", "summary": "Exclusive : Child was born via emergency caesarean at 25 weeks after mother says hospital initially failed to diagnose her appendicitis, court documents show Get our breaking news email , free app or daily news podcast Sydney’s Northern Beaches hospital has settled outside court with a family after claims their baby was born by emergency caesarean at 25 weeks and left with lifelong disabilities. Court documents seen by Guardian Australia reveal the baby’s mother presented to the hospital’s birthing unit in 2022, complaining of lower abdominal pain on her right side. The woman – who cannot be named for legal reasons – says she was sent home without being given an ultrasound or undergoing any further investigation. Continue reading...", "ingested_utc": "2025-08-17T15:33:50Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:33:50Z", "source": "Guardian_World", "title": "Downton Abbey costumes and memorabilia for sale in charity auction", "url": "https://www.theguardian.com/tv-and-radio/2025/aug/17/downton-abbey-costumes-and-memorabilia-for-sale-in-charity-auction", "id_key": "165d9c92f3f001fdb068bfd9d23a52cf9f501fede8ec1b3e55eafaf3e7e6d373", "summary": "Lady Mary Crawley’s wedding dress and the Grantham’s family car, a 1925 Sunbeam Saloon, are among the lots Downton Abbey fans will be able to secure a souvenir from the period drama as costumes worn by the characters, furniture used to adorn the stately home, and even the family car used in the popular ITV series and subsequent films are to be sold at auction for charity. A dress worn by the late Dame Maggie Smith , who starred as Violet Crawley, Dowager Countess of Grantham, is among one of the star lots. Continue reading...", "ingested_utc": "2025-08-17T15:33:50Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:33:50Z", "source": "Guardian_World", "title": "Golden eagles poised for reintroduction in England", "url": "https://www.theguardian.com/environment/2025/aug/17/golden-eagles-poised-reintroduction-england", "id_key": "fbe8815401abfa1ebfe7248c2dbea83bd73e400581d50fc39be9025ef40163fa", "summary": "Exclusive: Study expected to confirm there are enough suitable sites to support bird of prey’s return After more than 150 years, golden eagles could be set to return to England, as a study is expected to confirm there are enough suitable sites to support the reintroduction of the UK’s most iconic bird of prey. Golden eagles, which can have a wingspan of more than 2 metres, are occasionally seen in areas such as Northumberland. However, these birds come from a growing population in southern Scotland. A recent project to reintroduce the birds in Scotland is likely to be a model for any reintroduction in England. Continue reading...", "ingested_utc": "2025-08-17T15:33:50Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:34:08Z", "source": "CryptoSlate", "title": "‘People deserve to know this threat is coming’: superintelligence and the countdown to save humanity", "url": "https://cryptoslate.com/people-deserve-to-know-this-threat-is-coming-superintelligence-and-the-countdown-to-save-humanity/", "id_key": "ce6290e49a142b35c1d1ff7bf6d0616baffd6cf8c66c187ae207459deed254e0", "summary": "Welcome to Slate Sundays, CryptoSlate’s new weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. Would you take a drug that had a 25% chance of killing you? Like a one-in-four possibility that rather than curing your ills or […] The post ‘People deserve to know this threat is coming’: superintelligence and the countdown to save humanity appeared first on CryptoSlate .", "ingested_utc": "2025-08-17T15:34:08Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:34:11Z", "source": "CryptoNews", "title": "Wellgistics Rolls Out XRP Ledger Payments for Thousands of US Pharmacies", "url": "https://cryptonews.com/news/wellgistics-rolls-out-xrp-ledger-payments-for-thousands-of-us-pharmacies/", "id_key": "c057e0ef216a06e94db05fc81f5bf8950416a88470bd39fb2cd0f1f082ae875f", "summary": "Wellgistics Health is introducing an XRP Ledger–based payment system to thousands of pharmacies across the United States. The post Wellgistics Rolls Out XRP Ledger Payments for Thousands of US Pharmacies appeared first on Cryptonews .", "ingested_utc": "2025-08-17T15:34:11Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:35:57Z", "source": "NYTimes_World", "title": "Air Canada Flight Attendants Say They Will Defy Back-to-Work Order", "url": "https://www.nytimes.com/2025/08/17/world/canada/air-canada-strike.html", "id_key": "a40899232b40ca1db5837f42ccb8c6f733fc7b3c64054af127520e9bcd59c84a", "summary": "The decision by the union representing the 10,000 workers means that travel chaos will most likely continue for at least a second day.", "ingested_utc": "2025-08-17T15:35:57Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:36:08Z", "source": "FT_Home", "title": "Israeli protesters hold ‘day of stoppage’ to demand Gaza hostage deal", "url": "https://www.ft.com/content/515722ac-b9ec-46b3-99c5-1fd1c0e6d857", "id_key": "cb86a40d4e92be197a5d0dd3626cd1f79b4c0b6715ccd71afa2ffd15841601e8", "summary": "Demonstrators block roads as Netanyahu plans intensified offensive against Hamas in Palestinian enclave", "ingested_utc": "2025-08-17T15:36:08Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:36:36Z", "source": "AlJazeera_All", "title": "Israel intensifies Gaza City attacks, forcing starving Palestinians to flee", "url": "https://www.aljazeera.com/news/2025/8/17/israel-intensifies-gaza-city-attacks-forcing-starving-palestinians-to-flee?traffic_source=rss", "id_key": "457d68373eebd9bbc15bbadaf549367959cb3851cd0b0b9aa9beebbb91c19f4c", "summary": "UN warns of man-made famine in Gaza as starvation deaths rise, Israel steps up plan to ethnically cleanse northern Gaza.", "ingested_utc": "2025-08-17T15:36:36Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T15:36:49Z", "source": "Nikkei_Asia_Top", "title": "Japan to greenlight first yen-based stablecoin", "url": "https://asia.nikkei.com/spotlight/cryptocurrencies/japan-to-greenlight-first-yen-based-stablecoin", "id_key": "e68447596edbd7b36569b4cc519575c03d5e179e9cfaa08a841665a40fd271b5", "summary": "", "ingested_utc": "2025-08-17T15:36:49Z"}
