{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:07Z", "source": "BBC_Business", "title": "Trump's trade war puts US love for Scottish goods to the test", "url": "https://www.bbc.com/news/articles/c4g0jnw7v8jo?at_medium=RSS&at_campaign=rss", "id_key": "f9d2f60fff6905506af0f6d46c84ed8a7ff18624bbc58a59e0a4a9637168cb84", "summary": "The consequences of the tariff hikes are being felt across the world, and not just in direct trade with the US.", "ingested_utc": "2025-08-18T06:59:07Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:09Z", "source": "Guardian_World", "title": "Australia news live: Andrew Leigh backs cancellation of Israeli MP’s visa; former Labor MP appointed gender equality ambassador", "url": "https://www.theguardian.com/australia-news/live/2025/aug/18/politics-ebikes-qantas-lambie-gaza-palestine-danielle-wood-productivity-tax-reform-roundtable-anthony-albanese-jim-chalmers-ntwnfb", "id_key": "5a90eaf247d77fac55034e0065e349dec7bc72c0330d5c01c723bae09e073910", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Shadow education minister says childcare safety reforms should come more quickly Jonno Duniam , the shadow minister for education, said governments on both sides of the spectrum had failed for years to institute reforms on the childcare sector, issuing calls for the Labor government and states to act quickly to make such changes. Both governments of all persuasions have dropped the ball. The government I was a part of dropped the ball. We should have acted on that at the time. The fact that we didn’t and the fact that we are now hearing these stories means we failed. But regardless of who was in power and who didn’t do what, here we are today and we need to act. With the resources of eight states and territories and the commonwealth combined, I would be absolutely stunned if we could not get this thing off the ground in the next few weeks. So I hope that things do speed up. I hope that the end result is a national system. Continue reading...", "ingested_utc": "2025-08-18T06:59:09Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:09Z", "source": "Guardian_World", "title": "Queensland premier rules out changes to coal royalty scheme despite pressure from mining industry", "url": "https://www.theguardian.com/australia-news/2025/aug/18/queensland-coal-royalty-royalties-scheme-qld-premier-david-crisafulli", "id_key": "1ff4ca3968a92b36c0e67147e6e0e175276ccf40cba8956caad387f303857c28", "summary": "David Crisafulli says LNP ‘not touching’ policy charging rates among world’s highest, as conservationists rubbish industry claims levy causing downturn Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Queensland’s premier has ruled out changes to the state’s coal royalties regime, often dubbed the world’s highest, amid pressure from the industry. David Crisafulli gave his strongest denial yet of any changes at a press conference in Emerald, in central Queensland, ahead of a cabinet meeting on Monday. Continue reading...", "ingested_utc": "2025-08-18T06:59:09Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:09Z", "source": "Guardian_World", "title": "Queensland police go to court in bid to stop Story Bridge pro-Palestine protest march", "url": "https://www.theguardian.com/world/2025/aug/18/queensland-police-go-to-court-in-bid-to-stop-story-bridge-pro-palestine-protest-march", "id_key": "f248c2edb7ba0a71a0867effdced47c4e35ba1cbb69178b5f899d31044a70545", "summary": "Case heads to Brisbane magistrates court after mediation between Justice for Palestine Magan-djin and police fails Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The Queensland police service will take protest organisers to court in an effort to halt a planned pro-Palestine march over Brisbane’s Story Bridge this weekend. Justice for Palestine Magan-djin (Brisbane) have advertised plans to march over the bridge at 1pm on Sunday – replicating similar protests that occurred earlier this month in Sydney and Melbourne. Continue reading...", "ingested_utc": "2025-08-18T06:59:09Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:09Z", "source": "Guardian_World", "title": "Monday briefing: What’s at stake for Ukrainians as Trump and Putin talk of ceding land in return for peace", "url": "https://www.theguardian.com/world/2025/aug/18/monday-briefing-whats-at-stake-for-ukrainians-as-trump-and-putin-talk-of-ceding-land-in-return-for-peace", "id_key": "18f09d5fb4273e940867341c92ccf672802a5a09c2f5add6fcd41e0ec2d205f5", "summary": "In today’s newsletter: While global leaders debate maps and borders, Ukrainians endure nightly drone strikes, mass displacement and the slow destruction of their communities Good morning. On Friday, Donald Trump and Vladimir Putin met in Alaska to discuss the future of Ukraine, but there was no deal reached and no big questions answered. Trump appeared deferential to the Russian leader and now backs plans to hand over Ukrainian territory as part of a peace deal. Today he will meet with Volodymyr Zelenskyy and European leaders. In discussions about what a peace settlement would look like, “land swaps” were represented as simple transactions. The fate of people appeared to be a casual afterthought. Trump and Putin are eager to embrace the idea that territory can be bought and sold like real estate, but Guardian reporting exposes the devastating part of this war: human loss. Gaza | Palestinians were gripped by fear and anxiety on Sunday after the Israeli military said it was preparing for the forcible displacement of a million people from Gaza City. Meanwhile tens of thousands of demonstrators gathered in Tel Aviv to call for an end to the war in Gaza. Scotland | The UK’s first transgender judge has launched a case against the UK in the European court of human rights challenging the process that led to the supreme court’s ruling on biological sex. Business | The bosses of Britain’s largest listed companies took home record high pay packets for the third successive year, according to a report . Analysis found that the record set in the last financial year means the average FTSE 100 chief executive is now paid 122 times the salary of the average full-time UK worker. US news | Three people were killed and eight others wounded when multiple gunmen opened fire inside a crowded Brooklyn hookah lounge and restaurant early on Sunday morning, according to authorities. Weather | Hurricane Erin was downgraded to category 3 early on Sunday as its outer bands continued to lash the Virgin Islands and Puerto Rico with heavy rains and tropical storm force winds. Continue reading...", "ingested_utc": "2025-08-18T06:59:09Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:32Z", "source": "CryptoNews", "title": "Bad News for DOGE? Qubic Community Votes to Target Dogecoin After Monero 51% Attack", "url": "https://cryptonews.com/news/qubic-community-votes-to-target-dogecoin-after-monero-51-attack/", "id_key": "9d94caa3f9030c73e8fbd5baf2822e11f860e774608a56c0c5ff82b97c646c90", "summary": "The community behind Qubic has voted to target Dogecoin with its next 51% attack, just days after successfully taking majority control of the Monero network. The post Bad News for DOGE? Qubic Community Votes to Target Dogecoin After Monero 51% Attack appeared first on Cryptonews .", "ingested_utc": "2025-08-18T06:59:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:32Z", "source": "CryptoNews", "title": "Japan Prepares to Approve First Yen-Backed Stablecoin This Autumn: Report", "url": "https://cryptonews.com/news/japan-prepares-yen-backed-stablecoin-approval-this-autumn/", "id_key": "725d5545cc2d64b754b449e13c1beda49537879e7872683615d71af5512a3ba9", "summary": "Japan is set to approve its first yen-backed stablecoin this autumn, enabling remittances and corporate payments with fintech JPYC leading the launch. The post Japan Prepares to Approve First Yen-Backed Stablecoin This Autumn: Report appeared first on Cryptonews .", "ingested_utc": "2025-08-18T06:59:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T06:59:33Z", "source": "CoinJournal", "title": "PUMP price dips 15% as Pump.fun offloads 2.5B tokens", "url": "https://coinjournal.net/news/pump-price-dips-15-as-pump-fun-offloads-2-5b-tokens/", "id_key": "8d7f6f2dff42385142efde2f1b4b82ca8b160733b68a12c8d7166d7aa6affda8", "summary": "The Launchpad has transferred PUMP worth around $9.19M to OKX. The transaction sparked concerns about market confidence and bearish pressure. PUMP price plunged on the daily timeframe. Digital currencies traded in the red on Monday as Bitcoin and Ethereum dropped 2% and 3.20% after an early morning sell-off. Meanwhile, PUMP grabbed attention as its significant […] The post PUMP price dips 15% as Pump.fun offloads 2.5B tokens appeared first on CoinJournal .", "ingested_utc": "2025-08-18T06:59:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:01:24Z", "source": "NYTimes_World", "title": "Air Canada Flight Attendants Say They Will Defy Back-to-Work Order", "url": "https://www.nytimes.com/2025/08/17/world/canada/air-canada-strike.html", "id_key": "f1e07dd4ce0148be6615f50c2e499f33c29286342ebfa696d5677dff48960226", "summary": "The decision by the union representing the 10,000 workers means that travel chaos will continue for at least a second day. Air Canada said it had suspended its reopening plan until Monday evening.", "ingested_utc": "2025-08-18T07:01:24Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:01:31Z", "source": "NPR_Top", "title": "Stronger, bigger Hurricane Erin forecast to create dangerous surf along U.S. coast", "url": "https://www.npr.org/2025/08/17/nx-s1-5505324/hurricane-erin", "id_key": "3895640381fa3288cea500ac169505e465454da17a9292391d761da7aea5f637", "summary": "A stronger and bigger Hurricane Erin pelted parts of the Caribbean and was forecast to create dangerous surf and rip currents along the U.S. East Coast this week.", "ingested_utc": "2025-08-18T07:01:31Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:02:18Z", "source": "FinancialPost_Business", "title": "European Gas Falls Further Ahead of Zelenskiy-Trump Meeting", "url": "https://financialpost.com/pmn/business-pmn/european-gas-falls-further-ahead-of-zelenskiy-trump-meeting", "id_key": "cbcb92f224a9c4d4c908d44930ed735c0a981c7c56db7c4e3bfd93f3ee7b39f4", "summary": "European natural gas prices fell to a fresh 2025 low ahead of US President Donald Trump’s meeting with Ukraine’s Volodymyr Zelenskiy, who faces pressure to reach a peace deal with Russia that involves ceding territory.", "ingested_utc": "2025-08-18T07:02:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:02:18Z", "source": "FinancialPost_Business", "title": "Hair Center of Turkey Achieves Amazing Hair Transplant Results With its New Hybrid Technique", "url": "https://financialpost.com/globe-newswire/hair-center-of-turkey-achieves-amazing-hair-transplant-results-with-its-new-hybrid-technique", "id_key": "385c60ecd0fe6025152e8b2dc5f720faa75631b8cf6965ec062d27f5c34472ef", "summary": "ISTANBUL, Aug. 18, 2025 (GLOBE NEWSWIRE) — Hair Center of Turkey, a leading institution in hair restoration, has announced the launch of its Hybrid Hair Transplant method, which merges the advantages of FUE Sapphire and FUE DHI techniques. The clinic is also introducing an exclusive VIP Package, specifically designed to meet the unique needs of […]", "ingested_utc": "2025-08-18T07:02:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:02:18Z", "source": "FinancialPost_Business", "title": "500 Global and UNDP Launch New Innovation Programs to Boost Africa’s Ecosystem", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/500-global-and-undp-launch-new-innovation-programs-to-boost-africas-ecosystem", "id_key": "239ecb13c906b05b720ace1c8b4c99c1fd9bd4769a7871f9cae33d96b4d656d3", "summary": "The launch is the latest in a series of firm actions to reinforce support for the African venture ecosystem NAIROBI, Kenya — 500 Global, one of the world’s most active venture capital firms1, today announced the launch of their first founder programs in Nairobi, in collaboration with the United Nations Development Programme (UNDP), to support […]", "ingested_utc": "2025-08-18T07:02:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:02:24Z", "source": "Nikkei_Asia_Top", "title": "Closing arguments begin in mogul Jimmy Lai's Hong Kong security trial", "url": "https://asia.nikkei.com/spotlight/hong-kong-security-law/closing-arguments-begin-in-mogul-jimmy-lai-s-hong-kong-security-trial", "id_key": "ff7d363608bc2f3e72dd012710cecc85a2d911b07cd6dab33f3b89257b59ccfb", "summary": "", "ingested_utc": "2025-08-18T07:02:24Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:02:32Z", "source": "HackerNews_Top", "title": "Non-Uniform Memory Access (NUMA) is reshaping microservice placement", "url": "https://codemia.io/blog/path/NUMA-Is-the-New-Network-How-Per-Socket-Memory-Models-Are-Reshaping-Microservice-Placement", "id_key": "60c84c36e56c3d444efea13d1f1b214d6889e53cc273d46e839f158e37797a4d", "summary": "Comments", "ingested_utc": "2025-08-18T07:02:32Z"}
