{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:47:58Z", "source": "Guardian_World", "title": "Putin-Trump summit: US ready to be part of Ukraine security guarantees, says Merz, as Zelenskyy prepares to fly to Washington – live", "url": "https://www.theguardian.com/world/live/2025/aug/16/putin-trump-summit-alaska-us-europe-ukraine-security-guarantees-zelenskyy-latest-news-updates", "id_key": "ae7b35b4cbefe19765ae9f6bf373b6329c3694848a51f7c00e935bdb53de49d3", "summary": "The German chancellor will join Europe’s ‘coalition of the willing’ in talks on Sunday before the Ukrainian and US presidents meet on Monday Zelenskyy to meet Trump on Monday after Putin summit briefing Russia’s reaction to Donald Trump’s summit with Vladimir Putin in Alaska has been nothing short of jubilant, with Moscow celebrating the fact that the Russian leader met his US counterpart without making concessions and now faces no sanctions despite rejecting Trump’s ceasefire demands. “The meeting proved that negotiations are possible without preconditions,” wrote former president Dmitry Medvedev on Telegram. He added that the summit showed that talks could continue as Russia wages war in Ukraine . Continue reading...", "ingested_utc": "2025-08-16T15:47:58Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:47:58Z", "source": "Guardian_World", "title": "Zelenskyy to fly to Washington as Merz says US ready to be part of Ukraine security guarantees – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/15/trump-putin-alaska-meeting-summit-news-updates", "id_key": "b21701b75ccdea4bb0aa1b11097083619a717c484629cf6e960accf54574af27", "summary": "This blog is now closed. Follow the latest updates on the aftermath of the Trump-Putin summit here The president has yet to deplane, but is currently greeting Alaska governor Muke Dunleavy and senators Lisa Murkowski and Dan Sullivan , all Republicans, aboard Air Force One, per the White House. White House press secretary Karoline Leavitt also says that for the expanded bilateral meeting and lunch, Trump, Rubio, and Witkoff will be joined by treasury secretary Scott Bessent , commerce secretary Howard Lutnick , defense secretary Pete Hegseth , and White House chief of staff Susie Wiles . Continue reading...", "ingested_utc": "2025-08-16T15:47:58Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:47:59Z", "source": "Guardian_World", "title": "Time not right to recognise Palestinian state, says Danish PM – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/16/middle-east-crisis-gaza-israel-hamas-lebanon-hezbollah-latest-news-updates", "id_key": "bd68c3e695c1d01c5a4e2439e49f3d4e319d9ce84200428a51f21857bd2f6d23", "summary": "This blog is now closed. You can read all our Middle East coverage here. The Metropolitan police has said that 60 more people will be prosecuted for showing support for Palestine Action, which was proscribed by the UK government last month. More than 700 people have been arrested for supporting the group since its proscription on 5 July. We are deeply concerned about the unimaginable crisis in Gaza, which is having a terrible impact on civilians and especially the children. Starvation is deepening. Water scarcity is increasing very much each day. Colleagues on the ground are reporting that people are now basically rationing between either using water for drinking or for hygiene. Continue reading...", "ingested_utc": "2025-08-16T15:47:59Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:47:59Z", "source": "Guardian_World", "title": "Man arrested after Bournemouth player reports racial abuse at Liverpool match", "url": "https://www.theguardian.com/uk-news/2025/aug/16/man-arrested-bournemouth-liverpool-match-player-antoine-semenyo", "id_key": "72ccba6a52fa2ab939e862679f485a3f1e19b60849a772f1fa69ee3334607e2c", "summary": "Police detain 47-year-old on suspicion of racially aggravated public order offence over alleged abuse of Antoine Semenyo A 47-year-old man has been arrested after a Bournemouth player reported being racially abused during his team’s match against Liverpool on Friday, police have said. The man from Liverpool was arrested on Saturday on suspicion of a racially aggravated public order offence and has been taken into custody to be interviewed, Merseyside police said. Continue reading...", "ingested_utc": "2025-08-16T15:47:59Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:47:59Z", "source": "Guardian_World", "title": "RFK Jr denies 2028 presidential ambitions after attacks from Trump influencer Laura Loomer", "url": "https://www.theguardian.com/us-news/2025/aug/16/rfk-jr-laura-loomer", "id_key": "f6ed5637b1b04243d9b8f1ed70a59268f1238ab57926c44e8e8f67d80835fbe8", "summary": "HHS chief took to social media with deference to president after ‘Trump’s Rasputin’ said he was plotting move The US health and human services (HHS) secretary, Robert F Kennedy Jr , has fended off an attack by conservative firebrand and Donald Trump influencer Laura Loomer by issuing a statement of fealty to the president which calls it “a flat-out lie” that he is running for the White House in 2028. Kennedy, 71, had been under pressure since Loomer, 32, expressed concern in a recent Politico interview that Stefanie Spear, a top aide of the HHS secretary, was trying to “utilize her position to try to lay the groundwork for a 2028 RFK presidential run”. Continue reading...", "ingested_utc": "2025-08-16T15:47:59Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:47:59Z", "source": "Guardian_World", "title": "Hurricane Erin gathers force as it nears Leeward Islands", "url": "https://www.theguardian.com/world/2025/aug/16/hurricane-erin-gathers-force-as-it-nears-north-east-caribbean-leeward-islands", "id_key": "6ac160200b9d1992687c6026e89774b1f4894193897db0e2c5e4baa04aa14f9f", "summary": "Hurricane intensifies to category 4 storm with strong winds and heavy rain expected to cause flooding and landslides Hurricane Erin has intensified into a category 4 storm as it churns its way over the Atlantic, brushing past islands in the north-east Caribbean. The National Hurricane Center (NHC), in Miami, said on Saturday that Erin was still not expected to hit land in the US and would eventually swerve away, but forecasters have warned that strong winds and heavy rain could cause flooding and landslides on nearby islands. Continue reading...", "ingested_utc": "2025-08-16T15:47:59Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:47:59Z", "source": "Guardian_World", "title": "‘Devil in the Ozarks’ spent months planning Arkansas prison escape – report", "url": "https://www.theguardian.com/us-news/2025/aug/16/devil-in-the-ozarks-arkansas-escape-details", "id_key": "46e3d9f28a01deb9ec0bd0b7c350abd2b832b3ec6962cef54fd19f2ffdf692e6", "summary": "Corrections department review shows how Grant Hardin made fake guard uniform and details lax security at facility A former police chief known and convicted murderer known as “the devil in the Ozarks ” spent months planning his escape from an Arkansas prison, and he said lax security in the kitchen where he worked allowed him to gather the supplies he needed, according to an internal review by prison officials released on Friday. The state corrections department’s critical incident review of Grant Hardin’s 25 May escape from the Calico Rock prison provides the most detailed description so far of his planning – and the issues that allowed him to walk out of the facility. Continue reading...", "ingested_utc": "2025-08-16T15:47:59Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:50:18Z", "source": "NPR_Top", "title": "Immigration arrests dip in July, and activists hope they're partly responsible", "url": "https://www.npr.org/2025/08/16/nx-s1-5504144/immigration-arrests-dip-in-july-and-activists-hope-theyre-partly-responsible", "id_key": "92cd80a14b305546907c0ea9016b68668fd16be1b72be739b601b13cb9d742d8", "summary": "Immigration arrests falter in July after a big push for mass deportations in June. Activists in sanctuary jurisdictions hope their resistance plays a role.", "ingested_utc": "2025-08-16T15:50:18Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:50:41Z", "source": "Engadget_All", "title": "This Anker 3-in-1 wireless charging station is 30 percent off right now", "url": "https://www.engadget.com/deals/this-anker-3-in-1-wireless-charging-station-is-30-percent-off-right-now-145325421.html?src=rss", "id_key": "5ad887022522b1d9e8d094e73e663bf02b1b138a3a12abdaedd9f7cf5e101d9a", "summary": "Anker makes some of our favorite charging gear, and now you can save on a bunch of wireless power accessories from the brand. Whether you're going back to school soon or want a new charging station that can power up a few devices at once, there are discounts here worth considering. One of the best is this 3-in-1 MagSafe charging station , on sale for a record low price of $63. The Qi2-certified charger wirelessly charges your compatible iPhone, Apple Watch, and AirPods on one compact and convenient dock. Qi2 boasts 15W of power, so you can take advantage of fast charging on compatible devices. This means the station can charge an iPhone 16 Pro Max to 20 percent in just 20 minutes and an Apple Watch Series 10 from zero to 100 percent in just over an hour. The magnetic stand for your iPhone is adjustable with 45 degrees of vertical rotation and 360 degrees of horizontal rotation, so you can always find the perfect angle for your phone while charging. Being able to wirelessly charge these three daily devices at once might remind you of Apple's wireless charging pad that never was, but Anker's 3-in-1 charging station offers an elegant solution. We tend to like Anker's charging products , and we’ve found they make some of the best charging stations on the market. Anker's products can be a bit pricey, though, which is why the best time to pick them up is during these sales. The company actually has a slew of its charging products on sale right now . Its 3-in-1 wireless charging cube is 31 percent off right now, and its foldable 3-in-1 travel wireless charger is 22 percent off. If your iPhone is Qi2 compatible, then you might also look at Anker's simple Qi2 charging pad , which is 35 percent off for a two-pack right now. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/this-anker-3-in-1-wireless-charging-station-is-30-percent-off-right-now-145325421.html?src=rss", "ingested_utc": "2025-08-16T15:50:41Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:51:14Z", "source": "HackerNews_Top", "title": "Payment Processor Fun 2025 – Making Your Own Merchant Service Provider", "url": "https://voidfox.com/blog/payment_processor_fun_2025_making_your_own_msp/", "id_key": "de167523c82a0498733bfff6c35ac901d9ff0f4381ba375999dc52bdeda61d5b", "summary": "Comments", "ingested_utc": "2025-08-16T15:51:14Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T15:51:14Z", "source": "HackerNews_Top", "title": "Dicing an Onion, the Mathematically Optimal Way", "url": "https://pudding.cool/2025/08/onions/", "id_key": "e892f2c5ca134d3eaee227cf81ea3fc33b30f473c7227727c7e564e7e514f9f9", "summary": "Comments", "ingested_utc": "2025-08-16T15:51:14Z"}
