{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T19:50:26Z", "source": "Engadget_All", "title": "Ayn reveals a Nintendo DS-style handheld that comes in the classic Game Boy Color purple", "url": "https://www.engadget.com/gaming/ayn-reveals-a-nintendo-ds-style-handheld-that-comes-in-the-classic-game-boy-color-purple-194416424.html?src=rss", "id_key": "ed1871a43c7b51b11c7367fa641b350f727397c9cadb8aba1f25c79a042048b5", "summary": "Ayn added more than just a touch of nostalgia with its upcoming dual-screen handheld that gives us modern-day Nintendo DS vibes. After teasing the device in a YouTube video earlier this week, Ayn dropped the full spec sheet, price range and release date for its Thor handhelds. The Thor Lite base model will start at $249 for preorder pricing, but you can opt for the top-of-the-line Thor Max model that goes for $429. Besides the clear purple colorway, the Ayn Thor will come in black, white and rainbow, which colors its buttons like the SNES. Ayn Ayn built all of its Thor models with a primary six-inch AMOLED display with a 120Hz refresh rate and a 1,920 x 1,080 resolution, while the secondary 3.92-inch AMOLED screen will have a 60Hz refresh rate and a smaller 1,240 x 1,080 resolution. The Thor Lite maxes out at 8GB of memory and 128GB of storage, but you can upgrade to 16GB of memory and 1TB of storage with the Thor Max. The Pro and Max models will pack a Snapdragon 8 Gen 2 processor, while the Lite will use the less powerful Snapdragon 865. Outside of the spec differences, all Thor models will run on a 6,000 mAh battery and Android 13. The dual-screen handheld will have video output capabilities, a USB-C port, a 3.5mm audio jack, a TF card slot and can connect via Wi-Fi and Bluetooth. As with all foldable devices , the hinge is often a point of failure, so Ayn built the Thor with a reinforced hinge, along with an active cooling system and Hall effect joysticks. Ayn isn't the only handheld maker getting into dual-screen devices. The market was previously dominated by the Ayaneo Flip DS , which currently starts at $1,139, but Ayaneo has announced a more affordable dual-screen handheld called the Pocket DS. Along with the Retroid Flip 2 that was released earlier this year, Retroid is selling an add-on accessory to make some of its other products into a dual-screen handheld. As for the Ayn Thor, preorders start August 25 at 10:30PM ET, with the first shipments expected in mid-October. This article originally appeared on Engadget at https://www.engadget.com/gaming/ayn-reveals-a-nintendo-ds-style-handheld-that-comes-in-the-classic-game-boy-color-purple-194416424.html?src=rss", "ingested_utc": "2025-08-24T19:50:26Z"}
