{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:45:12Z", "source": "NPR_Top", "title": "Supreme Court allows NIH to stop making nearly $800M in research grants for now", "url": "https://www.npr.org/2025/08/21/g-s1-84441/supreme-court-nih-grants", "id_key": "15d82c61934c59ac1a40962184d3040b02e05e514d0dd93959c6eae1be04f035", "summary": "But the court, in its emergency docket order, also left in place by a 5-4 order a lower court ruling that threw out NIH memos that enforced the administration's policies.", "ingested_utc": "2025-08-21T21:45:12Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:45:12Z", "source": "NPR_Business", "title": "'I regret that I didn't fight harder,' former labor secretary Robert Reich says", "url": "https://www.npr.org/2025/08/21/nx-s1-5507068/i-regret-that-i-didnt-fight-harder-former-labor-secretary-robert-reich-says", "id_key": "622bbdc823fd4340cfe491a4276a5b5761ea7771cd057493ceeb3b41c39af5d6", "summary": "Reich served under President Clinton from 1993 to 1997. He opens his new memoir, Coming Up Short, with an apology on behalf of the Baby Boom generation for failing to build a more just society.", "ingested_utc": "2025-08-21T21:45:12Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:45:17Z", "source": "FT_Markets", "title": "Meg Ryan appointed SEC’s top cop", "url": "https://www.ft.com/content/5ebb0aaf-54c8-4169-9b44-e15c02b94437", "id_key": "32ff779f70f53f56272e0f44cffa35068a33a54ab6a96cd489f5a6db23d1ed0d", "summary": "The curious reshaping of America’s financial regulator", "ingested_utc": "2025-08-21T21:45:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:45:35Z", "source": "Engadget_All", "title": "Bungie's veteran CEO Pete Parsons is leaving the company", "url": "https://www.engadget.com/gaming/bungies-veteran-ceo-pete-parsons-is-leaving-the-company-213626001.html?src=rss", "id_key": "fd6ddd0cb5840740dcaf7eee45175f892e383e1d53b4c0a4e51dd92bd2487c36", "summary": "Bungie CEO Pete Parsons has announced that he's leaving the Halo developer after working at the studio for more than two decades. In Parsons' place, Justin Truman, a general manager on Destiny 2 and Bungie's chief development officer, is taking over as studio head. \"After more than two decades of helping build this incredible studio, establishing the Bungie Foundation and growing inspiring communities around our work, I have decided to pass the torch,\" Parsons shared in a statement on Bungie's website. \"Today marks the right time for a new beginning. The future of Bungie will be in the hands of a new generation of leaders, and I am thrilled to announce that Justin Truman will be stepping into leadership as Bungie's new studio head.\" Parsons oversaw Bungie during a consequential period in the studio's history. Bungie started publishing its own games under his leadership, ending a longterm publishing deal with Activision that helped get Destiny released. Parsons also played a role in the studio's $3.6 million acquisition by Sony, which placed Bungie at the center of plans to develop live-service games for the PlayStation — a move that hasn't really paid off so far. Bungie has faced notable difficulties since coming under Sony ownership. The studio's relative independence did nothing to spare it from having to lay off 220 employees in 2024. Developing Bungie's next game, Marathon, has also seemed like an uphill battle. The game was delayed indefinitely earlier this year following the discovery that the alpha version of Marathon used stolen art assets . Truman's new leadership role suggests Destiny 2 will remain a going concern for Bungie. It might also signal a new relationship with Sony and PlayStation Studios. During a recent earnings call, Sony CFO Lin Tao said Bungie would be less independent in the future, and eventually \"become part of PlayStation Studios,\" PC Gamer reports . This article originally appeared on Engadget at https://www.engadget.com/gaming/bungies-veteran-ceo-pete-parsons-is-leaving-the-company-213626001.html?src=rss", "ingested_utc": "2025-08-21T21:45:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:45:51Z", "source": "FinancialPost_Business", "title": "Musk’s X reaches tentative settlement with former Twitter workers in $500 million lawsuit", "url": "https://financialpost.com/pmn/musks-x-reaches-tentative-settlement-with-former-twitter-workers-in-500-million-lawsuit", "id_key": "53fd4b02c42eb25de8cc127295744747349963787834cd14e387c1009e78fcaa", "summary": "SAN FRANCISCO (AP) — Elon Musk’s X has reached a tentative settlement with former employees of the company then known as Twitter who’d sued for $500 million in severance pay. The parties disclosed the deal in a Wednesday court filing asking for a scheduled Sept. 17 hearing in the case to be postponed. The San […]", "ingested_utc": "2025-08-21T21:45:51Z"}
