{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:49:41Z", "source": "Guardian_Business", "title": "Canada to drop counter-tariffs on some US goods one day after call with Trump", "url": "https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump", "id_key": "6e35517b81f90952e0567512ecd24538705c676c91ea7fd4466e8004f9ffb8f6", "summary": "Mark Carney says change will go into effect on 1 September but tariffs on steel, aluminum and autos will remain Canada will drop its counter-tariffs on some American goods in the coming days, Mark Carney has said, as the country’s prime minister looks to end a protracted trade war with longtime ally the United States. From 1 September, the Canadian government will remove some levies on US goods that comply with the North American free-trade pact, a move meant to “match” how the White House treated Canadian goods. Levies on steel, aluminum and autos will remain in place. Continue reading...", "ingested_utc": "2025-08-22T18:49:41Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:49:42Z", "source": "Guardian_World", "title": "Checked out: Jenrick’s migrant hotel record haunts his rightwing bid for attention", "url": "https://www.theguardian.com/politics/2025/aug/22/checked-out-jenricks-migrant-hotel-record-haunts-his-rightwing-bid-for-attention", "id_key": "275e5cb86b133c8f184270e7aa074029bbe75e127414c6ab8f9f4a333d38bafe", "summary": "Far-right agitator or leadership hopeful? MPs call hypocrisy as former minister rails against system he expanded Robert Jenrick had been migration minister for just a few days in 2022 when he gave a broadcast interview that could easily have been given by a minister in the current government. “Suella Braverman [the former home secretary] and her predecessor, Priti Patel, were procuring more hotels,” he told Sky News . “What I have done in my short tenure is ramp that up and procure even more. Because November, historically, has been one of the highest months of the year for migrants illegally crossing the Channel.” Continue reading...", "ingested_utc": "2025-08-22T18:49:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:49:42Z", "source": "Guardian_World", "title": "David Lammy given warning after fishing with JD Vance without licence", "url": "https://www.theguardian.com/politics/2025/aug/22/david-lammy-avoids-fine-after-fishing-with-jd-vance-without-licence", "id_key": "0c1f0bd704aae27922a9bfa7d434db8a3eb61d861ae5f5ea81584a4cfbe1c566", "summary": "Foreign secretary referred himself to Environment Agency after hosting Vance at Chevening country retreat David Lammy has received a formal warning after reporting himself for fishing without a licence with the US vice-president, JD Vance. The foreign secretary took Vance angling at his official country retreat in Chevening, Kent, on 8 August as he hosted him at the start of a holiday in Britain . Continue reading...", "ingested_utc": "2025-08-22T18:49:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:49:42Z", "source": "Guardian_World", "title": "Trump threatens to send troops to Chicago and says he could bring in ‘regular military’ to Washington DC – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/22/donald-trump-administration-federal-reserve-republicans-democrats-us-politics-live", "id_key": "ebd53305036530cf732f9c21642e24e572c712f66acd47da7154b5596b9f07d2", "summary": "US president attacks Democratic-run cities as he also says Putin might come to US World Cup and confirms $2bn request to Congress to ‘beautify’ capital As we bring you more information about the reported FBI raid on John Bolton’s Maryland home , it’s worth pointing out that Bolton was stripped of his security clearance when Trump started his second term in office. The president also got rid of Bolton’s government detail, despite being the target of an assassination plot due to Bolton’s criticism of the Iranian regime. Bolton served as Trump’s third national security advis er in his first term in office, but has since become a vocal critic of the president . Less than an hour ago, a post from Bolton’s X account critiqued the state of negotiations between Russia and Ukraine. “Russia has not changed its goal: drag Ukraine into a new Russian Empire,” he wrote. “Meanwhile, meetings will continue because Trump wants a Nobel Peace Prize, but I don’t see these talks making any progress.” Continue reading...", "ingested_utc": "2025-08-22T18:49:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:49:42Z", "source": "Guardian_World", "title": "Trump targets Chicago and New York as Hegseth orders weapons for DC troops", "url": "https://www.theguardian.com/us-news/2025/aug/22/trump-troops-dc-new-york-chicago", "id_key": "c0991ea93baa9f5738b3d185b69a0c5d1e74ca7f7f8e072e29235923220e94fb", "summary": "President plots expansion of crime crackdown as Pentagon chief says troops patrolling DC streets will be armed Donald Trump has threatened to take his federal crackdown on crime and city cleanliness to New York and Chicago, as defense secretary Pete Hegseth ordered that national guard troops patrolling the streets of Washington DC under federal control will now be armed. The US president talked to reporters in the Oval Office and said: “When ready, we will start in Chicago … Chicago is a mess.” He added that then the administration “will help with New York”, amid the controversial and aggressive federal efforts to control leading Democratic-voting cities, each of which has a Black mayor. Continue reading...", "ingested_utc": "2025-08-22T18:49:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:49:42Z", "source": "Guardian_World", "title": "Wildfire explodes in California wine country as heatwave scorches US west", "url": "https://www.theguardian.com/us-news/2025/aug/22/california-wildfire-napa-county", "id_key": "1f3f99357f9ae8270fcbd81b6e38d1cbf4859548f4a114174c98637bc036a0d8", "summary": "Multiple fires have ignited this week with searing heat expected to last days and extend to Pacific north-west Multiple wildfires have ignited across California as the state continues to scorch in a multi-day heatwave that is expected to last through the weekend. The largest this week, named the Pickett fire, exploded in size on Thursday as it burned in a remote area of Napa county, and covered more than 2,100 acres (850 hectares) by Friday morning. Evacuation orders and warnings have been issued Thursday for hundreds of residents around Calistoga, a small city in the region known for its wine, as firefighters faced challenging conditions, working through dangerously high temperatures and rugged terrain. The fire’s perimeter is 0% contained. Continue reading...", "ingested_utc": "2025-08-22T18:49:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:49:42Z", "source": "Guardian_World", "title": "Air pollution from oil and gas causes 90,000 premature US deaths each year, says new study", "url": "https://www.theguardian.com/us-news/2025/aug/22/air-pollution-oil-gas-health-study", "id_key": "aaa741feac6861fb4274e75d688532a7675f97c2684c4a5c405ed3d82f60122c", "summary": "Study analyzed health impacts of fossil fuels from exploration to end use, and found communities of color bear brunt of harm Air pollution from oil and gas causes more than 90,000 premature deaths and sickens hundreds of thousands of people across the US each year, a new study shows, with disproportionately high impacts on communities of color. More than 10,000 annual pre-term births are attributable to fine particulate matter from oil and gas , the authors found, also linking 216,000 annual childhood-onset asthma cases to the sector’s nitrogen dioxide emissions and 1,610 annual lifetime cancer cases to its hazardous air pollutants. Continue reading...", "ingested_utc": "2025-08-22T18:49:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:50:02Z", "source": "CryptoSlate", "title": "Crypto investor loses $1M in Uniswap scam exploiting Ethereum’s EIP-7702", "url": "https://cryptoslate.com/crypto-investor-loses-1m-in-uniswap-scam-exploiting-ethereums-eip-7702/", "id_key": "c1cb57688dbe431f1fd7749737f9a3a1f45052a93482492dde3ba09d98f14703", "summary": "A single phishing attack drained nearly $1 million worth of tokens from a crypto investor who unknowingly signed a batch of malicious transactions disguised as Uniswap swaps, according to blockchain security firm Scam Sniffer. In an Aug. 22 post on X, Yu Xiang, founder of blockchain security firm SlowMist, noted that the incident involved five […] The post Crypto investor loses $1M in Uniswap scam exploiting Ethereum’s EIP-7702 appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T18:50:02Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:50:06Z", "source": "CryptoNews", "title": "ASIC Removes 14,000 Scam Sites in Two Years, Crypto Fraud Accounts for 20% of Takedowns", "url": "https://cryptonews.com/news/asic-removes-14000-scam-sites-in-two-years-crypto-fraud-accounts-for-20-of-takedowns/", "id_key": "7b8d6985427e3e132616027297ecf18b958c715f5382cb43e74c7891a7991b73", "summary": "Australian Securities and Investments Commission has removed more than 14,000 investment scam and phishing websites since July 2023 with crypto investment scams accounting for approximately 3,015 takedowns or 20% of all removals. The post ASIC Removes 14,000 Scam Sites in Two Years, Crypto Fraud Accounts for 20% of Takedowns appeared first on Cryptonews .", "ingested_utc": "2025-08-22T18:50:06Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:50:06Z", "source": "CryptoNews", "title": "Weekly Crypto Regulation News: Lawmakers Split on Crypto Policy and Wyoming Launches Stablecoin", "url": "https://cryptonews.com/news/weekly-crypto-regulation-news-lawmakers-split-on-crypto-policy-as-treasury-weighs-genius-act-wyoming-launches-stablecoin/", "id_key": "64bc072a849bc2e6ed206aaa6846391aa6375bd97be651b3a95ec4e26203f73e", "summary": "The U.S. Treasury has taken the next step in implementing the recently passed GENIUS Act, formally requesting public comments on how financial institutions can strengthen protections against illicit finance risks tied to digital assets. The post Weekly Crypto Regulation News: Lawmakers Split on Crypto Policy and Wyoming Launches Stablecoin appeared first on Cryptonews .", "ingested_utc": "2025-08-22T18:50:06Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:50:06Z", "source": "CryptoNews", "title": "Ethereum Price Live: ETH Nears All-Time High, Just 1% Away", "url": "https://cryptonews.com/news/ethereum-price-live-eth-nears-all-time-high-just-50-away/", "id_key": "e7a9a11b9d54280341f571cc0cb010c12f9bf970fbc5bd27654bb370d3606c2c", "summary": "Follow real-time updates as Ethereum edges within striking distance of a new record high. The post Ethereum Price Live: ETH Nears All-Time High, Just 1% Away appeared first on Cryptonews .", "ingested_utc": "2025-08-22T18:50:06Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:50:07Z", "source": "CoinJournal", "title": "What sparked the sudden crypto market surge?", "url": "https://coinjournal.net/news/what-sparked-the-sudden-crypto-market-surge/", "id_key": "4b8cebb1ff90617937c8206b2b34e5bf45eda95db16c0c2144b5a2402b469612", "summary": "Crypto market cap has rebounded above $4T after Fed rate-cut signals. Bitcoin reserve proposals boost confidence in digital assets. Ethereum and Chainlink lead altcoin rally with double-digit gains. The cryptocurrency market has staged a remarkable rebound, with total market capitalisation climbing more than 5% in the past 24 hours to reclaim the $4.01 trillion level. […] The post What sparked the sudden crypto market surge? appeared first on CoinJournal .", "ingested_utc": "2025-08-22T18:50:07Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:52:54Z", "source": "NYTimes_Business", "title": "British Government Set to Take Control of Sanjeev Gupta’s Speciality Steel UK", "url": "https://www.nytimes.com/2025/08/22/business/britain-steel-takeover.html", "id_key": "3f60e1ed16b2f79480eede668ed8323ac9741a61d7ef0f1bcfc33c42128d1e66", "summary": "The move, which comes after a court-approved liquidation of Speciality Steel, is meant to preserve jobs and domestic manufacturing.", "ingested_utc": "2025-08-22T18:52:54Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:52:54Z", "source": "NYTimes_Business", "title": "Nvidia Is Making a New Chip for China Amid Debate on AI Exports", "url": "https://www.nytimes.com/2025/08/22/business/jensen-huang-nvidia-china.html", "id_key": "543699e57654437cc2942248b5d147f775204ca6e0b9e3bd750ccdbccd47e098", "summary": "Jensen Huang, Nvidia’s chief executive, said he plans to ask the Trump administration’s permission to sell a more powerful chip to Chinese companies.", "ingested_utc": "2025-08-22T18:52:54Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:52:54Z", "source": "NYTimes_World", "title": "Canada To Drop Some Retaliatory Tariffs on U.S. Products, Carney Says", "url": "https://www.nytimes.com/2025/08/22/world/canada/canada-us-tariffs-drop-trump.html", "id_key": "db9908dd60e32cc81f057926d3d14796aa6f1ceb19e20b6f4a39d3da05d089df", "summary": "Canada’s leader said he would follow the United States in dropping tariffs against American goods covered by the existing free trade agreement.", "ingested_utc": "2025-08-22T18:52:54Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:02Z", "source": "NPR_Top", "title": "Canada removes some of its retaliatory tariffs on the U.S.", "url": "https://www.npr.org/2025/08/22/nx-s1-5511357/canada-carney-tariffs-us", "id_key": "a12749947e241b3172684c40c77a9a675a4827e0c359688469af5bb07cf6e8bf", "summary": "Canada is dropping retaliatory tariffs to match U.S. tariff exemptions for goods covered under the United States-Mexico-Canada trade pact, Prime Minister Mark Carney announced Friday.", "ingested_utc": "2025-08-22T18:53:02Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:04Z", "source": "NPR_Economy", "title": "Trump calls for resignation of Fed governor in latest line of attack", "url": "https://www.npr.org/2025/08/20/nx-s1-5508276/trump-calls-for-resignation-of-fed-governor-in-latest-line-of-attack", "id_key": "9a53a26f2f7be8f468a25dc05d05b4746067205164bf4c576b6a27dfc0b5a9f7", "summary": "President Trump is calling for the resignation of Federal Reserve governor Lisa Cook after a Trump ally accused her of making false statements on mortgage applications.", "ingested_utc": "2025-08-22T18:53:04Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:06Z", "source": "FT_Home", "title": "Tariff revenue will cut US deficits by $4tn, fiscal watchdog says", "url": "https://www.ft.com/content/f996ece9-d9e2-4a06-957a-487994f6a7e7", "id_key": "315d17c5831605c33a3946f22314993f94c21c6d05fff3a1226aafea4aeb28cf", "summary": "Congressional Budget Office estimate offsets concerns about fiscal effects of Donald Trump’s tax bill", "ingested_utc": "2025-08-22T18:53:06Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:08Z", "source": "FT_Markets", "title": "Government supporting four out of UK’s six steel companies", "url": "https://www.ft.com/content/642d59c1-1694-4a15-a063-0336b3c1f2b4", "id_key": "fb98bc6f46e6d9141717c53a67e0d0257fd3521f1f9960e4578ccd43b6bcfbbf", "summary": "Intervention at Speciality Steel deepens taxpayer support for struggling but strategically important sector", "ingested_utc": "2025-08-22T18:53:08Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:26Z", "source": "ArsTechnica_All", "title": "Google says it dropped the energy cost of AI queries by 33x in one year", "url": "https://arstechnica.com/ai/2025/08/google-says-it-dropped-the-energy-cost-of-ai-queries-by-33x-in-one-year/", "id_key": "05ec166391a35529979840ca50bc7c49197bdd190caa5cf2cb79032020fac71a", "summary": "The company claims that a text query now burns the equivalent of 9 seconds of TV.", "ingested_utc": "2025-08-22T18:53:26Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:26Z", "source": "WIRED_All", "title": "The Best Big Screen Chromebook Is On Sale Now", "url": "https://www.wired.com/story/acer-cx15-deal/", "id_key": "d75b100c9b8aabf68b3121d827c8fc63a7d0bd60848b2ea959e1404569cef769", "summary": "A discount on the Asus CX15 Chromebook brings the price down to just $159.", "ingested_utc": "2025-08-22T18:53:26Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:28Z", "source": "Engadget_All", "title": "Apple is reportedly considering using Gemini to power the new Siri", "url": "https://www.engadget.com/ai/apple-is-reportedly-considering-using-gemini-to-power-the-new-siri-184528449.html?src=rss", "id_key": "bfbaf19a128cd5b2cea1159254c362780e890f3b3392618f848f241605691c7e", "summary": "Apple might use Gemini to power its revamped version of Siri, Bloomberg reports . The companies are in the early stages of exploring a partnership, with Google training a version of its Gemini model that can run on Apple's servers. The iPhone maker was previously reported to be considering similar partnerships with OpenAI and Anthropic . \"The company is simultaneously developing two versions of the new Siri: one dubbed Linwood that is powered by its models and another code-named Glenwood that runs on outside technology, \" Bloomberg writes. A final decision has yet to be made on what AI model Apple will ultimately use, but it's entirely possible it sticks with its internally-developed models. While seceding a potentially key technology to a competitor seems decidedly un-Apple, it's a testament to how much difficulty the company has had rolling out Apple Intelligence. Apple included the majority of its new AI features in the release of iOS 18 , but failed to ship an updated version of Siri that can draw on personal data to take action in apps. Apple ultimately admitted the Siri update was delayed in March, with the new launch now expected sometime in 2026 . The turmoil caused by the delay reportedly led to Apple's various AI projects changing hands internally , and the company's decision to consider using a third-party AI model. As of the launch of the Pixel 10 , Gemini now offers a similar set of capabilities to what Apple promised with the new Siri. It could presumably do the same things on iOS with the right changes. Using a version of Gemini that runs on Apple's hardware and servers — the company calls this Private Cloud Compute — could also add an additional layer of security. Apple was reportedly planning to offer Gemini as an alternative to ChatGPT in Apple Intelligence, but the option has yet to ship. Having Gemini power some of its AI features would put Apple in a similar position to Samsung, who's Galaxy AI relies on a mix of custom models and Gemini. This article originally appeared on Engadget at https://www.engadget.com/ai/apple-is-reportedly-considering-using-gemini-to-power-the-new-siri-184528449.html?src=rss", "ingested_utc": "2025-08-22T18:53:28Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:38Z", "source": "TheStreet_Top", "title": "Amazon is selling a $390 porch swing for $161 that's perfect for outdoor lounging year-round", "url": "https://www.thestreet.com/deals/outsunny-two-person-patio-swing-bench-amazon-sale", "id_key": "ae9fd756c818c7b862e30f5bd1a7b347d76961843bf0d85bdbda2fbdc3b94f4d", "summary": "It’s a nice addition to my deck, and very relaxing.\"", "ingested_utc": "2025-08-22T18:53:38Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:38Z", "source": "TheStreet_Top", "title": "Apple raises subscription prices across multiple services", "url": "https://www.thestreet.com/technology/apple-makes-a-decision-that-will-anger-loyal-customers-and-subscribers", "id_key": "5020609b43d9e1ca8879e0460758ff01e095a7f26bedf04a109229921ea8b828", "summary": "Apple's services division is a huge moneymaker and the company is milking it for all it's worth.", "ingested_utc": "2025-08-22T18:53:38Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:39Z", "source": "AlJazeera_All", "title": "Canada to ease most retaliatory tariffs against United States", "url": "https://www.aljazeera.com/news/2025/8/22/canada-to-ease-most-retaliatory-tariffs-against-united-states?traffic_source=rss", "id_key": "9a8c640883eedc1fa8dfed4710c79ae0abd85122ebf02f3e07c6bcb47358722f", "summary": "Prime Minister Mark Carney says most Canadian goods will be exempted from US tariffs while some sectoral duties remain.", "ingested_utc": "2025-08-22T18:53:39Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:39Z", "source": "AlJazeera_All", "title": "Why are Sudanese refugees returning home despite the civil war?", "url": "https://www.aljazeera.com/video/the-take-2/2025/8/22/why-are-sudanese-refugees-returning-home-despite-the-civil-war?traffic_source=rss", "id_key": "0ffbba22bb979acfde573f63196e8d0564d938d1756102856eef349eac0a9d5a", "summary": "UNHCR’s Mamadou Dian Balde on why Sudanese refugees return home despite war, cholera and collapse of services.", "ingested_utc": "2025-08-22T18:53:39Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:39Z", "source": "AlJazeera_All", "title": "FBI raids home and office of ex-Trump official John Bolton", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/22/fbi-raids-home-and-office-of-ex-trump-official-john-bolton?traffic_source=rss", "id_key": "730ea5f1278f029bb593d43706610427cbd3dc659f3642d340983dfef2b40214", "summary": "FBI agents are searching the home and office of former US National Security Adviser John Bolton.", "ingested_utc": "2025-08-22T18:53:39Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:39Z", "source": "AlJazeera_All", "title": "At least 65 killed in Gaza as Israel escalates attacks on Gaza City", "url": "https://www.aljazeera.com/news/2025/8/22/at-least-52-killed-in-gaza-as-israel-escalates-attacks-on-gaza-city?traffic_source=rss", "id_key": "a62caf61df907da8f94f3cc6c808d183fd28109202d4248caa7e1c9dc8193554", "summary": "Israel's defence minister warns that Gaza City will be destroyed unless Hamas yields to Israel's terms for ending war.", "ingested_utc": "2025-08-22T18:53:39Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:46Z", "source": "FinancialPost_Business", "title": "Ninepoint Partners Announces August 2025 Cash Distributions for ETF Series Securities", "url": "https://financialpost.com/globe-newswire/ninepoint-partners-announces-august-2025-cash-distributions-for-etf-series-securities", "id_key": "32d4dc4d8cc8005e54bb4731ca61ba6eb9a861bc538cde57c5462af028d92209", "summary": "TORONTO, Aug. 22, 2025 (GLOBE NEWSWIRE) — Ninepoint Partners LP (“Ninepoint Partners”) today announced the August 2025 cash distributions for its ETF Series securities. The record date for the distributions is August 29, 2025. All distributions are payable on September 8, 2025. The per-unit August 2025 distributions are detailed below: Ninepoint ETF Series Ticker Distribution […]", "ingested_utc": "2025-08-22T18:53:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:46Z", "source": "FinancialPost_Business", "title": "Databricks, among Silicon Valley’s hottest AI startups, is set to cinch a US$100 billion valuation with Canada in tow", "url": "https://financialpost.com/technology/ai-startup-databricks-100-billion-valuation-canada", "id_key": "39f4bf98e9959a9ff5330ce78698c4660332f295ceae14ae6e7d8bfb3e0f01f3", "summary": "Among a growing cohort of U.S.-based AI startups setting up shop in Canada to access tech talent and clients as the global AI race accelerates", "ingested_utc": "2025-08-22T18:53:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:46Z", "source": "FinancialPost_Business", "title": "Leading Edge Materials Announces Update on Previously Announced Non-Brokered Private Placement", "url": "https://financialpost.com/globe-newswire/leading-edge-materials-announces-update-on-previously-announced-non-brokered-private-placement", "id_key": "01b7f27ebb1204fae0eb4d16a4c3ce52fc7a3d0d56c563b10801d01cedbce2c5", "summary": "LEADING EDGE MATERIALS ANNOUNCES UPDATE ON PREVIOUSLY ANNOUNCED NON-BROKERED PRIVATE PLACEMENT NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES OR ANY OTHER JURISDICTION IN WHICH THE DISTRIBUTION OR RELEASE WOULD BE UNLAWFUL. ANY FAILURE TO COMPLY WITH THIS RESTRICTION MAY CONSTITUTE A VIOLATION OF U.S. SECURITIES LAWS. THIS PRESS […]", "ingested_utc": "2025-08-22T18:53:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:46Z", "source": "FinancialPost_Business", "title": "Ninepoint Partners Announces Estimated August 2025 Cash Distributions for Ninepoint Cash Management Fund – ETF Series", "url": "https://financialpost.com/globe-newswire/ninepoint-partners-announces-estimated-august-2025-cash-distributions-for-ninepoint-cash-management-fund-etf-series", "id_key": "ea9315a56da8b6adb27f3aab4996603c5d57d226ff09216165222a00ca93b06d", "summary": "TORONTO, Aug. 22, 2025 (GLOBE NEWSWIRE) — Ninepoint Partners LP (“Ninepoint Partners”) today announced the estimated August 2025 cash distribution for the ETF Series of Ninepoint Cash Management Fund (the “Fund”). Ninepoint Partners expects to issue a press release on or about August 28, 2025, which will provide the final distribution rate. The record date […]", "ingested_utc": "2025-08-22T18:53:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:46Z", "source": "FinancialPost_Business", "title": "How Nvidia’s chips became central to the U.S.-China trade war", "url": "https://financialpost.com/pmn/how-nvidias-chips-became-central-to-the-u-s-china-trade-war", "id_key": "76d0906f47bd28840bcf9155ea51a8828c6ddfebbfa9f0dc1ab9911d523f1775", "summary": "When Nvidia CEO Jensen Huang revealed Friday that the company is working with the Trump administration on a new computer chip designed for sale to China, it marked the latest chapter in a long-running debate over how the U.S. should compete with China’s technological ambitions. The reasoning has sometimes changed — with U.S. officials citing […]", "ingested_utc": "2025-08-22T18:53:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:46Z", "source": "FinancialPost_Business", "title": "China’s Dongfeng Plans to List EV Unit, Take Rest Private", "url": "https://financialpost.com/pmn/business-pmn/chinas-dongfeng-plans-to-list-ev-unit-take-rest-private", "id_key": "5c70aca7a3a309cdf83c7232c508cb5f6458a3de4e5a0fe246235e3b8f0b7881", "summary": "Dongfeng Motor Group Co. plans to withdraw its Hong Kong shares in a new twist on a long-awaited restructuring, part of transaction that will result in a new stock listing for its Voyah line of luxury new-energy vehicles.", "ingested_utc": "2025-08-22T18:53:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:53:53Z", "source": "Nikkei_Asia_Top", "title": "Corporate Japan seeks ways to cushion Trump's sector-specific tariffs", "url": "https://asia.nikkei.com/economy/trade-war/trump-tariffs/corporate-japan-seeks-ways-to-cushion-trump-s-sector-specific-tariffs", "id_key": "b9888ce5d70bc53fb5e41f5902dd22ff59dae6f3c49b17e2071f437c555a4749", "summary": "", "ingested_utc": "2025-08-22T18:53:53Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T18:54:01Z", "source": "HackerNews_Top", "title": "US probes delays in Tesla crash reports involving driver-assistance systems", "url": "https://www.reuters.com/legal/litigation/us-probes/delays-tesla-crash-reports-involving-driver-assistance-systems-2025-08-21/", "id_key": "a8662c56337a7386ae65f7e513122e63e0a5fb344f416936711d248063eb58b7", "summary": "Comments", "ingested_utc": "2025-08-22T18:54:01Z"}
