{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:51:23Z", "source": "Engadget_All", "title": "One of our favorite Bluetooth speakers drops to $60 on Amazon", "url": "https://www.engadget.com/deals/one-of-our-favorite-bluetooth-speakers-drops-to-60-on-amazon-132149518.html?src=rss", "id_key": "904370227a95a0e4eafe3268ece2caf3995eda5ea6797c806eae4b8de3a22215", "summary": "Yes, summer might be coming to a close sooner than any of us would like, but that doesn't mean the outdoor fun has to end. Currently, Ultimate Ears' Wonderboom 4 Bluetooth speaker is down to $60 from $100 in blue and black. The 40 percent discount brings the speaker to a record-low price. It's one of our picks for best portable Bluetooth speakers for 2025 thanks to features like its 14 hours of battery life and its IP67 dust and waterproof rating. There are a few other great sales on UE speakers right now. The Megaboom 4 portable speaker is down to $150 from $200 — a 25 percent discount in every color. Then there's a 33 percent discount on the standard Boom 4 portable speaker , dropping to $100, from $150. The sale is available in blue, black and red. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/one-of-our-favorite-bluetooth-speakers-drops-to-60-on-amazon-132149518.html?src=rss", "ingested_utc": "2025-08-16T14:51:23Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:51:31Z", "source": "TheStreet_Top", "title": "It's time to put these three crypto IPOs on your radar after Circle and Bullish's big debuts", "url": "https://www.thestreet.com/investing/after-circle-and-bullishs-big-debuts-its-time-to-put-these-three-crypto-ipos-on-your-radar", "id_key": "4c70be525ecdb7f21fc99c7fb65e83ef2370b6425fe1ca5e6d7c1f8261ac218d", "summary": "Why buy crypto when you can buy the companies selling the pickaxes?", "ingested_utc": "2025-08-16T14:51:31Z"}
