{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:53:35Z", "source": "BBC_Business", "title": "Trump backs down from 250% EU pharma tariff in deal", "url": "https://www.bbc.com/news/articles/ckgjwk8gze7o?at_medium=RSS&at_campaign=rss", "id_key": "33ce3879bc593caa4eafe64d517c3111e0486d268c68f7a06395d0eb04698898", "summary": "The US and EU have released details of the new trade deal reducing tariffs between teh two partners.", "ingested_utc": "2025-08-21T13:53:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:53:38Z", "source": "Guardian_World", "title": "Bolsonaro given 48 hours to explain alleged plans to flee to Argentina", "url": "https://www.theguardian.com/world/2025/aug/21/bolsonaro-given-48-hours-to-explain-alleged-plans-to-flee-to-argentina", "id_key": "d06afe11a94c6cc3eeb404fb2e9afa92be681778c4126018d0a21b99bab7ff2a", "summary": "Brazilian supreme court judge sets ultimatum after police claim far-right populist sought to flee to avoid punishment over failed coup A supreme court judge has given Brazil’s ex-president, Jair Bolsonaro, 48 hours to explain police claims he was planning to flee to Argentina to avoid punishment for allegedly masterminding a failed coup after losing the 2022 election. Bolsonaro’s trial for the alleged attempt to seize power is scheduled to conclude early next month, with the far-right populist facing more than four decades in prison if found guilty. Continue reading...", "ingested_utc": "2025-08-21T13:53:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:53:38Z", "source": "Guardian_World", "title": "Italian police arrest Ukrainian man over Nord Stream pipelines blast", "url": "https://www.theguardian.com/world/2025/aug/21/italian-police-arrest-ukrainian-man-over-nord-stream-pipelines-blast", "id_key": "34cbdab65ea6b5c511c9e4dd4c183ea5de2b5689ff243f53aa38416a354d23ad", "summary": "Serhiy K is believed to have been onboard boat from where 2022 attack on gas pipelines was carried out A Ukrainian man alleged to have been involved in the 2022 detonation of the Nord Stream pipelines that carried gas from Russia to Germany, has been arrested in Italy, according to German authorities. The man, identified only as Serhiy K, is believed to have been onboard the sailing boat from where the attacked was allegedly carried out. Continue reading...", "ingested_utc": "2025-08-21T13:53:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:53:38Z", "source": "Guardian_World", "title": "Revealed: Israeli military’s own data indicates civilian death rate of 83% in Gaza war", "url": "https://www.theguardian.com/world/ng-interactive/2025/aug/21/revealed-israeli-militarys-own-data-indicates-civilian-death-rate-of-83-in-gaza-war", "id_key": "b452e4af06570b92ca560aa583198ab97a12eb75447796262783a56727447c09", "summary": "Figures from classified IDF database listed 8,900 named fighters as dead or probably dead in May, as overall death toll reached 53,000 Figures from a classified Israeli military intelligence database indicate five out of six Palestinians killed by Israeli forces in Gaza have been civilians, an extreme rate of slaughter rarely matched in recent decades of warfare. As of May, 19 months into the war, Israeli intelligence officials listed 8,900 named fighters from Hamas and Palestinian Islamic Jihad as dead or “probably dead”, a joint investigation by the Guardian, the Israeli-Palestinian publication +972 Magazine and the Hebrew-language outlet Local Call has found. 8,900 Named fighters listed as dead or ‘probably dead’ in Israeli database as of May 2025 Continue reading...", "ingested_utc": "2025-08-21T13:53:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:53:38Z", "source": "Guardian_World", "title": "Delta and United sued by passengers over window seats that have no windows", "url": "https://www.theguardian.com/us-news/2025/aug/21/delta-united-lawsuit-windowless-seats", "id_key": "96f08deaf0cd1c4b56ee7e43d6a4ce9e1350fbeb984cfabb2a1c301596b4172b", "summary": "Suit claims that plaintiffs bought tickets for plane seats next to windows that instead were next to windowless walls Delta Air Lines and United Airlines are being sued by a group of passengers who claim they paid extra money to sit in “window” seats which were not actually next to windows. Proposed class actions were filed against United in San Francisco federal court and against Delta in Brooklyn , New York, federal court, seeking millions of dollars in damages for more than 1 million passengers at each airline. Continue reading...", "ingested_utc": "2025-08-21T13:53:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:54:05Z", "source": "Unchained", "title": "Wormhole Foundation to Counter LayerZero’s Bid for Stargate", "url": "https://unchainedcrypto.com/wormhole-foundation-to-counter-layerzeros-bid-for-stargate/", "id_key": "cb741e2f86bc4e263fa7fddc913baff52b6b840916facbe8bef4c9935a2420cc", "summary": "The Wormhole Foundation, the entity behind the giant cross-chain messaging protocol Wormhole, plans to make a counteroffer against LayerZero’s $110 million bid to acquire Stargate. Wormhole is considered LayerZero’s biggest competitor. Last week, LayerZero proposed acquiring Stargate, and swapping all Stargate’s STG tokens for LayerZero’s ZRO tokens at a fixed ... The post Wormhole Foundation to Counter LayerZero’s Bid for Stargate appeared first on Unchained .", "ingested_utc": "2025-08-21T13:54:05Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:55:57Z", "source": "NYTimes_World", "title": "Suspect Is Arrested in Sabotage of Pipelines Between Russia and Germany", "url": "https://www.nytimes.com/2025/08/21/world/europe/nord-stream-pipeline-attacks-arrest.html", "id_key": "621816a635a83ed259cf2009adaf9608b95fea3ef1591727174616bdbe47788d", "summary": "German authorities said a Ukrainian man suspected of coordinating the attacks on the Nord Stream pipelines in 2022 had been taken into custody by the Italian police.", "ingested_utc": "2025-08-21T13:55:57Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:56:29Z", "source": "Engadget_All", "title": "Sennheiser updates the Ambeo Max soundbar with lossless audio, customizable immersion and more", "url": "https://www.engadget.com/home/home-theater/sennheiser-updates-the-ambeo-max-soundbar-with-lossless-audio-customizable-immersion-and-more-134707400.html?src=rss", "id_key": "774513f9e96653123be645bcffb1ce85b86c766a7e693f7467039af26af2c2be", "summary": "Sennheiser's most expensive Ambeo soundbar is getting a substantial update. The company announced that the Ambeo Soundbar Max , a $2,000 beast of a living room speaker, will gain two features it calls Customizable Immersion and Voice Enhancement Mode. Plus, the company is adding lossless audio support on top of Dolby Atmos Music. The firmware update will equip the Max with Ambeo OS2 and is available via free download through the Sennheiser Smart Control app for iOS and Android. With Customizable Immersion, Sennheiser will give users the ability to adjust volume levels for side, top and center channel virtualization. The company says this will allow customers to tailor the immersion to their preferences or to the content they're watching. As you might expect, Voice Enhancement Mode boosts dialogue to ensure it remains clear when sound effects or music would otherwise overpower the mix in movies, TV shows or during sports events. The Ambeo Soundbar Max already offered support for spatial audio for tunes via Dolby Atmos Music, but now the living room speaker will allow you to play lossless audio too. Sennheiser says you can expect up to 24-bit/96kHz through Google Cast and up to 24-bit/192kHz from Tidal Connect. The Ambeo Soundbar Max originally arrived in 2019 as the Ambeo Soundbar. Sennheiser changed the name when it expanded the Ambeo Soundbar lineup, which now includes the mid-sized Plus and compact Mini options. The Max was $2,500 at launch before rising to $3,000, but the company is now selling it's biggest home theater unit for $2,000. That may seem like a lot for one piece of your setup, but Sennheiser promises the combination of bass performance and Ambeo tech means you won't need a separate subwoofer or rear satellite speakers. Those claims held up during my review of the soundbar back when it debuted. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/sennheiser-updates-the-ambeo-max-soundbar-with-lossless-audio-customizable-immersion-and-more-134707400.html?src=rss", "ingested_utc": "2025-08-21T13:56:29Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:56:45Z", "source": "FinancialPost_Business", "title": "Walmart reports rare profit miss, blames higher insurance claims", "url": "https://financialpost.com/news/retail-marketing/walmart-profit-miss-higher-claims", "id_key": "b1a19fbdcb1aa4cc6b5d6adde3ab26d078e4ce67d3f8135797997186240f8e8f", "summary": "Adjusted earnings per share came in at 68 cents U.S. for the second quarter", "ingested_utc": "2025-08-21T13:56:45Z"}
