{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T04:00:44Z", "source": "Guardian_World", "title": "Ukraine live updates: Trump and European leaders press Putin to agree to Zelenskyy meeting", "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news", "id_key": "97043fb341f33bab121242e9d6238408a4fa76783f7cc7d63e71bdb130b5bc2c", "summary": "US president says arrangements being made for bilateral meeting between Putin and Zelenskyy and that US will help guarantee Ukraine’s security if a deal is reached Full report: Trump arranging Zelenskyy-Putin meeting as European leaders push for US security guarantees Sketch: All smoke and no fire as Zelenskky emerges unbruised after Trump meet Welcome to our live coverage of the latest diplomatic efforts to find an end to the war in Ukraine. Vladimir Putin has agreed to face-to-face talks with Volodymyr Zelenskyy, according to Donald Trump and European leaders, although the Kremlin has yet to confirm a meeting will take place. German chancellor Friedrich Merz said Putin told Trump in a call during the White House meeting that he was ready to meet Zelenskyy “within the next two weeks” . Kremlin aide Yuri Ushakov said Putin and Trump only discussed the “idea” of direct Russia-Ukraine talks in Monday’s phone call. Trump told Zelenskyy the US would help guarantee Ukraine’s security in any deal to end the war , though the extent of any assistance was not immediately clear. “I believe this is a major step forward,” Zelenskyy said, also saying security guarantees for Ukraine would probably be worked out within 10 days. The US president ruled out a ceasefire in the Russia-Ukraine war during a meeting with Zelenskyy and European leaders at the White House , despite last week warning Moscow of “very severe consequences” if Vladimir Putin didn’t agree to halt the fighting. Trump said while sitting with the leaders on Monday: “All of us would obviously prefer an immediate ceasefire while we work on a lasting peace. Maybe something like that could happen. As of this moment, it’s not happening.” Trump described his meeting with Zelenskyy and the leaders of Britain, Germany, France, Italy, Finland, the European Union and Nato as “a very good, early step for a war that has been going on for almost four years”. He also said on social media that vice-president JD Vance, secretary of state Marco Rubio and special envoy Steve Witkoff were “coordinating with Russia and Ukraine”. “Everyone is very happy about the possibility of peace for Russia/Ukraine,” Trump said. French president Emmanuel Macron called for stepping up sanctions against Russia if Putin does not move forward on peace with Ukraine . Merz said Ukraine should not be forced to surrender its Donbas region to Russia in talks, likening it to the US giving up Florida. Trump, however, seemed clearly swayed by Putin from their talks in Alaska last Friday and echoed the Russian president’s talking points , saying several times on Monday that ending the war was “up to” both Zelenskyy and Putin – rather than just Putin, who invaded Ukraine. Trump also said: “We also need to discuss the possible exchanges of territory, taking into consideration the current line of contact – that means the war zone .” Ukraine will promise to buy $90bn of US weapons financed by Europe as part of a deal to get guarantees from the US for its security if there is a peace settlement with Russia, Zelenskyy said. “There indeed is a package with our proposals worth $90bn,” the Ukrainian president said. “And we have agreements with the US president that when our export opens, they will buy Ukrainian drones. This is important for us.” In stark contrast to the heated exchange during Zelenskyy’s first trip to Trump’s White House in February, the Ukrainian president’s charm offensive this time around looked to pay off , allowing him to emerge unscathed. Zelenskyy – who wore a black military-style suit and presented a letter from his wife, Olena Zelenska, for Melania Trump in response to her letter to Putin – said this meeting with Trump was his “best” so far. Continue reading...", "ingested_utc": "2025-08-19T04:00:44Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T04:01:09Z", "source": "CoinJournal", "title": "Asian markets open: BTC slips 1.1% to $116k as traders brace for August weakness", "url": "https://coinjournal.net/news/asian-markets-open-btc-slips-1-1-to-116k-as-traders-brace-for-august-weakness/", "id_key": "a0e8d4920d73b4de8475cf1d97d6c7d398634c12f2edcb268746c74d95b9bb05", "summary": "Crypto markets show a split between institutional bulls and retail bears. Prediction markets signal a bearish end to August for Bitcoin. Derivatives data shows caution, with funding rates turning negative. A profound and unsettling divide is splitting the cryptocurrency market in two as the trading day begins in East Asia. While the world’s largest institutions […] The post Asian markets open: BTC slips 1.1% to $116k as traders brace for August weakness appeared first on CoinJournal .", "ingested_utc": "2025-08-19T04:01:09Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T04:03:53Z", "source": "Nikkei_Asia_Top", "title": "US court tosses suit against Texas restricting Chinese property ownership", "url": "https://asia.nikkei.com/politics/international-relations/us-china-tensions/us-court-tosses-suit-against-texas-restricting-chinese-property-ownership", "id_key": "c57a974f3a6536c42af5bcb2595b9db00c1a8cb181ee6f5bd8cb619e5a4f415e", "summary": "", "ingested_utc": "2025-08-19T04:03:53Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T04:04:02Z", "source": "HackerNews_Top", "title": "Int. Association for the Preservation of Spiritualist and Occult Periodicals", "url": "https://iapsop.com", "id_key": "139f220666315b051e1e9589a59bdc7588ebbf33a41963f9bba5c80284fd8694", "summary": "Comments", "ingested_utc": "2025-08-19T04:04:02Z"}
