{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T14:53:51Z", "source": "CryptoBriefing", "title": "Trump Jr.-backed Thumzup to acquire Dogehash in all-stock deal to establish a premier Dogecoin mining platform", "url": "https://cryptobriefing.com/dogecoin-mining-platform-acquisition-news/", "id_key": "7cd40f58ef194e67ce56bfd648628eabaeec0044c82f827875264812c1fc0ba2", "summary": "The acquisition could significantly boost Dogecoin's market presence and influence, potentially reshaping the crypto mining landscape. The post Trump Jr.-backed Thumzup to acquire Dogehash in all-stock deal to establish a premier Dogecoin mining platform appeared first on Crypto Briefing .", "ingested_utc": "2025-08-19T14:53:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T14:53:58Z", "source": "Unchained", "title": "SEC Delays Deciding on Multiple Crypto ETFs Until October", "url": "https://unchainedcrypto.com/sec-delays-deciding-on-multiple-crypto-etfs-until-october/", "id_key": "7bbd7b5ca5dc3deb90922562c29772f7dd7d45f8cc3f25ae589712ce5bf16b1b", "summary": "The U.S. Securities and Exchange Commission (SEC) has delayed decisions on multiple high-profile crypto exchange-traded funds (ETFs), pushing the review deadlines into October 2025. Two Solana ETFs – one from 21Shares and the other from Bitwise – have a new decision date of Oct. 16. An XRP-based ETF from 21Shares ... The post SEC Delays Deciding on Multiple Crypto ETFs Until October appeared first on Unchained .", "ingested_utc": "2025-08-19T14:53:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T14:53:58Z", "source": "Unchained", "title": "Circle’s Arc Blockchain Integrates With Fireblocks", "url": "https://unchainedcrypto.com/circles-arc-blockchain-integrates-with-fireblocks/", "id_key": "b8a4c8ebe7dfa6ffaef9e48d719a30be3b2d031d32e0bd0f2549b39235300efd", "summary": "Circle’s new Arc blockchain, a layer 1 network purpose-built for stablecoin finance, will debut with institutional access via integration with Fireblocks. Fireblocks is a digital asset custody and tokenization platform serving over 2,400 banks and fintech firms. The early integration positions Circle to offer immediate institutional-grade access to Arc, as ... The post Circle’s Arc Blockchain Integrates With Fireblocks appeared first on Unchained .", "ingested_utc": "2025-08-19T14:53:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T14:53:58Z", "source": "Unchained", "title": "U.S. Treasury Seeks Public Input on Illicit Activity After GENIUS Act Signing", "url": "https://unchainedcrypto.com/u-s-treasury-seeks-public-input-on-illicit-activity-after-genius-act-signing/", "id_key": "7a93b524c983453033e4bf105e15425a6c2ac71e071bbc62f2b962ff27a589d6", "summary": "The U.S. Treasury Department has issued a public call for comments related to the detection and prevention of illicit activities involving digital assets, following the signing of the GENIUS Act into law. The Treasury is seeking feedback on “innovative or novel methods, techniques, or strategies” that could be used to ... The post U.S. Treasury Seeks Public Input on Illicit Activity After GENIUS Act Signing appeared first on Unchained .", "ingested_utc": "2025-08-19T14:53:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T14:53:58Z", "source": "Unchained", "title": "Ethereum Validator Exit Queue Hits Record 910,000 ETH", "url": "https://unchainedcrypto.com/ethereum-validator-exit-queue-hits-record-910000-eth/", "id_key": "d74e2512484c06331fc6529711b578cfa5718c10ff90e761f7ab98e832b18503", "summary": "A record 910,461 ETH was waiting to exit the Ethereum network as of Aug. 18, with wait times of about 15 days and 17 hours. In dollar terms, the amount of ETH in the validator exit queue sits at around $3.9 billion and amounts to over 2.5% of ETH’s total ... The post Ethereum Validator Exit Queue Hits Record 910,000 ETH appeared first on Unchained .", "ingested_utc": "2025-08-19T14:53:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T14:56:16Z", "source": "WIRED_All", "title": "Labubus Are on Track to Be a Billion-Dollar Business This year", "url": "https://www.wired.com/story/labubu-pop-mart-earnings-2025/", "id_key": "29ca09d642f030ebe33cb110e7639836a837aa4d65793d66111961048d48099a", "summary": "Pop Mart, the Chinese company behind the Labubu franchise, has sold $670 million worth of related products so far this year—more than iconic US toy lines Barbie and Hot Wheels.", "ingested_utc": "2025-08-19T14:56:16Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T14:56:34Z", "source": "FinancialPost_Business", "title": "IQM to Integrate Quantum Computer Into Oak Ridge National Laboratory’s HPC Systems", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/iqm-to-integrate-quantum-computer-into-oak-ridge-national-laboratorys-hpc-systems", "id_key": "db9a2b3daa331a023305d7b25337f60abfe69e04e03420900f6b6beadd83cf6d", "summary": "IQM Radiance 20-qubit upgradeable full stack superconducting quantum computer will be the first on-premises quantum computer at Oak Ridge National Laboratory (ORNL). The system will be delivered by the third quarter of 2025, and it will be integrated with ORNL’s high-performance computing (HPC) systems to advance hybrid quantum-classical application development. TENNESSEE, USA & ESPOO, Finland […]", "ingested_utc": "2025-08-19T14:56:34Z"}
