{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T06:49:11Z", "source": "Guardian_World", "title": "Government to ‘feel the pressure’ after Gaza protests, says Greens leader – as it happened", "url": "https://www.theguardian.com/australia-news/live/2025/aug/24/australia-news-live-pro-palestine-marches-expected-to-attract-huge-turnout-after-declaration-of-famine-in-gaza-ntwnfb", "id_key": "2d71a2e80f1eaca62bdc40c73803f5854968ea18c19c4892a9e80458daefe598", "summary": "This blog is now closed Get our breaking news email , free app or daily news podcast David Littleproud continues to insist the Coalition is not setting itself up for another election defeat by maintaining its support for nuclear power. Speaking to 2GB on Sunday, Littleproud said the Coalition would take a different approach than it did at the last election by lifting the moratorium on nuclear power generation in Australia and “let the market do it”. I just say to your city viewers, regional Australia is bearing the brunt of this. I’m seeing towns and I’m actually seeing families being torn up by these renewable projects that are tearing up their productivity, your food security and actually the native environment. And it’s all without premise. Artificial intelligence was absolutely central to our discussions because it will be absolutely gamechanging in our economy and our society into the future. Getting it to 8% will be a good effort but not good enough, as minister Mark Butler has pointed out, so we will continue to work with the states on providing the support that people need and deserve, particularly in this instance, when it comes to Thriving Kids. Well, that’s the ongoing discussions that we’ve been having, whether it’s treasurers, health ministers, NDIS ministers, leaders, have been having this discussion since the deal was struck. What’s the best way to implement. Two deals, not one. They are closely related. There are billions and billions of dollars tied up in them and so we’ve been trying to progress both of those deals at once for good reason because there are swings and roundabouts for both of us. Continue reading...", "ingested_utc": "2025-08-24T06:49:11Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T06:49:11Z", "source": "Guardian_World", "title": "Trout farm in Cotswolds tourist hotspot accused of welfare abuses", "url": "https://www.theguardian.com/world/2025/aug/24/bibury-trout-farm-cotswolds-accused-animal-welfare-abuses", "id_key": "f6e007c9737c966e5cb6f421510ccf6531720550052710581a8b3e5c1266db09", "summary": "Exclusive: Charity says footage shows fish being struck repeatedly and at least one child taking part in killing fish Animal welfare campaigners allege that a “harrowing series of welfare abuses” have taken place at one of England’s oldest working trout farms in a tourist hotspot in the Cotswolds, including the participation of children in killing fish. Animal Equality UK, a charity that works to end cruelty to farmed animals, has released video footage that it claims shows fish being repeatedly beaten with batons, mishandled and left to suffocate by untrained members of the public including a child at Bibury trout farm in Gloucestershire. Continue reading...", "ingested_utc": "2025-08-24T06:49:11Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T06:52:01Z", "source": "AlJazeera_All", "title": "Drug Trafficking on the Dark Web | True Crime Reports", "url": "https://www.aljazeera.com/video/true-crime-reports/2025/8/24/drug-trafficking-on-the-dark-web-true-crime-reports?traffic_source=rss", "id_key": "1c0e88370de40cc5cc394030cebd6c0d48c877e526e5a2fabed19189995ebb8b", "summary": "Ross Ulbricht built an empire in the shadows where drugs, weapons, and stolen secrets flowed freely.", "ingested_utc": "2025-08-24T06:52:01Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T06:52:22Z", "source": "HackerNews_Top", "title": "Programming People (2016)", "url": "https://leftoversalad.com/c/015_programmingpeople/", "id_key": "688ba9ed8ee3ed082850d28b19e00d03a2614300533f1e05cca361da170f82a0", "summary": "Comments", "ingested_utc": "2025-08-24T06:52:22Z"}
