{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:42:00Z", "source": "Guardian_World", "title": "Ice is processing Kilmar Ábrego García for deportation, Kristi Noem says – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/25/donald-trump-national-guard-plans-chicago-washington-dc-us-politics-latest-updates-news", "id_key": "2aca207c0613f8af871f3f351ce4eb1d75d2f0a1ae07c2aa3c5319964d898ec1", "summary": "US homeland security secretary says Ábrego García is being processed for deportation but doesn’t say where he will be sent amid concerns he will go to Uganda Kilmar Ábrego García detained after reporting to US immigration agents The justice department is alleging in a new court filing that three Smartmatic executives who were indicted last year on bribery and money-laundering charges transferred money from a 2018 voting machine contract with Los Angeles county into slush funds that were originally set up to pay bribes to election officials in Venezuela and the Philippines between 2012 and 2016 to obtain and retain lucrative election contracts. Prosecutors say one of the executives transferred an undisclosed amount from the $282m LA county contract into the slush funds in 2019 but did not say if anyone actually received bribes from the county’s money at that point. Continue reading...", "ingested_utc": "2025-08-25T14:42:00Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:42:00Z", "source": "Guardian_World", "title": "Thousands under evacuation orders in California and Oregon as wildfires burn", "url": "https://www.theguardian.com/us-news/2025/aug/25/california-oregon-pickett-flat-wildfires", "id_key": "c784034c21674c996c624ad033234c48a9e9c35e4a1b3e0cf0ea49e0990492c3", "summary": "Pickett fire chars Napa wine country while predicted thunderstorms add to danger of Oregon’s Flat fire Thousands of homes in northern California wine country and central Oregon were under evacuation orders as firefighting crews battled wildfires in dry, hot weather. The Pickett fire, which had charred more than 6,800 acres of Napa county, was just 13% contained by Monday morning, according to the California department of forestry & fire protection, or Cal Fire. Continue reading...", "ingested_utc": "2025-08-25T14:42:00Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:42:18Z", "source": "BitcoinMagazine", "title": "Bitcoin Price Drops Again — And Nope, It’s Still Not Because of the Fed", "url": "https://bitcoinmagazine.com/markets/bitcoin-price-drops-again-and-nope-its-still-not-because-of-the-fed", "id_key": "e5855e241841b8fab58aebefc1cb22a1e1031838da80bc7d33335ac98d7aa200", "summary": "Bitcoin Magazine Bitcoin Price Drops Again — And Nope, It’s Still Not Because of the Fed The bitcoin price is yo-yoing around like a piñata. What is going on? Who shoved it? And what’s it to do with Powell, the Fed, the bitcoin treasury companies and, uh, just ordinary markets doing markets-y things? This post Bitcoin Price Drops Again — And Nope, It’s Still Not Because of the Fed first appeared on Bitcoin Magazine and is written by Joakim Book .", "ingested_utc": "2025-08-25T14:42:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:42:20Z", "source": "CryptoSlate", "title": "BitMine volume rockets to top 20 passing JPMorgan as $2.8B trading frenzy shocks Wall Street", "url": "https://cryptoslate.com/bitmine-ranks-in-top-20-us-stocks-with-1000-surge-in-ethereum-era/", "id_key": "390a4c268d1b82da4237c228e0247847b3103621eec6576bf7a2bf37ff13f6dd", "summary": "BitMine, an Ethereum-focused firm, announced that its shares have become one of the most heavily traded equities in the United States. In its Aug. 25 disclosure, the company referenced Fundstrat data showing that its stock recorded an average daily trading volume of $2.8 billion over the five trading days ending Aug. 24. That figure placed […] The post BitMine volume rockets to top 20 passing JPMorgan as $2.8B trading frenzy shocks Wall Street appeared first on CryptoSlate .", "ingested_utc": "2025-08-25T14:42:20Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:42:21Z", "source": "CryptoBriefing", "title": "Webull brokerage reopens crypto trading for US users after 2023 suspension", "url": "https://cryptobriefing.com/webull-crypto-trading-us-return/", "id_key": "eaeebe1b1a4cfad66f9b125e5d23e511e11210642c549e9312b47e07244fd82b", "summary": "Webull's crypto trading resumption may enhance portfolio diversification and competitiveness, potentially influencing broader market dynamics. The post Webull brokerage reopens crypto trading for US users after 2023 suspension appeared first on Crypto Briefing .", "ingested_utc": "2025-08-25T14:42:21Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:42:24Z", "source": "CryptoNews", "title": "Circle Chief Tarbert Holds Stablecoin Meetings With Top South Korean Bankers", "url": "https://cryptonews.com/news/circle-chief-tarbert-holds-stablecoin-meetings-with-top-south-korean-bankers/", "id_key": "d28a600a28f2262ced2b74d95d7939263c15b2ad7012d15b505ab0d596363546", "summary": "The President of the USD Coin (USDC) issuer Circle Heath Tarbert has held stablecoin-themed Meetings with some of South Korea’s top bankers. The post Circle Chief Tarbert Holds Stablecoin Meetings With Top South Korean Bankers appeared first on Cryptonews .", "ingested_utc": "2025-08-25T14:42:24Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:28Z", "source": "FT_Home", "title": "Israel says it will scale back presence in Lebanon if Hizbollah disarmed", "url": "https://www.ft.com/content/917c4e08-ed84-4cfb-adde-bdb38cf57b1e", "id_key": "041e35fab7e4a32af9b6f939381a7c0bb07b04f1e4ab10d4af4efcaeaa33da4d", "summary": "Israeli forces to make ‘phased reduction’ in southern regions if Lebanese army removes weapons from Shia militant group", "ingested_utc": "2025-08-25T14:44:28Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:29Z", "source": "FT_Markets", "title": "Why bitcoin treasury companies are a fool’s paradise", "url": "https://www.ft.com/content/478ea5bc-ea18-44f7-9da1-602ebe283fca", "id_key": "6ef74bb7c93223275f8e1d5296fb6b934f279f2713db3dfc4d39aa3d9ccd44b4", "summary": "In a crypto winter, the consequences could be painful for investors", "ingested_utc": "2025-08-25T14:44:29Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:29Z", "source": "FT_Markets", "title": "London’s IPO drought: advisers bank on a bounceback", "url": "https://www.ft.com/content/1a878393-e6e2-4caf-a185-29164ceede84", "id_key": "76ba58eb8dd574a3c70bc6baf5f6669a334770f91294a9ba22ed012c639c7358", "summary": "Law firms and consultants start to recruit specialists again after three-year dearth of listings work", "ingested_utc": "2025-08-25T14:44:29Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:47Z", "source": "TheVerge_All", "title": "AI doesn’t belong in journaling", "url": "https://www.theverge.com/analysis/764519/ai-gemini-pixel-journal-app", "id_key": "9d761950de507a5ece2e57df53a03020e3dab7b696cd8f3c5c6ea55734acf419", "summary": "In July 2023, I deleted the Day One journaling app from my phone and laptop. It was perhaps the best thing I've done as a lifelong diarist. The decision was prompted by Apple announcing its Journal app at WWDC that year. In that keynote, Apple said it would use \"on-device machine learning\" to provide prompts […]", "ingested_utc": "2025-08-25T14:44:47Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:48Z", "source": "TechCrunch_All", "title": "Yottar wants to help energy users find capacity on the electrical grid", "url": "https://techcrunch.com/2025/08/25/yottar-wants-to-help-energy-users-find-capacity-on-the-electrical-grid/", "id_key": "1c7354ae41abfa35cb416598fb8767fff07ba3b9062ce76c955cb4eadaf14715", "summary": "The startup maps utility assets and collects data on electricity demand, which helps customers find locations ripe for upgrades or new equipment.", "ingested_utc": "2025-08-25T14:44:48Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:48Z", "source": "TechCrunch_All", "title": "Next set of VC judges locked in for Startup Battlefield 200 at TechCrunch Disrupt 2025", "url": "https://techcrunch.com/2025/08/25/next-batch-of-startup-battlefield-200-judges-revealed/", "id_key": "5c14317e958d1684088d3d52ffe985f5022a3d903c9f4068e567cb2d4e1e3baf", "summary": "The Startup Battlefield 2025 judging panel is getting even stronger. Our first wave of VCs brought serious firepower, and now we’re adding more top investors who will grill founders, unpack the big questions, and help crown this year’s $100,000 champion at TechCrunch Disrupt, October 27–29 in San Francisco’s Moscone West.", "ingested_utc": "2025-08-25T14:44:48Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:49Z", "source": "ArsTechnica_All", "title": "SpaceX’s latest Dragon mission will breathe more fire at the space station", "url": "https://arstechnica.com/space/2025/08/spacexs-latest-dragon-mission-will-breathe-more-fire-at-the-space-station/", "id_key": "ea8c608b4bc6e5b9b2d434367452c712e2ea9ab1958389ffcde6062f6ccd273e", "summary": "\"The boost kit will help sustain the orbiting lab's altitude, starting in September.\"", "ingested_utc": "2025-08-25T14:44:49Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:51Z", "source": "Engadget_All", "title": "The best Labor Day sales for 2025: Get up to 50 percent off tech from Apple, Anker, Shark and others", "url": "https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-get-up-to-50-percent-off-tech-from-apple-anker-shark-and-others-120049434.html?src=rss", "id_key": "28f7313ca2e320885a500a9417d5968d30c04559fc48c1f9e1e6e86a837d905b", "summary": "Labor Day may bring about the unofficial end to summer, but on the bright side, it can be a good time to save on tech. While seasonal holidays like Memorial Day and Labor Day aren’t the boon for tech deals as Prime Day or Black Friday can be, you can still find some good deals across the web. That’s particularly true if you’re going back to school soon, or are shopping for someone imminently heading back to campus. Engadget has you covered for all of the best Labor Day sales on tech. Since this time of year does overlap with the back-to-school season, students should be first in line to check out these deals. If you need some new gadgets for college, or refreshed tech to help you out in your first job after graduating, now's the time to see if you can get it for less. Student discounts are handy and exclusive to those who can prove their student status, but the good thing about Labor Day sales is that anyone can take advantage of them — student ID not required. Best Labor Day sales: Engadget's top picks Apple MacBook Air (13-inch, M4) for $799 ($200 off): Apple's latest MacBook Air is the top pick in our guide to the best laptops , and it earned a score of 92 in our review . The M4 model isn't a major refresh overall, but that's not a bad thing — the design remains exceptionally thin, light and well-built, with long battery life and a top-notch keyboard and trackpad. Now it's a bit faster thanks to the updated chipset. Apple AirPods Pro 2 for $169 (32 percent off): The AirPods Pro 2 are Apple’s best set of wireless earbuds for now, as they offer the full set of Apple-focused features, strong ANC, onboard volume controls, a comfy in-ear design and a warm sound profile that most should find agreeable. They can even work as a hearing aid , though their six-hour battery life still isn’t the best, and you should only get them if you’re all-in on Apple hardware. But if that’s the case, we consider them the best wireless earbuds for iPhone owners. Apple iPad (11-inch, A16) for $299 ($50 off): Apple's entry-level iPad is, unsurprisingly, the best iPad option for those on a budget. It has solid performance thanks to the A16 chipset, 128GB of storage in the base model and good battery life. Apple iPad Air (11-inch, M3) for $449 ($150 off): The latest iPad Air is a relatively minor update; the only big addition is a more powerful M3 chip. However, we still recommend this iPad over the base model in our iPad buying guide : Its display is more color-rich and better at fending off glare, its speakers are more robust, it works with Apple’s best accessories and its performance should hold up better in the years ahead. Apple Mac mini M4 for $499 ($100 off): The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard, two front-facing USB-C ports, an extra Thunderbolt 4 port and the ability to drive three external displays. We gave the M4 Pro model a review score of 90 . Anker 621 5K magnetic power bank for $28 (30 percent off) : This slim battery pack attaches magnetically to the backs of iPhones to provide power when you need it most. Its 5K capacity will be more than enough to revive a near-dead iPhone 16, and it's svelte enough that you can use your phone while it's powering up without any discomfort. It will also work with most MagSafe-compatible cases. Google Pixel 10 smartphone + $100 Amazon gift card for $799 ($100 off): More of a pre-order deal than a Labor Day deal, this bundle includes a free gift card when you order the latest Google Pixel phone in advance. You'll find different gift card deals at Amazon depending on which phone you go with: the Pixel 10 Pro and Pro XL have a $200 gift cards included, while the Pixel 10 Pro Fold comes with a free $300 gift card. Eufy 11S Max robot vacuum for $159 (43 percent off): This model is one of our favorite budget robot vacuums thanks to its slim design that lets you get underneath furniture more easily and strong suction power for its size. Note that it does not have Wi-Fi connectivity, but it comes with a remote that lets you control the robot to your liking. Shark AI Ultra robot vacuum for $298 (50 percent off): This Shark robot vacuum is a version of one of our favorites and it comes with a auto-empty base that can hold up to 60 days worth of debris. It has strong suction power and home mapping capabilities, so you can tailor cleaning jobs to your liking in addition to putting the robot on a cleaning schedule. Blink Outdoor 4 security cameras (3 camera system) for $100 (47 percent off): Some of our favorite security cameras , Blink Outdoor 4 devices support 1080p video, two-way talk, motion alerts and night vision. The most convenient thing about these is that they're totally wireless and run on AA batteries that can last up to two years before you need to replace them. That combined with their weather-proof design allows you to place them both inside and outside. Cosori 9-in-1 air fryer for $90 (25 percent off): One of our picks for the best air fryers , this Cosori model has a spacious six-quart cooking basket and nine prep modes to choose from. In our testing, it consistently crisped up all kinds of foods, from frozen appetizers to raw proteins, and it has a nifty safety feature with its built-in basket release button. HORI Piranha Plant camera for Switch 2 for $40 (33 percent off): If you plan on taking advantage of the Switch 2's video and group chat feature, there's no cuter way to do it than with this Piranha Plant camera. In addition to using it with the pot as a stand, the plant itself detaches from the pot so you can use the camera in portable mode with the USB port on the new console. ESPN Unlimited with Disney+ and Hulu (with ads) for $30/month ($6/month off): ESPN’s new streaming service is officially available now, and new subscribers can get Disney+ and Hulu included for one year when they sign up. The regular price of the new ESPN Unlimited plan is $30 per month, but this bundle offer throws in Disney+ and Hulu (with ads) for one year at no extra cost. If you want to break it down, you’re essentially getting each of the three services for $10 monthly with this offer. NordVPN deal — Get up to 77 percent off two-year plans: Most of NordVPN's two-year plans are on sale right now. You'll get 77 percent off the Prime tier, bringing the price down to $189 for 27 months of service (Nord throws in an extra three months for free). Arguably the best plan for most people is the Plus tier, which is 73 percent off and down to $108 for the 27-month term. MasterClass deal — Get 50 percent off one-year subscriptions: You can sign up for one year of MasterClass access for as low as $5 per month thanks to this sale that runs through September 1. A subscription lets you watch hundreds of online video classes taught by experts in their fields, and subject matter ranges from writing to cooking to sports. Best Labor Day sales on tech Beats Studio Pro headphones for $180 (49 percent off) 8Bitdo Ultimate 2C Wired Controller for $15 (25 percent off) Sony WH-1000XM4 headphones for $198 (43 percent off) Anker Laptop Power Bank (25K, 100W) for $95 (30 percent off) Amazon Fire Max 11 tablet for $175 (24 percent off) Nothing Headphones (1) for $269 ($30 off) Amazon Labor Day sale: Get up to 40 percent off headphones, earbuds, tech accessories and more Sonos back-to-school sale: Save up to 25 percent on headphones and speakers Ooni Labor Day sale: Get 20 percent off the Koda 2 Max and save on other pizza ovens Solo Stove Labor Day sale: Get 20 percent off fire pits and 15 percent off select accessories Meater Labor Day sale: Get up to 27 percent off smart meat thermometers Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-get-up-to-50-percent-off-tech-from-apple-anker-shark-and-others-120049434.html?src=rss", "ingested_utc": "2025-08-25T14:44:51Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:44:51Z", "source": "Engadget_All", "title": "Apple will reportedly bring back Touch ID on a foldable iPhone", "url": "https://www.engadget.com/mobile/apple-will-reportedly-bring-back-touch-id-on-a-foldable-iphone-135831748.html?src=rss", "id_key": "9658a43319ff7d9fe87659f90c030986c3201689c3a613f32d7a07e73de3db75", "summary": "As an iPhone user who has watched the release of foldable Android mobile phones with envy, I can't wait for 2026. Yes, Apple's 2025 iPhone launch event is next month, but I've been eyeing Apple's first foldable iPhone, rumored to launch next year. It's part of three years of Apple's planned iPhone redesigns. While this would be a new addition to Apple's lineup, Bloomberg reports that it will come with a throwback feature: Touch ID. Why it's reverting to Touch ID from Face ID is unclear as the last use was on the third-generation iPhone SE. Apple did something similar when it brought back its MagSafe charging line with the iPhone 12's release — it initially worked with MacBooks. According to Bloomberg, Apple was initially going to give the new iPhone on-cell touch sensors, but pivoted to an in-cell option, similar to the current iPhone. An in-cell screen builds the touch sensors directly into the display, while an on-cell adds a layer on top, creating a thicker end product, which can be more noticeable in folding phones where its display creases. The foldable iPhone is also rumored to have four cameras and come in white, black, light blue and light gold. While we'll have to wait a while for the foldable rumors to be confirmed, this year's event shouldn't be without its interesting moments. There will likely be an ultra-thin device called the iPhone Air , reported to have just one camera and a basic A19 chip. This article originally appeared on Engadget at https://www.engadget.com/mobile/apple-will-reportedly-bring-back-touch-id-on-a-foldable-iphone-135831748.html?src=rss", "ingested_utc": "2025-08-25T14:44:51Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:45:00Z", "source": "AlJazeera_All", "title": "Syria condemns new Israeli “military incursion” in Damascus countryside", "url": "https://www.aljazeera.com/news/2025/8/25/syria-condemns-new-israeli-military-incursion-in-damascus-countryside?traffic_source=rss", "id_key": "ccb2275002930a37c88e58120cba342bb20269d0fbe682d5df1be167cc6ec10e", "summary": "Syria's foreign minister accuses Israel of violating a 1974 agreement to advance its 'expansionist and partition plans'.", "ingested_utc": "2025-08-25T14:45:00Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:45:00Z", "source": "AlJazeera_All", "title": "Western media outlets “tend to privilege Israeli sources”", "url": "https://www.aljazeera.com/video/quotable/2025/8/25/western-media-outlets-tend-to-privilege-israeli?traffic_source=rss", "id_key": "b0f49bcee64b18d727deed9dae193f94b898590a33cbe9ff7167277e2371e8ea", "summary": "“What you end up getting is an overwhelmingly Israeli voice and kind of suppressed Palestinian voice.”", "ingested_utc": "2025-08-25T14:45:00Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:45:06Z", "source": "FinancialPost_Business", "title": "Ukrainian Drone Strikes Deepen Russia’s Summer Fuel Crunch", "url": "https://financialpost.com/pmn/business-pmn/ukrainian-drone-strikes-deepen-russias-summer-fuel-crunch", "id_key": "9cbf870883309434340e0b569db71c0db2511e146d45f440b85c2758f19e4d62", "summary": "Ukrainian drone strikes on Russian oil refineries have exacerbated a summer crisis on the domestic fuel market, leading to a spike in prices amid high seasonal demand.", "ingested_utc": "2025-08-25T14:45:06Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:45:21Z", "source": "HackerNews_Top", "title": "Show HN: Base, an SQLite database editor for macOS", "url": "https://menial.co.uk/base/", "id_key": "82a165ce0d012ee232efd89a4cdfbb279a91b7b23fd912028fa40ecd138d2b9d", "summary": "Comments", "ingested_utc": "2025-08-25T14:45:21Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T14:45:21Z", "source": "HackerNews_Top", "title": "A lightweight TypeScript library for assertion-based runtime data validation", "url": "https://github.com/nimeshnayaju/decode-kit", "id_key": "02c44d20b12b35a24481dbefca69779d1217563c489928e0dca04c3c99a5ab85", "summary": "Comments", "ingested_utc": "2025-08-25T14:45:21Z"}
