{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:51:35Z", "source": "Engadget_All", "title": "HORI's Piranha Plant camera for Nintendo Switch 2 is 33 percent off right now", "url": "https://www.engadget.com/deals/horis-piranha-plant-camera-for-nintendo-switch-2-is-33-percent-off-right-now-145031014.html?src=rss", "id_key": "409d9388c85b878f7334ace7fd63057cf759e8a582fd95f0284909db6ed495c1", "summary": "Even though the Switch 2 basically just came out, we're already starting to see discounts on some of its accessories. One of the more charming peripherals, the HORI Piranha Plant camera, is on sale right now for only $40. That's $20 off and a record-low price. It's a good deal for anyone who wants to take advantage of the Switch 2's camera functionality in games like Mario Kart World and that recently-released campfire sim . This was designed specifically for Nintendo's new console, so it's a plug-and-play affair. It's actually cheaper than the official Switch 2 camera with this sale and it looks a whole lot cooler. It's a Piranha Plant from the Mario franchise. We called it a \"work of art\" upon encountering the device and that holds true today. This thing is not only stylish, resembling an Amiibo more than a camera, but it's downright useful. The pot the Piranha Plant sits in functions as both a stand and USB extension for the device. The plant itself detaches from the pot, so the camera can be used in portable mode by popping it into the USB port at the top of the console. There's also a built-in privacy shutter. Just close the plant's mouth to obscure the lens. The actual camera specs here aren't going to win any awards, with a frame rate of 30FPS and a resolution of 640 x 480p. However, that's more than enough to capture footage of your floating head to accompany your kart as it races through the Mushroom Kingdom. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/horis-piranha-plant-camera-for-nintendo-switch-2-is-33-percent-off-right-now-145031014.html?src=rss", "ingested_utc": "2025-08-23T14:51:35Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:51:50Z", "source": "FinancialPost_Business", "title": "European postal services suspend shipment of packages to US over import tariffs", "url": "https://financialpost.com/pmn/european-postal-services-suspend-shipment-of-packages-to-us-over-import-tariffs", "id_key": "4c9f0be544a8fc86d1244583759b12b47350dff5a9b191e966685cedae84fdd9", "summary": "ATHENS, Greece (AP) — Multiple postal services around Europe announced Saturday that they are suspending the shipment of many packages to the United States amid a lack of clarity over new import duties. Postal services in Germany, Denmark, Sweden and Italy said they will stop shipping most merchandise to the U.S. effective immediately. France and […]", "ingested_utc": "2025-08-23T14:51:50Z"}
