{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:49:07Z", "source": "Guardian_World", "title": "Noel Clarke loses libel case against Guardian over sexual misconduct investigation", "url": "https://www.theguardian.com/media/2025/aug/22/noel-clarke-loses-libel-case-against-guardian-over-sexual-misconduct-investigation", "id_key": "8cb26d518f0b0b1f9465c147c4639b354dfe4d04737c65d7799c9df608802b06", "summary": "High court rejects actor’s claim that accusations against him by more than 20 women were false and part of a conspiracy The Guardian has successfully defended a libel action brought by the actor Noel Clarke over an investigation by the newspaper in which he was accused of sexual misconduct by more than 20 women. In a high court judgment handed down on Friday, Mrs Justice Steyn rejected Clarke’s claim. He had said the allegations set out in the Guardian’s investigation were false and that he had been the victim of an unlawful conspiracy. There were strong grounds to believe that over 15 years, he used his power to prey on and harass female colleagues. He sometimes bullied female colleagues. He engaged in unwanted sexual contact, kissing, touching or groping. He engaged in sexually inappropriate behaviour and comments. He was involved in professional misconduct. He took and shared explicit pictures and videos without consent, including secretly filming a young actor’s naked audition. Continue reading...", "ingested_utc": "2025-08-22T09:49:07Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:49:27Z", "source": "CryptoSlate", "title": "Ripple’s RLUSD stablecoin to enter Japanese market by 2026", "url": "https://cryptoslate.com/ripples-rlusd-stablecoin-to-enter-japanese-market-by-2026/", "id_key": "918cfe4974745a5d1553a18ace9573f1a442b336056979f8a50fb594a17b8807", "summary": "Crypto firm Ripple has revealed plans to expand its RLUSD stablecoin into Japan by 2026. On Aug. 22, the stablecoin issuer announced that it had signed a memorandum of understanding with SBI VC Trade, a Japanese financial powerhouse SBI Holdings subsidiary. According to the statement, SBI would distribute RLUSD in Japan and work with Ripple […] The post Ripple’s RLUSD stablecoin to enter Japanese market by 2026 appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T09:49:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:51:26Z", "source": "NPR_Top", "title": "U.N.-backed agency says famine exists in northern Gaza", "url": "https://www.npr.org/2025/08/22/nx-s1-5509964/famine-gaza-israel-middle-east-un", "id_key": "903d9a46fadecb5ef5fe527bfebf82f00b81cf2e2b3ea4158ef6b9b93d9905a3", "summary": "A U.N.-backed food security group has issued a dire warning: famine has officially now taken hold in northern Gaza and is expected to spread in the coming months.", "ingested_utc": "2025-08-22T09:51:26Z"}
