{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:39:53Z", "source": "Guardian_World", "title": "Crochet, isolation and the prison chaplain: Erin Patterson’s life behind bars detailed in court", "url": "https://www.theguardian.com/australia-news/2025/aug/25/erin-patterson-life-behind-bars-detailed-in-court-mushroom-murders", "id_key": "bd4ff1e4e63bbc3f82b898e1087930b863ab9f2fbe0419a0bc3684fc4b8c7d56", "summary": "Victorian supreme court also hears that mushroom lunch murderer spends 22 hours a day in cell and has had no contact with other inmates Full report: Mushroom lunch survivor forgives Erin Patterson as defence agrees triple murderer deserves life sentence Get our breaking news email , free app or daily news podcast Erin Patterson has become a “keen crocheter” inside Victoria’s maximum security women’s prison, where she spends about 22 hours a day isolated. Inside her prison, Melbourne’s Dame Phyllis Frost Centre, Patterson’s personal items include wool for crocheting, blankets she has crocheted, a hair straightener and computer. Continue reading...", "ingested_utc": "2025-08-25T09:39:53Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:40:15Z", "source": "CryptoSlate", "title": "76% of Japan’s banks eye tokenized securities as SBI bets on Chainlink", "url": "https://cryptoslate.com/76-of-japans-banks-eye-tokenized-securities-as-sbi-bets-on-chainlink/", "id_key": "17e1816cdc812eb505aafe4ef15803384a2f9f2f0cdd233ab1ee4e41f4c38a45", "summary": "Japan’s SBI Group has entered into a strategic partnership with Chainlink to accelerate blockchain adoption, digital asset growth, and tokenization across Japan and the broader Asia-Pacific region. The collaboration, announced on Aug. 24, combines SBI’s financial market expertise with Chainlink’s widely used infrastructure for data, interoperability, and institutional-grade DeFi applications. Driving tokenization The initiative is […] The post 76% of Japan’s banks eye tokenized securities as SBI bets on Chainlink appeared first on CryptoSlate .", "ingested_utc": "2025-08-25T09:40:15Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:40:18Z", "source": "CryptoNews", "title": "Japan Finance Minister Says Crypto Can Be a Part of Diversified Portfolio – Is Strategic BTC Reserve Coming?", "url": "https://cryptonews.com/news/japan-finance-minister-says-crypto-can-be-a-part-of-diversified-portfolio-is-strategic-btc-reserve-coming/", "id_key": "0a0822ba5f2c43ac1eb4b8dcdfe755f02ca25ea112eefa4045449d98e042ea01", "summary": "Japanese Finance Minister said that crypto assets can be a part of diversified investments and that the ministry will focus on creating a trading environment for crypto. The post Japan Finance Minister Says Crypto Can Be a Part of Diversified Portfolio – Is Strategic BTC Reserve Coming? appeared first on Cryptonews .", "ingested_utc": "2025-08-25T09:40:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:11Z", "source": "NYTimes_World", "title": "E1 Settlement in West Bank Tied to Greater Israel Goal", "url": "https://www.nytimes.com/2025/08/25/world/middleeast/west-bank-e1-israel.html", "id_key": "49f0dde543789e4b401b1bcdaa73073acd4d83b7d788b366355098293e15af1d", "summary": "Israel’s approval of a settlement project delayed for decades shows how far Prime Minister Benjamin Netanyahu has gone in dashing Palestinian aspirations.", "ingested_utc": "2025-08-25T09:42:11Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:18Z", "source": "NPR_Top", "title": "Confusion, explosive anger, waiting: A 'quiet' day in New York immigration court", "url": "https://www.npr.org/2025/08/25/nx-s1-5503595/immigration-court-new-york", "id_key": "ac61d09f8291527742b4e89c6d6361065d932a5ae1625da77809df372a5f461d", "summary": "Dozens of immigration courts across the country have become epicenters of the Trump administration's efforts to increase the rate of immigration arrests.", "ingested_utc": "2025-08-25T09:42:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:18Z", "source": "NPR_Top", "title": "20 years after Katrina, New Orleans schools are still 'a work in progress'", "url": "https://www.npr.org/2025/08/25/nx-s1-5435783/education-hurricane-katrina-anniversary-charter-schools", "id_key": "0381b279bff7cb25341a86486397e96bbf23c5aa5640f01d7f4d96e7f0fb92b2", "summary": "The city's school system looks almost nothing like it did 20 years ago. People in New Orleans have strong opinions about whether that's good or bad, but the data is hard to argue with.", "ingested_utc": "2025-08-25T09:42:18Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:19Z", "source": "NPR_Business", "title": "Boxed in by shifting tariff rules, European shippers pause some U.S.-bound parcels", "url": "https://www.npr.org/2025/08/23/nx-s1-5513936/dhl-parcel-tariffs", "id_key": "1557064b2dc062dd4f3a5ddb7515a24a512796b706f4103150a938e7825a7ac1", "summary": "New customs regulations take effect August 29, and many European postal agencies and companies say until new systems are set up they can't ship some goods. Gifts worth less than $100 are not affected.", "ingested_utc": "2025-08-25T09:42:19Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:22Z", "source": "FT_Home", "title": "UK gender pay gap understated for past two decades, report finds", "url": "https://www.ft.com/content/4cb19300-0586-434c-8291-a77126789357", "id_key": "7eccd656a5892f165a181ed48599529e2cb99542c18b819c06b846dae4f9758d", "summary": "Office for National Statistics already under scrutiny over quality of its figures", "ingested_utc": "2025-08-25T09:42:22Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:23Z", "source": "FT_Markets", "title": "Investors pile billions into New York office market", "url": "https://www.ft.com/content/8d1c9978-353a-4a2b-81d3-0d4113ce0b85", "id_key": "75784e5c827452a6fa0976d5f838c50d2560c722bff1496977e3a5201f67bffb", "summary": "Rebound in CMBS borrowing tied to city’s skyscrapers signals thaw after pandemic chill", "ingested_utc": "2025-08-25T09:42:23Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:41Z", "source": "WIRED_All", "title": "IBM and NASA Develop a Digital Twin of the Sun to Predict Future Solar Storms", "url": "https://www.wired.com/story/ibm-and-nasa-develop-a-digital-twin-of-the-sun-to-predict-future-solar-storms/", "id_key": "eb9abf80978e6da70701163cad160f5b089652c7c65fd35650e173481d472f68", "summary": "The tool models the sun using AI, and its developers say it can anticipate solar flares 16 percent more accurately and in half the time of current prediction systems.", "ingested_utc": "2025-08-25T09:42:41Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:42:43Z", "source": "Engadget_All", "title": "The best air purifier for 2025", "url": "https://www.engadget.com/home/smart-home/best-air-purifier-120040002.html?src=rss", "id_key": "4b7b150a8c667c1ad25ab49359446b8252c06de7931eb24ab889bd7ef5e14f94", "summary": "The air in our homes can be five times more polluted than outdoor air. Energy-efficient homes are designed to be tightly sealed, too, so they trap more pollutants inside. Cooking emissions, cleaning chemicals and fragrances all contribute to less-than-healthy air. Pets, smoke and off-gassing furniture do their part as well. If the air quality outside is good, the best thing to do is open up your windows for at least 15 minutes a day. But if wildfires, car pollution, or high pollen counts prevent you from letting in fresh air, an air purifier may be your best bet. These machines can reduce pollutants, remove odors and trap some bacteria and mold. We tested over a dozen to see how they perform and how nice they were to live with. Here are the best air purifiers we could find. Table of contents Best air purifiers for 2025 What an air purifier can and can’t do What to look for in an air purifier Other air purifiers we tested How we test air purifiers Air purifier FAQs Best air purifiers for 2025 What an air purifier can and can’t do There are three key categories of air pollution that adversely affect the quality of the air you breathe: volatile organic compounds (VOC), particulate matter (PM2.5 and PM10) and carbon dioxide. VOCs are emitted gasses that can come from cleaners, off-gassing plastics, paint, solvents, fragrances, cooking food and, ironically, air fresheners. VOCs are most closely related to odors you can smell. High levels can irritate your breathing passages, cause headaches and may become cancer-causing over time. Air purifiers with activated charcoal components can help clean VOCs from the air. Particulate matter is usually discussed as PM2.5 and PM10, with the numbers indicating particle size in microns. This is dust, dirt, mold, smoke and, again, emissions from cooking food. Higher levels of PM can lead to respiratory irritation, allergy symptoms, respiratory infections and potentially lung cancer. Air purifiers that include a HEPA or particle filter can help remove airborne particles from your space. Carbon dioxide is what humans and pets breathe out. Elevated levels can cause dizziness and lethargy. But no air purifier can reduce CO2 levels because the molecules are so small. Plants can help to some extent, but really the only solution is opening a window or otherwise ventilating the space. There are no federal standards for air purifiers, but the state of California does require all air cleaners sold in the state to be certified by the California Air Resources Board (CARB). All of our top picks here have met that certification. What to look for in an air purifier HEPA filters and other filter types An air purifier isn’t an overly complicated device. Smart modes and app connectivity aside, they’re not much more than a filter and a fan, which you can certainly DIY . The fan pulls air through the filter to capture particulate matter and other unhealthy elements so you don’t breathe them in. The type of fan can make some difference — it should be powerful enough to pull in air quickly, but also quiet enough on its low speed so it can unobtrusively clean all day long. Filters, on the other hand, are more varied. Most have two or more layers, typically a pre-filter, an activated carbon filter and sometimes a particle or even a true HEPA filter. The pre-filter is made from a fine mesh that captures big stuff like pet hair and larger chunks of dust. Sometimes this part is separate from the more technical filters — which means you can remove and clean it without needing to swap out the whole thing. For all-in-one filters, you can vacuum the outside of it to remove larger particles. An activated carbon or activated charcoal layer is extremely porous, tightly packed coal that presents a vast amount of microscopic surface area to the passing air. Gaseous chemicals, VOCs and other molecules become lodged in the crannys and stick. This is the layer that gets rid of odors. Nearly all types of air purifiers include a particle filter. Some of those can be called \"true HEPA\" (high-efficiency particulate air) filters — meaning they conform to the standards set out by the DOE . Particle filters are made up of pleated masses of ultrafine fibers that force air to take a convoluted path in order to pass through. This traps and absorbs tiny molecules of smoke and dust, allergens like dander and pollen, and some viruses and bacteria. Since all of these air filters physically trap particulates, they’ll eventually fill up and become less effective. Most manufacturers recommend replacing the filter every six months, while others claim a year-long life span. Most smart air purifiers will let you know in the app when it’s time to replace. When you’re considering a unit’s cost, be sure to factor in the expense of replacement filters, which you may end up buying twice a year. Room size Air purifiers list their air filtration capabilities in terms of room size and frequency of air exchanges, sometimes listed as clean air delivery rate (CADR) or you may see a number for cubic feet per minute (CFM). A smaller unit might say it can exchange the air in a 500-square-foot room twice per hour. So that model should be able to pass all of the air in a 250-square-foot room through the filter every 15 minutes, but a 1,000-square-foot room would probably be outside its effective range. Of course, there’s no standard for manufacturers to adhere to when it comes to these calculations, but typically, larger air purifiers can handle large rooms. Controls In our testing, we focused on Wi-Fi-connected “smart” air purifiers with companion apps that can monitor air quality and adjust the fan settings as needed. Within the apps, you can control auto-clean settings, set timers and schedules and check the health of the filter as well. Most will remind you when it’s time to get a replacement, and let you order one directly from the manufacturer through the app. You can also see the current and historical readings from the internal air quality (AQ) sensor. Most determine air quality through an optical particle meter, though some brands like Dyson and Molekule also include chemical sensors for VOC measurements. When levels of particulates become elevated, the fans switch up to high speed to move more air through until the quality improves. Most smart purifiers also work with voice assistants, so if asking Alexa to turn on your air purifier makes your life easier in some way, you can do so. If you don’t want to talk to an AI or grab your phone to control your purifier, getting a unit with simple on-board controls is a good idea. These can be as basic as buttons with indicator lights or as elaborate as a touchscreen panel. At minimum, it’s good to have a way to control the fan speed and turn on or off auto mode on the device itself. Design As we mentioned, sticking the device as close to the middle of the room is helpful for getting the best performance. That means you’ll be looking at it a lot, so design considerations matter. Most purifiers are cylindrical towers with fan vents up top. Units meant for larger rooms are not small, weighing between 12 and 20 pounds and reaching two feet tall (or in the case of the Dyson Purifier Cool, three and a half feet). Some, like Coway’s Airmega IconS, take on more furniture-like designs to blend in. Others, like Dyson's, are conspicuously designed to stand out. How to set up an air purifier Even the best air purifier can’t do much without airflow. So ideally, you won’t shove your air purifier off in a corner right next to a wall. Most manufacturers recommend at least a foot of clearance between the machine and anything that could block circulation — walls, couches, cabinets and the like. Most cylindrical models have intake vents all around the outside, but box models may have them on just one side, so make sure you point the vents outwards towards the center of the room. Smaller air purifiers work better if they’re up off the ground by a couple feet, such as on top of a stool or end table. And of course, make sure the cord isn’t stretching across trafficked areas to avoid tripping. Before you plug your air purifier in, make sure to check that the filter isn’t wrapped in plastic inside the machine. I probably don’t need to tell you how I know this is a very important first step. The purifiers we recommend are smart home models, so the next step will usually involve downloading the manufacturer’s app to your phone and connecting the air purifier to the app as well as your home’s Wi-Fi. Additional steps for clearing the air Air purifiers, as the name suggests, clean the air. Once dust, dander and smoke settle onto surfaces, there isn’t much these machines can do to eradicate them. So vacuuming and good old-fashioned dusting are important steps to keep allergens and particulate matter at bay. If you have an HVAC system, changing or even upgrading your system’s air filters can help keep bad air in check. The American Lung Association recommends filters with at least a MERV-13 rating. The association also recommends not burning candles in your home, foregoing air fresheners and opting for homemade cleaning supplies over chemical cleaners. When an air purifier just isn’t enough The most striking bit of knowledge I picked up from testing air purifiers is how effective opening windows can be on indoor air quality. What took an air purifier a half hour to clear out took mere minutes when I opened my front door and a few windows. Every variable measured by the air quality sensors, including VOCs, PM, and particularly CO2 levels (which air purifiers can’t alleviate), improved dramatically after exposure to fresh air — significantly faster and better than any machine we tested. Letting in fresh air for just fifteen minutes each day can help, according to the Lung Association. On very cold days, do it midday. When it’s hot, open windows in the early morning when it’s coolest. When I did it in the middle of winter, my HVAC system had to work a little overtime afterwards, but venting a room was the most surefire way of getting air quality quickly back in the green. Of course, if the air outside is unhealthy from wildfire smoke or run-of-the-mill pollution, or if you're dealing with seasonal allergies, throwing open the windows won’t work and an air purifier might be the best way to consistently clean things up. How we test air purifiers My living room is not a science lab; there’s far too much pet hair for that to be the case. Still, I went beyond just turning stuff on and sniffing the air by acquiring two consumer-grade indoor air quality monitors that performed well in laboratory assessments , the Element from Awair and the uHoo Smart Air Monitor . I conducted burn tests in this medium-sized room by measuring the ambient air quality, then burned a brick of piñon incense for twenty minutes and measured the air again. Then I ran one purifier at its highest speed for thirty minutes and recorded levels, then ran the unit on the lowest setting for a half hour and remeasured. I made note of the sound levels using a simple iPhone app to compare one machine’s noise level to the next. Over the course of a month, I used each unit in different scenarios (such as in the basements where the cat litter box is) and tried out each device’s smart features, controls and auto modes. I also just lived with them and evaluated how they fit into everyday life. As new purifiers come on the market we continue to acquire units that seem worthy of inclusion. Most recently, we tested purifiers from Blueair, IQAir, Windmill and others, adding our findings to this guide. Other air purifiers we tested IQAir HealthPro Plus SE The IQAir HealthPro Plus SE is a formidable piece of equipment. The boxy tower looks like something you’d see in a hospital and weighs 35 pounds, making me appreciate the included wheels when I needed to move it around. It’s designed and made in Sweden and each unit comes with an impressive certificate of performance. I’m certain the testing processes IQAir employs are more scientific than my tests — after all, the company is probably best known for its air quality monitors — but I found the filtration efficiency to be on par with and, in one test, worse than that of other models I tested. I was also disappointed that a $1,000-plus air purifier from an air monitor device company was only capable of measuring particulate matter — and not VOCs — to trigger the auto-clean function. That said, setup was simple and the app can integrate data from public air quality sources as well as other AQ monitors you may have set up. Coway’s Airmega Icon S Coway’s Airmega Icon S was our previous pick for best design. It looks more like a tiny mid-century-modern credenza than an air purifier and the little shelf up top doubles as a wireless phone charger. The PM2.5 sensor reliably kicked in the auto mode as I used it and the three-speed fan is quiet, even on high, yet powerful. I had a little trouble getting the app to connect, but the onboard touch controls worked better anyway. It’s expensive at $699, too, but it does have a washable pre-filter. Sensibo Pure At $229, and nearly always on sale for $130, I had the Sensibo Pure pegged as a contender for a budget pick. Unfortunately, replacement filters are $99 unless you subscribe to automatic shipments and many of the app features are behind a paywall as well. It’s not certified by CARB and underperformed many of the other units in the burn test, though it did return the air back to a “good” rating according to the air monitors after 30 minutes. The design is inoffensive, it’s not overly loud and it does integrate with Sensibo’s smart AC devices, so if you’re already happy with one of those, this may be a decent option. Dyson Purifier Cool Like all Dyson products, this air purifier is dripping with design. It looks like no other unit on the market and it’s up to you to decide whether you like that or not. I was indifferent to the looks, but appreciated the slick and informative app, which not only displays indoor air quality, it also shows what conditions are like outside, using a clever house graphic to differentiate the two sets of numbers. I also like that it detects VOCs as well as particulates and the auto mode seemed to read the room accurately. The air coming out of the fan did indeed feel cool, though at first had a strong plastic odor. Unfortunately, it was the lowest performing unit during two separate burn tests and had repeated connectivity issues. Molekule Air Pro The Molekule Air Pro comes from a brand that pays keen attention to aesthetics. It and the app have that Instagrammable, muted-modern look that countless clothing and bedsheet brands emulate these days. That style doesn’t come cheap as the Air Pro costs over $1,000 and requires $140 filters. The company came under fire for and had to stop making many of its claims about its filtration system, which may have led to it filing for bankruptcy in 2023. Molekule is still able to tout its patented photoelectrochemical oxidation, which the company says destroys pollutants at a “molecular level.” In my tests, it performed almost as well as the others in improving VOC and PM2.5 levels. But it’s also very loud: When auto mode kicked the fan into high gear, it would make me tense. Also, I found the unit often indicated “bad” or “very bad” levels when my two monitors indicated the air quality was actually pretty good. Air purifier FAQs What settings should you run an air purifier on? There aren’t many settings to adjust on an air purifier. Most have low, medium and high fan speeds and possibly an auto-mode that detects impurities in the air and increases the fan speed on your behalf. Air circulates through a purifier faster at higher fan-speed settings so it cleans the air more efficiently. Higher speeds also make the air purifier louder. That means you typically want to find the balance between cleaning power and noise levels. Other settings like timers and dimming the LED lights make the unit more comfortable to live with, particularly if you use yours in your bedroom. For everyday cleaning of the air, you’re probably best off leaving the air purifier running on low, only kicking it up to high at certain times when the air is murkier, like after you cook. What is a HEPA filter? A HEPA filter is a type of particle filter. Every air purifier has a particle filter, but not all are considered “true HEPA” filters. The specifications are determined by the US Department of Energy and require a minimum efficiency of 99.97 percent when filtering airborne particles of 0.3 microns. HEPA filters can remove dust, pollen, mold and bacteria. Check out more from our spring cleaning guide. This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/best-air-purifier-120040002.html?src=rss", "ingested_utc": "2025-08-25T09:42:43Z"}
