{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:50:45Z", "source": "BBC_Business", "title": "Global postal services halt US deliveries over tariffs", "url": "https://www.bbc.com/news/articles/cx2p17xypgko?at_medium=RSS&at_campaign=rss", "id_key": "e9cbc24c6b443718ed15824e624bfef609256c4d1fec97e765edd9d7d9989738", "summary": "Services including Royal Mail and DHL say they are suspending deliveries until they had proper systems were in place.", "ingested_utc": "2025-08-22T14:50:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:50:45Z", "source": "BBC_Technology", "title": "US in talks over 10% Intel stake, White House confirms", "url": "https://www.bbc.com/news/articles/c620gg77epxo?at_medium=RSS&at_campaign=rss", "id_key": "ee50ba0631003beac82c4225f54a370f132a68fe1eacb1834c843b0de7dd2dcf", "summary": "The potential deal could involve swapping government grants for shares in the chip making giant.", "ingested_utc": "2025-08-22T14:50:45Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:50:47Z", "source": "Guardian_World", "title": "No Putin-Zelenskyy meeting planned until agenda is agreed, Russia’s foreign minister says – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/22/ukraine-war-latest-updates-zelenskyy-putin-trump-news", "id_key": "455b124aba78a22701a2be3dc68bc6dcc5449617acbcada102a9338878a42a9c", "summary": "This blog is now closed Speaking alongside Zelenskyy, Nato’s Rutte said the alliance’s support for Ukraine remained “unwavering” and “continues to grow,” with more plans to provide Nato funding to ensure “a crucial flow of lethal US weapons to Ukraine.” He lauded the outcome of Monday’s talks at the White House, saying that Trump made it clear “the United States will indeed be involved in providing security guarantees for Ukraine.” “ Robust security guarantees will be essential , and this is what we are now working to define, so that when the time comes you for you to enter that bilateral meeting, you have the unmistakable force of Ukraine’s friends behind you, ensuring that Russia will uphold any deal, and will never ever again, attempt to take one square kilometre of Ukraine.” “ The Budapest Memorandum and Minsk did not provide those security guarantees. So we clearly know what it should not be, and we are now working together – Ukraine, the Europeans, the United States – to make sure that the security guarantees are of such a level that Vladimir Vladimirovich Putin, sitting in Moscow, will never, ever try to attack Ukraine again.” Continue reading...", "ingested_utc": "2025-08-22T14:50:47Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:50:47Z", "source": "Guardian_World", "title": "Wes Streeting’s row with pharma firms grows as they reject NHS drug pricing offer", "url": "https://www.theguardian.com/business/2025/aug/22/wes-streeting-pharma-firms-nhs-drug-pricing-rebate-scheme", "id_key": "467ee0b65efa453e01e18b3ee80a0ab20fe0de243c10ecc879fddff98cbe354d", "summary": "Drugmakers fail to meet health secretary’s latest offer, meaning ‘unsustainable’ rebate scheme will stay in place Business live – latest updates A row between Wes Streeting and pharmaceutical companies has intensified after drugmakers rejected the health secretary’s latest offer on NHS drug pricing. The two sides failed to reach agreement by a midday deadline on Friday, meaning the mechanism under which the health service claws back some of the money it pays for medicines will continue at a rate the industry said was “unsustainable” and could ultimately disadvantage patients. Continue reading...", "ingested_utc": "2025-08-22T14:50:47Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:50:47Z", "source": "Guardian_World", "title": "Trump says he wasn’t briefed on FBI raid of John Bolton’s home – live updates", "url": "https://www.theguardian.com/us-news/live/2025/aug/22/donald-trump-administration-federal-reserve-republicans-democrats-us-politics-live", "id_key": "f841329fd534950dbdfb1629427310e93fc74e398808ee25038c059a5c06c39b", "summary": "President says ‘I’m not a fan of John Bolton,’ who served as his national security adviser during his first term, and expects briefing later from justice department FBI raids home of John Bolton, Trump’s ex-national security adviser As we bring you more information about the reported FBI raid on John Bolton’s Maryland home , it’s worth pointing out that Bolton was stripped of his security clearance when Trump started his second term in office. The president also got rid of Bolton’s government detail, despite being the target of an assassination plot due to Bolton’s criticism of the Iranian regime. Bolton served as Trump’s third national security advis er in his first term in office, but has since become a vocal critic of the president . Less than an hour ago, a post from Bolton’s X account critiqued the state of negotiations between Russia and Ukraine. “Russia has not changed its goal: drag Ukraine into a new Russian Empire,” he wrote. “Meanwhile, meetings will continue because Trump wants a Nobel Peace Prize, but I don’t see these talks making any progress.” Continue reading...", "ingested_utc": "2025-08-22T14:50:47Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:51:19Z", "source": "CryptoNews", "title": "KCS and BGB Exchange Tokens Pumping, Is the Bull Market Still Here?", "url": "https://cryptonews.com/news/kcs-and-bgb-exchange-tokens-pumping-is-the-bull-market-still-here/", "id_key": "c527f91d56470ec07e2f1d3519e89edc9d06ff944856059f516db3fb3855cb29", "summary": "Exchange tokens like BNB Coin (BNB) and OKB (OKB) have been pumping lately and the next in line that could be boosted as a result of this trend would be KCS (KuCoin) and BGB (Bitget).BNB Coin (BNB) made a new all-time high on August 20 as it reached $882. Meanwhile, OKB delivered triple-digit gains to […] The post KCS and BGB Exchange Tokens Pumping, Is the Bull Market Still Here? appeared first on Cryptonews .", "ingested_utc": "2025-08-22T14:51:19Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:51:19Z", "source": "CryptoNews", "title": "SBI Holdings and Startale Reveal Onchain Platform for Tokenized Stocks and RWAs", "url": "https://cryptonews.com/news/breaking-sbi-holdings-and-startale-reveal-onchain-platform-for-tokenized-stocks-and-rwas/", "id_key": "31af07ef1d615b3f3af9144e33da4472a5cfed2f22c061d7ae2401ae91c49dd8", "summary": "SBI Holdings and Startale, as a joint venture, will provide 24/7 onchain tokenized stock and other financial assets trading and cross-border settlement infrastructure with lower fees. The post SBI Holdings and Startale Reveal Onchain Platform for Tokenized Stocks and RWAs appeared first on Cryptonews .", "ingested_utc": "2025-08-22T14:51:19Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:53:52Z", "source": "TheStreet_Top", "title": "Burlington makes bold move to steal Walmart customers", "url": "https://www.thestreet.com/retail/burlington-makes-bold-move-to-steal-walmart-customers", "id_key": "066daceb66d8cf5ecb157a7f451d8043ef2b4b2c636c39e82b9fd75493bfd63d", "summary": "The company is using its fashion-minded inventory and competitive prices to gain an edge.", "ingested_utc": "2025-08-22T14:53:52Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:53:52Z", "source": "TheStreet_Top", "title": "Walmart is selling a 'comfortable' $900 modular patio sectional for only $460", "url": "https://www.thestreet.com/deals/lausaint-home-patio-conversation-set-walmart-flash-sale-august-2025", "id_key": "a1ef49d051635ecca7c43bf392d8451c7bf063c401097e4cacbb4d2fdc367d32", "summary": "\"Equally comfortable as it is aesthetically pleasing!\"", "ingested_utc": "2025-08-22T14:53:52Z"}
