{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T14:54:25Z", "source": "CryptoBriefing", "title": "OpenAI’s Altman confirms plans to back a startup that would rival Musk’s Neuralink", "url": "https://cryptobriefing.com/brain-computer-interface-altman/", "id_key": "ee2bc5157c1e0a2b4ef586b355f4789eec38a20261470fd89c2ea940b6542a49", "summary": "OpenAI's move into brain-computer interfaces could intensify competition in tech innovation, potentially reshaping human-computer interaction. The post OpenAI’s Altman confirms plans to back a startup that would rival Musk’s Neuralink appeared first on Crypto Briefing .", "ingested_utc": "2025-08-15T14:54:25Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T14:54:27Z", "source": "CryptoNews", "title": "BlackRock Pours Over $1B into Bitcoin & Ethereum ETFs During Dip — What Do They Know?", "url": "https://cryptonews.com/news/blackrock-pours-over-1b-into-bitcoin-ethereum-etfs-during-dip-what-do-they-know/", "id_key": "f29ec424721290477b305493bf1fad11f0f48f40fe3bf5f06c965291e370cd49", "summary": "As July PPI jumped 0.9% and risk assets sold off, BlackRock’s Larry Fink bought the dip through IBIT and ETHA, adding 4,428 BTC (~$526M) and 105,900 ETH (~$488M). The post BlackRock Pours Over $1B into Bitcoin & Ethereum ETFs During Dip — What Do They Know? appeared first on Cryptonews .", "ingested_utc": "2025-08-15T14:54:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T14:55:58Z", "source": "Guardian_Business", "title": "When Trump tariffs hit French barrels and corks, California’s winemakers feel the squeeze", "url": "https://www.theguardian.com/food/2025/aug/15/wine-california-trump-tariffs", "id_key": "046acb5a0227e18419ee44c1bedc1f04238d1d7fa1bc542027adf343cfebe5db", "summary": "Small California producers say Trump’s EU levies are driving up costs and threatening family businesses Kory Burke, a small producer of high-quality wines in central California , never believed that tariffs on imports from France or Italy could help boost his business. But he knew for sure they would be a big hindrance as soon as Donald Trump announced late last month that he was slapping a 15% levy on all goods from the European Union. “The first email I received was from my cork provider,” Burke recalled. “He said he’d take on 2% of the additional cost of importing corks from Europe, but I would have to absorb the other 13%. Then my barrel supplier got in touch, pushing me to put in my orders as fast as possible because every new French barrel coming across the Atlantic after the tariffs was going to come with a $100 or $150 fee.” Continue reading...", "ingested_utc": "2025-08-15T14:55:58Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T14:57:04Z", "source": "FinancialPost_Business", "title": "Strategic Storage Trust VI, Inc. Reports Second Quarter 2025 Results", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/strategic-storage-trust-vi-inc-reports-second-quarter-2025-results", "id_key": "0a249302d3ad119c4acde94422846188337dbe0c3f2f20781e0fe360ae82eb78", "summary": "Q2 Total revenues increased approximately 9.6% compared to the same period in 2024. Q2 Increased Same-Store Revenues by approximately 5.1% for the Quarter. Q2 Net loss attributable to common stockholders decreased approximately 46.4% compared to the same period in 2024. Q2 Increased Same-Store Net Operating Income (“NOI”) by approximately 9.6% for the Quarter. YTD Total […]", "ingested_utc": "2025-08-15T14:57:04Z"}
