{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:39:58Z", "source": "BBC_World", "title": "Ghislaine Maxwell denies seeing 'inappropriate' conduct by Trump", "url": "https://www.bbc.com/news/articles/cdd3pe6189go?at_medium=RSS&at_campaign=rss", "id_key": "39ff9d92d6756c47fe8bc71e3cad4e3bafd8ee85ea7a7b8db0e38173c25384d5", "summary": "Maxwell was interviewed after pressure on Trump to release information about whether prominent figures were involved in Jeffrey Epstein's crimes.", "ingested_utc": "2025-08-23T13:39:58Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:40:02Z", "source": "Guardian_World", "title": "Family of UK aid volunteer reportedly killed in Ukraine ‘disappointed’ by Foreign Office", "url": "https://www.theguardian.com/uk-news/2025/aug/23/family-british-aid-volunteer-reportedly-killed-ukraine-donbas-foreign-office", "id_key": "0bc2bfb3f3bdd683df7a8501b3b3d9d5ff08e97b993f2e71adaba3e7a7549d87", "summary": "Relatives of Annie Lewis Marffy in ‘red-tape limbo’ over recovery of her body and issuing of death certificate The family of a British aid volunteer reportedly killed in a drone strike in Ukraine said they have been left “very disappointed” by the reaction from the Foreign Office. Annie Lewis Marffy, 69, travelled from her home in Silverton, near Exeter, Devon, in late May to deliver supplies packed into a green Toyota Rav4 in a mission arranged by the non-profit organisation Aid Ukraine UK. Lewis Marffy was to take the vehicle in convoy with a British volunteer to Kramatorsk in the contested Donbas region. Continue reading...", "ingested_utc": "2025-08-23T13:40:02Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:42:30Z", "source": "NPR_Top", "title": "Hawaii's Kilauea volcano erupts again and shoots lava for 31st time since December", "url": "https://www.npr.org/2025/08/23/nx-s1-5513910/hawaii-kilauea-volcano-erupts-again-shoots-lava", "id_key": "c86f07b76bc86c909b29603c686bf828e5463904f52b94cd60f654260ef3b041", "summary": "Hawaii's Kilauea volcano resumed erupting Friday by shooting an arc of lava 100 feet into the air and across a section of its summit crater floor.", "ingested_utc": "2025-08-23T13:42:30Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:42:50Z", "source": "TheVerge_All", "title": "The Fairphone 6 no longer feels like a compromise (except in the US)", "url": "https://www.theverge.com/phones/762755/fairphone-6-review-no-longer-compromise", "id_key": "bf01b3c3da9025de8834f9828a8fe42798650eb8a0fca717fa37e299e0ed53a2", "summary": "The Fairphone 6 arrives almost two years after the 5, a testament to the company's approach to the upgrade cycle. If anything, I suspect the company would be frustrated if Fairphone 5 owners were considering a new model already - these are phones to keep, to repair, and to hold on to until the bitter […]", "ingested_utc": "2025-08-23T13:42:50Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:42:54Z", "source": "Engadget_All", "title": "Bluesky blocks Mississippi due to its new age verification law", "url": "https://www.engadget.com/social-media/bluesky-blocks-mississippi-due-to-its-new-age-verification-law-133049512.html?src=rss", "id_key": "681be800fc72316f183bd862063ff00e80660f55cafa035fa9557f90ede1bdba", "summary": "Users with Mississippi IP addresses can no longer access the Bluesky app. The decentralized social media network has explained in a post that Mississippi's new age verification law for social networks \"would fundamentally change\" how it operates, and it wouldn't be possible to comply with its small team and limited resources. Bluesky says that while it does follow the UK's Online Safety Act , it works very differently from Mississippi's approach to age verification. In the UK, it's only required to check for a user's age if they're accessing certain content and features. In Mississippi, however, it cannot allow anyone to access its service at all, unless they hand over sensitive data proving how old they are. Further, the platform will be required to keep track of which users are children under 18, and it will be responsible for making sure those users won't be able to access \"harmful materials.\" Earlier this month, the Supreme Court decided not to intervene with the legislation, allowing it to go into effect. The service says that it doesn't have the significant resources needed to be able to build the required \"verification systems, parental consent workflows and compliance infrastructure.\" In addition, it could be penalized with up $10,000 per user if the government finds it to be non-compliant. Because only big tech companies can afford the costs associated with those requirements, Bluesky says the \"dynamic entrenches existing big tech platforms while stifling the innovation and competition that benefits users.\" Bluesky will now show a note to any user accessing the service from Mississippi, telling them why it's no longer available in the state. This article originally appeared on Engadget at https://www.engadget.com/social-media/bluesky-blocks-mississippi-due-to-its-new-age-verification-law-133049512.html?src=rss", "ingested_utc": "2025-08-23T13:42:54Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:43:11Z", "source": "FinancialPost_Business", "title": "Taiwan Referendum to Restart Nuclear Power Plant Fails", "url": "https://financialpost.com/pmn/business-pmn/taiwan-referendum-to-restart-nuclear-power-plant-fails", "id_key": "1eed4a902e9f1e5dbd8849c318d51ee53ba2077fa2099156bdfaf6d23c39c2cd", "summary": "A referendum to restart a Taiwan nuclear plant failed due to poor voter turnout, dealing a blow to attempts by some groups to revive atomic power after the government shut all reactors.", "ingested_utc": "2025-08-23T13:43:11Z"}
