{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:39:20Z", "source": "Guardian_World", "title": "Kingsmill owner to buy Hovis in £75m deal to create UK’s biggest bread brand", "url": "https://www.theguardian.com/business/2025/aug/15/kingsmill-owner-agrees-to-buy-hovis-in-deal-to-create-uk-biggest-bread-brand", "id_key": "9b6a34d3cab8483a2c4d5cf76b62ff2ae1bac2d175b5ba05d60f1c7e5cafe217", "summary": "Jobs expected to go if competition watchdog approves takeover by Associated British Foods Business live – latest updates The owner of Kingsmill has agreed to buy its rival Hovis in a deal worth an estimated £75m that could create the UK’s biggest bread brand if the competition regulator approves it, but also put jobs at risk. The deal comes after decades of decline in the popularity of the packaged sliced loaf, with Hovis, owned by the private equity company Endless, and its rival Kingsmill – part of Associated British Foods (ABF) – struggling to get out of the red for some years. Continue reading...", "ingested_utc": "2025-08-15T09:39:20Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:39:20Z", "source": "Guardian_World", "title": "Intel shares jump after report says Trump administration looking at stake", "url": "https://www.theguardian.com/technology/2025/aug/15/intel-shares-jump-after-report-says-trump-administration-looking-at-stake", "id_key": "79b3f976f9cf0d3ad9b964efd15bbec236142766a834051bbac84deed62c1880", "summary": "Market value passes $104bn despite White House saying claims of talks to invest in factories are ‘speculation’ Shares in Intel have jumped 7.4% after it was reported that the Trump administration is considering taking a stake in the struggling US chipmaker. The potential investment, which would be paid for by the US government, would be used to develop Intel’s factory hub in Ohio, according to Bloomberg. It would also help shore up the chipmaker’s finances at a time when Intel has been slashing jobs as part of a wider cost-cutting drive. Continue reading...", "ingested_utc": "2025-08-15T09:39:20Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:39:38Z", "source": "CryptoSlate", "title": "BlackRock’s Ethereum ETF leads $640 million inflow spree, hits record trading volumes", "url": "https://cryptoslate.com/insights/blackrocks-ethereum-etf-leads-640-million-inflow-spree-hits-record-trading-volumes/", "id_key": "dd0ddd768532377b6bb90534adb2b777c9c8c5f1fd116eb5773ac2349004fa6c", "summary": "US spot Ethereum exchange-traded funds (ETFs) extended their winning streak on Aug. 14, recording $639.6 million in net inflows. Data from SoSo Value shows that BlackRock’s ETHA led the surge with $519.7 million in inflows. It was followed by Grayscale Ethereum Mini Trust, which saw $60.7 million in inflows, Fidelity’s FETH attracted $56.9 million, and […] The post BlackRock’s Ethereum ETF leads $640 million inflow spree, hits record trading volumes appeared first on CryptoSlate .", "ingested_utc": "2025-08-15T09:39:38Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:29Z", "source": "NYTimes_Business", "title": "Tariffs Are High. So Is the Stock Market.", "url": "https://www.nytimes.com/2025/08/15/business/tariffs-are-high-so-is-the-stock-market.html", "id_key": "57e3361641b3e5abb7f3a3ee8b4be6957df6d54582c7588a646a3853f62db55e", "summary": "Strong corporate earnings, mostly stable tariff rates and the expectation of interest rate cuts have eased worries of a market reckoning.", "ingested_utc": "2025-08-15T09:41:29Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:29Z", "source": "NYTimes_Business", "title": "Why Hands-Off Investing Pays Off", "url": "https://www.nytimes.com/2025/08/15/business/investing-fund-returns-interfere.html", "id_key": "c9b12edeeafc82f64b2051f182d34ce5d7e982b820e52b89a9940c18886039a9", "summary": "Put money into low-cost stock and bond funds, but don’t forget the rest of the recipe: Leave your investments alone.", "ingested_utc": "2025-08-15T09:41:29Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:29Z", "source": "NYTimes_Business", "title": "Elon Musk’s SpaceX Most Likely Doesn’t Pay Taxes", "url": "https://www.nytimes.com/2025/08/15/technology/spacex-musk-government-contracts-taxes.html", "id_key": "b5b191e2ac0d8a44d518103cd9b241493b3487065379c832c534319146770244", "summary": "Elon Musk’s rocket company relies on federal contracts, but years of losses have most likely let it avoid paying federal income taxes, according to internal company documents.", "ingested_utc": "2025-08-15T09:41:29Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:30Z", "source": "NYTimes_World", "title": "The Trauma of Childhood in Gaza: No School, Few Toys, Little Hope", "url": "https://www.nytimes.com/2025/08/15/world/middleeast/gaza-children-school-play.html", "id_key": "4ad9d710f992d7f31c76f38222b33b5b33ec0c2d4d808a6a02e330de1bc0d706", "summary": "Over the past two years, tens of thousands of children in the territory have been killed, wounded or orphaned. Childhood as they once knew it has ceased to exist.", "ingested_utc": "2025-08-15T09:41:30Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:30Z", "source": "NYTimes_World", "title": "Masaoki Sen, a Kamikaze Volunteer and Japan Tea Ceremony Grandmaster, Dies", "url": "https://www.nytimes.com/2025/08/15/world/asia/japan-masaoki-sen-kamikaze-tea.html", "id_key": "e86b29444882a9307886e52a80cefc90ab17793dfdd9e7ef2b0c5a876d306087", "summary": "A pilot who never flew on a suicide mission during World War II, Mr. Sen went on to become a grandmaster of Japan’s tea ceremony and used the platform to oppose all wars.", "ingested_utc": "2025-08-15T09:41:30Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:30Z", "source": "NYTimes_World", "title": "No Running Water and No Electricity, but for Some Venetians, This Island Is Paradise", "url": "https://www.nytimes.com/2025/08/15/world/europe/venice-residents-poveglia-island-lease.html", "id_key": "338f6a2bd40d5da2da95a7d66345100a5acb4c4602cf69ad33e5f98c227eccb1", "summary": "A citizens’ group is now in charge of the island of Poveglia, where they will create a park for anyone who wants to leave Venice’s maddening crowds of tourists behind.", "ingested_utc": "2025-08-15T09:41:30Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:31Z", "source": "NYTimes_Economy", "title": "Trump Extends China Tariff Truce by Three Months", "url": "https://www.nytimes.com/2025/08/11/us/politics/us-china-trade-tariffs-deal.html", "id_key": "015fbe1bfea79d2c8671a4bb63fbe5cbbf7331ecd33c632911d8c7ebc1ed5bcf", "summary": "President Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year.", "ingested_utc": "2025-08-15T09:41:31Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:31Z", "source": "NYTimes_Technology", "title": "Ford Rejigs E.V. Plans After Suffering Billions in Losses", "url": "https://www.nytimes.com/2025/08/11/business/ford-electric-vehicles.html", "id_key": "bdd0c3e7717df0bfa7c944b37fef59d56cb393f58aa414d33b2e4770e7506750", "summary": "Ford, which once had a lead on other established automakers, said on Monday that it will use new materials and methods to lower the costs of electric vehicles.", "ingested_utc": "2025-08-15T09:41:31Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:41:42Z", "source": "FT_Markets", "title": "SoftBank-owned PayPay files for US listing", "url": "https://www.ft.com/content/73677866-90fd-447c-9810-cd10051d9ca1", "id_key": "8297be9afd432d3ad6ff4857897e9c15c28007d9a06f9c284a117b54d08287d8", "summary": "Sale of American depositary shares could value payments company above $10bn and help fund AI bets", "ingested_utc": "2025-08-15T09:41:42Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:01Z", "source": "Engadget_All", "title": "The best robot vacuum for 2025", "url": "https://www.engadget.com/home/smart-home/best-robot-vacuums-130010426.html?src=rss", "id_key": "df7ada6ff2f3dd00258b452548d2969226a770375046af7809c29c2dd331eb7b", "summary": "Chores are just a fact of life, but there may be some chores you detest more than others. If vacuuming comes to mind for you, consider a robot vacuum cleaner. These smart home gadgets have come a long way in recent years. Previously, you’d shell out hundreds for basic dirt-sucking capabilities. Now, robot vacuums have gotten so advanced that even affordable machines have good suction power, and maybe even a handful of extra features like home mapping and mopping capabilities. Prices for models with self-emptying bases and mopping capabilities are also falling. That’s all to say that the robot vacuum space has gotten much more crowded recently. While that means you have many good options to choose from, making sense of the market gets tougher and tougher each year. Engadget has tested dozens of robot vacuums over the years and we continue to try out the latest models as they become available. Below, we’ve collected our top picks for the best robot vacuums you can get right now. Table of contents Best robot vacuums 2025 What to look for in a robot vacuum Robot vacuum maintenance tips How we test robot vacuums Robot vacuum FAQs Best robot vacuums 2025 What to look for in the best robot vacuums Floor type We recommend thinking first about the floors in your home: Do you have carpet throughout, or tile and hardwood floors, or a mix? Robots with stronger suction power will do a better job picking up dirt on carpets as they can get into the nooks and crannies more easily. Some machines have “max” modes as well, which ups suction power but also typically eats battery life faster than the “normal” floor cleaning mode. Vacuum suction Suction power is an important factor to consider. Unfortunately, there isn’t a standard power scale that all robo-vacs adhere to, so it’s difficult to compare among a bunch of devices. Some companies provide Pascal (Pa) levels and generally the higher the Pa, the stronger the vacuum cleaner will be. But other companies don’t rely on Pa and simply say their robots have X-times more suction than other robots. If you’re looking for the best vacuum for your needs, it’s helpful to pay attention to real-world testing and how well the vac can pick up fine dust, crumbs and pet hair in an environment similar to that of your home. Wi-Fi connectivity As we explained in our budget guide , Wi-Fi connectivity is a key feature for most robot vacuums. Some of the affordable devices aren’t Wi-Fi connected, though, so it’s best to double check before you buy cheap. Wi-Fi lets a robot vacuum cleaner do things like communicate with a mobile app, which then allows you to control the device from your phone. Mapping features and object detection Past a certain price threshold, you’ll find advanced perks like home mapping features, improved object detection and automatic dustbin disposal. Home mapping is exactly what it sounds like: The vacuum uses sensors to map your home’s layout as it cleans, allowing you to send it to particular rooms or avoid no-go zones where you don’t want it to roam. Most robo-vacs have object detection, but some will be better than others at actually avoiding things like chair legs and children’s toys. High-end models even go so far as to promise obstacle avoidance to steer clear of things like pet poop that can potentially ruin your machine. Self-empty station Finally, for peak convenience, consider a self-empty robot vacuum that comes with a self-empty station. These are basically garbage bins attached to the machine’s docking station. At the end of each job, the robo-vac automatically empties its small dustbin into the large clean base – that means you won’t have to empty the dustbin yourself and you’ll only have to tend to the base once every few weeks. Just keep in mind that most self-emptying bins require proprietary garbage bags – another long-term expense you’ll have to factor in. Also, any vac-and-mop robot with a water tank will not dump its dirty water into the clean base, so you’ll still have to clean up that yourself. Robot vacuums with mopping capabilities Mopping capabilities are much more common now in robot vacuums than they were just five years ago. Machines with this feature have a water tank either built into the robot’s chassis, the auto-empty bin or as a separate piece that you swap in for the dustbin when you want to mop your floors. It makes the robo-vac more useful if you have hard floors in your home that you like to keep squeaky clean, but it does require more work on your part. Filling and emptying the reservoir remains a human’s job for the most part (except on the most expensive machines), as does adding cleaning solutions if the mopping robot comes with this feature to ensure it uses clean water for every cycle. Robot vacuum maintenance tips First and foremost, always empty your robot vacuum’s dustbin after every cleaning job. If you have a model with a self-emptying base, there’s less work for you to do yourself. If not, simply detach and empty the dustbin as soon as the robot is done cleaning. It’s also a good idea to take a dry cloth to the inside of the dustbin every once in a while to remove any small dust and dirt particles clinging to its insides. In addition, you’ll want to regularly examine the machine’s brush roll to see if any hair has wrapped around them, or if any large debris is preventing them from working properly. Some brushes are better than others at not succumbing to tangled hair, but it’s a good idea to check your robot’s brushes regardless — both their main brush and any smaller roller brushes or corner brushes they have. These parts are often easy to pop off of the machine (because they do require replacements eventually) so we recommend removing each brush entirely, getting rid of any tangled hair or other debris attached to them and reinstalling them afterwards. Robot vacuums also have filters that need replacing every couple of months. Check your machine’s user manual or the manufacturer’s website to see how long they recommend going in between filter replacements. Most of the time, these filters cannot be washed, so you will need to buy new ones either directly from the manufacturer or from other retailers like Amazon or Walmart. How we test robot vacuums We primarily test robot vacuums by using them as they are intended to be used: in a home, across different types of flooring and in the face of all sorts of messes including pet hair, spilt coffee grounds and other food debris, dust bunnies and more. We set up all robot vacuums according to their provided instructions and run multiple cleaning jobs during a testing period of at least one to two weeks per machine. If the robot has mopping capabilities, we also test those as well on hardwood and tile flooring. For models with self-emptying bases, we rely on those built-in trash cans for all post-job cleaning, and we make sure to test the robot vacuum's mobile app for usability and convenience. As we're testing, we make note of things like how loud the robot and its components are, how much human attention the robot needs on a regular basis, how the robot handles large messes and big dust bunnies, if the robot gets stuck on rugs, doormats or other furniture and more. Robot vacuum FAQs Are robot vacuums worth it? We tackled this question when we reviewed budget robot vacuums and the answer is yes, especially if vacuuming is one of your least favorite chores. Robots take the hard work out of cleaning your floors – just turn the thing on and watch it go. Any robot vacuum cleaner worth buying is semi-autonomous in that it will suck up dirt around your home until its battery is low and then make its way back to its charging dock. Unlike a regular vacuum, you should only have to interact with it to turn it on, empty its dustbin and untangle it if it were to get stuck somewhere. That’s not to say robot vacuums are perfect. They’re almost always less powerful and less flexible than traditional vacuums. Since most robo-vacs are much smaller than traditional models, they often don’t have the same level of suction you’ll get in an upright machine. Plus, their dustbins are smaller, so they will need to be emptied more frequently. While Wi-Fi-connected robot vacuums give you the flexibility to start a cleaning job from anywhere using an app, targeting a small area of your home can be more complicated. Some robo-vacs have spot-cleaning features that focus the machine’s attention on a specific area, which almost – but not quite – mimics the spot-cleaning you’d be able to do yourself with a regular or cordless vacuum. How long do robot vacuums last? Robot vacuums can last many years, if you take care of them properly. Check out our recommendations for robot vacuum maintenance above, but in a nutshell, you should make sure that you're emptying the machine's bin after every job and periodically cleaning the interior of the bin and the brushes. It's also a good idea to check the user manual to see how often your robot vacuum's filter needs changing. Do robot vacuums work better than handheld vacuums? There's no straight answer to this question. Robot vacuums offer more convenience than handheld vacuums, so for those who are looking to automate a chore, that could mean one of these devices works better for them than a standard vacuum. However, handheld vacuum cleaners often have stronger suction power, and they give the user a bit more control. It ultimately depends on how you intend to use your main vacuum cleaner and what you want to prioritize most. How often do you have to clean a robot vacuum? Cleaning a robot vacuum isn’t too much of a chore, but you’ll want to give it a little TLC every few weeks or so, depending on how often you’re running it and how much dirt it’s picking up. The dustbin usually needs to be emptied after each cleaning run, especially if you have pets or lots of carpet where dirt can hide. Many newer models have self-emptying docks, which means you won’t have to empty the dustbin yourself after every use, but the main bin will still need a good clean once a month or so. Also, it’s a good idea to check the side brushes and main brush for any hair tangles or debris every couple of weeks to keep things running smoothly. What are the negatives of robot vacuums? Robot vacuums won’t work for everyone. One of the biggest drawbacks is that they usually don’t have the same suction power as a full-sized upright vacuum or even a cordless stick vacuum , so they might struggle with deep-cleaning thick carpets. They’re also designed for floors only, so if you’re looking to clean furniture, stairs or other tricky spots, you’ll still need a traditional vacuum to do that. Plus, they can sometimes get stuck or miss spots, especially if you’ve got a lot of furniture or obstacles in the way. While their sensors help, they might still bump into things or need a little help getting out of tight spots. And while most have decent dirt detection features, they’re best for keeping things tidy rather than doing heavy-duty cleaning. Check out more from our spring cleaning guide. This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/best-robot-vacuums-130010426.html?src=rss", "ingested_utc": "2025-08-15T09:42:01Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:10Z", "source": "AlJazeera_All", "title": "Trump faces “serious risks” with Putin’s “maximalist demands”", "url": "https://www.aljazeera.com/video/quotable/2025/8/15/trump-faces-serious-risks-with-putins-maximalist?traffic_source=rss", "id_key": "6047237aea2a45ceb3a24ef4ac6c7250172c001d5126c26178fc4cf08c41eaef", "summary": "David Salvo, of the Alliance for Securing Democracy, warns of Putin's push to sway Trump on Ukraine.", "ingested_utc": "2025-08-15T09:42:10Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:10Z", "source": "AlJazeera_All", "title": "Sewage floods Gaza’s Nasser Hospital after Israeli strike", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/15/sewage-floods-gazas-nasser-hospital-after-israeli-strike?traffic_source=rss", "id_key": "632a8dd0e5d3d66e22c76afabc568b0fa23dcc9953f8d1ae2d00cfbc874aedce", "summary": "Sewage water has flooded Gaza’s Nasser Hospital after an Israeli strike damaged nearby infrastructure.", "ingested_utc": "2025-08-15T09:42:10Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:10Z", "source": "AlJazeera_All", "title": "Blackwater founder Erik Prince to send forces to Haiti to fight gangs", "url": "https://www.aljazeera.com/news/2025/8/15/blackwater-founder-erik-prince-to-send-forces-to-haiti-to-fight-gangs?traffic_source=rss", "id_key": "5f67aa50b6012261989e1e4932e120b7591e7dc9ed202b354c99d0286afc67b3", "summary": "Vectus Global, a security company led by Erik Prince, has a contract to battle Haiti's gangs and restore tax collection.", "ingested_utc": "2025-08-15T09:42:10Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:19Z", "source": "FinancialPost_Business", "title": "Orsted’s Worst Week on Record Hints at More Volatility to Come", "url": "https://financialpost.com/pmn/business-pmn/orsteds-worst-week-on-record-hints-at-more-volatility-to-come", "id_key": "7c0aa146543f67bb6fa36b19deb1b032bc2375490b9b3f287cb364d2e82002be", "summary": "Since its market debut more than nine years ago, wind power pioneer Orsted A/S has experienced the highs of ranking among Europe’s most valuable energy companies, and this week’s low of giving up all stock gains since going public.", "ingested_utc": "2025-08-15T09:42:19Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:19Z", "source": "FinancialPost_Business", "title": "Canadian Home Sales Continue to Climb in July, National Benchmark Price Remains Steady", "url": "https://financialpost.com/globe-newswire/canadian-home-sales-continue-to-climb-in-july-national-benchmark-price-remains-steady", "id_key": "e9e30c6c0107298cc8a8eb56f85b4dce82c01bfad10cb38b1c35218b5bcb04f3", "summary": "OTTAWA, Ontario, Aug. 15, 2025 (GLOBE NEWSWIRE) — The number of home sales recorded over Canadian MLS® Systems climbed 3.8% on a month-over-month basis in July 2025. Building on gains recorded over the previous three months, transactions are now up a cumulative 11.2% since March. The July increase in home sales was again led overwhelmingly […]", "ingested_utc": "2025-08-15T09:42:19Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:26Z", "source": "Nikkei_Asia_Top", "title": "Vietnam launches $49bn in projects to boost growth amid US tariff pain", "url": "https://asia.nikkei.com/economy/vietnam-launches-49bn-in-projects-to-boost-growth-amid-us-tariff-pain", "id_key": "5b6a51115e81628dc508cfd13c9ca1b1b98f13ceb0253061ec5329fded5c189e", "summary": "", "ingested_utc": "2025-08-15T09:42:26Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:42:33Z", "source": "MIT_TechReview", "title": "Taiwan’s “silicon shield” could be weakening", "url": "https://www.technologyreview.com/2025/08/15/1121358/taiwan-silicon-shield-tsmc-china-chip-manufacturing/", "id_key": "a60608a0f962790a8c0217c19b2d5e358d9a6cdef6c0e13eadd86bded50b6936", "summary": "One winter afternoon in a conference room in Taipei, a pair of twentysomething women dragged their friend across the floor. Lying on the ground in checkered pants and a brown sweatshirt, she was pretending to be either injured or dead. One friend picked her up by her arms, the other grabbed hold of her legs,…", "ingested_utc": "2025-08-15T09:42:33Z"}
