{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T21:43:33Z", "source": "Guardian_World", "title": "Tractor falls from bridge on to M20 leaving driver critically injured", "url": "https://www.theguardian.com/world/2025/aug/18/tractor-falls-from-bridge-on-to-m20-leaving-driver-critically-injured", "id_key": "19f725f8952a5885abd04b19019ecbe6c9f2a46f8cd4e90f4cc9b4051ccfaaef", "summary": "Man airlifted to hospital after vehicle drops on to central reservation of motorway in Kent A man has been hospitalised with serious injuries after a tractor tipped on to a motorway from a bridge following a crash. Kent police said they were called to reports of a single-vehicle collision on the A227 overbridge near Wrotham at 11.17am on Monday. A tractor became separated from its trailer before falling on to the central reservation between junctions 2 and 3 of the M20. Continue reading...", "ingested_utc": "2025-08-18T21:43:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T21:43:52Z", "source": "CryptoSlate", "title": "Circle’s Arc blockchain network to launch with day one access for institutions via Fireblocks", "url": "https://cryptoslate.com/circles-arc-blockchain-network-to-launch-with-day-one-access-for-institutions-via-fireblocks/", "id_key": "34900158d859aca42a2d4b24344360cb56ae63d6cb88af9c2664280e6c2bd5be", "summary": "Circle’s upcoming Arc blockchain will debut with direct institutional access through Fireblocks, positioning the stablecoin issuer for a stronger foothold as competition in the sector accelerates. New York–based Fireblocks, which provides custody and tokenization infrastructure to more than 2,400 banks, asset managers, and fintech firms, confirmed it will support Arc from launch. The early integration […] The post Circle’s Arc blockchain network to launch with day one access for institutions via Fireblocks appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T21:43:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T21:46:36Z", "source": "FinancialPost_Business", "title": "Capvidia brings MBD for Suppliers with browser-based 3D human-viewable models linked to QIF/STEP", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/capvidia-brings-mbd-for-suppliers-with-browser-based-3d-human-viewable-models-linked-to-qif-step", "id_key": "05bfa0ecb075d760d5e89eee6fa1e8449ea41433fb37cda04b9a6551aa845f43", "summary": "CHICAGO — Capvidia, a global leader in Model-Based Definition (MBD) and Model-Based Enterprise (MBE) software, announced a major milestone for MBDVidia: 3D human-viewable HTML models synchronized with QIF and STEP AP242. The result is OEM MBD that suppliers can use anywhere with no CAD required. How it works: MBDVidia publishes standards-based QIF/STEP from native CAD […]", "ingested_utc": "2025-08-18T21:46:36Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T21:46:36Z", "source": "FinancialPost_Business", "title": "Cybin Announces Results of Annual Meeting of Shareholders", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/cybin-announces-results-of-annual-meeting-of-shareholders", "id_key": "dcbcb8d6f0356dcf064ade96343c110399e44f1546376f6a7b09cd7d215d1241", "summary": "TORONTO — Cybin Inc. (NYSE American: CYBN) (Cboe CA: CYBN) (“Cybin” or the “Company”), a clinical-stage breakthrough neuropsychiatry company committed to advancing mental healthcare by developing new and innovative next-generation treatment options, is pleased to announce the voting results for each of the matters presented at the Company’s annual meeting of shareholders held on August […]", "ingested_utc": "2025-08-18T21:46:36Z"}
