{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:54:59Z", "source": "BBC_Business", "title": "Air fares and food prices push up inflation in July", "url": "https://www.bbc.com/news/articles/c741wkngndqo?at_medium=RSS&at_campaign=rss", "id_key": "845f1e08cf1eb93c0517f0298aeb1172cc034a6b049c878d69897e9f2e5b7344", "summary": "Prices are now rising at their fastest pace since last January.", "ingested_utc": "2025-08-20T06:54:59Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "There are risks in Australia’s row with Israel, but it’s Netanyahu who is trashing the relationship", "url": "https://www.theguardian.com/australia-news/2025/aug/20/australia-israel-relationship-albanese-netanyahu", "id_key": "75187c0febacd204619e36112a69349463dd9356fc0c41e278402c839fbacc96", "summary": "The Israeli prime minister has launched a diplomatic broadside against Albanese, adopting a similar playbook to his approach to UK, Canada and France Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast When Anthony Albanese announced Australia would formally recognise Palestinian statehood earlier this month, the prime minister let slip he had already discussed the decision with Israel’s Benjamin Netanyahu. A call between the leaders had been expected, but no statement or readout was released after it took place. Speaking alongside the foreign affairs minister, Penny Wong, a few days later, Albanese said it had been a civil conversation. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "New investigation into backpacker killer Ivan Milat possible after NSW premier leaves door open", "url": "https://www.theguardian.com/australia-news/2025/aug/20/new-investigation-into-backpacker-killer-ivan-milat-possible-after-photos-related-to-cold-case-surface-ntwnfb", "id_key": "80043f0da491c3f2690e18bde3561df9b71842fea59b952311dcc49bb2a530a2", "summary": "Chris Minns says he will seek to meet victims’ families after agreeing police sketch of cold case suspect ‘incredibly similar’ to serial killer The premier of New South Wales, Chris Minns, has said he is open to a parliamentary inquiry into Ivan Milat, after a state MP questioned whether the backpacker murderer could be responsible for many more deaths. Legalise Cannabis party MLC Jeremy Buckingham is pursuing whether Milat was responsible for dozens of unsolved murders throughout Australia, mainly of young women. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "India and China hail warming ties amid Trump-induced geopolitical shake-up", "url": "https://www.theguardian.com/world/2025/aug/20/india-and-china-hail-warming-ties-amid-trump-induced-geopolitical-shake-up", "id_key": "4ca53453d6ed74fe202fc343eae672fc17c519dae52a6e0d6a2991b3578e9e13", "summary": "Visit to Delhi by Wang Yi, China’s top diplomat, has seen both countries agree to resume trade ties and work towards resolving border dispute India’s prime minister and China’s foreign minister have hailed “steady” progress in their countries’ fractious relationship, agreeing to resume trade and other ties, as well as work towards resolving the long-running Himalayan border dispute, amid a global geopolitical shake-up instigated by Donald Trump’s tariff regime. According to statements from China’s foreign ministry, the two sides agreed to resume direct flights – reiterating a pledge made in January – as well as issuing visas to journalists and facilitating business and cultural exchanges. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "Rail fares in England expected to rise by 5.8% next year", "url": "https://www.theguardian.com/money/2025/aug/20/rail-fares-in-england-rise-next-year", "id_key": "cb257aa9e5aa2603c5210c2927a5ad34253ef2270b6f79bb03178d38447ee056", "summary": "Concern among passenger groups over usual calculation of ticket prices Business live – latest updates Train fares in England expected to rise by as much as 5.8% next year on the back of the latest inflation data release, sparking concern among passenger groups. Increases in rail ticket prices are usually calculated by adding one percentage point to July’s inflation reading on the retail prices index, which was 4.8%, according to figures from the Office for National Statistics. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:01Z", "source": "Guardian_World", "title": "UK inflation rises by more than expected to 3.8% amid higher food prices", "url": "https://www.theguardian.com/business/2025/aug/20/inflation-rises-july-pause-interest-rate-cuts", "id_key": "4e0205b0e590a72ecdcb45b6f04cb0dc8c37b4782a4f87a40462d852c76eb873", "summary": "Annual July rate all but rules out possibility of a further Bank of England interest rate cut this year Business live – latest updates Inflation rose again last month to a higher than expected 3.8% amid higher food prices and travel costs, adding to fears that the Bank of England will delay further interest rate cuts. Figures showed the annual rate as measured by the consumer price index (CPI) climbed from June’s 3.6% reading , sitting above the central bank’s 2% target for the 10th consecutive month. Continue reading...", "ingested_utc": "2025-08-20T06:55:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:55:23Z", "source": "CryptoNews", "title": "ALT5 Sigma Denies SEC Probe Rumors Amid $1.5B Trump Crypto Deal", "url": "https://cryptonews.com/news/alt5-sigma-denies-sec-probe-rumors-amid-1-5b-trump-crypto-deal/", "id_key": "8d78a41934355a7b3823c1f96cc8f8ecb1e0d963151f647de105a7aeaf1fab46", "summary": "ALT5 Sigma has pushed back against reports linking the firm and one of its executives to a fresh SEC investigation. The post ALT5 Sigma Denies SEC Probe Rumors Amid $1.5B Trump Crypto Deal appeared first on Cryptonews .", "ingested_utc": "2025-08-20T06:55:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:57:24Z", "source": "FT_Home", "title": "UK inflation rises more than expected to 3.8% in July", "url": "https://www.ft.com/content/7a75942f-9b40-4c49-b87f-e0ed3bed83f8", "id_key": "f31f9f75930177a497d0420738b3d2e04a36329dbce60c6fabd7ad7bf7aff58f", "summary": "Economists say figure casts doubt on prospect of further BoE rate cuts this year", "ingested_utc": "2025-08-20T06:57:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:58:02Z", "source": "FinancialPost_Business", "title": "World’s Two Biggest Miners Meet With Trump Over Copper Plans", "url": "https://financialpost.com/pmn/business-pmn/worlds-two-biggest-miners-meet-with-trump-over-copper-project", "id_key": "7a88a2e4ffd168a6384b85c4f6e8bae76e60fb3f42ea50b4dcc4dc0bd88a219b", "summary": "The chief executive officers of the world’s two biggest mining companies met President Donald Trump to discuss a copper project that could supply the US with a quarter of its demand for decades to come.", "ingested_utc": "2025-08-20T06:58:02Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T06:58:18Z", "source": "HackerNews_Top", "title": "Intel Foundry Demonstrates First Arm-Based Chip on 18A Node", "url": "https://hothardware.com/news/intel-foundry-demos-deer-creek-falls-reference-soc", "id_key": "8b161545ab4b69df8b4479e8c6f8123c0ffbe4ac7476dabdad4b0f88aea717ec", "summary": "Comments", "ingested_utc": "2025-08-20T06:58:18Z"}
