{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:01Z", "source": "BBC_World", "title": "Suspected French spy arrested in alleged Mali coup plot", "url": "https://www.bbc.com/news/articles/cj9w7dg3pr4o?at_medium=RSS&at_campaign=rss", "id_key": "84bbd1a3025d910377f4f2255a22770802627c98dab88dc24aad7e86b2da4aa9", "summary": "The French national is accused of working \"on behalf of the French intelligence service\" in Mali.", "ingested_utc": "2025-08-15T08:51:01Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:04Z", "source": "Guardian_World", "title": "Man arrested over Sydney airport scuffle back in custody after alleged assault at Central train station", "url": "https://www.theguardian.com/australia-news/2025/aug/15/man-arrested-over-sydney-airport-scuffle-back-in-custody-after-alleged-assault-at-central-train-station", "id_key": "67daa4829908e5ac57db3be57929b9d4571a8b26795d5420c05a83dc86f60d3b", "summary": "Nicholas Teplin, 41, allegedly struck three men on Thursday afternoon, a day after airport arrest during which a police gun accidentally fired Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A Victorian man involved in an airport scuffle in which a police gun was accidentally fired is back in custody for allegedly assaulting several people the next day. Nicholas Teplin, 41, faced a court on Friday on allegations he hit three men in the head at Sydney’s Central railway station and then shoved a police officer while in custody. Continue reading...", "ingested_utc": "2025-08-15T08:51:04Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:04Z", "source": "Guardian_World", "title": "Ukraine is fighting for the same values as allies did in second world war, says Keir Starmer – UK politics live", "url": "https://www.theguardian.com/politics/live/2025/aug/15/keir-starmer-zelenskyy-values-ukraine-uk-politics-latest-updates-news", "id_key": "ff53f277257f3280d1a9a97019f34d8ab3fcd9542905201c389f5df0d9343a83", "summary": "Addressing reception marking 80th anniversary of VJ Day, prime minister says he spoke to Zelenskyy about allies’ values as Trump prepares to meet Putin John Healey said suggestions that Russian occupation in parts of Ukraine and a minerals deal featuring in any truce were “all hypotheticals”. Asked whether the UK would back those ideas, the defence secretary told Sky News: I think those are all hypotheticals. This is, as President Trump said, a first meeting, there’s an important principle, once serious negotiations start, that there can be no decisions about Ukraine without Ukraine. So his declaration of bringing President Zelensky into the discussions is important, just as the aim to secure an unconditional ceasefire, to allow the negotiations to take place, is an important part of what I hope we will start to see as a result of the discussions today. It’s a recognition that you can only end fighting by talking. And to have talking and serious negotiation, it requires someone to broker those talks. President Trump is playing that role in a way that only President Trump can, and it’s why we and other European leaders and Ukraine have been willing to give President Trump our full support in trying to take these first steps. Well, I think, well, first of all, we need to see what happens in the discussions today and whether they lead to serious negotiations that will properly involve Ukraine in the future. But our first priority, is to continue to stand with Ukraine, as we have since the outset of this full scale war, to step up our support for the diplomatic pressure and the economic pressure on Putin, but also to keep a focus on the frontline while all eyes are on Alaska, because we can’t jeopardise the peace by forgetting about the war. Continue reading...", "ingested_utc": "2025-08-15T08:51:04Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:04Z", "source": "Guardian_World", "title": "Manchester airport suspends flights after easyJet planes collide", "url": "https://www.theguardian.com/uk-news/2025/aug/15/manchester-airport-suspends-flights-after-easyjet-planes-collide", "id_key": "d82af29f383a5f0637be2232ba5e4986d76cf4bc052700f213bb6f336322d080", "summary": "Two aircraft clipped wings as they taxied to runway for takeoff, with no reports of injuries Flights were briefly suspended at Manchester airport on Friday morning after two easyJet planes collided with each other, clipping wings as they taxied to the runway for takeoff. The two planes were flying to Paris and Gibraltar. They clipped wings at about 6.30am but were able to return to a stand where all the passengers disembarked. There are no reports of any injuries. Continue reading...", "ingested_utc": "2025-08-15T08:51:04Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:04Z", "source": "Guardian_World", "title": "Farage urges Starmer to appoint Reform peers to House of Lords", "url": "https://www.theguardian.com/politics/2025/aug/15/farage-starmer-reform-uk-peers-house-of-lords", "id_key": "553ba4e57afc6fcdbd13f3ff97dffa017f75763df87a3d01c578dd005ec0d17f", "summary": "Party leader’s demand dismissed by defence secretary as a plea for ‘more Putin apologists’ in parliament UK politics live – latest updates Nigel Farage has called for the right to nominate Reform UK supporters to the House of Lords, claiming this would address a “democratic disparity”. The demand was dismissed by the defence secretary, John Healey, who said parliament would not benefit from “more Putin apologists”. Continue reading...", "ingested_utc": "2025-08-15T08:51:04Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:04Z", "source": "Guardian_World", "title": "Kingsmill owner agrees to buy Hovis in deal that could create UK’s biggest bread brand", "url": "https://www.theguardian.com/business/2025/aug/15/kingsmill-owner-agrees-to-buy-hovis-in-deal-to-create-uk-biggest-bread-brand", "id_key": "93535c6785dd2e7b611651f4a7f4dbf5eff2f914f6e2669bdb43656eeb6ab230", "summary": "Jobs expected to go if competition watchdog approves takeover by Associated British Foods Business live – latest updates The owner of Kingsmill has agreed to buy its rival Hovis in a deal that could create the UK’s biggest bread brand if the competition regulator approves it, but also put jobs at risk. The deal comes after decades of decline in the popularity of the packaged sliced loaf, with Hovis, owned by the private equity company Endless, and its rival Kingsmill – part of Associated British Foods (ABF) – struggling to get out of the red for some years. Continue reading...", "ingested_utc": "2025-08-15T08:51:04Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:22Z", "source": "CryptoSlate", "title": "Government-backed chipmaker races past 3,000 BTC in push for 100k Bitcoin target", "url": "https://cryptoslate.com/government-backed-chipmaker-races-past-3000-btc-in-push-for-100k-bitcoin-target/", "id_key": "3a2a0cc03e2bf4c9073edd27a4445e222358aa92caac6fd712a40ed30adc9663", "summary": "Sequans Communications has accelerated the build-out of its newly launched Bitcoin treasury, acquiring more than 3,000 BTC in less than a month as part of a plan to hold 100,000 BTC by 2030. The Paris-based, government-backed Internet of Things semiconductor company began executing the strategy in July, following a $384 million capital raise announced in […] The post Government-backed chipmaker races past 3,000 BTC in push for 100k Bitcoin target appeared first on CryptoSlate .", "ingested_utc": "2025-08-15T08:51:22Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:26Z", "source": "CryptoNews", "title": "Law Enforcement, Private Firms Seized Over $300M in Crypto Linked to Fraud Schemes: Report", "url": "https://cryptonews.com/news/over-300m-seized-in-crypto-linked-to-fraud-schemes/", "id_key": "2a6fad59f58b665986857889b4451492a60851aa88a13eedfe6e4885048056ad", "summary": "TRM Labs, TRON, Tether, and Binance joined the T3 Financial Crime Unit that seized over $250 million in crypto from criminal proceeds. The post Law Enforcement, Private Firms Seized Over $300M in Crypto Linked to Fraud Schemes: Report appeared first on Cryptonews .", "ingested_utc": "2025-08-15T08:51:26Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:51:27Z", "source": "CoinJournal", "title": "DOGE dips 6% as crypto bulls suffer huge losses; Check forecast", "url": "https://coinjournal.net/news/doge-dips-6-as-crypto-bulls-suffer-huge-losses-check-forecast/", "id_key": "b5e139405959b4cfe47ca256b8b59f6b6118a9635d3827ef6aef1ea57ab3d46c", "summary": "Key takeaways The cryptocurrency market reversed its recent gains, with bullish traders losing over $800 million in the last 24 hours. DOGE dropped by 6% after failing to hit $0.26. DOGE dips lower on poor PPI data The cryptocurrency market reversed its recent gains on the back of poor PPI data from the United States. […] The post DOGE dips 6% as crypto bulls suffer huge losses; Check forecast appeared first on CoinJournal .", "ingested_utc": "2025-08-15T08:51:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:53:27Z", "source": "NPR_World", "title": "A former U.S. ambassador to Russia on the Trump-Putin summit", "url": "https://www.npr.org/2025/08/15/nx-s1-5502428/a-former-u-s-ambassador-to-russia-on-the-trump-putin-summit", "id_key": "d0849c22500bdfa468b1aeb762fff981357529311fefe26436d4652ecac0be62", "summary": "NPR's Michel Martin speaks with former U.S. Ambassador to Russia Michael McFaul about the diplomatic dynamics ahead of today's US-Russia summit in Alaska.", "ingested_utc": "2025-08-15T08:53:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:53:27Z", "source": "NPR_World", "title": "No longer isolated, Russia sees opportunity as Putin and Trump meet in Alaska", "url": "https://www.npr.org/2025/08/15/nx-s1-5502647/no-longer-isolated-russia-sees-opportunity-as-putin-and-trump-meet-in-alaska", "id_key": "91fbe697b91d0b6ebec366525e4d4b7a008bc34247a5d5b8065f9842b5b9334c", "summary": "Vladimir Putin was once an international pariah because of Russia's war in Ukraine, but now he's secured a meeting with President Trump to negotiate an end to the conflict. The Kremlin is portraying it as an opportunity for economic cooperation with the U.S.", "ingested_utc": "2025-08-15T08:53:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:53:27Z", "source": "NPR_World", "title": "Ukrainian historian Yaroslav Hrytsak on the path ahead for his country", "url": "https://www.npr.org/2025/08/15/nx-s1-5502443/ukrainian-historian-yaroslav-hrytsak-on-the-path-ahead-for-his-country", "id_key": "8df894a8549f269f9623b05a8535a88b10047d648f7ae84f819cc08b64b27d50", "summary": "Ukrainians say peace can't be achieved in their war with Russia without Ukraine being involved. Yaroslav Hrytsak, a historian at Ukrainian Catholic University in Lviv, talks about what options Ukrainians think they have.", "ingested_utc": "2025-08-15T08:53:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:53:28Z", "source": "FT_Home", "title": "Shein’s UK profits jump on record sales", "url": "https://www.ft.com/content/a3fa8f2d-f6b6-4a4d-a230-4f5da1671ead", "id_key": "6d78f25c5a0c1a3c68d8cb53d4b2ee641e66e0328a3d4d78442d7c4e5ae8306f", "summary": "Fast-fashion group posts 57% jump in earnings as it tries to secure London listing", "ingested_utc": "2025-08-15T08:53:28Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:54:02Z", "source": "FinancialPost_Business", "title": "Orsted ‘Surprise’ Credit Downgrade Caps Worst Week on Record", "url": "https://financialpost.com/pmn/business-pmn/orsted-surprise-credit-downgrade-caps-worst-week-on-record", "id_key": "258a94ee5aa4150dd6739d73977b5d33fec0c2684144e25a8718a031186a62bc", "summary": "Orsted A/S was downgraded to the lowest tier of investment grade by S&P Global Ratings on increasing risks to its US offshore wind business as the Trump Administration moves to halt the sector’s development.", "ingested_utc": "2025-08-15T08:54:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:54:02Z", "source": "FinancialPost_Business", "title": "Algeria Nears Deals With Exxon and Chevron in Shale Gas Push", "url": "https://financialpost.com/pmn/business-pmn/algeria-nears-deals-with-exxon-and-chevron-in-shale-gas-push", "id_key": "8534e11de503c106cf246215f238935a981f5bec03b8a3ca233371c9230bf4b1", "summary": "Algeria is close to finalizing a deal with Exxon Mobil Corp. and Chevron Corp. to tap the North African nation’s vast gas reserves, including shale, for the first time, a senior official said.", "ingested_utc": "2025-08-15T08:54:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:54:02Z", "source": "FinancialPost_Business", "title": "Europe Gas Prices Fall Near 2025 Lows Ahead of Trump–Putin Talks", "url": "https://financialpost.com/pmn/business-pmn/europe-gas-prices-fall-near-2025-lows-ahead-of-trump-putin-talks", "id_key": "1c1b2757f4ecd1cdec5e01b2c72b22a8af261c457515479733faea73fe9b818b", "summary": "Europe’s natural gas prices slid to near the lowest level this year in anticipation of a historic summit between US President Donald Trump and Russia’s Vladimir Putin, which will seek to end a war that collapsed fuel flows from what was once the continent’s biggest supplier.", "ingested_utc": "2025-08-15T08:54:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:54:02Z", "source": "FinancialPost_Business", "title": "Lindt Weighs Making Chocolate Bunnies in US as Trump Tariffs Hit", "url": "https://financialpost.com/pmn/business-pmn/lindt-weighs-making-chocolate-bunnies-in-us-as-trump-tariffs-hit", "id_key": "8677698b461cd052e04fd2fafd8537f29f175475f05fcde83912d5a8a307dba1", "summary": "Swiss chocolatier Lindt & Spruengli AG may shift production of its world-famous, gold-wrapped Easter bunnies to the US to sidestep import tariffs imposed by the Trump administration.", "ingested_utc": "2025-08-15T08:54:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T08:54:02Z", "source": "FinancialPost_Business", "title": "Modi Slams ‘Economic Selfishness’ in Defiance of US Tariffs", "url": "https://financialpost.com/pmn/business-pmn/modi-assails-economic-selfishness-in-defiance-of-trump-tariffs", "id_key": "7531fa36441bf34c41979855b92228be24cf3e228c8012a61eb4234ce5d254d1", "summary": "India’s Prime Minister Narendra Modi announced tax cuts, pledged policy reform and urged the citizens to design and produce high quality goods at home, in a sweeping Independence Day speech that advocated for self reliance in a protectionist global economy.", "ingested_utc": "2025-08-15T08:54:02Z"}
