{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:29Z", "source": "BBC_World", "title": "Texas police hunt convict 'mistakenly' freed from jail", "url": "https://www.bbc.com/news/articles/cd0d32ezn17o?at_medium=RSS&at_campaign=rss", "id_key": "edc503552cde9959f1e332203fd8755e2bd1dcd9281c4741d1ab908384836774", "summary": "Police say the man was sentenced to jail for assaulting a family member and evading arrest.", "ingested_utc": "2025-08-19T13:37:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:32Z", "source": "Guardian_Business", "title": "Intel secures $2bn lifeline from Japan’s SoftBank", "url": "https://www.theguardian.com/technology/2025/aug/19/intel-japan-softbank-us-government", "id_key": "055184532607b79eae72dea9102257749a59fd816ae2f4d037e64b8d93a86eac", "summary": "Shares in chip maker rise amid reports US government is also considering taking a stake Business live – latest updates SoftBank has agreed to invest $2bn (£1.5bn) in Intel, amid reports that Donald Trump’s administration is also considering a stake in the struggling US chip maker. The Japanese technology investor announced the multibillion-dollar deal on Tuesday, in a move expected to give it a 2% stake in the business. Continue reading...", "ingested_utc": "2025-08-19T13:37:32Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:32Z", "source": "Guardian_Business", "title": "Shein looks at moving back to China for Hong Kong listing after London IPO stalls", "url": "https://www.theguardian.com/business/2025/aug/19/shein-mulls-china-return-for-hong-kong-listing-after-london-ipo-stalls", "id_key": "ea6fb38ee5d653b48ad8dac49e23e4d62691f280a637a74dd6c0b974101d5131", "summary": "Fashion retailer considered £50bn float in London but has not received backing from Chinese authorities Business live – latest updates The online fashion retailer Shein is understood to be considering moving its base back to China from Singapore to pave the way for a Hong Kong listing. The business, which was founded in China and moved its headquarters to Singapore in 2022, had been considering a £50bn float in London after failing to win approval from regulators in the US for a New York flotation. Continue reading...", "ingested_utc": "2025-08-19T13:37:32Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "Trump warns Putin of ‘rough situation’ if he does not move towards peace in Ukraine but tells Zelenskyy to ‘show flexibility’ – live", "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news", "id_key": "f101ca161fe138ed6177a4a0c0355bf0938c9b63564ef38d3944fdbfd8fa9cd8", "summary": "US president says it’s possible Russian leader does not want to make deal and hints at possibility of US air security guarantees Volodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February , which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough. In his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports. A meeting between Zelenskyy and Putin ... could it finally happen? The need for security guarantees agreed – but details unclear Trump believes he is very good at solving conflicts A potential boost for the US arms industry Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "Mediators optimistic Israel will accept ceasefire deal that is ‘almost identical’ to one they earlier agreed – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/19/aid-ship-food-gaza-cyprus-israel-middle-east-crisis-latest-updates-news", "id_key": "074784b15df95fe0bbc6a9aec60a88c87442307eae6b7e453e609dd210edf28a", "summary": "Qatar says no breakthrough has yet been made but Hamas has given ‘positive response’ The UN’s human rights office on Tuesday condemned a far-right Israeli minister for taunting a Palestinian prisoner in his cell and sharing the footage online, Reuters reports. National security minister Itamar Ben-Gvir published a video on Friday last week showing him confronting Marwan Barghouti, the most high-profile Palestinian detainee in Israeli custody. Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "Israel to respond by Friday over Gaza truce plan accepted by Hamas", "url": "https://www.theguardian.com/world/2025/aug/19/israel-to-respond-by-friday-gaza-truce-plan-hamas", "id_key": "7ab2fa1fb7517c693169c91717af20e7c9d56e093ce57acbbeb2a921f0a74d2d", "summary": "Israel under pressure to accept ceasefire proposal that is said to be almost identical to earlier US-backed plan Middle East crisis – live updates Israel has said it will deliver its response to international mediators by Friday over a new Gaza ceasefire plan accepted by Hamas amid mounting pressure for a truce in a war that has claimed more than 62,000 Palestinian lives. After mass protests in Israel demanding a deal to secure the release of the remaining 20 living Israeli hostages held in Gaza, it appeared that Hamas had reduced its demands for a prisoners-for-hostages exchange as well as over the scope of an Israeli-demanded “security buffer zone”. Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "Boss of flexible office group IWG dismisses 17% fall in share price as ‘machine selling’", "url": "https://www.theguardian.com/business/2025/aug/19/iwg-boss-dismisses-fall-share-price-machine-selling", "id_key": "e3c4506ad171b33b607c5dd1d38eb4bd9a5c3b416991825b00c30e71074a0ba3", "summary": "Spaces and Regus owner says global volatility will support demand for its hybrid workspaces Business live – latest updates The boss of the flexible office company IWG played down a 17% drop in its share price on Tuesday as “not rational”, arguing that economic uncertainty around the world is supporting demand for hybrid workspace. IWG, which owns the Spaces and Regus brands, said its adjusted profit rose by 6% to $262m (£194m) for its first half of the year, but its shares plunged after it told investors it expected adjusted profit to end 2025 at the lower end of previous guidance of $525m-$565m. Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "Reform UK accused of serving a ‘plate of chaos’ at Leicestershire county council", "url": "https://www.theguardian.com/politics/2025/aug/19/reform-uk-accused-serving-plate-of-chaos-leicestershire-county-council", "id_key": "36b5fc8c5edac28e166fc92a04a65acf4bb56188e66bebaf806bcbab25bad2ff", "summary": "Tory opposition criticises leadership after Reform’s 22-year-old deputy leader is removed after three months in role A Reform UK-led county council has served its residents a “plate of chaos” from the start of its leadership, according to its Conservative opposition, after its 22-year-old deputy leader was removed three months into the job. Joseph Boam, elected in May as a Reform councillor for Leicestershire county council , had also been stripped of his cabinet brief for adult social care and communities, said the leader of the Leicestershire Conservatives, Deborah Taylor. Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "‘Alligator Alcatraz’ civil rights case sees split ruling from Miami judge", "url": "https://www.theguardian.com/us-news/2025/aug/19/alligator-alcatraz-split-ruling-miami", "id_key": "0151928f7a8baa11dd1fab10d75067664a23cbfb1915bb28331fd841c2c3a454", "summary": "Civil rights lawyers say immigrants at the Everglades site lack confidential access to counsel as judge moves case A federal judge in Miami issued a split decision in a lawsuit over the legal rights of detainees at the immigration detention center in the Florida Everglades known as “Alligator Alcatraz”, dismissing part of the suit and also moving the case to a different jurisdiction. US district judge Rodolfo Ruiz issued the decision late Monday, writing in a 47-page ruling that claims the detainees at the facility don’t have confidential access to their lawyers or to hearings in immigration court were rendered moot when the Trump administration recently designated the Krome North processing center near Miami as a site for their cases to be heard. Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "Trump administration speechwriter linked to hate speech online", "url": "https://www.theguardian.com/us-news/2025/aug/19/eric-lendrum-trump-dhs-speechwriter-hate-speech", "id_key": "898f4bcc65f6d6c2fc9c0e5320eaf357c08cfeacbc2d2584ccb6b553275500c9", "summary": "Eric Lendrum, of Department of Homeland Security, likened US conservatives to Jews in Nazi Germany US politics – live updates A speechwriter for the Trump administration ’s Department of Homeland Security (DHS) has come under scrutiny after he was linked to hate speech online. Eric Lendrum compared the circumstances of American conservatives to that of enslaved people and Jewish people in Nazi Germany, and in his podcast claimed that the racist great replacement conspiracy theory was “real”, the news outlet Notus reported . Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:33Z", "source": "Guardian_World", "title": "When US prison healthcare companies went bust, victims’ families kept fighting", "url": "https://www.theguardian.com/us-news/2025/aug/19/us-private-prison-healthcare-companies", "id_key": "2fa6ca5c29913eb63f53408693330713308ef27ced36eb235b65dd46118c85d6", "summary": "The Guardian examined several cases that played out in bankruptcy court, where a series of unlikely events led to an unusual victory When Jennifer Casey Norred attempted suicide at Leon county jail in Tallahassee, Florida, medical staff didn’t take her to the emergency room or provide mental health support. Instead, they strapped her to a chair for 24 hours, according to jail records. The jail’s own policy requires that restraint chairs only be used as a last resort, and not for more than two hours. It was the kind of policy violation that has become more common nationwide since two private-equity backed prison health companies, Corizon and Wellpath, have come to dominate the industry, experts say. Continue reading...", "ingested_utc": "2025-08-19T13:37:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:51Z", "source": "CryptoSlate", "title": "Nasdaq braces for IPO debut of first blockchain lender as Figure swings to $29M profit", "url": "https://cryptoslate.com/nasdaq-braces-for-ipo-debut-of-first-blockchain-lender-as-figure-swings-to-29m-profit/", "id_key": "395965404d7cf5b1e90c1ae13a879b3ab1917bdc74722a7a60a3d3d9717a087e", "summary": "Figure Technology has filed for an initial public offering on Nasdaq, reporting $191 million in revenue for the first half of 2025 and a net income of $29 million. The filing, made public on August 18, marks one of the first cases of a blockchain-based lender reaching the U.S. public markets. Per Reuters, the company […] The post Nasdaq braces for IPO debut of first blockchain lender as Figure swings to $29M profit appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T13:37:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:51Z", "source": "CryptoSlate", "title": "Tether recruits ex-Trump adviser Bo Hines to bolster US strategy", "url": "https://cryptoslate.com/tether-recruits-ex-trump-adviser-bo-hines-to-bolster-us-strategy/", "id_key": "5265d947b42a64159b935eb318e4ba55adafae9b168dc9e75d415b6a1d223563", "summary": "Tether has hired Bo Hines, a former adviser to President Donald Trump, as its Strategic Advisor for Digital Assets and US Strategy. The company confirmed on Aug. 19 that Hines will immediately begin working with Tether’s leadership to guide its expansion and regulatory engagement in the United States. In his new role, Hines will oversee […] The post Tether recruits ex-Trump adviser Bo Hines to bolster US strategy appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T13:37:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:52Z", "source": "CryptoBriefing", "title": "Ethereum treasury SharpLink Gaming holds 740,760 ETH worth over $3 billion", "url": "https://cryptobriefing.com/ethereum-treasury-holdings-sharplink/", "id_key": "868a4a5589599e16cfbda38b4d81adca495f53240eff1010f9a985e1e5f6f143", "summary": "SharpLink Gaming's significant Ethereum holdings highlight the growing trend of corporate investment in cryptocurrencies, impacting market dynamics. The post Ethereum treasury SharpLink Gaming holds 740,760 ETH worth over $3 billion appeared first on Crypto Briefing .", "ingested_utc": "2025-08-19T13:37:52Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:52Z", "source": "CryptoBriefing", "title": "Wyoming launches Frontier Stable Token FRNT on Ethereum, Solana, Avalanche, and more", "url": "https://cryptobriefing.com/wyoming-stablecoin-launch-frnt/", "id_key": "7267682c436624c44595790cc2b1dc833fd5fb4a62a3f46ca3ba368a9b2993e6", "summary": "Wyoming's FRNT stablecoin could revolutionize state-level financial operations, enhancing efficiency and transparency in government transactions. The post Wyoming launches Frontier Stable Token FRNT on Ethereum, Solana, Avalanche, and more appeared first on Crypto Briefing .", "ingested_utc": "2025-08-19T13:37:52Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:57Z", "source": "CryptoNews", "title": "US Treasury Seeks Public Input on Tools to Detect Crypto Money Laundering", "url": "https://cryptonews.com/news/us-treasury-seeks-public-input-on-tools-to-detect-crypto-money-laundering/", "id_key": "3d4424a828368e1a7a63f1f1e256cfa1376b04799744ac306cd0a2a795317db7", "summary": "US Treasury seeks 60-day public input on AI and blockchain monitoring tools to detect crypto money laundering following GENIUS Act requirements as criminals stole $3B in 119 incidents during first half of 2025 with hackers moving funds in just 4 seconds. The post US Treasury Seeks Public Input on Tools to Detect Crypto Money Laundering appeared first on Cryptonews .", "ingested_utc": "2025-08-19T13:37:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:57Z", "source": "CryptoNews", "title": "Crypto Giants Push $6B Ethereum Treasury Strategy to Convince Wall Street", "url": "https://cryptonews.com/news/crypto-giants-push-6b-ethereum-treasury-strategy-to-convince-wall-street/", "id_key": "361a27fd3537b4cb6dd4edfda538ace2a84c6acb81067fc4c15e15183b3e8457", "summary": "Major ETH treasury companies gather in Manhattan pitching Wall Street on $6B Ethereum treasury strategy as corporate holdings reach $22B controlling significant supply following 75% surge since June. The post Crypto Giants Push $6B Ethereum Treasury Strategy to Convince Wall Street appeared first on Cryptonews .", "ingested_utc": "2025-08-19T13:37:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:57Z", "source": "CryptoNews", "title": "Official Trump Coin in Hot Waters, TRUMP Price Drops below $9 – What’s Next?", "url": "https://cryptonews.com/news/official-trump-coin-in-hot-waters-trump-price-drops-below-9-whats-next/", "id_key": "0119790fe597422eb57e751b23b96657db5e902c335c7c7ef9a851821adb55e3", "summary": "With Canary Capital recently filing for an Official Trump ETF, could the TRUMP price be on the cusp of a big breakout? The post Official Trump Coin in Hot Waters, TRUMP Price Drops below $9 – What’s Next? appeared first on Cryptonews .", "ingested_utc": "2025-08-19T13:37:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:57Z", "source": "CryptoNews", "title": "Saylor Reverses Course on Stock Sales as Strategy’s Premium to Bitcoin Holdings Falls", "url": "https://cryptonews.com/news/saylor-reverses-course-on-stock-sales-as-strategys-premium-to-bitcoin-holdings-falls/", "id_key": "134eeb9da9959e1d8683b4c7cc4ad6b5363c298468206607bdc5ef2277212962", "summary": "Saylor's Strategy Inc quietly reverses course on self-imposed stock sale restrictions below 2.5x mNAV threshold as Bitcoin premium erodes and purchasing pace dramatically slows to just 430 BTC weekly from previous aggressive accumulation patterns. The post Saylor Reverses Course on Stock Sales as Strategy’s Premium to Bitcoin Holdings Falls appeared first on Cryptonews .", "ingested_utc": "2025-08-19T13:37:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:57Z", "source": "CryptoNews", "title": "Bitmine’s Tom Lee Insider Insight Predicts Ethereum Dip to $4,075 Before Rally to $5,100", "url": "https://cryptonews.com/news/bitmines-tom-lee-insider-insight-predicts-ethereum-dip-to-4075-before-rally-to-5100/", "id_key": "a547c5085ee2849686cf951826923ba544cbe9a11b888ab9edcc9a595f3fd19d", "summary": "Bitmine's Tom Lee shares exclusive insider insights predicting Ethereum temporary decline to $4,075-$4,150 range before subsequent rally toward $5,100 as ETFs experience $196.6M outflows during current technical correction phase. The post Bitmine’s Tom Lee Insider Insight Predicts Ethereum Dip to $4,075 Before Rally to $5,100 appeared first on Cryptonews .", "ingested_utc": "2025-08-19T13:37:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:57Z", "source": "CryptoNews", "title": "Stablecoins Threaten to Disrupt U.S. Bank Deposits and Payments, Morningstar DBRS Warns", "url": "https://cryptonews.com/news/stablecoins-threaten-to-disrupt-u-s-bank-deposits-and-payments-morningstar-warns/", "id_key": "587d50c44b68f83b76bde43582a871ebeaee823272a1ed09a51b9135506da189", "summary": "Stablecoins have rapidly become a central pillar of the digital asset economy, now exceeding a combined market capitalization of $230 billion as of mid-2025, according to Morningstar DBRS. The post Stablecoins Threaten to Disrupt U.S. Bank Deposits and Payments, Morningstar DBRS Warns appeared first on Cryptonews .", "ingested_utc": "2025-08-19T13:37:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:58Z", "source": "CoinJournal", "title": "Polygon price forecast: POL surges 6% as TVL reaches 2025 high", "url": "https://coinjournal.net/news/polygon-price-forecast-pol-surges-6-as-tvl-reaches-2025-high/", "id_key": "82e9a48dc163264495bc851f6875df3fc2bae40105ba4d49fd479281fcfd9e37", "summary": "Polygon token (POL) soared as most altcoins dipped on Monday and early Tuesday. While POL has given up some of the gains to $0.26, bulls appear to be in control. Gains for the altcoin come as its network’s total value locked (TVL) jumped to a year-to-date high. Polygon’s native token, POL (ex- MATIC) (POL), is […] The post Polygon price forecast: POL surges 6% as TVL reaches 2025 high appeared first on CoinJournal .", "ingested_utc": "2025-08-19T13:37:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:37:58Z", "source": "CoinJournal", "title": "Why is the price of WAVES token rising?", "url": "https://coinjournal.net/news/why-is-the-price-of-waves-token-rising/", "id_key": "85919ae0f6442e014d822947a9405299bb5f166caff3f34279ebfef09a5059ec", "summary": "Waves launches AI tools and secures $10M funding for Units Network. Price breaks $1.30 resistance with bullish RSI and MACD signals. Community campaign boosts visibility as altcoin flows support gains. WAVES is climbing again, and traders are asking why. Over the past 24 hours, the token has risen by 4.86%, extending its 25% weekly rally. […] The post Why is the price of WAVES token rising? appeared first on CoinJournal .", "ingested_utc": "2025-08-19T13:37:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:38:14Z", "source": "CoinMetrics_Blog", "title": "Layer-1 Sector Analysis", "url": "https://coinmetrics.io/state-of-the-network/layer-1s-sector-analysis/", "id_key": "b4c2f0604e4dd17f44b9d24c5c94e1ae37a2dfe5c0422ef2bfafa568fd0c08da", "summary": "Coin Metrics Sector Analysis: Layer-1 blockchain architectures, usage, and token economics The post Layer-1 Sector Analysis appeared first on Coin Metrics .", "ingested_utc": "2025-08-19T13:38:14Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:38:40Z", "source": "Sui_Blog", "title": "SUI Now Listed on Robinhood, Expanding its Reach to Millions of Users", "url": "https://blog.sui.io/robinhood-listing-sui/", "id_key": "8737681fbc1e3551728e65c43d73bc32e7f59e24a593077ff293e426cb160d70", "summary": "The SUI token is available to trade for US customers on Robinhood starting today, in landmark moment of maturation and access for the Sui ecosystem.", "ingested_utc": "2025-08-19T13:38:40Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:39:54Z", "source": "NYTimes_Business", "title": "Trump May Further Redefine U.S. Capitalism With an Intel Move", "url": "https://www.nytimes.com/2025/08/19/business/dealbook/trump-capitalism-intel.html", "id_key": "df4c9b662815b0674414275c5ea5121e4e8d9711a540501c30cf3257bd7459c6", "summary": "The White House’s deliberations about taking a stake in Intel could upend the technology sector — and further redefine how Washington deals with business.", "ingested_utc": "2025-08-19T13:39:54Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:39:54Z", "source": "NYTimes_Business", "title": "MSNBC’s Rebrand to MS NOW Invites Bemusement and Ridicule", "url": "https://www.nytimes.com/2025/08/19/business/msnbc-ms-now-rebranding.html", "id_key": "dbc96a35b0f754f1e2c09dba1c5be95f172e1381eba7c871ebd14d1f823e23ba", "summary": "The cable TV network’s new name, MS NOW, became the subject of mockery soon after it was announced on Monday.", "ingested_utc": "2025-08-19T13:39:54Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:39:55Z", "source": "NYTimes_World", "title": "Live Updates: European Leaders Discuss Protections for Ukraine After White House Talks", "url": "https://www.nytimes.com/live/2025/08/19/us/trump-zelensky-ukraine-russia", "id_key": "61111420acf1f93c8ef8157c01d8b5a2914b3c049799078e05ca59271476aab1", "summary": "After hastily arranged meetings with President Trump produced little tangible progress toward peace, Ukraine’s allies focused on security guarantees to keep Russia from invading again.", "ingested_utc": "2025-08-19T13:39:55Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:39:55Z", "source": "NYTimes_World", "title": "Netanyahu Faces Pressure From Far Right Over New Israel-Hamas Cease-Fire Proposal", "url": "https://www.nytimes.com/2025/08/19/world/middleeast/israel-hamas-cease-fire-talks.html", "id_key": "aee36ee61abab890ebe6be85f49f405408fe9cc97c26d5377d1109f8c8c49d3d", "summary": "Some members of Israel’s coalition have ruled out a proposed hostage deal with Hamas, but the prime minister has yet to state his position.", "ingested_utc": "2025-08-19T13:39:55Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:07Z", "source": "FT_Home", "title": "Trump says Ukraine security guarantee could include US air support", "url": "https://www.ft.com/content/591a8788-c553-4886-858f-b7c7854cbcfd", "id_key": "a9f0fcb841fd2713058c4af33bbb6af37e57ea6e3b5873220975376d9ab1e5fb", "summary": "US president warns Putin will face ‘rough situation’ if he does not co-operate on a peace deal", "ingested_utc": "2025-08-19T13:40:07Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:07Z", "source": "FT_Home", "title": "European defence rally falters on Ukraine ceasefire talks", "url": "https://www.ft.com/content/d548ee94-5e02-4124-87ad-7fd5ee039758", "id_key": "e502bdf93778ac1f64e014c04d801a5ef5e04ffbd985d1193021a4f5eb4dca08", "summary": "Stock prices fall as Trump vows to involve Zelenskyy in peace discussions with Putin and Kyiv vows to buy US weapons", "ingested_utc": "2025-08-19T13:40:07Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:25Z", "source": "TheVerge_All", "title": "Spotify’s new track mixing tool adds DJ features to your playlists", "url": "https://www.theverge.com/news/761290/spotify-playlist-mix-audio-transition-feature", "id_key": "bf1aa8e70e8bbf6e4b8154a73042e895d87574c06e4a38be0f0cce9002156a0d", "summary": "Spotify is testing a new audio mixing feature that allows you to customize track transitions for your playlists. Now rolling out in beta for “eligible Premium users,” the Mix feature provides an option to automatically blend transitions between tracks, or manually adjust aspects like volume, EQ, and effect curves while looking at waveform and beat […]", "ingested_utc": "2025-08-19T13:40:25Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:25Z", "source": "TheVerge_All", "title": "Anker’s latest power station is compact, capable, and temporarily cheap", "url": "https://www.theverge.com/news/761219/ankers-latest-power-station-is-compact-capable-and-temporarily-cheap", "id_key": "1c5aace863384987d26bbb8b9d03720400bc3aa0470076587e7adab6f57be39b", "summary": "1kWh power stations like Anker’s new Solix C1000 Gen 2 are in the sweet spot for most people in need of a big-ass battery. Its long-lasting LFP chemistry and 2,000W inverter combine during a blackout to keep devices like a router, fridge/freezer, and some lights running for a few hours, and it’s portable enough for […]", "ingested_utc": "2025-08-19T13:40:25Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:25Z", "source": "TheVerge_All", "title": "Adobe&#8217;s AI Acrobat file hub is designed for more than PDFs", "url": "https://www.theverge.com/news/761248/adobe-acrobat-studio-pdf-ai-workspace-app", "id_key": "dc19fb48559a5ae0d9fba3f05582a321fdb8d78967cd27e2be8bff06be5a6752", "summary": "Adobe is introducing a new Acrobat platform that combines the PDF app with its Adobe Express content creation service and AI assistants that can automate specific productivity tasks. Acrobat Studio allows users to upload up to 100 documents and consolidate the information together into a single workspace. The idea is to evolve Acrobat beyond being […]", "ingested_utc": "2025-08-19T13:40:25Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:25Z", "source": "TheVerge_All", "title": "Intel will receive a $2 billion lifeline from SoftBank", "url": "https://www.theverge.com/news/761259/intel-softbank-2-billion-investment", "id_key": "2523ed1311205e82bb10f3d081f8c1bb4862c925297f542fb6ca6a2ab79fa5f1", "summary": "SoftBank will invest $2 billion into Intel as the struggling chipmaker pulls back on spending and lays off thousands of workers. In an announcement, SoftBank CEO Masayoshi Son said the investment aligns with the firm’s belief that “advanced semiconductor manufacturing and supply will further expand in the United States.” SoftBank’s investment in Intel makes it […]", "ingested_utc": "2025-08-19T13:40:25Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:25Z", "source": "TechCrunch_All", "title": "Nvidia said to be developing new, more powerful AI chip for sale in China", "url": "https://techcrunch.com/2025/08/19/nvidia-said-to-be-developing-new-more-powerful-ai-chip-for-sale-in-china/", "id_key": "8b29df8561e915e1e85ba317fe878974f0b871fe510aa6ebf19b9e0e91ac19af", "summary": "Nvidia is apparently putting together a new AI chip meant for sale in China that's half as powerful as its flagship B300 Blackwell GPU. The new chip would be more powerful than the H20 GPUs the company is currently allowed to sell in the country.", "ingested_utc": "2025-08-19T13:40:25Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:27Z", "source": "WIRED_All", "title": "The Best Ergonomic Mouse (2025), Tested and Reviewed", "url": "https://www.wired.com/gallery/best-ergonomic-mouse/", "id_key": "039a717e7564c272e9b61e1bc4cfdb1829207a3cd7b9275ad1e07e2aba9f2447", "summary": "Wrists cramping? Skip the gaming mouse and snag one of these WIRED-tested ergonomic options instead.", "ingested_utc": "2025-08-19T13:40:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "NVIDIA is reportedly developing an AI chip for China more powerful than the H20", "url": "https://www.engadget.com/ai/nvidia-is-reportedly-developing-an-ai-chip-for-china-more-powerful-than-the-h20-130057520.html?src=rss", "id_key": "1c9bf7178e7f181b1b1bb7dae89b2a57b4a58628413812ed2fa924954fb6fc16", "summary": "NVIDIA is working on a new AI chip meant for the Chinese market that's more powerful than the H20, according to Reuters . It will reportedly be based on the company's latest Blackwell architecture , which can produce chips between seven and 30 times faster than its previous AI platform. Reuters says the product is tentatively named B30A and will have a single-die design, putting all its main components on a single piece of silicon. It will apparently be capable of half the computing power of NVIDIA's Blackwell Ultra GPUs , which have dual-die configuration. The product will also come with high-bandwidth memory and the company's NVLink technology for speedier data transmission between processors. It's possible that NVIDIA is developing the chip after the Chinese government discouraged local companies from using the H20, especially for government and national security purposes. Chinese regulators even reportedly ordered big tech corporations, including Alibaba, Bytedance and Tencent, to suspend their purchases from NVIDIA until the government is done with a national security review. China's warning to local companies came after the US government lifted its export restriction on the company's H20 chips. If you'll recall, the US blocked the company from selling its H20 chips to China back in April over concerns that the Chinese military could use the chips to develop AI technology. In July, NVIDIA announced that the government has assured the company that it will approve licenses to ship and export H20 chips to China. The Financial Times then reported in August that the government had agreed to grant NVIDIA (and AMP) export licenses in exchange for 15 percent of their profits. Reuters says NVIDIA is still finalizing the specs of B30A, but it's hoping to deliver samples to Chinese clients for testing as soon as September this year. Trump seems to already be aware that NVIDIA is working on a chip based on Blackwell for the Chinese market, but whether it gets regulatory and export approval remains to be seen: The president told reporters that NVIDIA CEO Jensen Huan is \"coming to see [him] again about that.\" This article originally appeared on Engadget at https://www.engadget.com/ai/nvidia-is-reportedly-developing-an-ai-chip-for-china-more-powerful-than-the-h20-130057520.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "NordVPN deal: Two-year plans are up to 77 percent off", "url": "https://www.engadget.com/deals/nordvpn-deal-two-year-plans-are-up-to-77-percent-off-151807749.html?src=rss", "id_key": "edc9c7370188e13d172ddb7f1b3608c4e10d3a0e45b6a8f29c61fa1d7aa7d747", "summary": "VPN users are overwhelmed with choice , and there are as many bad options out there as there are good ones. Luckily, NordVPN sits in the latter category, and right now Nord is offering discounted plans across its various tiers. If you take out a two-year NordVPN Plus plan (the company's most popular plan) it’ll cost you $108 for the duration of the contract, with Nord throwing in three extra months at no extra cost. That’s 73 percent off the usual rate. As well as Nord’s VPN service, a Plus plan also includes the Threat Protection Pro anti-malware tool, password management and an ad- and tracker-blocker. A Prime plan additionally comes with encrypted cloud storage or NordProtect, which insures you against identity theft and monitors dark web activity. That's also on sale — down to $189 on the same two-year commitment with those three additional months thrown in, which works out to a 77 percent savings on the regular price. When Engadget’s Sam Chapman reviewed NordVPN earlier this year, he praised its excellent download speeds, exclusive features and extensive server network. Less impressive is its clunky interface and inconsistent design when jumping between different platforms running a NordVPN app. While it doesn't quite make the cut in our guide to the best VPNs available right now, it generally performed well in speed tests and Threat Protection Pro is really worth having. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/nordvpn-deal-two-year-plans-are-up-to-77-percent-off-151807749.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "Qualcomm's latest Snapdragon chips offer slight power-up for budget smartphones", "url": "https://www.engadget.com/mobile/qualcomms-latest-snapdragon-chips-offer-slight-power-up-for-budget-smartphones-130017850.html?src=rss", "id_key": "bc2d226765bebd34a7623fc5fb2e387091394f8fc354a1725a894fdf6ca03f62", "summary": "Qualcomm revealed its latest mobile platform for more affordable smartphones and devices called the Snapdragon 7s Gen 4. Compared to its predecessor, the new Snapdragon chips have overall improved performance, support for more detailed displays and a feature that allows for better video quality in low-light situations. We were able to test the Snapdragon 7s Gen 3 with smartphones like the Nothing 3a and 3a Pro , but this next-gen chipset represents a seven percent improvement with both the Qualcomm Adreno GPU and Kryo CPU. The Gen 4 specs also show higher peak CPU speeds of up to 2.7 GHz, compared to the previous generation's 2.5 GHz. On top of the overall performance boost, Qualcomm added support for WFHD+ displays that have a 2,900 x 1,300 resolution and a 144Hz refresh rate. For better video in dark scenarios, Qualcomm infused the Snapdragon 7s Gen 4 with the Low Light Vision feature, which was previously reserved for the company's more expensive chips. Beyond these upgrades, the fourth-generation Snapdragon 7s chips keep the AI-powered ability to take 200-megapixel photos, Qualcomm's Quick Charge 4+ Technology that can recharge a device from zero to 50 percent in five minutes and support for real-time translation and transcription with multiple languages. It's a minor upgrade from the Snapdragon 7s Gen 3 that was announced last August and Qualcomm hasn't announced any phone makers who plan to use this chip yet. However, we could see the latest chip being used by companies like Honor and Vivo, who previously used Qualcomm's Snapdragon 7 Gen 3 models. This article originally appeared on Engadget at https://www.engadget.com/mobile/qualcomms-latest-snapdragon-chips-offer-slight-power-up-for-budget-smartphones-130017850.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "Acrobat Studio is Adobe's new AI-powered hub for PDFs", "url": "https://www.engadget.com/ai/acrobat-studio-is-adobes-new-ai-powered-hub-for-pdfs-130003264.html?src=rss", "id_key": "f7e93b2434035fe3b9bf037e9ef5db1f1a1092407cfc6ef8b1bc863e394ef9e6", "summary": "Whether you love or hate them, PDFs are an inescapable part of the job for many of us. In fact, it's safe to say the format isn't going away anytime soon, with Adobe reporting there are 3 trillion PDFs in circulation worldwide. However, there's no denying they can be a pain to work with, and in an effort to make it easier to manage projects involving multiple PDFs, Adobe is launching a new product today called Acrobat Studio. And wouldn't you know it, the company is marketing the inclusion of generative AI tools as a major selling point of the suite. The main feature of Acrobat Studio are hubs Adobe calls PDF Spaces. Here, you can upload up to 100 files — including PDFs of course, alongside public web pages, RTFs, DOCXs and more — and Acrobat Studio's built-in AI assistants will help you make sense of everything. To start, the hub will generate a summary of all the documents, with a few pre-populated prompts to help with further analysis. Accompanying each bullet point from the AI is a citation you can use to verify the model's summary by quickly jumping to the document it pulled the information from. Sharing your PDF Spaces with colleagues is built right into Acrobat Studio. In addition to chatting with Acrobat Studio's AI assistant, you can create custom assistants to carry out specific tasks. By default, Adobe offers three of these — analyst, instructor and entertainer — to get you started. The names do a decent job of communicating each assistant's purpose. For example, the instructor will attempt to explain complex topics. You can create your own by writing a set of custom prompts. There are some notable limitations to PDF Spaces. For one, the hub's generative AI features currently only work with documents written in English. Adobe says it will add support for other languages \"over time.\" Similarly, the hub can't analyze videos, handwritten notes and password-protected files. Outside of PDF Spaces, Acrobat Studio offers access to Adobe Express built right into the app, meaning you can use Adobe's Firefly AI models to generate commercially safe images for your PDFs. As you would expect, the suite also comes with Adobe Acrobat and all the tools you might need to create and edit your own protected documents. Pricing for Acrobat Studio starts at $25 per month for individuals, with a 14-day trial available. This article originally appeared on Engadget at https://www.engadget.com/ai/acrobat-studio-is-adobes-new-ai-powered-hub-for-pdfs-130003264.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "The HORI Piranha Plant camera for Switch 2 is on sale for $40", "url": "https://www.engadget.com/deals/the-hori-piranha-plant-camera-for-switch-2-is-on-sale-for-40-145031408.html?src=rss", "id_key": "5de507a71079d1654c440e4e038d54b4e9ee031c0b0479ece4bc48849c792d51", "summary": "Even though the Switch 2 basically just came out, we're already starting to see discounts on some of its accessories. One of the more charming peripherals, the HORI Piranha Plant camera, is on sale right now for only $40. That's $20 off and a record-low price. It's a good deal for anyone who wants to take advantage of the Switch 2's camera functionality in games like Mario Kart World and that recently-released campfire sim . This was designed specifically for Nintendo's new console, so it's a plug-and-play affair. It's actually cheaper than the official Switch 2 camera with this sale and it looks a whole lot cooler. It's a Piranha Plant from the Mario franchise. We called it a \"work of art\" upon encountering the device and that holds true today. This thing is not only stylish, resembling an Amiibo more than a camera, but it's downright useful. The pot the Piranha Plant sits in functions as both a stand and USB extension for the device. The plant itself detaches from the pot, so the camera can be used in portable mode by popping it into the USB port at the top of the console. There's also a built-in privacy shutter. Just close the plant's mouth to obscure the lens. The actual camera specs here aren't going to win any awards, with a frame rate of 30FPS and a resolution of 640 x 480p. However, that's more than enough to capture footage of your floating head to accompany your kart as it races through the Mushroom Kingdom. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-hori-piranha-plant-camera-for-switch-2-is-on-sale-for-40-145031408.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "Tesla offers a $350 retrofit turn signal stalk after removing it from the Model 3", "url": "https://www.engadget.com/transportation/evs/tesla-offers-a-350-retrofit-turn-signal-stalk-after-removing-it-from-the-model-3-123034169.html?src=rss", "id_key": "07a7240c28dc56bf633cb5e85141a3783ffcbe58e1dadcf78437f12be84c8179", "summary": "Leave it to Tesla to charge its customers for a feature it purposely left out. The company is now selling an almost $350 retrofit turn signal stalk for its Model 3 cars after removing from the initial model. Instead, it used buttons to activate the turn signal. As of now, the add-on is only available in the Chinese market. But, Model 3 drivers will need to shell out another 2,499 yuan ($348) to get a normal part of almost every car. However, there's a slight catch: The turn signal stalk is only compatible with models produced from February 7 of this year onward. Only one month earlier, Tesla launched a refreshed Model Y that brought back the turn signal stalk. \"We always say at Tesla, if you aren’t deleting so much that you have to put something back, you have’t deleted enough. Well, maybe we deleted too much,\" Tesla's vice president of engineering Lars Moravy said in an interview with Jay Leno shortly after. The option to buy a retrofit signal stalk isn't that surprising. Creator Chris Zheng first leaked the news back in February on X (formerly Twitter). It's unclear whether Tesla plans to bring the add-on to additional markets. This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/tesla-offers-a-350-retrofit-turn-signal-stalk-after-removing-it-from-the-model-3-123034169.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "Pick up Apple's AirPods Pro 2 while they're down to $169", "url": "https://www.engadget.com/deals/pick-up-apples-airpods-pro-2-while-theyre-down-to-169-142401518.html?src=rss", "id_key": "f9fde3ab73a79726c10b3b34ffe06ea524dd4ac02dd0a550d1ab55002fe5ee94", "summary": "They might be nearly three years old at this point, but Apple’s second-generation AirPods Pro remain some of the most popular wireless earbuds around for a reason, and right now they’re down to $169 on Amazon. That’s a not-insignificant 32 percent off the usual $249 price of the noise-canceling in-ears. Apple’s flagship AirPods were $100 off — a record-low $149 — during Prime Day, so we have seen them even cheaper than this, but for a non-sale period, Amazon’s current deal is worth considering. The AirPods Pro 2 are our top choice for iPhone users looking for wireless earbuds, thanks to much beefier sound than the original model, rock solid ANC and transparency modes, and seamless switching between Apple devices. Throw in spatial audio support, hands-free Siri and more than acceptable battery life, and the AirPods Pro 2 are hard to top. Not everyone gets on with the sometimes fiddly touch gestures, but a lot of wireless headphones struggle with this. If there’s anything to give you pause, it’s that we might be getting the AirPods Pro 3 sooner rather than later. But if that’s the case, you can be confident you’ll pay a lot more than $169 for the privilege. The AirPods Pro aren’t the only discounted AirPods right now. The AirPods 4 (without ANC) are down to $99. Usually priced at $129, you’re saving $30 on a much improved entry-level AirPods offering. They fit and sound better than any non-Pro AirPods before them, and inherit some previously Pro-only features thanks to the H2 chip. If you travel a lot you’ll also certainly rue the lack of ANC, but if that isn’t a deal breaker for you, the $99 price point might be tempting. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/pick-up-apples-airpods-pro-2-while-theyre-down-to-169-142401518.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:29Z", "source": "Engadget_All", "title": "OpenAI's ChatGPT Go plan arrives in India only for under $5 per month", "url": "https://www.engadget.com/ai/openais-chatgpt-go-plan-arrives-in-india-only-for-under-5-per-month-120053087.html?src=rss", "id_key": "4cc65628a21370a89ce391c8c1cfa8325875a1d374d0b8b950659e81207020da", "summary": "OpenAI has debuted its cheapest subscription yet for India only, product head Nick Turley announced on X . Called ChatGPT Go, the 390 rupee ($4.60) GPT-5 plan will offers users 10 times more message limits, image generation and file uploads than the free offering. \"Making ChatGPT more affordable has been a key ask from users,\" Turley wrote. \"We're rolling out Go in India first and will learn from feedback before expanding to other countries.\" The new plan was leaked earlier and OpenAI recently introduced local currency pricing in India via India's payment framework. With that, ChatGPT Plus and ChatGPT Pro are now offered for 1,999 rupees ($22.95) and 19,990 rupees ($229.50) — more expensive than the $20 and $200 users paid prior to the local currency rollout. ChatGPT Go now gives local users a more budget-oriented option. However, it doesn't offer access to GPT-5's advanced reasoning, has \"limited deep research,\" no custom GPTs and lower message, image and file upload limits compared to the higher-end subscriptions, according to OpenAI's plan page in India . India is a key market for OpenAI, being second only to the US by user base. CEO Sam Altman recently met with India's IT minister about a plan to introduce lower-cost AI plans. According to Turley's X post, it looks like ChatGPT Go will come to other countries soon, though the company has yet to say which ones. Turley recently said that ChatGPT now has 700 million weekly users globally, up from 500 million in March. This article originally appeared on Engadget at https://www.engadget.com/ai/openais-chatgpt-go-plan-arrives-in-india-only-for-under-5-per-month-120053087.html?src=rss", "ingested_utc": "2025-08-19T13:40:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:38Z", "source": "TheStreet_Top", "title": "Oil Prices may have major impact on stocks soon", "url": "https://www.thestreet.com/investing/oil-prices-could-have-a-major-impact-on-stocks-soon", "id_key": "beb62d20879550e20d5306bd9214894f9bd0b576985038a7b1183ea2eaf43402", "summary": "Here's what could happen to oil and stocks next.", "ingested_utc": "2025-08-19T13:40:38Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:38Z", "source": "TheStreet_Top", "title": "Stock Market Today: Home Depot, Medtronic, Viking Holdings report", "url": "https://www.thestreet.com/investing/stock-market-today-august-19-2025", "id_key": "1e74e3f8a677db7e3e961cdb2dedc1be21c411dccbc6bcc052348c0739d192a4", "summary": "Fedspeak is on the rise ahead of the bank's Jackson Hole summit", "ingested_utc": "2025-08-19T13:40:38Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:38Z", "source": "TheStreet_Top", "title": "ServiceNow stock hits a wall amid AI boom, 'frustrates' veteran trader", "url": "https://www.thestreet.com/investing/stocks/servicenow-stock-hits-a-wall-amid-ai-boom-frustrates-veteran-trader", "id_key": "80b1ee53553018fa3459fe532de353c5a18e5c525a8654a635a807d9898b5239", "summary": "And TheStreet Pro portfolio's lead fund manager makes a move on ServiceNow.", "ingested_utc": "2025-08-19T13:40:38Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:39Z", "source": "AlJazeera_All", "title": "Israel attacks displacement shelters to force Palestinians to southern Gaza", "url": "https://www.aljazeera.com/features/2025/8/19/israel-targets-displacement-shelters-in-central-gaza?traffic_source=rss", "id_key": "fda3143d825e172767caa132f2fef755ba911d7730d7bbc27fa95da932a52737", "summary": "Israel is ethnically cleansing the central neighborhood of Zeitoun in Gaza by bombing homes and displacement centres.", "ingested_utc": "2025-08-19T13:40:39Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:46Z", "source": "FinancialPost_Business", "title": "Andersen Consulting Expands Platform with Addition of Australia’s Liberty IT Consulting Group", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/andersen-consulting-expands-platform-with-addition-of-australias-liberty-it-consulting-group", "id_key": "851a6bf24b2c22d996f290e98353f5d65c65305ba1b6fffef4cd0cfe6f3d3196", "summary": "SAN FRANCISCO — Andersen Consulting further strengthens its digital transformation capabilities with Liberty IT, a leading provider of enterprise-grade digital transformation in financial services. Founded in 2016 and headquartered in Australia, Liberty IT specializes in technology consulting for top-tier financial services organizations such as banks, wealth management entities and the stock exchange. The firm specializes […]", "ingested_utc": "2025-08-19T13:40:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:46Z", "source": "FinancialPost_Business", "title": "Debt-Laden Tullow Holds Refinancing Talks With Bondholders", "url": "https://financialpost.com/pmn/business-pmn/debt-laden-tullow-holds-refinancing-talks-with-bondholders", "id_key": "5fffc02e383f6d369e33dd2c381cf62729b7849a322289473b67bf25dff9faa7", "summary": "Tullow Oil Plc is in talks with its bondholders about refinancing a nearly $1.3 billion bond due next year, as the imminent maturity adds to pressure on the Africa-focused oil explorer.", "ingested_utc": "2025-08-19T13:40:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:46Z", "source": "FinancialPost_Business", "title": "Canada Inflation Eases to 1.7%, Driven by Falling Gas Prices", "url": "https://financialpost.com/pmn/business-pmn/canada-inflation-eases-to-1-7-driven-by-falling-gas-prices", "id_key": "ce125f80b79ec09c92da400c0c1ec60381ae9cbb63a0dbf235410ae291fdb7b4", "summary": "Canadian consumer prices moderated slightly and underlying pressures broadly eased.", "ingested_utc": "2025-08-19T13:40:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:46Z", "source": "FinancialPost_Business", "title": "Dr. Kristina Zakhary to Teach Advanced Facelift & Brow Lift Cadaver Dissection Course at Marina Medical’s Pre-Conference Lab in Miami", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/dr-kristina-zakhary-to-teach-advanced-facelift-brow-lift-cadaver-dissection-course-at-marina-medicals-pre-conference-lab-in-miami", "id_key": "45c943b33952ec0e176d4e5ec6508fa2af30516f52ec5fc280569b6c07f6786c", "summary": "CALGARY, Alberta — Dr. Kristina Zakhary, a leading nationally recognized Otolaryngology Head & Neck Surgeon with special focus exclusively in Facial Plastic and Reconstructive Surgery, practicing for 20 years exclusively in cosmetic surgery of the face and neck, will serve as a course co-director and instructor for the “Optimum Mobility” Facelift & “003” Brow Lift […]", "ingested_utc": "2025-08-19T13:40:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:46Z", "source": "FinancialPost_Business", "title": "Markel Canada Appoints Alain Paris as Vice President, Product Line Leader – Primary Casualty", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/markel-canada-appoints-alain-paris-as-vice-president-product-line-leader-primary-casualty", "id_key": "45efb41ca8bcf3e384312bfd08c9d93d1a498dfabb39de80dc97383dd6cf561d", "summary": "TORONTO — Markel Insurance, the insurance operations within Markel Group Inc. (NYSE:MKL), today announced the appointment of Alain Paris as Vice President, Product Line Leader – Primary Casualty, effective immediately. In this new role, Paris will be responsible for leading the Primary Casualty product line across Canada, working closely with technical and field underwriting teams […]", "ingested_utc": "2025-08-19T13:40:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:46Z", "source": "FinancialPost_Business", "title": "Nikkiso Selected to Provide Regasification Systems and Engineering Services for LNG-to-Power Project in Bahamas", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/nikkiso-selected-to-provide-regasification-systems-and-engineering-services-for-lng-to-power-project-in-bahamas", "id_key": "e7e66d7fecfc84974426806e2d6a823e82773c86b34389bf69adcbd5cfc7f9af", "summary": "TEMECULA, Calif. — Nikkiso Clean Energy & Industrial Gases Group announced today that it has been contracted by NPG (a joint venture to be formed by Shell and a subsidiary of FOCOL Holdings Limited) to provide liquefied natural gas (LNG) regasification and cryogenic equipment for the New Providence Gas Project in Nassau, the Bahamas. The […]", "ingested_utc": "2025-08-19T13:40:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:40:46Z", "source": "FinancialPost_Business", "title": "Samsara Kicks Off Multi-City Safety Summit, Leading the Conversation Around AI-Powered Safety", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/samsara-kicks-off-multi-city-safety-summit-leading-the-conversation-around-ai-powered-safety", "id_key": "b3ce960edf30f02bcdf969e84df68c57dc4f82b65f3e28231cf58c9f4fffe6e9", "summary": "Industry leaders, including American Trucking Associations, Together for Safer Roads, Marsh, and Samsara customers convene to share insights on critical trends impacting safety professionals SAN FRANCISCO — Samsara Inc. (“Samsara”) (NYSE: IOT), the pioneer of the Connected Operations® Platform, today announced the launch of its Safety Summit Series, kicking off August 28, 2025, in Philadelphia […]", "ingested_utc": "2025-08-19T13:40:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:41:01Z", "source": "MIT_TechReview", "title": "The Download: clean energy progress, and OpenAI’s trilemma", "url": "https://www.technologyreview.com/2025/08/19/1122041/the-download-clean-energy-progress-and-openais-trilemma/", "id_key": "ca4f83af510f7f00d7826288c310f2c63d1114e3e681146b25c98d3508d8f962", "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. How to make clean energy progress under Trump in the states—blue and red alike —Joshua A. Basseches is the David and Jane Flowerree Assistant Professor of Environmental Studies and Public Policy at Tulane…", "ingested_utc": "2025-08-19T13:41:01Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:41:02Z", "source": "HackerNews_Top", "title": "Launch HN: Uplift (YC S25) – Voice models for under-served languages", "url": "https://news.ycombinator.com/item?id=44950661", "id_key": "d82632080189adcdd227621a69c4d0376db5a022654089e023e6cbc48973e2e2", "summary": "Comments", "ingested_utc": "2025-08-19T13:41:02Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:41:02Z", "source": "HackerNews_Top", "title": "Critical Cache Poisoning Vulnerability in Dnsmasq", "url": "https://lists.thekelleys.org.uk/pipermail/dnsmasq-discuss/2025q3/018288.html", "id_key": "615aeebed1a45e42c83cd8b65cae941bb7de3abc99e2e1a0a76421f2dfb21aa9", "summary": "Comments", "ingested_utc": "2025-08-19T13:41:02Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T13:41:02Z", "source": "HackerNews_Top", "title": "EloqKV, a distributed database with Redis compatible API (GPLv2 and AGPLv3)", "url": "https://github.com/eloqdata/eloqkv", "id_key": "f6658493c9a408245e53b064c78b22c68e4822270ad0fe37653aea37876d941b", "summary": "Comments", "ingested_utc": "2025-08-19T13:41:02Z"}
