{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T19:46:32Z", "source": "NPR_Technology", "title": "What's behind the Trump administration's immigration memes?", "url": "https://www.npr.org/2025/08/18/nx-s1-5482921/memes-white-house-dhs-social-media-trump", "id_key": "df5ce18182dfedcddfecff24636f91667738be6218a05a0b9a8d5ec43b5e63e5", "summary": "White supremacist tropes and ironic viral jokes illustrate the administration's project of redefining who belongs in the United States.", "ingested_utc": "2025-08-18T19:46:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T19:46:54Z", "source": "Engadget_All", "title": "NVIDIA's GeForce NOW game streaming gets RTX 5080 GPUs, better image quality and more", "url": "https://www.engadget.com/gaming/pc/nvidias-geforce-now-game-streaming-gets-rtx-5080-gpus-better-image-quality-and-more-193040331.html?src=rss", "id_key": "f57e72a068ec19a1d06703009b797e8d6e11ee3207761292e3f33eab5b9f90c7", "summary": "NVIDIA's GeForce NOW game streaming service is leveling-up in September with the addition of RTX 5080 GPUs, which will allow for 5K streaming at up to 120fps (or 1080p/320fps for the truly frame-hungry). While you'll need to be on the $20-a-month GeForce Now Ultimate tier to use RTX 5080 streaming servers, NVIDIA at least isn't raising that tier's price. Subscribers at that level will still receive 100 hours of monthly playtime (with 15 hours of rollover), up to eight-hour long sessions and access to all of GPU's respective DLSS features, including Frame Generation. NVIDIA claims the RTX 5080 GeForce Now servers will perform up to 2.8 times faster than the current RTX 4080 systems — but of course, that's due to the new GPU's 4X Frame Gen capabilities, which interpolates frames using AI modeling. The 4080 only supports up to 2X Frame Generation. At launch, GeForce Now's RTX 5080 servers will support popular games like Doom: The Dark Ages, Indiana Jones and the Great Circle , Cyberpunk 2077 and Flight Simulator . We're still waiting for a full list of supported titles from NVIDIA, as well updates on when we can expect more games that will support the RTX 5080. While the raw power of the RTX 5080 will be the main draw for the GeForce NOW Ultimate tier, NVIDIA is also improving something that's always bothered me with game streaming: image quality. No matter the resolution and framerate I've seen while streaming games across multiple services, I've always noticed that the color fidelity and overall sharpness doesn't look as good as rendering a game locally on a PC. NVIDIA's new Cinematic Quality Streaming (CQS) aims to change that, with support for YUV 4:4:4 chroma subsampling (for more accurate colors), smoother video streaming performance with the AV1 codec, and AI video filtering to reduce artifacts. CQS will also be able to automatically detect and optimize its settings for the DPI of your screen — that's helpful for high DPI laptop screens. With CQS turned on, GeForce Now streams will max out at a hefty 100Mbps. That'll make it ideal for people with 1Gbps or faster connections, but it could be out of reach if you've got slower internet or restrictive bandwidth caps. I've only seen a screenshot of CQS in action, but it's definitely something I'll be testing further once the new GeForce NOW servers launch in September. NVIDIA also plans to expand the number of titles on GeForce NOW with a new feature called Install-to-Play games, which will automatically get installed to cloud storage servers. Performance and Ultimate-tier subscribers will get 100GB of storage for free, and they can upgrade to 200GB for $2.99 monthly, 500GB for $4.99 per month and 1TB for $7.99. Typically, GeForce NOW games are preinstalled on servers and wait for players to queue them up. (It's also worth noting that the service taps into games you've already bought on existing storefronts like Steam, your subscription doesn't get you a collection of games to play like Xbox cloud streaming.) NVIDIA says that GeForce Now will have up 2,300 pre-installed games this year, and together with Install-to-Play options there will be over 4,500 games on the service. That goes a long way towards making GeForce Now more appealing to mainstream players — if you could play most new titles over the cloud for a monthly fee, why have a gaming PC at all? To that end, NVIDIA is also making GeForce NOW work even better across a wide variety of devices. It'll support up to 90fps on the Steam Deck through its native app, and it will also stream in 5K on newer LG OLED monitors. LG TVs will also get a native GeForce NOW app that supports up to 4K 120Hz streams, a first for any TV maker. NVIDIA also says that many Logitech racing wheels will be supported, as well. (Though I wonder how many people are traveling with wheels when they want to game on the go.) While its unclear if game streaming will ever replace local gaming, GeForce NOW is certainly getting close with the addition of RTX 5080 GPUs and a wealth of new features. And given the rise of streaming TV service costs these days, its pricing seems relatively fair. You can test out a free ad-supported version of GeForce NOW, or pay $10 a month (or $100 a year) for ad-free 1,440p support. For most people, especially if they're just streaming to laptops and handhelds, that'll be more than enough. But the Ultimate tier isn't unreasonable at $20 a month, $100 for six months or $200 annually. That's a small price to pay to game in 4K (and 5K!) without a huge rig. During my recent testing of GeForce NOW Ultimate with RTX 4080 servers, I noticed that it's relatively easy to launch games, performance is generally smooth and it works well across handhelds, TVs and multiple computers. I'd expect much of the same for the RTX 5080 servers, but I'll report back next month when they actually launch. This article originally appeared on Engadget at https://www.engadget.com/gaming/pc/nvidias-geforce-now-game-streaming-gets-rtx-5080-gpus-better-image-quality-and-more-193040331.html?src=rss", "ingested_utc": "2025-08-18T19:46:54Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T19:47:03Z", "source": "AlJazeera_All", "title": "Are US security guarantees enough to end the war in Ukraine?", "url": "https://www.aljazeera.com/video/inside-story/2025/8/18/are-us-security-guarantees-enough-to-end-the-war-in-ukraine?traffic_source=rss", "id_key": "68464b40b0d057e882566293ae85aa984f33f467ce09fcfc3523f6203524de43", "summary": "European leaders join Ukrainian President Volodymyr Zelenskyy in Washington, DC for talks.", "ingested_utc": "2025-08-18T19:47:03Z"}
