{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T05:36:39Z", "source": "Guardian_World", "title": "Taiwan referendum on reopening last nuclear plant fails", "url": "https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails", "id_key": "23fb9b26d0033b770f9346d60f0cf2ff194cebbcaeb4cb5d92689c69c1cc9c39", "summary": "Clear majority backs restarting Maanshan reactor but doesn’t reach legal threshold, as president says nuclear power may be reconsidered if it becomes safe A referendum to push for the reopening of Taiwan’s last nuclear plant has failed to reach the legal threshold to be valid, though the president said the island could return to the technology in the future if safety standards improved. The plebiscite on Saturday, backed by the opposition, asked whether the Maanshan power plant should be reopened if it was “confirmed” there were no safety issues. The plant was closed in May as the government shifts to renewables and liquefied natural gas. Continue reading...", "ingested_utc": "2025-08-24T05:36:39Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T05:36:39Z", "source": "Guardian_World", "title": "Australia news live: government to ‘feel the pressure’ after Gaza protests, says Greens leader; Queensland to get new sex offender registry", "url": "https://www.theguardian.com/australia-news/live/2025/aug/24/australia-news-live-pro-palestine-marches-expected-to-attract-huge-turnout-after-declaration-of-famine-in-gaza-ntwnfb", "id_key": "4770c1a45e6d8c92c3955ef82a565c7f0d09b0d3d200f02c336eaad81b5526c9", "summary": "Follow all the day’s news live Get our breaking news email , free app or daily news podcast David Littleproud continues to insist the Coalition is not setting itself up for another election defeat by maintaining its support for nuclear power. Speaking to 2GB on Sunday, Littleproud said the Coalition would take a different approach than it did at the last election by lifting the moratorium on nuclear power generation in Australia and “let the market do it”. I just say to your city viewers, regional Australia is bearing the brunt of this. I’m seeing towns and I’m actually seeing families being torn up by these renewable projects that are tearing up their productivity, your food security and actually the native environment. And it’s all without premise. Artificial intelligence was absolutely central to our discussions because it will be absolutely gamechanging in our economy and our society into the future. Getting it to 8% will be a good effort but not good enough, as minister Mark Butler has pointed out, so we will continue to work with the states on providing the support that people need and deserve, particularly in this instance, when it comes to Thriving Kids. Well, that’s the ongoing discussions that we’ve been having, whether it’s treasurers, health ministers, NDIS ministers, leaders, have been having this discussion since the deal was struck. What’s the best way to implement. Two deals, not one. They are closely related. There are billions and billions of dollars tied up in them and so we’ve been trying to progress both of those deals at once for good reason because there are swings and roundabouts for both of us. Continue reading...", "ingested_utc": "2025-08-24T05:36:39Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T05:36:39Z", "source": "Guardian_World", "title": "‘A dangerous moment’: the emboldening of Britain’s far right", "url": "https://www.theguardian.com/news/ng-interactive/2025/aug/24/britain-far-right-emboldened-migration-nationalism", "id_key": "c63ff9ae1baf912964564c8ca19cb93e25314b8a4f89e4073da109c9b47c4234", "summary": "In a summer of anti-migrant rallies, flags and nationalistic rhetoric, observers warn there is a lack of government voices pushing back The Bell hotel in Epping has seen a lot since it was built in the 16th century as a coaching inn, serving travellers passing through the historic Essex market town and on to London, 15 miles to the south-west. This has long been a place that bustled with outsiders, though they have not always been welcome – the small green common opposite was once named after a beacon that local stories say was built to warn of invasion. Though now wrapped in ugly 1960s extensions that have stripped it of anything approaching charm, the unassuming building – close to agricultural land and a cricket pitch – is an unlikely place to spark a potential political crisis. Continue reading...", "ingested_utc": "2025-08-24T05:36:39Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T05:38:55Z", "source": "NYTimes_World", "title": "Tourists Go to Siquijor Island in the Philippines for ‘Magic’ Healing", "url": "https://www.nytimes.com/2025/08/23/world/asia/philippines-siquijor-healers.html", "id_key": "cdaad60c3129664deb4447c71839052ded9398d5a3157a0abd2dc40c3351fc0c", "summary": "Siquijor, in the Philippines, is trying to capitalize on a centuries-old association with the occult.", "ingested_utc": "2025-08-24T05:38:55Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T05:39:34Z", "source": "AlJazeera_All", "title": "Barcelona defeat Levante with thrilling comeback in La Liga", "url": "https://www.aljazeera.com/sports/2025/8/24/barcelona-defeat-levante-with-thrilling-comeback-in-la-liga?traffic_source=rss", "id_key": "a46d13a22f41131886e6061d9de435676bd285d6d322fb715d64da4ffabbb37e", "summary": "Reigning Spanish League champions recovered from a two-goal deficit to pull off a stunning comeback against Levante.", "ingested_utc": "2025-08-24T05:39:34Z"}
