{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:26:53Z", "source": "BBC_Business", "title": "Greeting customers deters shoplifters, police say", "url": "https://www.bbc.com/news/articles/c5yp3543z7yo?at_medium=RSS&at_campaign=rss", "id_key": "1cf75719a9f831b0bfad4c6938d10dac3fe36a31edc727edf7829661e2fa4483", "summary": "Lancashire Police issues advice for shop owners as shoplifting levels have \"spiralled\".", "ingested_utc": "2025-08-17T11:26:53Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:26:55Z", "source": "Guardian_World", "title": "‘Stunning survival story’: Police rescue California man trapped behind waterfall for two days", "url": "https://www.theguardian.com/us-news/2025/aug/17/police-rescue-california-man-trapped-behind-waterfall", "id_key": "cbe9f9bee0df0e227ba6cb5751a2f44bd11685da3224cb106cc8ee0466e980c7", "summary": "Ryan Wardwell was rappelling down Seven Teacups falls when ‘extreme hydraulics’ trapped him behind a cascade A California man who recently became trapped behind a waterfall for two days while climbing was dramatically rescued by police utilizing a helicopter. Ryan Wardwell, 46, of Long Beach, went to waterfalls known as the Seven Teacups on 10 August with plans to rappel down, the sheriff’s office of Tulare country said in a social media post . But the “extreme hydraulics” of the waterfalls pushed Wardwell off his rappelling lines and trapped him behind a cascade of the Kern river, according to the sheriff’s office. Continue reading...", "ingested_utc": "2025-08-17T11:26:55Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:27:18Z", "source": "CryptoNews", "title": "Thailand Launches Crypto-to-Baht Payment System for Tourists Starting August 18", "url": "https://cryptonews.com/news/thailand-launches-crypto-to-baht-payment-system-for-tourists-starting-august-18/", "id_key": "7d73f9072553a9613d4fc434796b1cea59e30fd86b942b0d50dc52c204d99788", "summary": "Thailand launched its “TouristDigiPay” scheme on Monday, August 18, allowing foreign visitors to convert crypto into Thai Baht for electronic payment across the country. The initiative operates within a regulatory sandbox framework with strict Know Your Customer requirements and monthly spending limits to prevent financial crime while boosting tourism revenues.Government Coalition Targets Tourism Recovery Through […] The post Thailand Launches Crypto-to-Baht Payment System for Tourists Starting August 18 appeared first on Cryptonews .", "ingested_utc": "2025-08-17T11:27:18Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:28:54Z", "source": "Guardian_World", "title": "European leaders to join Zelenskyy in Washington for meeting with Trump", "url": "https://www.theguardian.com/world/2025/aug/17/european-leaders-to-join-zelenskyy-washington-meeting-trump-ukraine-russia", "id_key": "25ab70568cba839353edfb088af38644274afcc25a7a39e4a1eafa198335c116", "summary": "Emmanuel Macron, Friedrich Merz and others will aim to push back against ceding of Ukraine territory in ‘peace plan’ Ukraine war live – latest updates European leaders will join Ukraine’s president, Volodymyr Zelenskyy, at a White House meeting on Monday with Donald Trump, in a coordinated effort to push back on a US-endorsed “peace plan” that would allow Russia to take further Ukrainian territory. The French president, Emmanuel Macron, Germany’s chancellor, Fredrich Merz, the European Commission president, Ursula von der Leyen, and the Finnish president, Alexander Stubb, will accompany Zelenskyy in the Oval Office. Italy’s prime minister, Giorgia Meloni, will also attend. Continue reading...", "ingested_utc": "2025-08-17T11:28:54Z"}
