{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:40:20Z", "source": "Guardian_World", "title": "European leaders to join Zelenskyy at White House meeting on Monday, says Ursula von der Leyen – live", "url": "https://www.theguardian.com/world/live/2025/aug/17/trump-putin-meeting-european-leaders-ukraine-peace-deal-latest-updates-news", "id_key": "64357b90521d95a2f2cbc356b57d03f73654b90db7b559c9145a390231860ab9", "summary": "European Commission president says she and other European leaders will meet Donald Trump on Monday after Ukrainian president’s request European Commission President Ursula von der Leyen has just confirmed in a post on X that she will be meeting Donald Trump along with other European leaders in the White House on Monday at the request of Ukrainian President Volodymyr Zelenskyy. She also said that she will welcome Zelenskyy in Brussels later today and together will participate in a meeting of European leaders part of the “coalition of the willing”. Continue reading...", "ingested_utc": "2025-08-17T10:40:20Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:40:21Z", "source": "Guardian_World", "title": "Not so Totally Rad: the UK music tuition firm leaving pupils in the lurch and teachers in despair", "url": "https://www.theguardian.com/education/2025/aug/17/not-so-totally-rad-the-uk-music-tuition-firm-leaving-pupils-in-the-lurch-and-teachers-in-despair", "id_key": "0005f229ea3995bcc12e1a3d37fdb47e5abfb167d4e86252e84e426a3c8c827a", "summary": "Schools and parents tell of inexperienced and absent tutors, and slow refunds alongside repeated demands to pay for services never wanted or received In April 2024, Hannah, a teacher in a Kent primary school where she is in charge of music, thought she had successfully set up weekly drum lessons for around 10 children. She had found a company to provide them: Totally Rad, based in the West Midlands. Totally Rad Hub is one of the big players in a part of the education economy that has boomed as public funding for music in state schools has been squeezed: private companies that supply freelance instrument teachers. The company says it has a network of 200 freelance tutors providing instrument lessons to about 300 schools and 5,000 families. Continue reading...", "ingested_utc": "2025-08-17T10:40:21Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:40:43Z", "source": "CryptoNews", "title": "$1M Bitcoin in 2026 Would Signal US Economic Crisis, Not Victory: Galaxy CEO", "url": "https://cryptonews.com/news/1m-bitcoin-in-2026-would-signal-us-economic-crisis-not-victory-galaxy-ceo/", "id_key": "e3a74c18ac4a0f9c33829ea75b8c47e8dc14bb0d9ff6d224e37edf0de6b3537f", "summary": "Galaxy Digital CEO Mike Novogratz has pushed back on predictions that Bitcoin could hit $1 million, warning that it would reflect a collapse in the US economy. The post $1M Bitcoin in 2026 Would Signal US Economic Crisis, Not Victory: Galaxy CEO appeared first on Cryptonews .", "ingested_utc": "2025-08-17T10:40:43Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:40:43Z", "source": "CryptoNews", "title": "Ethereum Price Analysis: Steven McClurg’s Outlook – Will ETH Fall Behind as BTC Surges?", "url": "https://cryptonews.com/news/ethereum-price-analysis-steven-mcclurgs-outlook-will-eth-fall-behind-as-btc-surges/", "id_key": "b1d8208a4e0d3589ac0bc7c678343012e6d2277abb0fff35f9e8e7fa872e9c29", "summary": "Ethereum steadies near $4,557 after $3B ETF inflows, but Steven McClurg warns it may lag behind Bitcoin. Will ETH hit $4,965 or stall below $4,500? The post Ethereum Price Analysis: Steven McClurg’s Outlook – Will ETH Fall Behind as BTC Surges? appeared first on Cryptonews .", "ingested_utc": "2025-08-17T10:40:43Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:42:40Z", "source": "FT_Home", "title": "Yvette Cooper mounts fresh defence of UK ban on Palestine Action", "url": "https://www.ft.com/content/42eb102c-c279-4329-8079-7d1ca3bc5959", "id_key": "72703796d4195b92adf244a6b02955e6e13d374e460e90acb7d0d7e1ead3e66a", "summary": "Home secretary said group carried out ‘escalating campaign’ of criminal damage before it was proscribed", "ingested_utc": "2025-08-17T10:42:40Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:42:58Z", "source": "WIRED_All", "title": "The 7 Best Mattress Toppers (2025) Out of Dozens We've Tested: Supportive, Plush, Memory Foam", "url": "https://www.wired.com/gallery/best-mattress-toppers/", "id_key": "adcd9a43297440aa4c44a13ff1eb9d9b0ff7097ad3366b7585b3a0880dc69593", "summary": "These toppers will transform your mattress into exactly what you need, whether that's a super-plush pillow top, memory foam, or targeted back support.", "ingested_utc": "2025-08-17T10:42:58Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:42:58Z", "source": "WIRED_All", "title": "The Best Pixel 9 Cases, Tested and Reviewed (2025)", "url": "https://www.wired.com/gallery/best-google-pixel-9-cases-and-accessories/", "id_key": "0212761903e7690b57dbdfc1821d8d9ffc53e0ded1c4417c28a1225ae05ea568", "summary": "Whether you saved some cash with the Pixel 9a or went big with the Pixel 9 Pro XL, we’ve got a selection of cases—MagSafe included—to kit out your new Android phone.", "ingested_utc": "2025-08-17T10:42:58Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:43:00Z", "source": "Engadget_All", "title": "Ready to try Apple's iOS 26? Here are all the compatible iPhones that can run public beta 2 today", "url": "https://www.engadget.com/mobile/ready-to-try-apples-ios-26-here-are-all-the-compatible-iphones-that-can-run-public-beta-2-today-191854385.html?src=rss", "id_key": "bbc97036d04d6994a1cdbd7bd840a0f07fbc7353929e507c10b78fa5a2bcff22", "summary": "Soon after the Apple iPhone event takes place, we'll finally have access to iOS 26 and iPadOS 26 — both of which are bringing huge upgrades to your iPhone and iPad's operating systems. One you might be thrilled to play around with is the visual update: Liquid Glass . (It's like the better-executed version of Windows Vista .) We spent two weeks test-driving it — you can check out our detailed hands-on iOS 26 preview , or you can try it out yourself by downloading and installing the public beta 2 . That software is a more stable iteration of the separate developer version, which recently hit the beta 6 waypoint, and offers a few more flashy features not yet available in the public version. (While the public beta is open to everyone and quite stable, always remember there's a degree of risk involved with beta software.) Additionally, there are credible reports that iOS 26 could bring a new live translation feature to AirPods , too. Not ready to upgrade your smartphone or tablet this year? No worries, we'll help you find out if your devices will be able to run iOS 26. While Apple didn't nix any iPhones from its eligibility list last year, that's not the case for 2025 — a few models are getting cut this time. All iPhone 8 models and the iPhone X were the last to get the boot in 2023, and this year the 2018 models are getting left behind. If you have an ineligible device, you won't be able to download iOS 26 when it becomes available this fall. We'll get to the bottom of which iPhones and iPads will support iOS 26 and iPadOS 26 this year. To see what's coming with the latest OSes, check out everything announced at Apple's WWDC June 9 event . One thing you shouldn't immediately expect is Apple's updated version of Siri , though the company is reportedly working on a 'stripped-down' AI chatbot to compete with ChatGPT. These three iPhones won't be compatible with iOS 26 Unlike last year, several iPhone models won't be eligible to download the newest iOS when it makes its debut this fall. This trio of models first released in 2018 won't be coming to the iOS 26 party: iPhone XR iPhone XS iPhone XS Max iPhones compatible with iOS 26 While we don't yet know the new iPhones Apple will be dropping this fall — though there are iPhone 17 rumors — we do know, per Apple's site , that the phones listed below will be compatible with iOS 26. Basically, if you have an iPhone that was announced in 2019 or later, you're in the clear: iPhone SE (second generation or later) iPhone 11 iPhone 11 Pro iPhone 11 Pro Max iPhone 12 iPhone 12 mini iPhone 12 Pro iPhone 12 Pro Max iPhone 13 iPhone 13 mini iPhone 13 Pro iPhone 13 Pro Max iPhone 14 iPhone 14 Plus iPhone 14 Pro iPhone 14 Pro Max iPhone 15 iPhone 15 Plus iPhone 15 Pro iPhone 15 Pro Max iPhone 16 iPhone 16 Plus iPhone 16 Pro iPhone 16 Pro Max iPhone 16e iPads compatible with iPadOS 26 The iPads listed below, and any iPads released later this year, are eligible to download iPadOS 26 . iPad Pro (M4) iPad Pro 12.9‑inch (3rd generation and later) iPad Pro 11‑inch (1st generation and later) iPad Air (3rd generation and later, including M2 and M3) iPad (8th generation and later, including A16) iPad mini (5th generation and later, including A17 Pro) What if I don't want to buy a new iPhone? If you want to continue using your older iPhone that isn't supported by iOS 26, that's fine. However, you'll miss out on security updates which could potentially put your phone at risk for malware and other threats. Additionally, some apps may stop working if they require a certain version of iOS or later. And of course, you won't be able to access the latest features iOS 26 offers. When will iOS 26 become available? Apple usually rolls out its latest iOS in mid-September, just a few days before the new iPhones hit store shelves. Last year, it released iOS 18 on Monday, Sept. 16. Expect a confirmation of the release date at the iPhone 17 event, expected in early September. iOS 26 features we're excited about Liquid Glass design : Your home screen is getting revamped with new app icons, including dark mode and all-clear options. You'll also notice buttons with a new floating design. Liquid Glass was designed to make all of Apple's OSes more cohesive. Phone app redesign: You'll finally be able to scroll through contacts, recent calls and voicemail messages all on one screen. It also comes with a new feature called Hold Assist that'll notify you when an agent comes to the phone so you can avoid the elevator music. Live Translate: iOS 26 is bringing the ability to have a conversation via phone call or text message with someone who speaks another language. Live Translate will translate your conversation in real time. Polls feature: Coming to group messages in the Messages app, chat members will be able to create polls. This can help prevent the unwanted 30+ messages when it comes to deciding which restaurant you're meeting at this weekend. This article originally appeared on Engadget at https://www.engadget.com/mobile/ready-to-try-apples-ios-26-here-are-all-the-compatible-iphones-that-can-run-public-beta-2-today-191854385.html?src=rss", "ingested_utc": "2025-08-17T10:43:00Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:43:08Z", "source": "TheStreet_Top", "title": "What the star-studded Jackson Hole economic meeting means to you", "url": "https://www.thestreet.com/economy/what-the-star-studded-jackson-hole-economic-meeting-means-to-you", "id_key": "da7ce287e9fc8ae482c4d67307daa0a88464843ab6476e3209f1373472fa6384", "summary": "Fed interest rate cuts take front stage at global economic gathering", "ingested_utc": "2025-08-17T10:43:08Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:43:08Z", "source": "TheStreet_Top", "title": "Walmart's view on tariff impacts will move this week's markets", "url": "https://www.thestreet.com/investing/stocks/walmarts-view-on-tariff-effects-will-move-markets", "id_key": "7740a18ad455b04faaf434a787dce652f004c4e8201affd1e630f3a64e60d5b9", "summary": "Earnings season shifts to a week heavy in results from retailers.", "ingested_utc": "2025-08-17T10:43:08Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:43:15Z", "source": "FinancialPost_Business", "title": "Economists expect tariffs lifted food prices, core inflation in July", "url": "https://financialpost.com/pmn/economists-expect-tariffs-lifted-food-prices-core-inflation-in-july", "id_key": "52fdc8f2e063648483c53b4fbe20ab71748a871acd6bd53faba897a55a95e13f", "summary": "OTTAWA — Tariff impacts are expected to keep underlying inflation elevated in July, a Desjardins economist says, even if the headline figure retreats. Statistics Canada is set to report inflation figures for July on Tuesday. A poll of economists expects annual inflation cooled last month to 1.7 per cent, according to LSEG Data & Analytics. […]", "ingested_utc": "2025-08-17T10:43:15Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T10:43:30Z", "source": "HackerNews_Top", "title": "Why LinkedIn Rewards Mediocrity", "url": "https://www.elliotcsmith.com/linkedin-toxic-mediocrity/", "id_key": "fd0cb42ddc87d28297c971ca98cc39036e15c0fceee783fc1954bd39cee57a12", "summary": "Comments", "ingested_utc": "2025-08-17T10:43:30Z"}
