{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:25:35Z", "source": "Guardian_World", "title": "Reform councillor works on asylum claims for Home Office, investigation reveals", "url": "https://www.theguardian.com/politics/2025/aug/25/reform-councillor-works-on-asylum-claims-for-home-office-investigation-reveals", "id_key": "f01d627714a8aead1057454c1443c6cd3c4a26e1e0da900c613ed23bd7523a9f", "summary": "Paul Bean may have breached civil service impartiality rules over alleged social media posts Campaigners have complained to the Home Office after it was revealed a councillor for Reform UK also works for the government department processing asylum and immigration claims. Paul Bean , who serves as a councillor for Crook ward at Durham county council, declared his day job as a civil servant at the Home Office in his register of interests. Continue reading...", "ingested_utc": "2025-08-25T19:25:35Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:25:35Z", "source": "Guardian_World", "title": "‘If you survive this, you’ll survive anything’: new UK reality show that strands ‘newlyweds’ on honeymoon", "url": "https://www.theguardian.com/tv-and-radio/2025/aug/25/if-you-survive-this-youll-survive-anything-new-uk-reality-show-that-strands-newlyweds-on-honeymoon", "id_key": "84899766230c0554235181cd4fb68407b3a39414461099426304a51522941aa1", "summary": "BBC’s Stranded on Honeymoon Island tests whether love can flourish ‘in toughest of conditions’, says Davina McCall The new BBC series Stranded on Honeymoon Island is a “social experiment” about the reality of marriage that will teach audiences about “moving forward with your life”, its host, Davina McCall , has said. Made by the producers of Married at First Sight UK, the show features 12 singles looking for lifelong love who are matched with someone on a speed date and “married”. They are then stranded on a tropical island dressed only in their wedding outfit for a three-week honeymoon without phones, luxuries, family or friends. Continue reading...", "ingested_utc": "2025-08-25T19:25:35Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:25:51Z", "source": "Blockworks", "title": "Solana-based Jakpot Games launches pay-to-play arcade", "url": "https://blockworks.co/news/jakpot-games-pay-to-play-arcade", "id_key": "2925afca5d87c9c971e319fb7a6aa2ee003a23a7a51583c4f50ac156ce497549", "summary": "Tokens, anticheat, and “degen mode”: the GameFi trenches don’t stop", "ingested_utc": "2025-08-25T19:25:51Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:25:55Z", "source": "CryptoSlate", "title": "Institutional investors reach $33.6B in Bitcoin ETF holdings during Q2", "url": "https://cryptoslate.com/institutional-investors-reach-33-6b-in-bitcoin-etf-holdings-during-q2/", "id_key": "d5c4c8bfcc36838501e7459eaca9f71d2dce16353d243f9c4368a90b8b1fa323", "summary": "Investment advisors drove institutional Bitcoin (BTC) exposure via exchange-traded funds (ETFs) to $33.6 billion during the second quarter of 2025. Data shared by Bloomberg ETF analyst James Seyffart on Aug. 25 revealed that institutions added 57,375 BTC across all tracked categories. Bloomberg Intelligence data shows advisors now hold $17.4 billion in Bitcoin ETF positions, nearly […] The post Institutional investors reach $33.6B in Bitcoin ETF holdings during Q2 appeared first on CryptoSlate .", "ingested_utc": "2025-08-25T19:25:55Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:26:00Z", "source": "CryptoNews", "title": "ChatGPT Predicts the Price of XRP, Pepe and Shiba Inu by the End of 2025", "url": "https://cryptonews.com/news/chatgpt-predicts-predicts-the-price-of-xrp-pepe-and-shiba-inu-by-the-end-of-2025/", "id_key": "1f5601853d6bdb0a6b148af79a3b45d6680fe702d7ec8af734f756fccb3ea4f0", "summary": "ChatGPT Predicts a strong year-end rally for XRP, Shiba Inu, and Pepe in 2025. XRP has doubled after its SEC victory, Shiba Inu shows signs of a rebound, and Pepe eyes a breakout as Ethereum’s surge fuels optimism across meme coins and utility tokens. The post ChatGPT Predicts the Price of XRP, Pepe and Shiba Inu by the End of 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-25T19:26:00Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:27:46Z", "source": "MarketWatch_Bulletins", "title": "Dow and S&P 500 falling, Nasdaq ticks up as Nvidia results loom — follow live", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=21ce864f-f251-40a5-beb4-a79d3b5a4b5d&mod=mw_rss_bulletins", "id_key": "0308a68a4f9a06ef6b01d387fdc9815f84699187c7127448f7a31070a5e50253", "summary": "", "ingested_utc": "2025-08-25T19:27:46Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:24Z", "source": "TechCrunch_All", "title": "Bounce launches a service for moving accounts between Bluesky and Mastodon", "url": "https://techcrunch.com/2025/08/25/bounce-launches-a-service-for-moving-accounts-between-bluesky-and-mastodon/", "id_key": "0258872344884c3ab7b53ffb63ba1322833f077e7ac1977145f9c6d729e69ffc", "summary": "Bounce publicly debuts a tool that will let you move your account between open social networks like Bluesky and Mastodon.", "ingested_utc": "2025-08-25T19:28:24Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:27Z", "source": "Engadget_All", "title": "Google's new smart home hardware looks mostly familiar in leaked images", "url": "https://www.engadget.com/home/smart-home/googles-new-smart-home-hardware-looks-mostly-familiar-in-leaked-images-190011191.html?src=rss", "id_key": "27729395970612963f64f929fcde3a7379149886712aeff2fa0697c4daf48a5f", "summary": "Google wants to get Gemini in your smart home , and it looks like it's planning to release a lineup of new Nest Products to make it happen. The company teased a new smart speaker during its Pixel 10 launch event, and now Android Headlines has new images and details that confirm the look of the speaker and a collection of other Nest products that are on the way. Based on the images Android Headlines sourced, Google's new smart home lineup looks nearly identical to the cameras and doorbells it's already selling. The exception is the new smart speaker, now called the Google Home Speaker, which is smaller and rounder than the Nest Audio , and could be a replacement for the puck-shaped Nest Mini . The new speaker will come in what looks like red, light green, black and beige color options, and offer \"360-degree sound.\" Android Headlines writes that the speaker also supports Gemini Live, Sound Sensing for detecting smoke alarms or glass breaking and pairing with a Google TV Streamer . Google's not done releasing new products this year. 🔊 Google Home Speaker 📸 Nest Cam Indoor (3rd Gen) 📸 Nest Cam Outdoor (3rd Gen) 🚪 Nest Doorbell wired More info: https://t.co/DUuZSduVhJ pic.twitter.com/dpVTrQoERA — Androidheadline (@Androidheadline) August 25, 2025 The rest of the smart home lineup will feel familiar, save for some new colors, internal tweaks and software features. The biggest change is that all of the new Nest devices built-in cameras will reportedly record in 2K resolution, rather than 1080p. They'll also come in a selection of new colors. The Nest Cam Indoor comes in \"Snow\" (white), \"Berry\" (red) and \"Hazel\" (gray). The camera will include a new \"Zoom and Crop\" feature that lets you crop a camera feed to focus on a specific area, and be able to store up to an hour of footage locally if your Wi-Fi goes out. Google also plans to expand how long it'll store video previews of events Nest Cams detect, taking the library of 10-second previews from one hour to three. The Nest Cam Outdoor will only come in Snow and Hazel, but it'll reportedly include all the new features of the Nest Cam Indoor. The same goes for the new Nest Doorbell, except it'll be available in Snow, Hazel and \"Linen\" (beige). The decision to largely use the same design on its Nest devices and focus on changing internal components and software features is a similar strategy to what Google used with the Pixel 10 lineup . The phones largely look the same, but they feature improved internals and plenty of new software features. Android Headlines writes that Google plans to use this hardware launch to also rebrand its Nest Aware and Aware Plus subscriptions. The new name for Google's entry-level smart home subscription will be Google Home Premium. The company also plans to sell a Google Home Premium Advanced. As far as which subscription offers what, and if certain Gemini features will be locked behind a higher price, we'll have to wait until Google details its smart home plans. The company said Gemini for Home will launch in October, so expect more official announcements in the coming months. This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/googles-new-smart-home-hardware-looks-mostly-familiar-in-leaked-images-190011191.html?src=rss", "ingested_utc": "2025-08-25T19:28:27Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:37Z", "source": "AlJazeera_All", "title": "Musk sues Apple, OpenAI over alleged AI competition suppression", "url": "https://www.aljazeera.com/economy/2025/8/25/musk-sues-apple-openai-over-alleged-ai-competition-suppression?traffic_source=rss", "id_key": "0a916ae3196d85e262e29f710b12b52e98b50d4b8d9b123be4a1351734aaedf9", "summary": "Elon Musk filed a US lawsuit against the two tech giants in Texas that alleges that Apple suppressed Grok’s xAI.", "ingested_utc": "2025-08-25T19:28:37Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:37Z", "source": "AlJazeera_All", "title": "Trump threatens new China tariffs over magnets", "url": "https://www.aljazeera.com/economy/2025/8/25/trump-threatens-new-china-tariffs-over-magnets?traffic_source=rss", "id_key": "a97f24214801e0e895bb4d0409613b4cb18ed2e92b78d6d197352f197a67b3de", "summary": "The US president’s escalation comes despite a 90-day pause on increased tariffs that has already been agreed.", "ingested_utc": "2025-08-25T19:28:37Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:44Z", "source": "FinancialPost_Business", "title": "AirTrunk Seals A$16b Refi, Plans Fresh Sales to Fuel Expansion", "url": "https://financialpost.com/pmn/business-pmn/airtrunk-seals-a16b-refi-plans-fresh-sales-to-fuel-expansion", "id_key": "62839d2a74c0bf684c85e8a538524867f7355f04325c64e690793d023e2ebe57", "summary": "AirTrunk Pte has closed an A$16 billion ($10.4 billion) refinancing, the largest sustainability-linked financing ever in Asia Pacific and Japan and now is looking for ways to raise new capital in one of the hottest corners of credit markets.", "ingested_utc": "2025-08-25T19:28:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:44Z", "source": "FinancialPost_Business", "title": "Ram Acquires Retail Center in Jupiter, FL; Secures Whole Foods Market Lease", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/ram-acquires-retail-center-in-jupiter-fl-secures-whole-foods-market-lease", "id_key": "3e61d15cc41f9fcd0bca6e98c2c1d597e4fcf5fe2a5f4e62163c877398c196b8", "summary": "PALM BEACH GARDENS, Fla. — Ram Realty Advisors (“Ram”), a real estate investment management firm specializing in multifamily, mixed‐use, and grocery‐anchored retail in select high‐growth markets throughout the Southeast, today announced the acquisition of The Shoppes at Jupiter, a 197,000‐square foot shopping center located at the intersection of Indiantown Road and U.S. Highway 1 in […]", "ingested_utc": "2025-08-25T19:28:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:44Z", "source": "FinancialPost_Business", "title": "Canada, U.S. to meet after Canada removes some tariffs", "url": "https://financialpost.com/news/canadian-us-officials-canada-removes-tariffs", "id_key": "b530e949ca7f38bc39e51ad60ffdbe48f04813b71f4244f4542afdf5fbaff913", "summary": "Canada removed counter-tariffs on a long list of U.S. goods that comply with CUSMA", "ingested_utc": "2025-08-25T19:28:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T19:28:59Z", "source": "HackerNews_Top", "title": "Scamlexity: When agentic AI browsers get scammed", "url": "https://guard.io/labs/scamlexity-we-put-agentic-ai-browsers-to-the-test-they-clicked-they-paid-they-failed", "id_key": "08430d755fd9d2ff0a920f852d2fb1a017f3a1869da57158332699278edef812", "summary": "Comments", "ingested_utc": "2025-08-25T19:28:59Z"}
