{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:40:11Z", "source": "Guardian_World", "title": "Ex-defence secretary Shapps criticised as he is cleared to join missiles start-up", "url": "https://www.theguardian.com/politics/2025/aug/18/watchdog-condemned-for-clearing-grant-shapps-to-join-defence-startup", "id_key": "b4b965e1cd71c39e74ee9f1ae7815ef6462652c11f2197e80e992c289f59a811", "summary": "Former defence secretary allowed to take role as chair of Cambridge Aerospace, as long as he avoids defence matters The parliamentary standards body has been criticised for clearing Grant Shapps, a former Conservative defence secretary, to join a defence startup as long as he promises not to work on defence matters. In a ruling that drew scorn from political ethics experts, the Advisory Committee on Business Appointments (Acoba), which monitors and advises on the revolving door between Westminster and the business sector, gave Shapps the green light to become the chair of Cambridge Aerospace. Continue reading...", "ingested_utc": "2025-08-18T07:40:11Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:40:32Z", "source": "CryptoNews", "title": "EV Company Faraday Future to Launch $30M Crypto Treasury, Explore Tokenized Car Sales", "url": "https://cryptonews.com/news/faraday-future-to-launch-30m-crypto-treasury/", "id_key": "fb08487007016f208afcbd6b80782418586a1179dd5ddbbd7b4ce4fe7b5cf723", "summary": "Electric vehicle startup Faraday Future is pivoting toward digital assets with plans to build a $30 million crypto treasury and explore tokenized vehicle sales. The post EV Company Faraday Future to Launch $30M Crypto Treasury, Explore Tokenized Car Sales appeared first on Cryptonews .", "ingested_utc": "2025-08-18T07:40:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:40:32Z", "source": "CryptoNews", "title": "Lazarus Group Accused of Stealing $23M From British Crypto Startup Lykke", "url": "https://cryptonews.com/news/lazarus-group-accused-of-stealing-23m-from-british-crypto-startup-lykke/", "id_key": "59e8a89556d02b646ba80ad627ae9f595f0f64c23300764d8aaddda1e1c03fba", "summary": "The British Treasury’s sanctions office has accused the Lazarus Group of orchestrating the $23 million crypto heist that brought down British startup Lykke. The post Lazarus Group Accused of Stealing $23M From British Crypto Startup Lykke appeared first on Cryptonews .", "ingested_utc": "2025-08-18T07:40:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:42:30Z", "source": "NPR_Top", "title": "Three innovations pushing the medical field forward", "url": "https://www.npr.org/2025/08/18/nx-s1-5503741/three-innovations-pushing-the-medical-field-forward", "id_key": "b7ea97602b812666736b71d65d875e57625c1a9606e43cb79a5a10374e7bfba0", "summary": "Innovation is crucial for long-term economic prosperity. One area where that’s happening aplenty: medical technology. From a cancer vaccine to an Alzheimer’s blood test to a life-changing exoskeleton, we take you on a tour of the economics of health technology. Related episodes: The hidden costs of healthcare churn ( Apple / Spotify ) More for Palantir, less for mRNA, and a disaster database redemption arc ( Apple / Spotify ) It's actually really hard to make a robot, guys ( Apple / Spotify ) For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Fact-checking by Sierra Juarez . Voice-over by Greg Hardes. Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter .", "ingested_utc": "2025-08-18T07:42:30Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:42:31Z", "source": "NPR_Economy", "title": "When our inflation infeelings don’t match the CPI", "url": "https://www.npr.org/2025/08/15/nx-s1-5500523/when-our-inflation-infeelings-dont-match-the-cpi", "id_key": "d9815e3790270db208baa98823030280ae82c44c919614a1ed392639692e435c", "summary": "For most Americans, we just lived through the highest period of inflation in our lives. And we are reminded of this every time we go grocery shopping. All over TikTok, tons of people have posted videos of how little they got for … $20. $40. $100. Most upsetting to us: an $8 box of Cinnamon Toast Crunch. Food prices are almost 30% higher than they were five years ago. It’s bad. And those new, higher prices aren’t going away. At the same time, prices are no longer inflating at a wild pace. For the last two years, the rate of inflation has slowed way down. And yet, our fears or feelings that things will spiral out of control again? Those have not slowed down. This mismatch has been giving us all the …. feelings. Inflation feelings. Infeelings. On our latest show: we sort through our infeeltions. We talk to the economists who have studied us. We learn why our personal inflation calculators don’t always match the professional ones. Listen free at these links: Apple Podcasts , Spotify , the NPR app or anywhere you get podcasts. Find more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter . Support Planet Money, get bonus episodes and sponsor-free listening and now Summer School episodes one week early by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney .", "ingested_utc": "2025-08-18T07:42:31Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:42:53Z", "source": "Engadget_All", "title": "The best earbuds for Android devices in 2025", "url": "https://www.engadget.com/audio/headphones/best-earbuds-for-android-devices-120015765.html?src=rss", "id_key": "915395c15e582681946842d034a44b79722d718deb0ee6723edda9bf2cedce03", "summary": "Deserved or not, Apple has turned AirPods into the default choice for most iPhone owners in the market for new wireless earbuds . But if you’re one of the millions who have an Android smartphone, figuring out which set to grab isn’t as obvious. If you need a hand, allow us to point you in the right direction. We’ve tested and reviewed dozens of wireless earbuds over the years and broken down our favorite options for Android users below. Whether you use a Galaxy or a Pixel phone, and whether you want something for the gym or your morning commute, here are the best AirPods alternatives for Android. Table of contents The best Android earbuds for 2025 What to look for in wireless earbuds for Android devices How we test Android earbuds Recent updates Best Android earbuds for 2025 What to look for in wireless earbuds for Android devices Photo by Jeff Dunn / Engadget For the most part, the features you want from a set of “Android earbuds” are the same as what you want from any headphones. Great sound quality, a comfortable fit and sufficient battery life are still the foundations. Adequate water resistance is good for workouts, and nobody wants a crummy mic for making calls. Once you approach the $100 range, features like active noise cancellation (ANC), wireless charging, an ambient sound mode (which lets you better hear outside noise without turning off your music) and multipoint connectivity (the ability to pair with multiple devices simultaneously) should be expected. For Android devices specifically, there are a few extras to consider. A dedicated app that makes it easy to switch sound modes, customize the audio profile, locate your earbuds if they ever get misplaced or adjust other settings is strongly preferred. Features like Google Fast Pair or NFC-based pairing, which can help you avoid having to dig through your Bluetooth menu to connect your earbuds for the first time, are also nice perks. Some Android devices can also utilize higher-quality Bluetooth codecs such as aptX Adaptive or Sony’s LDAC — these aren’t nearly as important to audio quality as the actual architecture of your earbuds, but they can help wring out a little more detail if the buds are capable enough and you’re streaming lossless files. AptX Adaptive can also help reduce latency, which is good for streaming video or gaming. Diversity is Android’s greatest strength, but it also means that some wireless earbuds play nicer with certain devices, typically those made by the same company. Recent Samsung earbuds, for instance, come with a few perks that are only available if you use a Galaxy phone. We have a couple of recommendations related to this idea above. How we test Android earbuds Photo by Billy Steele/Engadget The best way to test earphones is simply to wear them as much as possible, so that’s what we do. We typically do this over a one- to two-week period, though embargo times occasionally force us to finish our review process a bit faster. We listen to a test playlist that includes several musical genres and podcasts, paying close attention to how each pair approaches the bass, mid and treble frequencies to get an accurate sense of its sound profile. We also test at high and low volumes to check for consistency in the tuning. We do not have access to a dummy head to take more objective measurements, but we’ll sometimes look to sites like Rtings , SoundGuys and others that do just to ensure our impressions are not wildly off-base. If a model supports custom EQ, we’ll tinker with that and use the available EQ presets to see if one sounds dramatically better than the others — though in general we base most of our impressions on the stock tuning each pair uses by default. To assess microphone quality, we record our own audio samples and take multiple calls with a partner both indoors and outside. For battery life, we play our test playlist on a loop with the volume around 75 percent and measure how long it takes for each set to drain. Where applicable, we do a thorough review of a pair’s companion app and test each available feature. While comfort is ultimately subjective, we take note of how secure each pair feels while we’re on the move. We also use certain pairs in especially crowded public spaces to get a better sense of their passive and active noise cancellation, as well as their ability to maintain a consistent Bluetooth connection. Recent updates August 2025 : We’ve taken another sweep to ensure our advice is still up-to-date. May 2025 : We’ve checked this guide to ensure our top picks still stand and noted a couple alternatives to the Noble Fokus Rex5, since that pair has had stock issues of late. We’re also keeping an eye on how the Trump administration’s tariff policy affects the pricing and stock of our recommendations (and the consumer tech industry as a whole). All of our picks are still available in their normal price ranges today, but we’ll update this guide if that changes. February 2025 : The Noble FoKus Rex5 is our new \"best for sound quality\" pick, replacing the Sennheiser Momentum True Wireless 4. Our other recommendations remain unchanged. December 2024 : We’ve lightly edited this guide for clarity and ensured that our current picks are still accurate. This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/best-earbuds-for-android-devices-120015765.html?src=rss", "ingested_utc": "2025-08-18T07:42:53Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:43:23Z", "source": "HackerNews_Top", "title": "Web apps in a single, portable, self-updating, vanilla HTML file", "url": "https://hyperclay.com/", "id_key": "dc7c86f5abb4dabbaee78a008b4d1460dac6ef8349b4d1cb3c95d8ca16d59322", "summary": "Comments", "ingested_utc": "2025-08-18T07:43:23Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:43:23Z", "source": "HackerNews_Top", "title": "SystemD Service Hardening", "url": "https://roguesecurity.dev/blog/systemd-hardening", "id_key": "7d738c899a29ea22dbdf3c5191d6d072f2d8c1794804d9f6e0ed59ce16d8b69a", "summary": "Comments", "ingested_utc": "2025-08-18T07:43:23Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:43:23Z", "source": "HackerNews_Top", "title": "Nvidia Tilus: A Tile-Level GPU Kernel Programming Language", "url": "https://github.com/NVIDIA/tilus", "id_key": "85ffee142864c69c5fce329684c7f20b68017608ba1dd54814ca1fa00fa9e90a", "summary": "Comments", "ingested_utc": "2025-08-18T07:43:23Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T07:43:23Z", "source": "HackerNews_Top", "title": "Airbus A320 Poised to Overtake Boeing 737 as Most-Delivered Commercial Airliner", "url": "https://simpleflying.com/airbus-a320-overtake-boeing-737-most-delivered-commercial-airliner/", "id_key": "68525bdcb32f663693791a377d1ba629a1e0d83c625bd49892ee5a3a336e9973", "summary": "Comments", "ingested_utc": "2025-08-18T07:43:23Z"}
