{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:42:46Z", "source": "BBC_Business", "title": "People buying less fast food as grocery prices remain high", "url": "https://www.bbc.com/news/articles/c5y042g11yvo?at_medium=RSS&at_campaign=rss", "id_key": "54eb10b4866447b83bb793efe48702947a6065583954f85d0c41a7b5b665e096", "summary": "But shoppers were still buying branded groceries instead of opting for cheaper, own-brand alternatives.", "ingested_utc": "2025-08-19T10:42:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:42:49Z", "source": "Guardian_World", "title": "Ukraine live updates: ‘Dynamics have accelerated,’ says Polish PM as coalition of the willing debrief takes place after White House meeting", "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news", "id_key": "08b16b17a18d1123f39908156e3fb9e95a01d12a8fe4d0a3bd9e724d60fca434", "summary": "European leaders meet virtually after talks at the White House where Trump said arrangements being made for meeting between Putin and Zelenskyy Full report: Trump arranging Zelenskyy-Putin meeting as European leaders push for US security guarantees Sketch: All smoke and no fire as Zelenskky emerges unbruised after Trump meet Volodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February , which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough. In his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports. A meeting between Zelenskyy and Putin ... could it finally happen? The need for security guarantees agreed – but details unclear Trump believes he is very good at solving conflicts A potential boost for the US arms industry Continue reading...", "ingested_utc": "2025-08-19T10:42:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:42:49Z", "source": "Guardian_World", "title": "UN say Israel not letting in enough supplies into Gaza to avert starvation – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/19/aid-ship-food-gaza-cyprus-israel-middle-east-crisis-latest-updates-news", "id_key": "ec90388d60d470a7d12fee844ddca57f60ac50147575f6815d9e25de00ba2b68", "summary": "UN human rights office spokesperson says risk of starvation in Gaza is a ‘direct result of the Israeli government’s policy’ The latest Gaza ceasefire proposal agreed by Hamas is “almost identical” to an earlier plan put forward by US special envoy Steve Witkoff, Qatar’s foreign ministry spokesperson said on Tuesday, Reuters reports. Israel is studying Hamas’ response to a Gaza ceasefire proposal of a potential deal for a 60-day truce and the release of half the Israeli hostages still held in the territory, two officials said on Tuesday, according to Reuters. Continue reading...", "ingested_utc": "2025-08-19T10:42:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:42:49Z", "source": "Guardian_World", "title": "BBC says it delayed Ozzy Osbourne documentary at family’s request", "url": "https://www.theguardian.com/music/2025/aug/19/bbc-delayed-ozzy-osbourne-documentary-family-request", "id_key": "b0c464ae66a9298f8548dbdca37dbb986c6e2afffcf6fa1c1ca77dcb7f5b15ff", "summary": "Broadcaster says family wants ‘to wait a bit longer’, after film about singer’s final years pulled from Monday’s listings The BBC has revealed it delayed an hour-long documentary about Ozzy Osbourne at the last minute at the request of his family. The film about the musician’s final years was suddenly pulled from listings on Monday, with the corporation making no comment about the decision. Its scheduled screening was less than a month after Osbourne’s death. It was also less than three weeks after his wife, Sharon, and their children appeared before crowds in his home city of Birmingham. Continue reading...", "ingested_utc": "2025-08-19T10:42:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:42:49Z", "source": "Guardian_World", "title": "Young chatty workers disturbing older colleagues ‘not age harassment’, tribunal rules", "url": "https://www.theguardian.com/money/2025/aug/19/young-chatty-workers-disturbing-older-ones-not-age-harassment-tribunal-rules", "id_key": "f646d386030d04c72edf1098b606cccb572a958fa2c1b748217f593e7f3cdcd3", "summary": "Workers in their 20s and 30s that may annoy by socialising found not to be breaking workplace equality rules Older employees who are disturbed by younger, more boisterous colleagues in the workplace are not victims of age harassment, an employment tribunal has ruled. Employees in their 20s and 30s may annoy more mature co-workers by chatting, socialising and looking at their phones but they are not breaking workplace equality rules, the tribunal said. Continue reading...", "ingested_utc": "2025-08-19T10:42:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:42:49Z", "source": "Guardian_World", "title": "Texas Democrats shadowed by law enforcement officers to stop them repeating protest over redrawing congressional districts – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/19/texas-congressional-maps-democrats-republicans-donald-trump-us-politics-updates-news", "id_key": "456e21bde5bc5a9997b37ec0bdd653d75d0f59e874ff9522cb25089ae15a7904", "summary": "Democratic representative Nicole Collier of Fort Worth remained on House floor on Monday after refusing to sign ‘permission slip’ agreeing to round-the-clock surveillance A Florida man who fatally stabbed a friend during an argument in 2022 over Donald Trump ’s businesses having gone bankrupt, is facing possibly spending the rest of his life in prison after being convicted of murder. Donald Jamesbrown Henry, 38, awaits a sentencing hearing tentatively scheduled for October after jurors found him guilty Friday of second-degree murder in the killing of Shawn Popp , whose death came to be regarded by some as an example of the havoc that politics can wreak on interpersonal relationships in the US. Continue reading...", "ingested_utc": "2025-08-19T10:42:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:42:49Z", "source": "Guardian_World", "title": "Florida man who fatally stabbed friend over Trump convicted of second-degree murder", "url": "https://www.theguardian.com/us-news/2025/aug/19/florida-man-stabbed-friend-trump-murder-conviction", "id_key": "6724557225071a0cb428728566b28cd99d800f6e7d8463d1c584a13bb922ffba", "summary": "Donald Jamesbrown Henry and Shawn Popp got into a fight over ‘Trump going bankrupt’ when the latter was attacked A Florida man who fatally stabbed a friend during an argument in 2022 over Donald Trump ’s businesses having gone bankrupt, is facing possibly spending the rest of his life in prison after being convicted of murder. Donald Jamesbrown Henry, 38, awaits a sentencing hearing tentatively scheduled for October after jurors found him guilty Friday of second-degree murder in the killing of Shawn Popp, whose death came to be regarded by some as an example of the havoc that politics can wreak on interpersonal relationships in the US. Continue reading...", "ingested_utc": "2025-08-19T10:42:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:43:08Z", "source": "CryptoSlate", "title": "Strategy eases MSTR stock sale limits as shares hit lowest level since April", "url": "https://cryptoslate.com/strategy-eases-mstr-stock-sale-limits-as-shares-hit-lowest-level-since-april/", "id_key": "78f5c2714e1c85cb562dbf7a5b8cc32d436ad4d2fbd2312559fe564c221d648c", "summary": "Michael Saylor revealed on Aug. 18 that Strategy (formerly MicroStrategy) has revised its stock issuance policy amid the financial instrument’s current downward trend. The company had previously limited stock sales below 2.5x market-to-net asset value (mNAV) strictly to cover debt interest or preferred share dividends. Under the new rules, the firm can now issue stock […] The post Strategy eases MSTR stock sale limits as shares hit lowest level since April appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T10:43:08Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:43:09Z", "source": "CryptoBriefing", "title": "Tether appoints former White House Crypto Council head Bo Hines as strategic advisor for digital assets and US strategy", "url": "https://cryptobriefing.com/tether-us-expansion-bo-hines/", "id_key": "579ee255dadea01074c5cd6bf9cf0b98a33cd886e36b1ffbd0769d1149d0769f", "summary": "Tether's strategic move may enhance US market influence, fostering innovation and regulatory alignment in the digital asset sector. The post Tether appoints former White House Crypto Council head Bo Hines as strategic advisor for digital assets and US strategy appeared first on Crypto Briefing .", "ingested_utc": "2025-08-19T10:43:09Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:43:13Z", "source": "CoinJournal", "title": "XRP price forecast points to a possible 777% surge to $28", "url": "https://coinjournal.net/news/xrp-price-forecast-points-to-a-possible-777-surge-to-28/", "id_key": "ddab946ec9f83fcd3f8512d4e54445da65d7e1bc245ed413bc53cc812c0b9231", "summary": "XRP could potentially rise from around $3 to $28, representing a 777% increase. Financial institutions are increasingly adopting XRP for cross-border payments. The projected surge depends on favorable market conditions and continued adoption. XRP is once again at the centre of market discussions after crypto strategist @egragcrypto shared a prediction suggesting the token could rally […] The post XRP price forecast points to a possible 777% surge to $28 appeared first on CoinJournal .", "ingested_utc": "2025-08-19T10:43:13Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:43:13Z", "source": "CoinJournal", "title": "Bitcoin sees strong accumulation despite BTC price pullback", "url": "https://coinjournal.net/news/bitcoin-sees-strong-accumulation-despite-btc-price-pullback/", "id_key": "b44f90cf0240217c56ff06fa11daa160026bd357ae338865ed14d6ee91676486", "summary": "Bitcoin price is near $115,300 after bouncing off lows of $114k. Despite sharp declines this past week, BTC is seeing robust accumulation. Onchain data suggests aggressive whale buying. Bitcoin (BTC) price hovers around $115,300 in early trading on August 19, 2025, but despite the pullback that includes a dip to lows of $114k, the benchmark […] The post Bitcoin sees strong accumulation despite BTC price pullback appeared first on CoinJournal .", "ingested_utc": "2025-08-19T10:43:13Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:43:13Z", "source": "CoinJournal", "title": "Morphware (XMW) price pumped 450% and dumped immediately: what happened?", "url": "https://coinjournal.net/news/morphware-xmw-price-pumped-450-and-dumped-immediately-what-happened/", "id_key": "d3c31aed7d33eec1ffc1cfd36eab35278ae0f7fe9c9d0d096663348c0cb6ed88", "summary": "UAE investment news and Reuters coverage sparked a rapid Morphware (XMW) rally. Low liquidity and profit-taking fueled a sharp price reversal. Contract risks and cautious sentiment have kept volatility high. The price of the Morphware (XMW) token jumped 450% earlier today, reaching a high of $0.2501 according to Coingecko, before erasing all the gains to […] The post Morphware (XMW) price pumped 450% and dumped immediately: what happened? appeared first on CoinJournal .", "ingested_utc": "2025-08-19T10:43:13Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:44:15Z", "source": "Erigon_Releases", "title": "v3.1.0-rc1: [r3.1] upgrade & downgrade: remove dirs not throw os.NotExist (#16716)", "url": "https://github.com/erigontech/erigon/releases/tag/v3.1.0-rc1", "id_key": "9f692b69d4295a06eb7081e387ae21cc76650c571a503fd2c0b162f831c7bebc", "summary": "Co-authored-by: JkLondon me@ilyamikheev.com", "ingested_utc": "2025-08-19T10:44:15Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:31Z", "source": "TechCrunch_All", "title": "Spotify’s latest feature lets you add your own transitions to playlists", "url": "https://techcrunch.com/2025/08/19/spotifys-latest-feature-lets-you-add-your-own-transitions-to-playlists/", "id_key": "6b8ebe8ef45e45f7c6e78736f8f72d3c2fde76bcc03bef85cdc3d192f305a1f6", "summary": "The new options are designed to appeal to playlist experts and other music fans, who have collectively created nearly 9 billion playlists on Spotify's platform to date.", "ingested_utc": "2025-08-19T10:45:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:34Z", "source": "Engadget_All", "title": "Spotify now lets you create seamless transitions between songs on your custom playlists", "url": "https://www.engadget.com/entertainment/music/spotify-now-lets-you-create-seamless-transitions-between-songs-on-your-custom-playlists-100051537.html?src=rss", "id_key": "b1675e5d48eb36fccb42b2bb339d0552d529cd9cedd20075db361633fd0726bf", "summary": "Spotify routinely debuts new playlist features for its users, but the company's latest update has the potential to dramatically alter custom mixes. Starting today, premium users will have access to a new tool for creating customized transitions within playlists. This will allow seamless progression from one track to the next, with natural-sounding changeovers and no awkward silence. Once you've created a playlist, you'll notice a Mix option on the toolbar. When selected, the tool gives you the option to pick Auto and allow Spotify to instantly make the transitions, or you can tap in further to customize things as you see fit. From there, you can choose presets like Fade or Rise to quickly apply transition styles or try specific changes to volume, EQ and effects. The app will display a waveform for the two songs, helping you select the best place to make the swap. After making your transitions, you can save them for future use or for sharing with friends. And speaking of friends, the transition editor is available for collaboration on any playlists you build with your pals. Spotify allows you to toggle the Mix option on and off at any time, so you're free to listen without any of that creative customization if needed. To help you create a playlist that's ready for mixing, Spotify will show you the tempo in BPMs (beats per minute) and Camelot keys for each song once you tap Mix. The company reminds users that the best options for this tool are songs that were created for seamless transitions, so genres like house and techno will provide the best results. Spotify also recommends using the Mix tool for making running playlists with consistent BPMs to help with pace or to create roadtrip playlists that can maintain \"the vibe.\" Lastly, you can create your own cover art for mixed playlists using Spotify's built-in editor that debuted last fall. This article originally appeared on Engadget at https://www.engadget.com/entertainment/music/spotify-now-lets-you-create-seamless-transitions-between-songs-on-your-custom-playlists-100051537.html?src=rss", "ingested_utc": "2025-08-19T10:45:34Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:36Z", "source": "TheEconomist_Finance", "title": "Who will win from Trump’s tariffs?", "url": "https://www.economist.com/finance-and-economics/2025/08/14/who-will-win-from-trumps-tariffs", "id_key": "2c565ee3d54079a5a26daeb13fef8cf30586132e74a33b57cb4861d3a7f6f28e", "summary": "New rates mean new “China plus one” locations", "ingested_utc": "2025-08-19T10:45:36Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:43Z", "source": "TheStreet_Top", "title": "Goldman Sachs warns of more labor weakness coming soon", "url": "https://www.thestreet.com/fed/goldman-sachs-warns-of-more-labor-weakness-coming-soon", "id_key": "3547d1f98089523a2ac4c8bdb743e2e7b9a68b80c4d9cadf0ad90c35d13dcdb5", "summary": "Here's how it could impact what happens to Fed interest rates next.", "ingested_utc": "2025-08-19T10:45:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "HEINZ Launches Irresistible New Mayonnaise-Style Sauces, Bringing Flavour to Every Bite", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/heinz-launches-irresistible-new-mayonnaise-style-sauces-bringing-flavour-to-every-bite", "id_key": "1727afa85a858458cb6e3c7e626f2920c7d00aed437645ebac9c5a2cb68b585f", "summary": "With nearly two-thirds of Canadians ranking mayo among their top five condiments1, the new HEINZ lineup delivers a flavour-forward and delicious way to enjoy dippable foods. TORONTO — HEINZ turns up the flavour for Canadians, with the launch of new HEINZ Mayonnaise-Style Sauces, expanding its range of delicious condiment options in Canada. The new lineup […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "City of Indianapolis and Marion County Roll Out Euna Payments’ PayLink to Bridge the Digital Divide Between In-Person and Online Payments", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/city-of-indianapolis-and-marion-county-roll-out-euna-payments-paylink-to-bridge-the-digital-divide-between-in-person-and-online-payments", "id_key": "6c883bf367524ebc2bf181d953d34c22dc062465620b1d317d4fb8f7a1de435d", "summary": "The new implementation of Euna Solutions’ technology advances the region’s mission to deliver secure, multi-channel payment options across 12 city-county agencies ATLANTA & TORONTO — Euna Solutions®, a leading provider of purpose-built, cloud-based solutions for the public sector, today announced that the City of Indianapolis and Marion County have successfully implemented PayLink, a feature of […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "Sportradar Strengthens Bundesliga International Relationship With Launch of Innovative New Products Starting 2025-26 Season", "url": "https://financialpost.com/globe-newswire/sportradar-strengthens-bundesliga-international-relationship-with-launch-of-innovative-new-products-starting-2025-26-season", "id_key": "0b16f9f27a7d1715afcdf430abc93a06c85791763b4500aa19d70beebb719476", "summary": "Leveraging proprietary match data and tracking technology, Sportradar is transforming how fans watch, bet, and engage with soccer ST. GALLEN, Switzerland and FRANKFURT, Germany, Aug. 19, 2025 (GLOBE NEWSWIRE) — Bundesliga International is strengthening its longstanding agreement with Sportradar Group AG (NASDAQ: SRAD) to further enhance the viewing experience, accelerate innovation through new exclusive data, […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "DMZ’s Black Innovation Summit returns for year five with over $300,000 in grants and investments to back Canada’s most promising Black tech founders", "url": "https://financialpost.com/globe-newswire/dmzs-black-innovation-summit-returns-for-year-five-with-over-300000-in-grants-and-investments-to-back-canadas-most-promising-black-tech-founders", "id_key": "760a2628f280c2dacd763a109bcb72e642517b769828f82ea572bd6a077ddcfb", "summary": "Highlighting why Black Means Business, the Summit will showcase how investing in Black founders drives innovation, outperformance and Canada’s economic growth. Toronto, ON, Aug. 19, 2025 (GLOBE NEWSWIRE) — DMZ, a global startup ecosystem, announced its fifth annual Black Innovation Summit (BIS) taking place on October 30, 2025 in Toronto. This year’s Summit will convene […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "RUX Acquires Open Door Technology and ERP Connect Consulting to Power Industry Built ERP Solutions for the Industrial Equipment and Commercial Field Services Industries", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/rux-acquires-open-door-technology-and-erp-connect-consulting-to-power-industry-built-erp-solutions-for-the-industrial-equipment-and-commercial-field-services-industries", "id_key": "c1162081d2acda69a6aa4c1f2209551a0a11f5b62c41b6bc25892ded77314448", "summary": "ST. PETERSBURG, Fla. — RUX Software, the newly launched ERP innovator serving industrial equipment and commercial field services businesses, has announced the acquisition of Open Door Technology and ERP Connect Consulting – two highly respected leaders in the Microsoft Dynamics community with deep expertise, loyal clients, and proven technology. The deals mark a major step […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "Liberty Gold Reports Strong Phase 5A Column Leach Metallurgical Results at Black Pine, Confirming Consistent Oxide Gold Recoveries Across Newly Tested Zones", "url": "https://financialpost.com/globe-newswire/liberty-gold-reports-strong-phase-5a-column-leach-metallurgical-results-at-black-pine-confirming-consistent-oxide-gold-recoveries-across-newly-tested-zones", "id_key": "22cef34268037a0c3ffa6216a7c1a31b693b82fe5c20d497819a84dc2eaf1248", "summary": "80.6% weighted average gold extraction from 24 column leach tests VANCOUVER, British Columbia, Aug. 19, 2025 (GLOBE NEWSWIRE) — Liberty Gold Corp. (TSX: LGD; OTCQX: LGDTF) (“Liberty Gold” or the “Company”) is pleased to report results from its Phase 5A metallurgical program at the Company’s Black Pine Oxide Gold Project (“Black Pine”) in southeast Idaho. […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "Zymeworks Announces Participation in Upcoming Investor Conferences", "url": "https://financialpost.com/globe-newswire/zymeworks-announces-participation-in-upcoming-investor-conferences-26", "id_key": "5ec313d1edcc6587dee80537d64e5f249aebb7b72353b3d0e35172dbb5da4a38", "summary": "VANCOUVER, British Columbia, Aug. 19, 2025 (GLOBE NEWSWIRE) — Zymeworks Inc. (Nasdaq: ZYME), a clinical-stage biotechnology company developing a diverse pipeline of novel, multifunctional biotherapeutics to improve the standard of care for difficult-to-treat diseases, including cancer, inflammation, and autoimmune disease, today announced that management will participate in the following upcoming investor conferences: Citi’s Biopharma Back […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:45:51Z", "source": "FinancialPost_Business", "title": "Bitget Opens Access for AI Agent-Assisted Trading Boosting Wider Crypto Adoption", "url": "https://financialpost.com/globe-newswire/bitget-opens-access-for-ai-agent-assisted-trading-boosting-wider-crypto-adoption", "id_key": "56eaa1130d6b1ce502f2c2774c048eb9b8b6a8cd988d4259e4320e7ee85b0050", "summary": "VICTORIA, Seychelles, Aug. 19, 2025 (GLOBE NEWSWIRE) — Bitget, the leading cryptocurrency exchange and Web3 company, has announced its AI-powered trading assistant, GetAgent, is now available to all users. First introduced in July in an invite-only launch, GetAgent blends advanced AI with real-time market data to deliver insights, strategies, and execution tools in one seamless […]", "ingested_utc": "2025-08-19T10:45:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:46:05Z", "source": "MIT_TechReview", "title": "Apple AirPods : a gateway hearing aid", "url": "https://www.technologyreview.com/2025/08/19/1121384/apple-airpod-pro-2-hearing-aid/", "id_key": "29984008c0e4e5e3bcba1dc4b494c2378b18151da93ea00d243e53f177cd6c93", "summary": "When the US Food and Drug Administration approved over-the-counter hearing-aid software for Apple’s AirPods Pro in September 2024, with a device price point right around $200, I was excited. I have mild to medium hearing loss and tinnitus, and my everyday programmed hearing aids cost just over $2,000—a lower-cost option I chose after my audiologist…", "ingested_utc": "2025-08-19T10:46:05Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T10:46:05Z", "source": "MIT_TechReview", "title": "How churches use data and AI as engines of surveillance", "url": "https://www.technologyreview.com/2025/08/19/1121389/ai-data-church-surveillance-america/", "id_key": "ee8319d06a28be547538eeec4a88a2259e5f6988611f884d363bde6e2777d626", "summary": "On a Sunday morning in a Midwestern megachurch, worshippers step through sliding glass doors into a bustling lobby—unaware they’ve just passed through a gauntlet of biometric surveillance. High-speed cameras snap multiple face “probes” per second, isolating eyes, noses, and mouths before passing the results to a local neural network that distills these images into digital…", "ingested_utc": "2025-08-19T10:46:05Z"}
