{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T23:33:07Z", "source": "Guardian_World", "title": "Australia news live: Albanese joined world leaders on phone call to discuss Ukraine; Qantas faces hefty fine over outsourcing", "url": "https://www.theguardian.com/australia-news/live/2025/aug/18/politics-ebikes-qantas-lambie-gaza-palestine-danielle-wood-productivity-tax-reform-roundtable-anthony-albanese-jim-chalmers-ntwnfb", "id_key": "9d94e8714cd614c769586711e52b6e20989483898557c3de1b3b627ebbba709b", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Shadow education minister says childcare safety reforms should come more quickly Jonno Duniam , the shadow minister for education, said governments on both sides of the spectrum had failed for years to institute reforms on the childcare sector, issuing calls for the Labor government and states to act quickly to make such changes. Both governments of all persuasions have dropped the ball. The government I was a part of dropped the ball. We should have acted on that at the time. The fact that we didn’t and the fact that we are now hearing these stories means we failed. But regardless of who was in power and who didn’t do what, here we are today and we need to act. With the resources of eight states and territories and the commonwealth combined, I would be absolutely stunned if we could not get this thing off the ground in the next few weeks. So I hope that things do speed up. I hope that the end result is a national system. Continue reading...", "ingested_utc": "2025-08-17T23:33:07Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T23:33:07Z", "source": "Guardian_World", "title": "Sydney pub shooting: man dead and another wounded outside Harold Park hotel in Forest Lodge", "url": "https://www.theguardian.com/australia-news/2025/aug/18/man-dead-another-wounded-after-shooting-outside-sydney-hotel-pub-forest-lodge-ntwnfb", "id_key": "db5f8c44f1ffed1a247c83b76c3741de3b0bb32120cea09114d0e1733b21a358", "summary": "NSW police say two people shot multiple times outside the Harold Park hotel by assailants who left the Forest Lodge scene by car Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast One man is dead and another has been taken to hospital with serious wounds after a shooting outside a Sydney pub. Emergency services were called to the Harold Park hotel on Ross Street in Forest Lodge in Sydney’s inner west at about 6.40pm on Sunday. Continue reading...", "ingested_utc": "2025-08-17T23:33:07Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T23:33:07Z", "source": "Guardian_World", "title": "Patients in England given more access to crucial health checks out of hours", "url": "https://www.theguardian.com/society/2025/aug/18/patients-england-more-access-crucial-health-checks-out-of-hours", "id_key": "26731874a84e6af003356cb4ddecc51bb482f6700ff2105f156cab0cfd55976e", "summary": "Government says 100 community diagnostic centres are open seven days a week for services such as MRI scans Patients in England now have greater access to important tests such as MRI scans and endoscopies in the evenings and weekends, the government has said, after increasing the number of community diagnostic centres (CDCs) offering out of hours services. There are 170 CDCs operating in England, which are often in shopping centres, football stadiums and on university campuses. Patients can access them through a referral from their GP or clinical teams at hospitals. Continue reading...", "ingested_utc": "2025-08-17T23:33:07Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T23:33:07Z", "source": "Guardian_World", "title": "‘Skibidi’, ‘delulu’ and ‘tradwife’ among words added to Cambridge Dictionary", "url": "https://www.theguardian.com/books/2025/aug/18/skibidi-delulu-and-tradwife-among-words-added-to-cambridge-dictionary", "id_key": "1d2983267fe79d73d33a5d912f35b84523e5bdc8437abbf69bc126c835747caa", "summary": "Lexicographers give nod to TikTok generation’s enduring influence on English language with latest additions “Skibidi”, “tradwife” and “delulu” are among the new words to have made this year’s Cambridge Dictionary in a selection that confirms the increasing influence of the TikTok generation on the English language. For those hoping such that such neologisms would be a passing internet craze, the compilers of the dictionary say they are here to stay. Continue reading...", "ingested_utc": "2025-08-17T23:33:07Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T23:33:28Z", "source": "CryptoNews", "title": "South Korea’s Jeju Wraps Crypto Probe of Almost 3,000 Tax Evaders, Seizes Coins", "url": "https://cryptonews.com/news/south-koreas-jeju-wraps-crypto-probe-of-almost-3000-tax-evaders-seizes-coins/", "id_key": "2a3d178288a31330f9a64182cc34bcc6f79ccd39da67b042352055a3a0468180", "summary": "Jeju City, in the South Korean island province of Jeju, has completed a crypto-themed investigation of almost 3,000 residents with unpaid tax bills, seizing Bitcoin (BTC) and other coins from dozens of individuals. The post South Korea’s Jeju Wraps Crypto Probe of Almost 3,000 Tax Evaders, Seizes Coins appeared first on Cryptonews .", "ingested_utc": "2025-08-17T23:33:28Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T23:35:57Z", "source": "TheStreet_Top", "title": "Unique gas company files Chapter 11 bankruptcy", "url": "https://www.thestreet.com/retail/waste-to-energy-gas-company-files-chapter-11-bankruptcy", "id_key": "6fd2e3d5c08424fa88d044f6678c99f4bece2a9cf53f4b082e80b4de6e98aebc", "summary": "Turning poop into energy should be a good business, but a key industry leader has fallen on crappy times.", "ingested_utc": "2025-08-17T23:35:57Z"}
