{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:28:57Z", "source": "Guardian_World", "title": "Mali’s junta arrests generals and French national over alleged coup plot", "url": "https://www.theguardian.com/world/2025/aug/15/mali-junta-arrests-generals-and-french-national-over-suspected-coup-plot", "id_key": "fbe04a5afc6e99d9b0bca453e9bb88b240ba655dc687009b64c0efb1fce11b11", "summary": "Development comes as the military continues to crack down on dissent after a pro-democracy rally in May Mali’s military rulers have arrested a group of military personnel and civilians, including two Malian generals and a suspected French agent, accusing them of attempting to destabilise the country. The announcement followed rumours in recent days of arrests of army officers. It was made by the security minister, Gen Daouda Aly Mohammedine on the local evening news on Thursday. He assured viewers that an investigation was under way and that the situation was “completely under control”. Continue reading...", "ingested_utc": "2025-08-15T11:28:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:28:57Z", "source": "Guardian_World", "title": "Preparations under way for Donald Trump to meet Vladimir Putin to discuss war in Ukraine – Europe live", "url": "https://www.theguardian.com/world/live/2025/aug/15/donald-trump-vladimir-putin-meeting-anchorage-alaska-ukraine-war-europe-live-latest-updates-news", "id_key": "08636dddbcc43bd42c24ff2c5e8c51689aeebd45637c15e902c835533e1bad11", "summary": "US and Russian presidents to meet in Anchorage, Alaska, starting at 11am local time, in what US hopes will be pivotal moment in efforts to end war In the last few minutes, US president Donald Trump appeared to recognise the importance of the occasion ahead, posting on his Truth Social account: HIGH STAKES!!! Continue reading...", "ingested_utc": "2025-08-15T11:28:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:28:57Z", "source": "Guardian_World", "title": "USSR sweatshirt and chicken kyiv: Russia dials up trolling before Alaska summit", "url": "https://www.theguardian.com/world/2025/aug/15/ussr-sweatshirt-and-chicken-kyiv-russia-dials-up-trolling-before-alaska-summit", "id_key": "0cd86fca7ad9ff6acbe3421a1dda3c06757d61433bbc8be33aa3c7cb7aced29a", "summary": "Foreign minister’s attire and inflight menu for Russian media are latest in series of provocations towards Ukraine In a not-so-subtle act of trolling, Russia’s foreign minister, Sergei Lavrov, arrived in Alaska on the eve of the US–Russia summit wearing a sweatshirt emblazoned with “USSR”. Once seen in western capitals as a pragmatic and skilled diplomat, the 75-year-old has in recent years mirrored the Kremlin’s radicalised politics, adopting an increasingly combative tone and resorting to trolling and mockery. Continue reading...", "ingested_utc": "2025-08-15T11:28:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:28:57Z", "source": "Guardian_World", "title": "Democrats are fighting fire with fire over redistricting – but will democracy burn?", "url": "https://www.theguardian.com/us-news/2025/aug/15/redistricting-gerrymandering-democrats-republicans-texas-california", "id_key": "df0842792b17ba3067d38ce69c7609213df0b4e3e970a08b522edc42cbe5e20d", "summary": "Trump’s plan to boost Republican House seats in the midterms through gerrymandering has provoked a reaction The mid-decade redistricting war looming between Republicans and Democrats is exposing an idea that’s corroding American democracy – voters may not matter that much in determining who controls the US House. After Texas Republicans unveiled a Donald Trump -fueled plan to pick up five additional US House seats last month , the California governor, Gavin Newsom, unveiled a plan on Thursday to throw out districts drawn by an independent commission and put in place new ones that would add five Democratic seats in response. Republicans are also expected to push ahead with plans to redraw maps in Ohio, Missouri, Florida and possibly Indiana, in their favor. Continue reading...", "ingested_utc": "2025-08-15T11:28:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:28:57Z", "source": "Guardian_World", "title": "Texas legislature to end special session without passing new electoral maps", "url": "https://www.theguardian.com/us-news/2025/aug/15/greg-abbott-special-session-electoral-maps", "id_key": "1b9ac8980613e6e19ab932b3c35d202330c2bdcee4c42375f6dcc2046862a157", "summary": "Governor Greg Abbott said he will immediately call another session as Democratic lawmakers signaled return to state Texas lawmakers will adjourn their first special session without passing new congressional maps on Friday, though Governor Greg Abbott has said he will immediately call another session and Democratic lawmakers signaled they are likely to return to the state. Abbott has pledged he will call consecutive special sessions until Democrats have returned. More than 50 Democrats left the state last month in order to deny a quorum in the legislature after Republicans announced plans to redraw the state’s congressional maps, at the request of Donald Trump, in order to gain five Republican seats. Continue reading...", "ingested_utc": "2025-08-15T11:28:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:29:15Z", "source": "CryptoSlate", "title": "New York lawmakers propose crypto tax to fund school programs", "url": "https://cryptoslate.com/new-york-lawmakers-propose-crypto-tax-to-fund-school-programs/", "id_key": "4724e7a97d0ad8886a7be45db948507fc2fc98d10863c7dc1424801700ca7a41", "summary": "Lawmakers in New York are considering a bill that would impose a tax on digital asset transactions. The proposal, introduced in the state’s Assembly on Aug. 13, seeks to apply a 0.2% excise tax on the sale or transfer of digital assets like Bitcoin and Ethereum starting in September. According to the bill, revenue from […] The post New York lawmakers propose crypto tax to fund school programs appeared first on CryptoSlate .", "ingested_utc": "2025-08-15T11:29:15Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:17Z", "source": "NPR_Top", "title": "Trump administration names DEA head to be D.C.'s emergency police commissioner", "url": "https://www.npr.org/2025/08/15/nx-s1-5502824/trump-administration-names-head-of-the-dea-to-be-washington-d-c-s-police-chief", "id_key": "1e5cdb70e429aa3e340eec6a5c596443d611a54941f38d517a506df61e0c4758", "summary": "Attorney General Pam Bondi has named the head of the Drug Enforcement Administration to be Washington D.C.'s emergency police commissioner. The National Guard, FBI and other entities are now working to follow President Trump's directive to clean up the nation's capital.", "ingested_utc": "2025-08-15T11:31:17Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:20Z", "source": "NPR_World", "title": "Blackwater founder to deploy nearly 200 personnel to Haiti as gang violence soars", "url": "https://www.npr.org/2025/08/15/nx-s1-5503316/blackwater-erik-prince-haiti-gang-violence", "id_key": "0ec9d2a133b7396227eb7f3a0aa51f5134f946faef11dc900e588acb2980fc92", "summary": "The deployment is meant to help the government of Haiti recover vast swaths of territory seized in the past year and now controlled by heavily armed gangs.", "ingested_utc": "2025-08-15T11:31:20Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:23Z", "source": "FT_Markets", "title": "Fund managers turn a blind eye to Gaza at their peril", "url": "https://www.ft.com/content/d8c697c2-8b41-401b-9305-503c3c8c8cc6", "id_key": "7babffa132f52282fac4b1403d6ebeb1df13ff4e504c3e3fff1451bcb770208a", "summary": "Scandal at Norway’s $1.9tn oil fund highlights risks for asset managers", "ingested_utc": "2025-08-15T11:31:23Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:41Z", "source": "Engadget_All", "title": "The Morning After: Insta360’s first drone is unlike anything else", "url": "https://www.engadget.com/general/the-morning-after-engadget-newsletter-111555276.html?src=rss", "id_key": "bdd62e9113ffb38d0f6d8e634f515b627ea07933cb5258a7faed2d55fc0b97e3", "summary": "The Insta360 Antigravity A1 is a new 360-degree FPV drone from a spin-off brand called Antigravity. The A1 includes a drone, OLED Vision goggles and a Grip motion controller — it’s more of a set. The drone has two ultrawide cameras that can capture 8K video, and it uses stitching algorithms to make the drone invisible in the final footage. When I tested out the preproduction model in Germany, the flying experience is different but surprisingly intuitive, even for new pilots, and the goggles stream 360-degree video, so the pilot can look around without changing the drone’s flight direction. Image by Mat Smith for Engadget The controller uses a Freemotion control, so the drone moves in the direction the pilot points their hand. Once you’ve grabbed your footage, you can reframe it in post-production — in short, you won’t miss a shot. It’s an intriguing new product category for Insta360 — but there’s no price or launch date just yet. — Mat Smith Get Engadget's newsletter delivered direct to your inbox. Subscribe right here! The news you might have missed Ask Engadget: What are my options when Windows 10 support ends on October 14? Apple watchOS 26 preview: It's the little things The best robot vacuum Cowboy e-bikes rescued from collapse thanks to rescue deal Apple’s ‘redesigned’ blood oxygen monitoring feature hits Apple Watches in the US For Series 9, 10 and Ultra 2 watches in the US. Engadget A year since an import ban forced the company to remove blood oxygen monitoring from some US Apple Watch models, Apple is introducing a redesigned version of the feature. In a post on its newsroom website, the company says the feature will roll out to Apple Watch Series 9, Series 10 and Watch Ultra 2 users through a joint Apple Watch and iPhone update. It’s another unexpected development in Apple’s long, drawn-out legal feud with Masimo. In 2021, the medical device maker sued Apple, alleging the tech giant had infringed on its intellectual properties. Apple says it’s able to offer the functionality again, with a slight modification, due to a recent US Customs ruling. Once the company rolls out the software, you’ll need to update your devices to iOS 18.6.1 and watchOS 11.6.1 to access the reworked feature. Continue reading. Teenage Engineering is giving away a free computer chassis, but it’s already ‘sold out’ Designed to be the cheapest case in the world. TE Teenage Engineering, the hip tech and design brand best known for its synths, has built another computer chassis. And it’s free! But also sold out. It’s a “small form factor, mini-ITX computer case.” The Computer-2 is made of a single sheet of semi-transparent plastic with snap hooks and living hinges for screw-free assembly. Teenage Engineering set out to design the “cheapest computer case in the world” and landed at $0. It was such a good deal that it sold out almost immediately. You can register to be notified if the company releases additional cases on its website. Continue reading. Flight Deals is Google’s new AI-powered travel search tool The tool is currently in beta, and Google says it will improve over time. Rolling out in the US, Canada and India over the next week, Flight Deals will live within Google Flights and is designed for “flexible travelers whose number one goal is saving money on their next trip.” Flight Deals will use real-time Google Flights data to ensure you’re always shown up-to-date flights and deals from various airlines and booking operators. The tool is in beta for now. Continue reading. This article originally appeared on Engadget at https://www.engadget.com/general/the-morning-after-engadget-newsletter-111555276.html?src=rss", "ingested_utc": "2025-08-15T11:31:41Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:57Z", "source": "FinancialPost_Business", "title": "Phase 3 Expansion of Singapore’s Changi Water Reclamation Plant set to commence", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/phase-3-expansion-of-singapores-changi-water-reclamation-plant-set-to-commence", "id_key": "b468218e98c01119ed0d3ddb882ce999d2b2479dd1e69531f08fb54db848b4b0", "summary": "DALLAS — A Binnies and AECOM (NYSE: ACM) joint venture today announced that it has been appointed by PUB, Singapore’s National Water Agency, to deliver the professional engineering services for the Phase 3 expansion of Changi Water Reclamation Plant (WRP) in the eastern region of Singapore. The plant is one of the largest used water […]", "ingested_utc": "2025-08-15T11:31:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:57Z", "source": "FinancialPost_Business", "title": "Canopy Growth Announces Mailing and Filing of Proxy Materials for Annual General and Special Meeting and Urges All Shareholders to Vote Now", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/canopy-growth-announces-mailing-and-filing-of-proxy-materials-for-annual-general-and-special-meeting-and-urges-all-shareholders-to-vote-now", "id_key": "8a0b5e212e01ef8c5619823b2da544bb2f629e0648b9929a78774469bd75f19e", "summary": "Voting is important and easy; shareholders are urged to vote today to help the Company avoid incurring additional costs. Canopy Growth shareholders with a 16-digit control number can vote online at and by phone at 1-800-474-7493. For more information, shareholders should contact Canopy Growth’s strategic shareholder advisor and proxy solicitation agent, Laurel Hill Advisory […]", "ingested_utc": "2025-08-15T11:31:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:57Z", "source": "FinancialPost_Business", "title": "T1 Energy Announces Rescheduled Earnings Release and Conference Call", "url": "https://financialpost.com/globe-newswire/t1-energy-announces-rescheduled-earnings-release-and-conference-call", "id_key": "e95759be74703eef429f306edfc05cf94aeecefb30104505403daddb0e787a77", "summary": "AUSTIN, Texas and NEW YORK, Aug. 15, 2025 (GLOBE NEWSWIRE) — T1 Energy Inc. (NYSE: TE) (“T1,” “T1 Energy,” or the “Company”) announced this morning that the Company has rescheduled its second quarter earnings release and conference call to August 20, 2025. T1’s decision to reschedule the earnings release is to accommodate the Company’s decision […]", "ingested_utc": "2025-08-15T11:31:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:57Z", "source": "FinancialPost_Business", "title": "Abaxx Provides Q2 2025 Corporate Update", "url": "https://financialpost.com/globe-newswire/abaxx-provides-q2-2025-corporate-update", "id_key": "a9aaf9f3914707c8dbaf4a5d4b7724551a08546306c1d85e4a3bf9855f078c24", "summary": "TORONTO, Aug. 15, 2025 (GLOBE NEWSWIRE) — Abaxx Technologies Inc. (CBOE:ABXX)(OTCQX:ABXXF) (“Abaxx” or the “Company”), a financial software and market infrastructure company, majority shareholder of Abaxx Singapore Pte Ltd., the owner of Abaxx Commodity Exchange and Clearinghouse (individually, “Abaxx Exchange” and “Abaxx Clearing”), and producer of the SmarterMarkets™ Podcast, provides an update on operational milestones […]", "ingested_utc": "2025-08-15T11:31:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T11:31:57Z", "source": "FinancialPost_Business", "title": "OTC Markets Group Welcomes MÉLIUZ S.A. to OTCQX", "url": "https://financialpost.com/globe-newswire/otc-markets-group-welcomes-meliuz-s-a-to-otcqx", "id_key": "d550dda7540413c2782ed63e21bcf4b3ba0020fcade02c39b929edf8cd634f5d", "summary": "NEW YORK, Aug. 15, 2025 (GLOBE NEWSWIRE) — OTC Markets Group Inc. (OTCQX: OTCM), operator of regulated markets for trading 12,000 U.S. and international securities, today announced MÉLIUZ S.A. (OTCQX: MLIZY), the first Bitcoin Treasury Company in Brazil and Latin America fully dedicated to accretively growing its Bitcoin holdings for shareholders while consistently delivering a […]", "ingested_utc": "2025-08-15T11:31:57Z"}
