{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:54:53Z", "source": "Guardian_World", "title": "Airbus workers vote to strike for 10 days next month in pay dispute", "url": "https://www.theguardian.com/business/2025/aug/20/thousands-of-airbus-workers-in-uk-to-go-on-strike-in-dispute-over-pay", "id_key": "b0b710d36e094c7a3f0893b18e5ac53415ea9500c0204b92e14a45b4eb682117", "summary": "Unite says series of stoppages is planned at factories in Broughton, north Wales, and Filton, near Bristol Business live – latest updates Thousands of Airbus workers in the UK are set to go on strike for 10 days in September in a row over pay which threatens to disrupt the production of aircraft wings. A series of two-day strikes are planned to begin on 2 September and continue throughout the month at Airbus’s factories at Broughton, north Wales, and Filton, near Bristol, according to Unite. Continue reading...", "ingested_utc": "2025-08-20T13:54:53Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:54:53Z", "source": "Guardian_World", "title": "Case against Kneecap rapper Mo Chara should be thrown out, defence tells court", "url": "https://www.theguardian.com/uk-news/2025/aug/20/case-against-kneecap-rapper-mo-chara-should-be-thrown-out-defence-tells-court", "id_key": "8196f15f2877b9f1a0414d0dff5e83d69b426fdb62be9e6589ac36174506863b", "summary": "Belfast rapper, whose real name is Liam Óg Ó hAnnaidh, is accused of displaying Hezbollah flag at London gig last year The criminal case against Liam Óg Ó hAnnaidh, a member of the rap trio Kneecap, should be thrown out, a court has heard. Ó hAnnaidh, who performs under the stage name Mo Chara, will have to wait until 26 September when chief magistrate Paul Goldspring will rule on whether he has the jurisdiction to try the case. Continue reading...", "ingested_utc": "2025-08-20T13:54:53Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:55:08Z", "source": "Blockworks", "title": "Crypto insiders ramp up stock sales, nearing $1.7B in 2025", "url": "https://blockworks.co/news/crypto-insiders-stock-sales-near-1-7b", "id_key": "0497cd94d09c9e178d38052a01cb42572dae8309c8867ee38bf1afd0cecd0efa", "summary": "Hot markets have made for big paydays this year", "ingested_utc": "2025-08-20T13:55:08Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:55:19Z", "source": "Unchained", "title": "Wyoming Launches FRNT Stablecoin on Several Blockchains", "url": "https://unchainedcrypto.com/wyoming-launches-frnt-stablecoin-on-several-blockchains/", "id_key": "39c9d35c03002c00819519478a8265709792a04f5aff68e94c0dd7410d3d1ac1", "summary": "Wyoming has launched the Frontier Stable Token (FRNT), a landmark Visa-supported stablecoin issued directly by a U.S. state agency, the Wyoming Stable Token Commission, fully backed by U.S. dollars and short-term Treasury bills. FRNT debuted on Tuesday with multichain compatibility, launching simultaneously across seven major blockchain networks: Ethereum, Solana, Avalanche, ... The post Wyoming Launches FRNT Stablecoin on Several Blockchains appeared first on Unchained .", "ingested_utc": "2025-08-20T13:55:19Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:57:06Z", "source": "NYTimes_Business", "title": "Target Names Company Veteran Michael Fiddelke as CEO Amid Sales Slump", "url": "https://www.nytimes.com/2025/08/20/business/target-retail-sales-outlook-tariffs.html", "id_key": "efce756b1062655fef1183f804df21bb33faec5de675b6d15b79d1e8171d2098", "summary": "Michael Fiddelke, the company’s chief operating officer, will step into the role in February.", "ingested_utc": "2025-08-20T13:57:06Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:57:16Z", "source": "NPR_World", "title": "Israeli military will call up 50,000 reservists as it plans new phase of war in Gaza", "url": "https://www.npr.org/2025/08/20/nx-s1-5507976/israel-palestinians-reservists-war-gaza", "id_key": "9b506cbb50d8b8c32b119f0b77467e82fca4d69a41345548aff7ce04f78c519c", "summary": "An Israeli official said that the military will be operating in parts of Gaza City where the Israeli military has not yet operated and where Hamas is still active.", "ingested_utc": "2025-08-20T13:57:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:57:38Z", "source": "Engadget_All", "title": "Xbox Ally handhelds will be available October 16, but we still don't know the price", "url": "https://www.engadget.com/gaming/xbox/xbox-ally-handhelds-will-be-available-october-16-but-we-still-dont-know-the-price-134015698.html?src=rss", "id_key": "58e13b30ef6002c0f5d1374dcd6f6d459fd0bf18cf2537a7f408e835bd724744", "summary": "Xbox gamers will have a new option for taking their library on the go this fall. During Gamescom 2025, ASUS revealed that the Xbox Ally handheld consoles will be on store shelves on October 16. We heard a thorough explanation of the specs and availability for the ROG Xbox Ally and ROG Xbox Ally X this summer, but the arrival date is the only new info to come from the major gaming event in Cologne. There's still no price available for these handhelds, but we expect to receive that critical detail along with pre-order information some time in the coming weeks. For comparison, the 2024 ROG Ally X costs $800 while the simpler ROG Ally Gaming Console from 2023 costs $500. So if we were hazarding guesses, the ROG Xbox Ally might come in at a price tag around $650, while the spiffier ROG Xbox Ally X could be more in the ballpark of $900. The Official Xbox Podcast also included a segment about the upcoming handhelds, with a pair of Xbox execs talking about the devices and their experiences using them for titles like Tony Hawk's Pro Skater , Clair Obscur: Expedition 33 and Balatro . The chatter is unsurprisingly very positive about the hardware, but it might have enough tidbits to hold you over if you're super amped about getting your own hands on an Xbox Ally this fall. This article originally appeared on Engadget at https://www.engadget.com/gaming/xbox/xbox-ally-handhelds-will-be-available-october-16-but-we-still-dont-know-the-price-134015698.html?src=rss", "ingested_utc": "2025-08-20T13:57:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:57:47Z", "source": "AlJazeera_All", "title": "Italian football coaches seek suspension of Israel World Cup ties", "url": "https://www.aljazeera.com/sports/2025/8/20/italian-football-coaches-seek-suspension-of-israel-world-cup-ties?traffic_source=rss", "id_key": "5a07d05cd3fd7db864001be659e22ce597d75d39ceba9fb8a066f28b1af3549f", "summary": "Italy's national football team are due to play Israel in two World Cup qualifiers ahead of the 2026 tournament.", "ingested_utc": "2025-08-20T13:57:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:58:07Z", "source": "FinancialPost_Business", "title": "First Quantum Minerals Announces Early Results of Cash Tender Offer to Purchase Its Outstanding 9.375% Senior Secured Second Lien Notes Due 2029 in a Maximum Aggregate Principal Amount of Up to $250 Million", "url": "https://financialpost.com/globe-newswire/first-quantum-minerals-announces-early-results-of-cash-tender-offer-to-purchase-its-outstanding-9-375-senior-secured-second-lien-notes-due-2029-in-a-maximum-aggregate-principal-amount-of-up-to-250-mi", "id_key": "c72fe51180419197aa8b54302963e09ebb1dfaab96337d07a3c7232370ae8ee3", "summary": "(In United States dollars, except where noted otherwise) TORONTO, Aug. 20, 2025 (GLOBE NEWSWIRE) — First Quantum Minerals Ltd. (“First Quantum” or the “Company”) (TSX: FM) today announced the early results of its previously announced offer to purchase for cash (the “Tender Offer”) its outstanding 9.375% Senior Secured Second Lien Notes due 2029 (the “Notes”) […]", "ingested_utc": "2025-08-20T13:58:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:58:07Z", "source": "FinancialPost_Business", "title": "Harvest Announces Launch Date of Canadian Harvest High Income Shares ETFs", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/harvest-announces-launch-date-of-canadian-harvest-high-income-shares-etfs", "id_key": "db54b65fd406cf05f2b8f3016e46c8a546117fb04b1cdf81d7d2afcfe848341a", "summary": "OAKVILLE, Ontario — Harvest Portfolios Group Inc. (“Harvest” “Harvest ETFs”) is pleased to announce that it has received the final prospectus notice from the securities regulators for the new suite of Canadian Harvest High Income Shares ETFs on August 19, 2025 and are expected to commence trading on the Toronto Stock Exchange (“TSX”) on Thursday […]", "ingested_utc": "2025-08-20T13:58:07Z"}
