{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:17Z", "source": "Guardian_World", "title": "High court asylum hotels ruling leaves Cooper scrambling for alternatives", "url": "https://www.theguardian.com/uk-news/2025/aug/19/high-court-asylum-hotels-ruling-leaves-cooper-scrambling-for-alternatives", "id_key": "6f98727254a00dd2e2891ac46f341c6cc92462a7cb9b4336df5b67f240db8578", "summary": "Yvette Cooper joins a long line of home secretaries struggling to find alternatives to hotels as anti-migrant fervour grows Yvette Cooper, thanks to Tuesday’s high court ruling , is facing potentially explosive decisions over where to house asylum seekers if courts rule that they must leave hotels. The Home Office, usually under Conservative ministers, has been struggling for five years to find an alternative to hotels so they can house a growing number of asylum seekers reaching these shores. Continue reading...", "ingested_utc": "2025-08-19T20:33:17Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:33Z", "source": "Blockworks", "title": "Evaluating crypto stocks with more IPOs on deck", "url": "https://blockworks.co/news/evaluating-crypto-stocks-ipos-on-deck", "id_key": "10ccfc49837453c09d0fb74adbc6154c397df5c2de9d11f46a88fe7423067629", "summary": "Crypto IPO hype has room to run as Bitwise exec says there remains a “massive shortage” of public crypto firms", "ingested_utc": "2025-08-19T20:33:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:35Z", "source": "BitcoinMagazine", "title": "Are You Even a Bitcoiner If You’re Not on Nostr?", "url": "https://bitcoinmagazine.com/conference/a-bitcoiner-must-be-on-nostr", "id_key": "474631b222bb54da4c71fc1ce81666b9e2889393f85f36b2bf16823696803b50", "summary": "Bitcoin Magazine Are You Even a Bitcoiner If You’re Not on Nostr? Bitcoiners who aren't on Nostr are missing the point. The purple pill of Nostr is inseparable from Bitcoin's orange pill. In this sit-down interview with Bitcoin Magazine, Derek Ross throws down the gauntlet to Bitcoiners who aren't on Nostr. This post Are You Even a Bitcoiner If You’re Not on Nostr? first appeared on Bitcoin Magazine and is written by Joakim Book .", "ingested_utc": "2025-08-19T20:33:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:35Z", "source": "BitcoinMagazine", "title": "From Hotel Rwanda to Bitcoin: Anaïse Kanimba’s Fight for Freedom Enters a New Chapter", "url": "https://bitcoinmagazine.com/politics/from-hotel-rwanda-to-bitcoin-anaise-kanimbas-fight-for-freedom-enters-a-new-chapter", "id_key": "c37c614638be7bf646e71d8e741784b00bd6f9b1ec8342e3b002116fe0c3696f", "summary": "Bitcoin Magazine From Hotel Rwanda to Bitcoin: Anaïse Kanimba’s Fight for Freedom Enters a New Chapter Once a Bitcoin skeptic, Anaïse Kanimba discovered Bitcoin amid a campaign to free her father — and now she’s helping to launch Africa’s foremost Bitcoin think tank. This post From Hotel Rwanda to Bitcoin: Anaïse Kanimba’s Fight for Freedom Enters a New Chapter first appeared on Bitcoin Magazine and is written by Frank Corva .", "ingested_utc": "2025-08-19T20:33:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:35Z", "source": "BitcoinMagazine", "title": "Has the Bitcoin Price Bull Market Topped?", "url": "https://bitcoinmagazine.com/markets/has-the-bitcoin-price-bull-market-topped", "id_key": "00566f22b4f49e75ef872ce3f49c9cd106d6e25544fae62e6d625fc27232c08c", "summary": "Bitcoin Magazine Has the Bitcoin Price Bull Market Topped? The bitcoin price retracement sparks concern, but negative funding rates and holder supply trends suggest the cycle is far from over. This post Has the Bitcoin Price Bull Market Topped? first appeared on Bitcoin Magazine and is written by Matt Crosby .", "ingested_utc": "2025-08-19T20:33:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:35Z", "source": "BitcoinMagazine", "title": "Stop Pretending Bitcoin Self Custody Is Easy, It’s Not", "url": "https://bitcoinmagazine.com/technical/stop-pretending-bitcoin-self-custody-is-easy", "id_key": "4b8871360895d7607f79f1f00a2195e88b0f8c1b5f7e4dd1680de2294dc8aa5e", "summary": "Bitcoin Magazine Stop Pretending Bitcoin Self Custody Is Easy, It’s Not Bitcoin self custody is a bedrock principle of the system, and while the ease of it has greatly improved in the last decade, it is not a solved problem. This post Stop Pretending Bitcoin Self Custody Is Easy, It’s Not first appeared on Bitcoin Magazine and is written by Shinobi .", "ingested_utc": "2025-08-19T20:33:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:37Z", "source": "CryptoSlate", "title": "Circle’s new Gateway promises instant cross-chain USDC transfers that feel like one chain", "url": "https://cryptoslate.com/circles-new-gateway-promises-instant-cross-chain-usdc-transfers-that-feel-like-one-chain/", "id_key": "9fc398aa01061e60b19d24d91699328e8482fc13fa9668427224d2aae1fc84e4", "summary": "Circle has launched a unified cross-chain infrastructure that enables businesses to access USDC balances across multiple blockchains. An Aug. 19 announcement labeled the new product as Gateway, a system that addresses liquidity fragmentation issues that force companies to pre-position funds across chains and manage complex rebalancing operations. Gateway combines smart contract infrastructure with an off-chain […] The post Circle’s new Gateway promises instant cross-chain USDC transfers that feel like one chain appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T20:33:37Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:37Z", "source": "CryptoSlate", "title": "Polkadot eyes Wall Street investors to close gap with Ethereum, Solana", "url": "https://cryptoslate.com/polkadot-eyes-wall-street-investors-to-close-gap-with-ethereum-solana/", "id_key": "c5539ef1ce4cb4ce1a6e58afa9ed34d7b920a6bccd9f825d5c3abd744ce19061", "summary": "Polkadot is moving to reposition itself in the current bull market by introducing a dedicated unit to bridge its ecosystem with institutional capital. On Aug. 19, the network announced the launch of Polkadot Capital Group, a capital markets-focused division designed to attract Wall Street investors and build stronger ties with traditional finance. According to the […] The post Polkadot eyes Wall Street investors to close gap with Ethereum, Solana appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T20:33:37Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:43Z", "source": "CryptoNews", "title": "Cardone Capital Deepens Bitcoin Bet With 130 BTC Deal – Targeting 4,000 Coins by Year-End", "url": "https://cryptonews.com/news/cardone-capital-swaps-debt-for-130-btc-in-new-bitcoin-real-estate-play-8-more-deals-are-coming/", "id_key": "2fbdbd022016620e73be9cfcf3c8e916fb638405e8ee789afa9f266da52f5870", "summary": "Cardone Capital has added 130 BTC through a Miami River refinance at 4.89% and has said eight more deals are in progress after June’s 1,000-BTC buy. It has targeted 4,000 BTC in 2025. The 10X Miami River Bitcoin Fund has launched, backed by a 346-unit property and $15 million in BTC. The post Cardone Capital Deepens Bitcoin Bet With 130 BTC Deal – Targeting 4,000 Coins by Year-End appeared first on Cryptonews .", "ingested_utc": "2025-08-19T20:33:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:33:44Z", "source": "CoinJournal", "title": "Bitcoin at risk of a 51% attack from two miners", "url": "https://coinjournal.net/news/bitcoin-at-risk-of-a-51-attack-from-two-miners/", "id_key": "5c1e126909829628b599acd9b7ec22e95b20012e5eccf3395cdcfe5e18d77507", "summary": "Foundry USA and AntPool now control over half of Bitcoin’s hash power. Bitcoin price is slipping toward $110,530, a crucial support level. Macro fears and Fed shifts add pressure to already weak crypto markets. After Monero’s 51% takeover, two Bitcoin mining pools have sparked fears of a potential 51% attack on Bitcoin. Notably, the developments […] The post Bitcoin at risk of a 51% attack from two miners appeared first on CoinJournal .", "ingested_utc": "2025-08-19T20:33:44Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:35:29Z", "source": "MarketWatch_Bulletins", "title": "Dow ends flat, Nasdaq and S&P 500 finish sharply lower as Big Tech stocks slide", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=676e3098-f698-4561-99f3-d6788828f78d&mod=mw_rss_bulletins", "id_key": "cb386e5e9de28e1ef89da0239f8db8adf61db4797c9ce07af8f3988aed62868e", "summary": "", "ingested_utc": "2025-08-19T20:35:29Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:35:37Z", "source": "NYTimes_World", "title": "Live Updates: White House Presses Meeting, Security Guarantees That Russia Has Yet to Accept", "url": "https://www.nytimes.com/live/2025/08/19/us/trump-zelensky-ukraine-russia", "id_key": "c4c7c85b81eea8c98b377cc29b2fb0a8284868b8b41a47a8c8ad359c81b9dc57", "summary": "A White House spokeswoman said Vladimir Putin had agreed to a meeting with Volodymyr Zelensky, but Russia has not confirmed. President Trump said American troops would not be deployed in Ukraine.", "ingested_utc": "2025-08-19T20:35:37Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:06Z", "source": "TheVerge_All", "title": "Microsoft employees occupy headquarters in protest of Israel contracts", "url": "https://www.theverge.com/ai-artificial-intelligence/761731/pro-palestinian-protests-microsoft-headquarters-redmond-washington-no-azure-tech-for-apartheid", "id_key": "7f103f800461335ecdfcd05ed44f00ee60ebb613885868d53812868302f5a6f9", "summary": "On Tuesday, a group of current and former Microsoft employees, as well as community members, took over a plaza at Microsoft's headquarters in Redmond, Washington, as part of a No Azure for Apartheid protest. They declared the area a \"Liberated Zone\" encampment and said they had changed its name from East Campus Plaza to \"The […]", "ingested_utc": "2025-08-19T20:36:06Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:08Z", "source": "ArsTechnica_All", "title": "Starlink keeps trying to block fiber deployment, says US must nix Louisiana plan", "url": "https://arstechnica.com/tech-policy/2025/08/starlink-keeps-trying-to-block-fiber-deployment-says-us-must-nix-louisiana-plan/", "id_key": "a7ddb5c7369e5ca01886470ce6582db988211264e32284925ca068113e6400cb", "summary": "SpaceX seeks more cash, calls fiber \"wasteful and unnecessary taxpayer spending.\"", "ingested_utc": "2025-08-19T20:36:08Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:10Z", "source": "Engadget_All", "title": "Prosecutors charge man who allegedly used botnet to take down X this spring", "url": "https://www.engadget.com/cybersecurity/prosecutors-charge-man-who-allegedly-used-botnet-to-take-down-x-this-spring-202312254.html?src=rss", "id_key": "476ed6e8e9a347d1bf29531f19c88e478f37eebf1e1ca656aff9ce0f87dc6a2d", "summary": "An Oregon man has been charged in a federal complaint today on allegations of operating a botnet for hire that conducted cyberattacks beginning at least in 2021. Ethan Foltz has been accused of running Rapper Bot, also known as Eleven Eleven Botnet and CowBot, and using it to execute coordinated distributed denial of service (DDoS) attacks. The complaint claims that Rapper Bot was used to target victims in more than 80 countries, and since April 2025, it has reportedly conducted more than 370,000 attacks against 18,000 unique victims. \"Rapper Bot was one of the most powerful DDoS botnets to ever exist,\" US Attorney Michael J. Heyman for the District of Alaska said. \"Our office remains committed to disrupting and dismantling cyber criminals that threaten internet security and infrastructure in the District of Alaska and across the United States.\" One of Rapper Bot's alleged victims was X, which was taken down by a DDoS attack in March. At the time, owner Elon Musk made unsubstantiated claims about the attack being perpetrated by a \"large, coordinated group and/or a country\" and that it stemmed from IP addresses in Ukraine, although security researchers said it was possible the social network had left servers unsecured . This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/prosecutors-charge-man-who-allegedly-used-botnet-to-take-down-x-this-spring-202312254.html?src=rss", "ingested_utc": "2025-08-19T20:36:10Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:10Z", "source": "Engadget_All", "title": "Meta's AI voice translation feature rolls out globally", "url": "https://www.engadget.com/ai/metas-ai-voice-translation-feature-rolls-out-globally-200945034.html?src=rss", "id_key": "4263cca5b8979a8633aa08b39087e970ba1783ea9930956e11b9aad538a8ba11", "summary": "On Tuesday, Meta rolled out its new voice dubbing feature globally. The Reels feature uses generative AI to translate your voice, with optional lip-syncing. Mark Zuckerberg first previewed the feature at Meta Connect 2024. At launch, the translations are only available for English to Spanish (and vice versa). The company says more languages will arrive later. At least at first, it's restricted to Facebook creators with 1,000+ followers. However, anyone with a public Instagram account can use it. The tool trains on your original voice and generates a translated audio track to match your tone. The lip-syncing add-on then matches your mouth's movements to the translated speech. The demo clip the company showed last year was spot-on — eerily so. Meta To use the feature, choose the \"Translate your voice with Meta AI\" option before publishing a reel. That's also where you can choose to add lip syncing. There's an option to review the AI-translated version before publishing. Viewers will see a pop-up noting that it's an AI translation. Meta says the feature works best for face-to-camera videos. The company recommends avoiding covering your mouth or including excessive background music. It works for up to two speakers, but it's best to avoid overlapping your speech. The company frames the feature as a way for creators to expand their audiences beyond their native tongues. As such, it included a by-language performance tracker, so you can see how well it's doing in each language. YouTube launched a similar feature last year. Apple has gotten in on the action, too: Messages, Phone and FaceTime apps have live translation tools in iOS 26. This article originally appeared on Engadget at https://www.engadget.com/ai/metas-ai-voice-translation-feature-rolls-out-globally-200945034.html?src=rss", "ingested_utc": "2025-08-19T20:36:10Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:19Z", "source": "TheStreet_Top", "title": "Kate Middleton-approved clothing brand files Chapter 7 bankruptcy", "url": "https://www.thestreet.com/retail/fashion-brand-worn-by-kate-middleton-files-chapter-7-bankruptcy", "id_key": "423ed607302985b27c2ce50c71aea2074a70464b846808b50df3e631a0d2abb6", "summary": "The company has closed its doors and laid off all workers, but the brand, a favorite of Kate Middleton may go on.", "ingested_utc": "2025-08-19T20:36:19Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:19Z", "source": "AlJazeera_All", "title": "Children tear gassed at football practice in occupied West Bank", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/19/children-tear-gassed-at-football-practice-in-occupied-west-bank?traffic_source=rss", "id_key": "242653c1ecb7aa50baf14cf27992ede8e7ffbb78de42b15607757299532a3e47", "summary": "Video shows that a children’s football game in the occupied West Bank was disrupted by tear gas fired by Israeli forces.", "ingested_utc": "2025-08-19T20:36:19Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:19Z", "source": "AlJazeera_All", "title": "Texas cop’s bodycam video shows man died after being tasered", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/19/texas-cops-bodycam-video-shows-man-died-after-being-tasered?traffic_source=rss", "id_key": "70a6646a45b52c857189f3a939885fe519d42f6bb6d3854c232cc3fad340f711", "summary": "Police in Texas released bodycam footage showing the events surrounding the death of an agitated man in police custody.", "ingested_utc": "2025-08-19T20:36:19Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "The Estée Lauder Companies Nominates Dana Strong, CBE and Annabelle Yu Long for Election to its Board of Directors", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/the-estee-lauder-companies-nominates-dana-strong-cbe-and-annabelle-yu-long-for-election-to-its-board-of-directors", "id_key": "a2475178cbb1b5dfff0363a21a7d9be6dfb46b48d58d6ac9549e0f41dc526773", "summary": "NEW YORK — The Estée Lauder Companies Inc. (NYSE:EL) announced today that Dana Strong, CBE and Annabelle Yu Long have been nominated by its Board of Directors for election as directors at the upcoming annual meeting of stockholders to be held on November 13, 2025. Ms. Strong and Ms. Long are globally respected leaders whose […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "Long Ridge Energy LLC Announces Timing of Second Quarter 2025 Earnings Conference Call", "url": "https://financialpost.com/globe-newswire/long-ridge-energy-llc-announces-timing-of-second-quarter-2025-earnings-conference-call", "id_key": "731695e8a0693b4f95099c39c1aac5e35bc6e1950231af7ba7743a6ff8d6ddaf", "summary": "HANNIBAL, Ohio, Aug. 19, 2025 (GLOBE NEWSWIRE) — Long Ridge Energy LLC (“LRE”) is announcing its second quarter 2025 investor call for Thursday, August 28, 2025 at 10:00 AM EDT. LRE comprises the electric power and natural gas business of Long Ridge Energy & Power LLC (“LREP”). LREP is a wholly owned portfolio company of […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "Atico Reports Consolidated Financial Results for Second Quarter of 2025", "url": "https://financialpost.com/globe-newswire/atico-reports-consolidated-financial-results-for-second-quarter-of-2025", "id_key": "3bb0b442f28d2ba3393b1a596cc130def17966d7d0377ceb92d099c8244b9eb7", "summary": "(All amounts expressed in US dollars, unless otherwise stated) VANCOUVER, British Columbia, Aug. 19, 2025 (GLOBE NEWSWIRE) — Atico Mining Corporation (the “Company” or “Atico”) (TSX.V: ATY | OTC: ATCMF) today announced its financial results for the three months ended June 30, 2025, posting income from mining operations of $4.5 million and a net income […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "Royal Gold Announces Fourth Quarter Dividend", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/royal-gold-announces-fourth-quarter-dividend-7", "id_key": "ab3307b94170094784ca1cd47db0085e9fc504b363e4e794807c889fb479875d", "summary": "DENVER — Royal Gold, Inc. (NASDAQ: RGLD) (together with its subsidiaries, “Royal Gold” or the “Company”) announced today that its Board of Directors has declared its fourth quarter dividend of $0.45 per share of common stock. The dividend is payable on Friday, October 17, 2025, to shareholders of record at the close of business on […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "Walmart recalls frozen shrimp over potential radioactive contamination", "url": "https://financialpost.com/pmn/walmart-recalls-frozen-shrimp-over-potential-radioactive-contamination", "id_key": "449dfbb1622a9cec773d9aa32091dbadb1d58b44959affbf15cfe8da6a5a9d81", "summary": "Walmart has recalled frozen, raw shrimp sold in 13 states because federal health officials say it could have potential radioactive contamination. The U.S. Food and Drug Administration asked Walmart to pull three lots of Great Value brand frozen shrimp from stores after federal officials detected Cesium-137, a radioactive isotope, in shipping containers and a sample […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "Canadian Net REIT Announces 2025 Second-Quarter Results", "url": "https://financialpost.com/globe-newswire/canadian-net-reit-announces-2025-second-quarter-results", "id_key": "9777965ca292eb4004cff7f2dc8ce0b06904f066550f7f22d2c78792c74c73aa", "summary": "REIT also announces monthly distributions for Q4 2025 MONTRÉAL, Aug. 19, 2025 (GLOBE NEWSWIRE) — Canadian Net Real Estate Investment Trust (“Canadian Net” or the “REIT”) (TSX-V: NET.UN) today reported its results for the quarter ended June 30th, 2025 (“Q2 2025”) and distributions for October, November and December 2025. “We are pleased with our second […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "Anaergia S.r.l. Announces Agreement to Provide Infrastructure and Equipment for New Biomethane Plants in Spain", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/anaergia-s-r-l-announces-agreement-to-provide-infrastructure-and-equipment-for-new-biomethane-plants-in-spain", "id_key": "1764c819d03eadb3adc61e4df9f97dc5172fed768dd34a1c42edcebfa6bc20bf", "summary": "Anaergia anticipates C$184 million in revenue from the Agreement TREVIGLIO, Italy & BURLINGTON, Ontario — Anaergia Inc. (“Anaergia”, the “Company”, “us”, or “our”) (TSX:ANRG; OTCQX:ANRGF), through its subsidiary Anaergia S.r.l., has signed a Binding Agreement (“Agreement”) with a leading Spanish company specializing in renewable gas infrastructure projects. Under the terms of the Agreement, Anaergia will […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:27Z", "source": "FinancialPost_Business", "title": "CitiusTech Acquires Health Data Movers, Enhances Healthcare Provider Offerings With Epic Implementation Capabilities", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/citiustech-acquires-health-data-movers-enhances-healthcare-provider-offerings-with-epic-implementation-capabilities", "id_key": "e0409586b309e4fd6975f520a6c368ec6dee5d47d5fe00adeddc9a4d5bafe6f8", "summary": "PRINCETON, N.J. — CitiusTech, a leading provider of healthcare technology, services & solutions, today announced that it has acquired Health Data Movers, a Best in KLAS healthcare technology services firm, with deep expertise in Epic Systems, Workday, ServiceNow and other core healthcare platforms. As healthcare providers work to improve quality of care and deliver more […]", "ingested_utc": "2025-08-19T20:36:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T20:36:42Z", "source": "HackerNews_Top", "title": "Medical cannabis patient data exposed by unsecured database", "url": "https://www.wired.com/story/highly-sensitive-medical-cannabis-patient-data-exposed-by-unsecured-database/", "id_key": "5d7a777f1aa28d7e0706e09171ee859ad6b49ae14096714ea0d2672db9459f36", "summary": "Comments", "ingested_utc": "2025-08-19T20:36:42Z"}
