{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:17Z", "source": "Guardian_Business", "title": "Trump’s promise of a US manufacturing renaissance leaves experts scratching their heads", "url": "https://www.theguardian.com/us-news/2025/aug/18/trumps-tariffs-manufacturing-resurgence-jobs", "id_key": "a6a0144aef004414080fab7e26ae6927ed3e0447b93f0ebceb79b66985cd0a8f", "summary": "Economists doubt US duties will bring about a resurgence of US factory jobs, notably due to Trump’s erratic tariff rollout Donald Trump’s hugely disruptive trade war is setting the stage for a manufacturing renaissance in the US, administration officials say. Outside the White House, many economists are skeptical. Global trade experts point to many reasons they believe the president’s tariffs will fail to bring about a major resurgence of manufacturing, among them: Trump’s erratic, constantly changing policies, his unfocused, across-the-board tariffs, and his replacing Joe Biden’s carrot-and-sticks approach to brandish sticks at the world. Continue reading...", "ingested_utc": "2025-08-18T11:31:17Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:17Z", "source": "Guardian_Business", "title": "Soho House members’ club to go private in $1.8bn deal as Ashton Kutcher joins board", "url": "https://www.theguardian.com/business/2025/aug/18/soho-house-members-club-deal-private-mcr-hotels-nyse", "id_key": "540c60c60e514e8dc98f9ea70ed76377255c5e16a09d2e85477f8a2dbd75eef0", "summary": "MCR Hotels to lead new equity investors in members’ club chain after four years on New York stock exchange Business live – latest updates The members’ club chain Soho House has agreed a $2.7bn (£1.9bn) deal to take it private after a tricky four years listed on the New York stock exchange. New York-based MCR Hotels will lead new equity investors in the chain of clubs as part of a deal that will involve it ditching its stock market listing. Continue reading...", "ingested_utc": "2025-08-18T11:31:17Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:18Z", "source": "Guardian_World", "title": "Watchdog criticised for clearing ex-defence secretary Shapps to join missile maker", "url": "https://www.theguardian.com/politics/2025/aug/18/watchdog-condemned-for-clearing-grant-shapps-to-join-defence-startup", "id_key": "f5ccc267a2104d3d47baa63ff7bc5127bb65957e4f0089bcbc01b105ba36d132", "summary": "Former minister can take up role as chair of Cambridge Aerospace – as long as he avoids defence matters UK politics – live updates The watchdog that monitors government ministers’ professional appointments after leaving office has been criticised for clearing Grant Shapps, a former Conservative defence secretary, to join Cambridge Aerospace as long as he promises not to work on defence matters. In a ruling that drew scorn from political ethics experts, the Advisory Committee on Business Appointments (Acoba), which monitors and advises on the revolving door between Westminster and the business sector, gave Shapps the green light to become the chair of defence company Cambridge Aerospace. Continue reading...", "ingested_utc": "2025-08-18T11:31:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:18Z", "source": "Guardian_World", "title": "‘Nothing is the same’: Windrush victim allowed to return to UK after 28 years", "url": "https://www.theguardian.com/uk-news/2025/aug/18/windrush-victim-allowed-return-uk-28-years-george-lee", "id_key": "ca25a6f32c24a1b253c2e049f9c59dc87e1b6089027625f95e9e392c113ae497", "summary": "George Lee was stuck in Poland and received little help from UK officials even after the scandal broke in 2018 When George Lee was last in the UK, Tony Blair was the newly elected prime minister, Diana, Princess of Wales had recently died and Elton John’s Candle in the Wind was being played on repeat. A pint of bitter cost £1.63 and a packet of 20 cigarettes sold for about £2.94. After 28 years of exile in Poland, Lee, an English teacher, flew back to Britain a fortnight ago, his ticket paid for by the Home Office, where staff had belatedly acknowledged that he was a victim of the Windrush scandal and allowed him to return. Continue reading...", "ingested_utc": "2025-08-18T11:31:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:18Z", "source": "Guardian_World", "title": "US aid group ‘distressed’ at block on medical visas for Gaza children", "url": "https://www.theguardian.com/us-news/2025/aug/18/gaza-medical-visas-children-laura-loomer-marco-rubio", "id_key": "bd54c367debc6bf1c4658c2e8e5bea5081aba34658bf73377c52d6f5ec29793c", "summary": "Charity Heal Palestine says children returned to Middle East after treatment, rebutting far-right influencer’s claim of secret ‘Islamic immigration’ wave An aid group that coordinates medical care in the United States for badly injured children from Gaza has said it is “distressed” by the US state department’s decision to stop issuing visitor visas for Palestinians after a far-right influencer complained directly to the secretary of state about their work. Laura Loomer, who has previously described herself as a “proud Islamophobe”, told the New York Times that she had spoken to Marco Rubio on Friday night to warn the secretary of state of what she called the threat posed by “Islamic invaders”. Continue reading...", "ingested_utc": "2025-08-18T11:31:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:18Z", "source": "Guardian_World", "title": "‘Hallmarks of authoritarianism’: Trump banks on loyalists as he wages war on truth", "url": "https://www.theguardian.com/us-news/2025/aug/18/trump-war-on-truth", "id_key": "2d4f1ad1eb02fb4afd51046dcd2f7267623d0cd87183e6f8655c42dae5e827e4", "summary": "Former officials say firing of BLS commissioner emblematic of president’s battle against established facts and history Donald Trump is waging a war on truth by firing top officials who present facts he finds unpalatable, while he banks on key loyalists at executive agencies to bolster his policies and powers by “rewriting history’s narrative” and squelching dissent, say scholars and former officials. Trump’s penchant for rejecting facts in an authoritarian style was especially revealed in August by his sudden firing of the Bureau of Labor Statistics commissioner, charging without evidence that her latest report was “totally rigged”, just hours after she released data undercutting his rosy economic boasts, say critics. Continue reading...", "ingested_utc": "2025-08-18T11:31:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:38Z", "source": "Protos", "title": "ETH unstaking wait queue hit multi-year high", "url": "https://protos.com/eth-unstaking-wait-queue-hit-multi-year-high/", "id_key": "4d50641221087b254f56b1e8ecbb859a106191574205dd0e88525c4e07cca475", "summary": "On Sunday, Ethereum users were unstaking $4 billion worth of ETH from the network due to two impactful headlines from finance. The post ETH unstaking wait queue hit multi-year high appeared first on Protos .", "ingested_utc": "2025-08-18T11:31:38Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:39Z", "source": "CryptoNews", "title": "Crypto Investment Products Hit $3.75B Inflows, AuM Peaks at $244B", "url": "https://cryptonews.com/news/crypto-investment-products-hit-3-75b-inflows-aum-peaks-at-244b/", "id_key": "be7ef8cc01e79404ab5a796870266616ddd6c1d0cf94456ae565f8007aab4939", "summary": "Digital asset investment products recorded $3.75 billion in inflows last week, the fourth-largest on record, signaling a sharp rebound. The post Crypto Investment Products Hit $3.75B Inflows, AuM Peaks at $244B appeared first on Cryptonews .", "ingested_utc": "2025-08-18T11:31:39Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:39Z", "source": "CryptoNews", "title": "Solana Achieves Historic 100K TPS Milestone, Developer Claims Blockchain First", "url": "https://cryptonews.com/news/solana-achieves-historic-100k-tps-milestone-developer-claims-blockchain-first/", "id_key": "ab4ac93cb71d17d35e1830b5122d0ce41c3fe312d47178b664ed18b510469cd4", "summary": "Solana records historic 107,540 transactions per second on mainnet achieving what developers claim as first 100K TPS milestone for major blockchain through stress test with noop program calls. The post Solana Achieves Historic 100K TPS Milestone, Developer Claims Blockchain First appeared first on Cryptonews .", "ingested_utc": "2025-08-18T11:31:39Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:31:40Z", "source": "CoinJournal", "title": "SOL could retest $174 amid bearish price action; Check forecast", "url": "https://coinjournal.net/news/sol-could-retest-174-amid-bearish-price-action-check-forecast/", "id_key": "6990a884cb902449f935fba9d38cc6e5e3958e8fe6ae0a1ad3d5b6da5ea70194", "summary": "Ke takeaways Solana is the worst performer in the top 10, down 6% in the last 24 hours. The coin could retest the $174 support level as BTC and others underperform. SOL dips 6% as the broader market sheds nearly $200b The weekend was bearish for Bitcoin, and other leading cryptocurrencies recorded huge losses. Bitcoin […] The post SOL could retest $174 amid bearish price action; Check forecast appeared first on CoinJournal .", "ingested_utc": "2025-08-18T11:31:40Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:33:27Z", "source": "NYTimes_World", "title": "Protests Highlight Growing Discontent With Netanyahu and the Gaza War", "url": "https://www.nytimes.com/2025/08/18/world/middleeast/israel-protests-gaza-netanyahu-hostages.html", "id_key": "073737ab281a977ef5e5f76598a6503287561c3847b687e7a12b27d27d7558b0", "summary": "Many Israelis feel that freeing the hostages cannot happen if the government refuses to come to terms with Hamas and pursues its policy of trying to eliminate the group militarily.", "ingested_utc": "2025-08-18T11:33:27Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:33:27Z", "source": "NYTimes_World", "title": "Trump Bows to Putin’s Approach on Ukraine: No Cease-Fire, Deadlines or Sanctions", "url": "https://www.nytimes.com/2025/08/16/us/politics/trump-putin-approach-ukraine.html", "id_key": "118fb269796ab822c1c23806eaa11d7bebb3c7b41bdcc6a127cbe5e63b6271a4", "summary": "The net effect of the Alaska summit was to give President Vladimir V. Putin of Russia a free pass to continue his war against his neighbor indefinitely without further penalty, pending talks on a broader peace deal.", "ingested_utc": "2025-08-18T11:33:27Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:33:35Z", "source": "NPR_Business", "title": "Air Canada suspends restart plans after union defies return to work order", "url": "https://www.npr.org/2025/08/17/nx-s1-5505416/air-canada-suspends-restart-plans", "id_key": "ebb4042fac4d0f2f41d666729a0e8753c63bff124d9f4432e936da48d67fc9fe", "summary": "Air Canada will resume flights Monday evening, claiming the union illegally directed flight attendants to defy a return-to-work order.", "ingested_utc": "2025-08-18T11:33:35Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:33:38Z", "source": "FT_Home", "title": "Soho House agrees $2.7bn take-private deal", "url": "https://www.ft.com/content/714d00d6-b2fa-47d7-9b03-c2629af99882", "id_key": "1f56d6e4fb67b68b99e05ba1971ddbc0eba00968a384ad8e211cc8405e72a2e0", "summary": "London members’ club that went global bought out by investors led by New York-based MCR Hotels", "ingested_utc": "2025-08-18T11:33:38Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:33:39Z", "source": "FT_Markets", "title": "The new Square Mile: how London’s IPO drought forced City bankers to pivot", "url": "https://www.ft.com/content/74db8359-a76e-4a65-a424-5624d7af22d6", "id_key": "102617af6a72cd9fc46dbcbeb5cfcbd483c97187dae7bab9c28ca4a18e85d785", "summary": "A dearth of public listings is forcing investment banks to broaden their horizons", "ingested_utc": "2025-08-18T11:33:39Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:33:56Z", "source": "ArsTechnica_All", "title": "Ars Technica System Guide: Four sample PC builds, from $500 to $5,000", "url": "https://arstechnica.com/gadgets/2025/08/ars-technica-system-guide-back-to-pc-building-for-back-to-school/", "id_key": "ea6a099f8d9e27ff53a5030a4cf81ebf9d7d3e27d9a9f31ff7ad74402ccfbe38", "summary": "Despite everything, it's still possible to build decent PCs for decent prices.", "ingested_utc": "2025-08-18T11:33:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:33:58Z", "source": "Engadget_All", "title": "Google will pay Australia $36 million over anticompetitive search deal with mobile carriers", "url": "https://www.engadget.com/big-tech/google-will-pay-australia-36-million-over-anticompetitive-search-deal-with-mobile-carriers-110956889.html?src=rss", "id_key": "e382c7035d2dac1600a61205c6c900cdfbf07b01bfe027fa0d88c87f85d027f5", "summary": "Google has agreed to pay a fine of $55 million AUD ($36 million USD) for anticompetitive practices, the Australian Competition and Consumer Commission (ACCC) announced . It stems from deals Google undertook with Australian telecommunications companies Telstra and Optus to only pre-install Google Search. The key there is that these companies couldn't install any other search engine. Telstra and Optus then got a share of Google's ad revenue from customers using Google search on their respective Androids. Google admitted these agreements were \"likely to have had the effect of substantially lessening competition.\" These deals were in place from December 2019 to March 2021. \"Conduct that restricts competition is illegal in Australia because it usually means less choice, higher costs or worse service for consumers,\" ACCC Chair Gina-Cass Gottlieb said before turning the emphasis to AI. \"Importantly, these changes come at a time when AI search tools are revolutionising how we search for information, creating new competition. With AI search tools becoming increasingly available, consumers can experiment with search services on their mobiles.\" Unlike some past instances in which Google has defended itself against an investigation or fine, the company is cooperating. It has admitted liability and proposed the fine alongside the ACCC. A court will determine whether its an apt punishment. Google has offered a range of search provider options to EU Android users since 2020 — after facing another antitrust ruling and a €4.3 billion ($5 billion) fine. Last year, Telstra and Optus came to agreements with the ACCC that they wouldn't make similar arrangements with Google moving forward. This article originally appeared on Engadget at https://www.engadget.com/big-tech/google-will-pay-australia-36-million-over-anticompetitive-search-deal-with-mobile-carriers-110956889.html?src=rss", "ingested_utc": "2025-08-18T11:33:58Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:34:13Z", "source": "FinancialPost_Business", "title": "Hisummer Launches Two Flameless Candle Warmer Lamps for Fall & Winter 2025 Décor and Gifting", "url": "https://financialpost.com/globe-newswire/hisummer-launches-two-flameless-candle-warmer-lamps-for-fall-winter-2025-decor-and-gifting", "id_key": "2f5fd940decfddd6abdc2ed1c1ef9c1d70eb401386e6414fd8433b7c659ed11c", "summary": "NEW YORK, Aug. 18, 2025 (GLOBE NEWSWIRE) — As the days grow shorter and the season of gatherings begins, Hisummer is redefining how people create warm, safe and stylish spaces at home. The U.S. lifestyle brand has introduced two distinctive flameless candle warmers, which are quickly becoming both the most talked-about fall home décor accent and […]", "ingested_utc": "2025-08-18T11:34:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:34:13Z", "source": "FinancialPost_Business", "title": "The Cannabist Company Announces Closing on Sale of Affiliate; Repositioning to a Wholesale Strategy in Pennsylvania", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/the-cannabist-company-announces-closing-on-sale-of-affiliate-repositioning-to-a-wholesale-strategy-in-pennsylvania", "id_key": "f1256a1e552446ad3d299ad24b726a6d78569dbe8aeda705a80a0664c3b55bd4", "summary": "NEW YORK — The Cannabist Company Holdings Inc. (Cboe CA: CBST) (OTCQB: CBSTF) (“The Cannabist Company” or the “Company”), one of the most experienced cultivators, manufacturers and retailers of cannabis products in the U.S., announced today the successful closing of the sale of its Pennsylvania affiliate that owns 3 medical dispensaries (“Pennsylvania Transaction”) to VP […]", "ingested_utc": "2025-08-18T11:34:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:34:13Z", "source": "FinancialPost_Business", "title": "TEN (Transportation Equipment Network) Appoints Nathan Smith as Interim Chief Executive Officer", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/ten-transportation-equipment-network-appoints-nathan-smith-as-interim-chief-executive-officer", "id_key": "ebccc1da2c4da03e3e7295f74bc6d7b94f6614ee376c2d0e6fb2e721a3772b1f", "summary": "DUBLIN, Ohio — TEN (Transportation Equipment Network), a leading trailer leasing company owned by I Squared Capital, a leading global infrastructure investor, today announced that Nathan Smith, TEN’s Chief Operating Officer, has been appointed interim Chief Executive Officer, effective immediately. Nathan Smith joined TEN in December 2024, bringing decades of leadership experience in the transportation […]", "ingested_utc": "2025-08-18T11:34:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:34:13Z", "source": "FinancialPost_Business", "title": "American Lithium Closes Oversubscribed Private Placement", "url": "https://financialpost.com/globe-newswire/american-lithium-closes-oversubscribed-private-placement", "id_key": "e91db56a59e714dc1a688a439e24b025512a9e01d8edf1be9b1e8c52bbea8d21", "summary": "Not for distribution to U.S. news wire services or dissemination in the United States VANCOUVER, British Columbia, Aug. 18, 2025 (GLOBE NEWSWIRE) — American Lithium Corp. (“American Lithium” or the “Company”) (TSX-V:LI | OTCQX:AMLIF | Frankfurt:5LA1) is pleased to announce that it has closed its previously announced non-brokered private placement for aggregate gross proceeds of […]", "ingested_utc": "2025-08-18T11:34:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:34:13Z", "source": "FinancialPost_Business", "title": "Apollo Silver Engages CDMG for Marketing Services", "url": "https://financialpost.com/globe-newswire/apollo-silver-engages-cdmg-for-marketing-services", "id_key": "e3bec5ce5cf007a16ce074767effbf1523727d4d3dcc8e987a625d733ea0bd97", "summary": "VANCOUVER, British Columbia, Aug. 18, 2025 (GLOBE NEWSWIRE) — Apollo Silver Corp. (“Apollo” or the “Company”) (TSX.V:APGO, OTCQB:APGOF, Frankfurt:6ZF0) is pleased to announce that it has engaged Creative Direct Marketing Group, Inc. (“CDMG”), an arm’s-length service provider, to provide marketing and advertising services for an aggregate total of US$1,620,357 (the “Agreement”), payable in tranches, in […]", "ingested_utc": "2025-08-18T11:34:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T11:34:28Z", "source": "HackerNews_Top", "title": "LLMs and Coding Agents = Security Nightmare", "url": "https://garymarcus.substack.com/p/llms-coding-agents-security-nightmare", "id_key": "b49d03f3f4d1724fd47308bdf6c661b11e40d2be62a27bd60a684bb6a4d1a482", "summary": "Comments", "ingested_utc": "2025-08-18T11:34:28Z"}
