{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Cointelegraph", "title": "Jack Dorsey’s Block targets 10-year lifecycle for Bitcoin mining rigs", "url": "https://cointelegraph.com/news/block-inc-proto-rig-bitcoin-mining-system", "id_key": "ae13a6fc23c41feb5e0c8009c484e78d9a924ed91b0524ed73ae9bc17a0f6fe2", "summary": "Block’s Proto Rig and Proto Fleet aim to reduce upgrade costs and extend rig lifespans, giving miners a potential edge in a capital-intensive, increasingly AI-integrated industry.", "ingested_utc": "2025-08-14T17:00:31Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Chainalysis_Blog", "title": "How A7A5, The Ruble-Backed Token, and Grinex, the Garantex Rebrand Sanctioned by OFAC, Enable The Russian Crypto Economy", "url": "https://www.chainalysis.com/blog/a7a5-grinex-russian-crypto-economy-ofac-sanctions-august-2025/", "id_key": "f582ef5f963e0155f86be0ca4c6d70f8a0ba2a40b5d95504bbe3034d0b262551", "summary": "TL;DR A7A5 is a Russian ruble-backed token issued by the Kyrgyzstani company Old Vector, which was sanctioned today. It is… The post How A7A5, The Ruble-Backed Token, and Grinex, the Garantex Rebrand Sanctioned by OFAC, Enable The Russian Crypto Economy appeared first on Chainalysis .", "ingested_utc": "2025-08-14T17:00:40Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Blackwater founder Erik Prince to send hundreds of fighters to strife-torn Haiti", "url": "https://www.theguardian.com/world/2025/aug/14/erik-prince-blackwater-haiti", "id_key": "ab1ded2a6beea5abf502b09057e6ea588a2a6c244e39a20ebc79e8ab9f89e84b", "summary": "Critics say Vectus Global’s presence – including snipers – will undermine Haiti’s police and UN security force Hundreds of combatants from the US, Europe and El Salvador will reportedly be deployed to Haiti in the coming weeks to battle the country’s gangs as part of a mission led by the controversial Blackwater founder and Donald Trump backer Erik Prince. According to Reuters, Prince’s new security firm, Vectus Global – which has been operating in the violence-ravaged Caribbean country since March – is preparing to intensify its activities there to help authorities win key roads and territories back from heavily armed criminal groups. Continue reading...", "ingested_utc": "2025-08-14T17:00:55Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Scottish pupil named Time magazine girl of the year for solar-powered blanket design", "url": "https://www.theguardian.com/uk-news/2025/aug/14/scottish-pupil-named-girl-of-the-year-for-solar-powered-blanket-design", "id_key": "ae8fadfbb18d7fe6adf854b64dbf70e4d410583045eac47e50830e4635577f6a", "summary": "Rebecca Young, 13, named one of 10 ‘girls of the year’ for her invention intended to help rough sleepers in winter A Scottish schoolgirl has been named a “girl of the year” by Time magazine after she invented a solar-powered thermal blanket to help rough sleepers keep warm. Rebecca Young, 13, came up with her design after seeing homeless people struggling in subzero temperatures on the streets of her home city, Glasgow, in winter. She said her message to young people was: “If you see a problem you think you can fix, you can do something about it.” Continue reading...", "ingested_utc": "2025-08-14T17:00:55Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Florida governor says state will open ‘deportation depot’ immigration jail", "url": "https://www.theguardian.com/us-news/2025/aug/14/florida-governor-ron-desantis-immigration-detention", "id_key": "cd99ae2873fca5b5cda88242878449e7f8f60e901fa49ef07db9d94d34f39da8", "summary": "Ron DeSantis announced move as judge to decide whether to close ‘Alligator Alcatraz’ facility in Everglades Florida’s Republican governor, Ron DeSantis , said on Thursday that the state will open a second immigration jail, as a federal judge weighs whether to close the controversial existing facility in the Everglades known as “ Alligator Alcatraz ”. DeSantis painted the forthcoming detention center at the shuttered Baker correctional institution in Sanderson as supplementary to the remote tented camp. He also said the facility would hold up to 1,300 undocumented immigrants awaiting deportation. Continue reading...", "ingested_utc": "2025-08-14T17:00:55Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "NPR_Business", "title": "Anti-Trump podcast MeidasTouch is rivaling Joe Rogan. Does it have staying power?", "url": "https://www.npr.org/2025/08/14/nx-s1-5493541/meidastouch-rogan-trump-podcast-video", "id_key": "ca1998d35db7cdf538b406bccec1c135dc71c4570af95ec2096eab6a89733d30", "summary": "The left-leaning media outfit has surged in Donald Trump's second term, appealing to progressives outraged by the president. Still, the online streaming world remains dominated by right-wing voices.", "ingested_utc": "2025-08-14T17:01:02Z"}
