{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "Trump says he wants to see a ceasefire and ‘won’t be happy if it’s not today’  – Europe live", "url": "https://www.theguardian.com/world/live/2025/aug/15/donald-trump-vladimir-putin-meeting-anchorage-alaska-ukraine-war-europe-live-latest-updates-news", "id_key": "0eeb2f23f2ba258e7815ea9046a2fe5d9a6b56ea9ed3a361c06780be07a54b76", "summary": "US president says Russia needs to show willingness to seriously talk about the end of the war in Ukraine, as he travels to meeting in Anchorage, Alaska Asked if his conversation with Trump will cover territorial issues, Trump says: “ They’ll be discussed, but I’ve got to let Ukraine make that decision , and I think they’ll make a proper decision, but I’m not here to negotiate for Ukraine. I’m here to get them at a table. “I noticed he’s bringing a lot of business people from Russia, and that’s good. I like that because they want to do business, but they’re not doing business until we get the war stopped. ” Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "Israeli unit tasked with smearing Gaza journalists as Hamas fighters – report", "url": "https://www.theguardian.com/world/2025/aug/15/israeli-military-unit-reportedly-tasked-with-linking-journalists-in-gaza-to-hamas", "id_key": "921432791d71220f3576f5d7713c0cf50477d2f310a2abd1985c35a6c44f00d8", "summary": "Israeli-Palestinian magazine says IDF ‘legitimisation cell’ set up to blunt global outrage over killing of media staff A special unit in Israel’s military was tasked with identifying reporters it could smear as undercover Hamas fighters, to target them and to blunt international outrage over the killing of media workers, the Israeli-Palestinian outlet +972 Magazine reports . The “legitimisation cell” was set up after the 7 October 2023 Hamas attack to gather information that could bolster Israel’s image and shore up diplomatic and military support from key allies, the report said, citing three intelligence sources. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "‘Hellish’: heatwave brings hottest nights on record to the Middle East", "url": "https://www.theguardian.com/world/2025/aug/15/hellish-heatwave-brings-hottest-nights-on-record-to-the-middle-east", "id_key": "0f7ebe897e04508ce588c754c68d75cc4c1f24bd67d97ec964bcecc82fbff04d", "summary": "Temperatures did not drop below 36C in Sedom, Israel on Tuesday night, while several parts of Jordan stayed above 35C on Monday Jordan and Israel have suffered through their hottest nights on record, with nocturnal temperatures in the Levant well above levels that scientists consider “hellish”. Temperatures on Monday night did not go below 35C (95F) in Ghor es-Safi and Aqaba in Jordan, while in the capital, Amman, they stayed above 31.8C. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "UK’s largest bioethanol plant to shut after blow from Starmer’s trade deal with Trump", "url": "https://www.theguardian.com/business/2025/aug/15/uks-largest-bioethanol-plant-to-shut-after-blow-from-starmers-trade-deal-with-trump", "id_key": "807254c80a803a57f542214755b443d264473d86b1a007229c619125bd7efc01", "summary": "Associated British Foods says 160 jobs will be lost at Vivergo site in Hull after ministers refuse to fund rescue The UK’s largest bioethanol plant is to close after being dealt a body blow by Keir Starmer’s trade deal with Donald Trump . The owner of the Vivergo plant in Hull, owned by Associated British Foods (ABF), said it is to close with the loss of 160 jobs, just hours after the government said it would not fund an industry rescue package. The first redundancies will be made on Tuesday. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "Writing on the wall for Diane Abbott as Labour moves to find successor", "url": "https://www.theguardian.com/politics/2025/aug/15/diane-abbott-suspension-labour-mp-successor", "id_key": "d9695967e4fab6d7ab413b7a00858e55d5a3efc0309e2ff627855a73e2d4ec57", "summary": "Exclusive: Contenders teed up for parliamentary seat, which MP says ‘seem to pre-empt results of investigation’ Moves to find a successor to Diane Abbott in the parliamentary seat she has represented since 1987 are under way, prompting concern that her fate has been decided before an investigation into her latest suspension has concluded. Potential contenders have been spoken to by figures on the party’s National Executive Committee (NEC), teeing them up for a future contest in her constituency of Hackney North and Stoke Newington, and giving them informal advice on how to prepare, according to a party source. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "‘I thought no one would believe me’: Wallaby sightings reported in Suffolk", "url": "https://www.theguardian.com/uk-news/2025/aug/15/two-wallaby-sightings-reported-in-suffolk", "id_key": "73cb3c82997e468da4c7760ac60e75058945df8f78acb3a77b1a9986868813c3", "summary": "Wallabies are native to Australia but small wild populations descended from escapers exist in the UK At first glance Steven Ellis thought the small creature in the distance was a deer, but he soon realised he was witnessing something far more unusual. Ellis was near the village of Ilketshall St Andrew in Suffolk when he took out his camera and took a photograph of the animal, which turned out to be a wallaby. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "King Charles leads 80th VJ Day commemoration in UK", "url": "https://www.theguardian.com/world/2025/aug/15/king-charles-leads-80th-vj-day-commemoration-in-uk", "id_key": "874632f51cafaeed0fe9571397fe6dba715f71005f1c9a98a8d07b06f0ce329c", "summary": "The queen, Keir Starmer and veterans of second world war in Asia hear testimonies at remembrance service King Charles led VJ Day commemorations in the UK as a national service of remembrance and two-minute silence marked the 80th anniversary of Japan’s surrender in the second world war and the end of the six-year-long conflict. He was joined by the queen, the prime minister, Keir Starmer, and veterans who served in the far east theatres of war as wreaths were laid at the National Memorial Arboretum service in Staffordshire. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "Secret Service and US military engineers face scrutiny over raising river water level for Vance’s birthday", "url": "https://www.theguardian.com/us-news/2025/aug/15/jd-vance-lake-water-levels-ohio", "id_key": "9e39357e551b2de0bfe8015a415af18f8c6169aeebd408f888a5fd22509bff15", "summary": "Senator Adam Schiff suggests in letter that use of funds to alter outflow of lake for personal use may have been inappropriate US politics live – latest updates The US Secret Service and US military engineers are facing scrutiny after Adam Schiff, the California senator, demanded they answer questions about the Trump administration’s recent decision to change the water level of a lake in Ohio to facilitate a family boating trip for JD Vance on his birthday. The Secret Service has said that it requested the outflow of the Caesar Creek Lake in Ohio be changed shortly before the vice-president’s 2 August trip so that his security detail could safely navigate the Little Miami River, which the lake feeds into. The story was first reported by the Guardian last week . Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "Democrats introduce joint resolution to end Trump’s ‘lawless’ DC takeover", "url": "https://www.theguardian.com/us-news/2025/aug/15/democrats-trump-dc-police-resolution", "id_key": "14df3ebb0eddb5b4a9626c1383fbcfb724d68a145f9d0c4e8aefb509b1cf8ac5", "summary": "Legislation says special emergency conditions that would warrant federalization of DC police have not been met Democratic lawmakers have introduced a joint resolution aimed at ending what they call Trump’s unlawful and unprecedented move to federalize the Metropolitan police department (MPD) in Washington DC. Representative Jamie Raskin, the ranking member of the House judiciary committee, DC’s non-voting House delegate, Eleanor Holmes Norton, and representative Robert Garcia, ranking member of the House committee on oversight and government reform introduced the resolution on Friday, invoking the District of Columbia Home Rule Act of 1973. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:33Z", "source": "Guardian_World", "title": "Barack Obama praises Texas Democrats’ fight as they signal return to state", "url": "https://www.theguardian.com/us-news/2025/aug/15/greg-abbott-special-session-electoral-maps", "id_key": "ad17632b28824533cb39be2b97fdc43877dea5b09e6e4cda3c15db4dd3255581", "summary": "Governor Greg Abbott calls new special session immediately after directly adjourned its last one on Friday US politics live – latest updates Texas Democrats, fresh off encouragement from Barack Obama, are poised to return to their state as Governor Greg Abbott formally called a second special session to address redistricting on Friday. Abbott issued the proclamation for the special session, set to begin at noon local time on Friday, just two hours after lawmakers formally adjourned the first one. Democrats have spent nearly two weeks away from the state, denying Republicans a quorum to conduct legislative business and pass new congressional maps. Continue reading...", "ingested_utc": "2025-08-15T17:38:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:51Z", "source": "CryptoSlate", "title": "Fed integrates crypto banking oversight into standard regulatory processes, ends additional scrutiny", "url": "https://cryptoslate.com/fed-integrates-crypto-banking-oversight-into-standard-regulatory-processes-ends-additional-scrutiny/", "id_key": "7d119df5ebb71dd3a371a98511052b0eea7020e1c8a83b2e4756d303d46d6021", "summary": "The Federal Reserve (Fed) announced it will shut down its program with additional scrutiny over crypto and fintech activities. On an August 15 statement, the central bank said it will sunset the Novel Activities Supervision Program and return to monitoring banks’ crypto and fintech activities through standard supervisory processes. The Fed established the specialized program […] The post Fed integrates crypto banking oversight into standard regulatory processes, ends additional scrutiny appeared first on CryptoSlate .", "ingested_utc": "2025-08-15T17:38:51Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:38:55Z", "source": "CryptoNews", "title": "SPX6900 Slips to $1.55 as DeFi Expansion, CeFi Listings, and Rival TOKEN6900 Shape Next Move", "url": "https://cryptonews.com/news/spx6900-slips-to-1-55-as-defi-expansion-cefi-listings-and-rival-token6900-shape-next-move/", "id_key": "281804a43cc4d4bb1eba8df98633e33a288f6dc45c6f0df507ca774fab1460db", "summary": "SPX6900 has broken its bullish run, sliding after losing key support. Whale movements, technical weakness, and a new rival token have clouded its momentum despite recent DeFi and CeFi integrations, NFT expansion, and multichain growth. Traders are watching for signs of a recovery. The post SPX6900 Slips to $1.55 as DeFi Expansion, CeFi Listings, and Rival TOKEN6900 Shape Next Move appeared first on Cryptonews .", "ingested_utc": "2025-08-15T17:38:55Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:01Z", "source": "FT_Home", "title": "WEF clears Klaus Schwab of material wrongdoing", "url": "https://www.ft.com/content/94962fad-1735-4a66-a77d-2aca27e2ed28", "id_key": "47aa5420be3f66d753d98d0b3d038643dbc129ed4d742c87e243115e334da850", "summary": "Davos forum names BlackRock’s Larry Fink as interim co-chair after whisteblower allegations rejected", "ingested_utc": "2025-08-15T17:41:01Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:03Z", "source": "FT_Markets", "title": "Directors’ Deals: London Stock Exchange directors see a chance to buy", "url": "https://www.ft.com/content/202aa9b0-d2ee-4e43-9005-a1448cfb2499", "id_key": "c8cbc27acbf64afac693607f5cbd97e1995096db46407f967dab89196a580045", "summary": "Share price falls in wake of interim results", "ingested_utc": "2025-08-15T17:41:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:20Z", "source": "TheVerge_All", "title": "A treaty to end plastic pollution is still out of reach — that’s not necessarily a bad thing", "url": "https://www.theverge.com/news/760058/plastic-pollution-treaty-negotiations-end", "id_key": "483687d1aeaece82fe1d5ba2e3bf2765247bd2b226f4c21d235217f5783cdba0", "summary": "The nations of the world have been on the precipice of reaching a global agreement to curb plastic pollution for a few years now. Delegates from 184 governments met in Geneva this month to try to hammer out a final treaty, but in the end, they walked away without a deal. This is not necessarily […]", "ingested_utc": "2025-08-15T17:41:20Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:20Z", "source": "TheVerge_All", "title": "Anthropic has new rules for a more dangerous AI landscape", "url": "https://www.theverge.com/news/760080/anthropic-updated-usage-policy-dangerous-ai-landscape", "id_key": "d46a325be2a5ff4a1e56b9a1037b608b702a4811cf6cab17a43a903f52e4dfaa", "summary": "Anthropic has updated the usage policy for its Claude AI chatbot in response to growing concerns about safety. In addition to introducing stricter cybersecurity rules, Anthropic now specifies some of the most dangerous weapons that people should not develop using Claude. Anthropic doesn’t highlight the tweaks made to its weapons policy in the post summarizing […]", "ingested_utc": "2025-08-15T17:41:20Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:33Z", "source": "TheStreet_Top", "title": "Iconic Rite Aid-owned ice cream brand gets major revival", "url": "https://www.thestreet.com/retail/iconic-rite-aid-owned-ice-cream-brand-gets-major-revival", "id_key": "54a62903e5062ec48364d62a49bef95737bb3f33c12a5fa5f0f2e93c2a9a8f16", "summary": "The brand is expanding while hanging onto the classic recipes fans know and love.", "ingested_utc": "2025-08-15T17:41:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:33Z", "source": "TheStreet_Top", "title": "Amazon is selling a 'lightweight' $130 digital camera for $30, and shoppers say it's 'perfect for beginners'", "url": "https://www.thestreet.com/deals/aycy-digital-camera-amazon-sale", "id_key": "51f8b76d89ba98288073539184b6b52872ce0cf8dffd13b1f02cbf86aa3694eb", "summary": "\"The photo quality is good for the price.\"", "ingested_utc": "2025-08-15T17:41:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:33Z", "source": "TheStreet_Top", "title": "Popular craft beverage manufacturer files Chapter 11 bankruptcy", "url": "https://www.thestreet.com/restaurants/hard-cider-beverage-company-files-chapter-11", "id_key": "ca33db2a780f11c7f4940b0eafd8fc129e5707d787522216864ed0343a5ed7c0", "summary": "The hard cider producer and craft beverage restaurant operator files Chapter 11 bankruptcy to restructure its debt.", "ingested_utc": "2025-08-15T17:41:33Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:40Z", "source": "FinancialPost_Business", "title": "AGCO orders immediate suspension of Longtooth Beverage Company liquor licences after owner charged with trafficking cocaine, other drugs", "url": "https://financialpost.com/globe-newswire/agco-orders-immediate-suspension-of-longtooth-beverage-company-liquor-licences-after-owner-charged-with-trafficking-cocaine-other-drugs", "id_key": "64a213424e91fb5915b14feaa6cfaea22ab688621b0e98ef28d6997aedb9f206", "summary": "TORONTO, Aug. 15, 2025 (GLOBE NEWSWIRE) — The Alcohol and Gaming Commission of Ontario (AGCO) has taken action to immediately suspend the licence of Longtooth Beverage Company, located at 429 West Front Street in Stirling, Ontario. This action comes in response to charges laid by the Ontario Provincial Police (OPP) against Lucas Ferrill, Longtooth’s owner […]", "ingested_utc": "2025-08-15T17:41:40Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:40Z", "source": "FinancialPost_Business", "title": "Statement from CUPE on Air Canada’s Request for Binding Arbitration", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/statement-from-cupe-on-air-canadas-request-for-binding-arbitration", "id_key": "08ee509134999ecf8ed6f5c0f79153d80409977c9f43de3c37816284d81084cf", "summary": "TORONTO — The Air Canada Component of CUPE has respectfully urged Employment Minister Patty Hajdu not to intervene pursuant to section 107 of the Canada Labour Code thereby permitting collective bargaining to continue and allowing the parties to negotiate a resolution. The integrity of the collective bargaining process depends on allowing the parties to reach […]", "ingested_utc": "2025-08-15T17:41:40Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:40Z", "source": "FinancialPost_Business", "title": "Cliffs Inks Multiyear Steel Pacts with US Automakers in Tariff Aftershock", "url": "https://financialpost.com/pmn/business-pmn/cliffs-inks-multiyear-steel-pacts-with-us-automakers-in-tariff-aftershock", "id_key": "5e070df6bbda91f3106780878a2b9a70c211a3946660dfa2a52ef073eba626d3", "summary": "Cleveland-Cliffs Inc. has signed fixed-price contracts to supply steel to multiple US carmakers for up to three years, an unusually long duration that signals the auto industry is guarding against potential inflationary pressures.", "ingested_utc": "2025-08-15T17:41:40Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:40Z", "source": "FinancialPost_Business", "title": "Picton Mahoney Asset Management Announces Monthly Distribution for PICTON Long Short Income Alternative Fund Exchange Traded Fund Units, PICTON Credit Opportunities Alternative Fund Exchange Traded Fund Units, PICTON Core Bond Fund Exchange Traded Fund Units, PICTON Multi-Strategy Alpha Alternative Fund Exchange Traded Fund Units and PICTON Investment Grade Alternative Fund Exchange Traded Fund Units", "url": "https://financialpost.com/globe-newswire/picton-mahoney-asset-management-announces-monthly-distribution-for-picton-long-short-income-alternative-fund-exchange-traded-fund-units-picton-credit-opportunities-alternative-fund-exchange-traded-f-3", "id_key": "163668882aca8baf8375686e2689bb1797109e6f8269db5e9dc7ec3f5968e6b2", "summary": "TORONTO, Aug. 15, 2025 (GLOBE NEWSWIRE) — (TSX: PFIA, PFCO, PFCB, PFAA, PFIG) Picton Mahoney Asset Management announced today that it has declared the August 2025 monthly cash distribution of $0.0226 per unit for the ETF units (“ETF Units”) of the PICTON Long Short Income Alternative Fund. Picton Mahoney Asset Management announced today that it […]", "ingested_utc": "2025-08-15T17:41:40Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:40Z", "source": "FinancialPost_Business", "title": "Alberta Indigenous loan agency pushes back against report it would help finance joint bid for MEG Energy", "url": "https://financialpost.com/commodities/energy/indigenous-loan-agency-pushes-back-meg-bid-report", "id_key": "5ed416b0f35b4f1c1eecd1e14ca674cb3cf4de80ac146846a7fb1f8cbe406dad", "summary": "Alberta Indigenous Opportunities Corp. says it's not in 'the business of participating in mergers and acquisitions'", "ingested_utc": "2025-08-15T17:41:40Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:48Z", "source": "Nikkei_Asia_Top", "title": "Japan's Yakiniku King barbecue chain to open 1st location in Philippines", "url": "https://asia.nikkei.com/life-arts/life/eat-drink/japan-s-yakiniku-king-barbecue-chain-to-open-1st-location-in-philippines", "id_key": "b8bae1480b79dfd5ed949de6391cd8e96274462ae3340ef8fec294f96f036bc8", "summary": "", "ingested_utc": "2025-08-15T17:41:48Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:56Z", "source": "HackerNews_Top", "title": "AI crawlers now solves the Anubis challenges crawling Codeberg", "url": "https://social.anoxinon.de/@Codeberg/115033790447125787", "id_key": "ccbadd48849c67a8200948e9650fc6131697f748eb8f2e87a476f91d2ce0979a", "summary": "Comments", "ingested_utc": "2025-08-15T17:41:56Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T17:41:56Z", "source": "HackerNews_Top", "title": "Is Air Travel Getting Worse? More delays, fewer accidents, and lower prices", "url": "https://www.maximum-progress.com/p/is-air-travel-getting-worse", "id_key": "71407b0a670ea9e08557b3bf6009cd57aadebced2fcd3498ee85fffe9be53771", "summary": "Comments", "ingested_utc": "2025-08-15T17:41:56Z"}
