{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Steam's censorship issues have broken PayPal support in some regions", "url": "https://www.engadget.com/gaming/pc/steams-censorship-issues-have-broken-paypal-support-in-some-regions-214223035.html?src=rss", "id_key": "6dfa7e9fa508b09aa5c613ad995cb31abe0bdadae4b95710c4359862d8bb316d", "summary": "If you've been unable to pay with PayPal on Steam, Valve says the limitation has to do with issues one of PayPal's banking partners has with content on the platform, according to Rock Paper Shotgun . Users have noticed PayPal was disabled in some regions as far back as July , and the issue seems like it might be out of both Valve and PayPal's hands. \"In early July 2025, PayPal notified Valve that their acquiring bank for payment transactions in certain currencies was immediately terminating the processing of any transactions related to Steam,\" Valve writes in a Steam Support page . \"This affects Steam purchases using PayPal in currencies other than EUR, CAD, GBP, JPY, AUD and USD.\" In a statement to Rock Paper Shotgun , Valve further clarified that the bank's decision to withdraw support for Steam transactions through PayPal was made \"regarding content on Steam, related to what we’ve previously commented on surrounding Mastercard.\" Opting to terminate Steam transactions means that PayPal had to be disabled as a payment method for multiple currencies. Engadget has contacted Valve and PayPal for more information on which regions this change impacts, and what other payment options will be available to them. We'll update this article if we hear back. Valve says it want to offer PayPal payments in those unsupported currencies in the future, \"but the timeline is uncertain.\" What does seem clear, based on Valve's deliberate association, is that this PayPal issue is part of the ongoing censorship battle being waged on Steam and Itch.io . Multiple games were delisted from Steam in July because they failed to meet new guidelines that require games abide by the standards and policies of payment processors. Because certain NSFW games didn't, they were removed. Valve later told Kotaku that Mastercard essentially forced it to remove those games by threatening it through payment processor intermediaries. And Mastercard was reportedly pressured to do so in the first place by conservative activists who took issue with certain sexually explicit games on Steam. In this case, a bank that works with PayPal is the weak link, rather than Steam or a payment network, but it's entirely possible that acquiring bank is responding to a similar kind of pressure. This article originally appeared on Engadget at https://www.engadget.com/gaming/pc/steams-censorship-issues-have-broken-paypal-support-in-some-regions-214223035.html?src=rss", "ingested_utc": "2025-08-14T21:48:58Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "US car buyers feel tariff pain as one automaker raises prices", "url": "https://www.thestreet.com/automotive/us-car-buyers-feel-tariff-automaker-raises-prices", "id_key": "dbd09628355dde857f145832318a5f9417ff0b2ddd6f2318caa9e89b6664d98e", "summary": "One U.S. auto industry giant is raising prices, while others are keeping prices flat.", "ingested_utc": "2025-08-14T21:49:07Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "CUPE welcomes Porter cabin crew", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/cupe-welcomes-porter-cabin-crew", "id_key": "ca22ef9819081f54e8e5206018f9c65f2a210cbad7433a06fe955f94d858a929", "summary": "OTTAWA, Ontario — This week, the Canada Industrial Relations Board (CIRB) announced that CUPE has been successful in its campaign to organize approximately 1,200 cabin crew at Porter Airlines. “When workers organize, they win,” said CUPE National President Mark Hancock. “We are honoured to welcome Porter cabin crew to CUPE. We look forward to making […]", "ingested_utc": "2025-08-14T21:49:14Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Skeena Gold & Silver Reports Q2 2025 Financial Results", "url": "https://financialpost.com/globe-newswire/skeena-gold-silver-reports-q2-2025-financial-results", "id_key": "eaa30298cffda6544d29c40494cc373fe6fbe7f7a325c783afc99cf694be367c", "summary": "VANCOUVER, British Columbia, Aug. 14, 2025 (GLOBE NEWSWIRE) — Skeena Resources Limited (TSX: SKE, NYSE: SKE) (“Skeena Gold & Silver”, “Skeena” or the “Company”) reports interim financial results for the quarter ended June 30, 2025. The interim financial statements and management’s discussion and analysis (“MD&A”) are available on Skeena’s website and have been posted under […]", "ingested_utc": "2025-08-14T21:49:14Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Inflation or jobs: Federal Reserve officials are divided over competing concerns", "url": "https://financialpost.com/pmn/inflation-or-jobs-federal-reserve-officials-are-divided-over-competing-concerns", "id_key": "6d80dd118317a818c0a203a107753f39f8d5261224adc3f4177affb48f24af98", "summary": "WASHINGTON (AP) — One major question will be front and center for Federal Reserve policymakers as they prepare for an annual conference in Jackson, Wyoming next week and a crucial policy meeting in September: Which is a bigger problem for the economy right now, stubborn inflation or slower hiring? Weak job gains since April have […]", "ingested_utc": "2025-08-14T21:49:14Z"}
