{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:10Z", "source": "BBC_Business", "title": "TikTok to lay off hundreds of UK content moderators", "url": "https://www.bbc.com/news/articles/cgjyp48dp21o?at_medium=RSS&at_campaign=rss", "id_key": "bf374b75848bcc85593cc33190666e73c0a9e3191d3f11adcb5e04d07c81fe7e", "summary": "The firm says it's planning to relocate work to its other offices in Europe and invest more in AI.", "ingested_utc": "2025-08-22T13:35:10Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:12Z", "source": "Guardian_Business", "title": "Fears grow over impact of ONS data reliability on Rachel Reeves’s budget", "url": "https://www.theguardian.com/uk-news/2025/aug/22/fears-grow-over-impact-of-ons-data-reliability-on-rachel-reeves-budget", "id_key": "7bd0b32b392c1493b4ab36ef0042e0006fda20c1f35075d860b1a61b753b463d", "summary": "Troubles at UK statistics body are muddying economic picture for Treasury and spending watchdog, sources warn Deep problems at the UK’s statistics agency with the quality of its data are piling pressure on officials in the run-up to the autumn budget, sources have told the Guardian. Staff at the Treasury and its independent spending watchdog are struggling to get a clear picture of the economy because of troubles at the Office for National Statistics (ONS) with producing reliable numbers. Continue reading...", "ingested_utc": "2025-08-22T13:35:12Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:12Z", "source": "Guardian_Business", "title": "Russia orders state-backed Max messenger app to be pre-installed on new phones", "url": "https://www.theguardian.com/technology/2025/aug/21/russia-max-app-phones", "id_key": "0208d4f464d04863100ea6cb9f74260d13c58671dc9ea7632116ce2cf2196113", "summary": "Critics say Max, a WhatsApp rival, could be used to track users, though state media says it is not a spying app A Russian state-backed messenger application called Max, a rival to WhatsApp that critics say could be used to track users, must be pre-installed on all mobile phones and tablets bought in the country starting next month, the Russian government said on Thursday. The decision to promote Max comes as Moscow, locked in a standoff with the west over Ukraine, is seeking greater control over the internet. The Kremlin said in a statement that Max, which will be integrated with government services, would be on a list of mandatory pre-installed apps on all “gadgets”, including mobile phones and tablets, sold in Russia from 1 September. The firm behind Max said this week that 18 million users had downloaded its app, parts of which are still in a testing phase. Continue reading...", "ingested_utc": "2025-08-22T13:35:12Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:12Z", "source": "Guardian_Business", "title": "Guzman y Gomez keeps expansion on the menu despite increased US losses rattling investors", "url": "https://www.theguardian.com/australia-news/2025/aug/22/guzman-y-gomez-keeps-expansion-on-the-menu-despite-increased-us-losses-rattling-investors", "id_key": "b945224aa8b89f23cc60b93fac63e502f9a14dfbb004b28691926de66f773b7a", "summary": "Shares in Sydney-based restaurant chain plummet by more than 20% despite global sales passing $1bn, as co-CEOs say ‘we are seeing momentum’ in American market Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Mexican-themed chain Guzman y Gomez plans to open at least 15 restaurants in the US despite doubling its losses on its “relentless” bid to expand into the competitive American market. Despite its struggles in the US, the company recorded more than $1bn in sales across its network for the first time and more than doubled its net profit to $14.5m in the 12 months to July – its first year on the Australian Stock Exchange (ASX). Continue reading...", "ingested_utc": "2025-08-22T13:35:12Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "No Putin-Zelenskyy meeting planned until agenda is agreed, Russia’s foreign minister says – Europe live", "url": "https://www.theguardian.com/world/live/2025/aug/22/ukraine-war-latest-updates-zelenskyy-putin-trump-news", "id_key": "f3b779bf5f3b69871c1e1a3e2cf21648c1c400fe66ed977a231ec6f3abf03571", "summary": "Sergei Lavrov also said Russia had agreed to be flexible on a number of points raised by US president Donald Trump Speaking alongside Zelenskyy, Nato’s Rutte said the alliance’s support for Ukraine remained “unwavering” and “continues to grow,” with more plans to provide Nato funding to ensure “a crucial flow of lethal US weapons to Ukraine.” He lauded the outcome of Monday’s talks at the White House, saying that Trump made it clear “the United States will indeed be involved in providing security guarantees for Ukraine.” “ Robust security guarantees will be essential , and this is what we are now working to define, so that when the time comes you for you to enter that bilateral meeting, you have the unmistakable force of Ukraine’s friends behind you, ensuring that Russia will uphold any deal, and will never ever again, attempt to take one square kilometre of Ukraine.” “ The Budapest Memorandum and Minsk did not provide those security guarantees. So we clearly know what it should not be, and we are now working together – Ukraine, the Europeans, the United States – to make sure that the security guarantees are of such a level that Vladimir Vladimirovich Putin, sitting in Moscow, will never, ever try to attack Ukraine again.” Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "Hundreds of TikTok UK moderator jobs at risk despite new online safety rules", "url": "https://www.theguardian.com/technology/2025/aug/22/tiktok-uk-moderator-jobs-at-risk-despite-new-online-safety-rules", "id_key": "ba3d39085e0091eb1ef5e3142c990c3a387dfbe4e4b098d2618f85c1305ddafb", "summary": "Cuts in trust and safety team part of switch towards artificial intelligence by social media app TikTok has put hundreds of UK content moderators’ jobs at risk, even as tighter rules come into effect to stop the spread of harmful material online. The viral video app said several hundred jobs in its trust and safety team could be affected in the UK, as well as south and south-east Asia, as part of a global reorganisation. Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "UN human rights agency says Gaza famine is direct result of Israel’s actions and may amount to war crime – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/22/famine-benjamin-netanyahu-palestine-gaza-israel-war-latest-updates", "id_key": "277dfe82a5ffabaf73c1d18d44b16c585fe337d295de916d635b828f185f456d", "summary": "A report by Forensic Architecture and the World Peace Foundation says Israel has dismantled the proven model of aid distribution Mothers in Gaza have resorted to using legume water and herbs as alternative to infant milk amid Famine , charity warns Dr. Ra’ed Al-Baba, who works at Al Awda Hospital run by ActionAid’s partner Al-Awda, said usage of alternatives to infant milk had “catastrophic” consequences. There are mothers who resort to using legume water, herbs, and other alternatives to infant milk because of the severe shortage. These methods carry catastrophic risks, causing gastroenteritis, food poisoning, delayed growth, severe anaemia, and even the inability to move. We have seen cases of extreme dehydration from polluted water mixed with these substitutes. This is not survival, this is slow death.” Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "Government to appeal against court ruling blocking asylum seekers being housed at Epping hotel – UK politics live", "url": "https://www.theguardian.com/uk-news/live/2025/aug/22/asylum-hotels-labour-immigration-protests-conservatives-kemi-badenoch-keir-starmer-uk-politics-live", "id_key": "4667dda1e7c4c1cdaf2afb964030f7cd035e02c607f18a4f1a71adf7c5033c40", "summary": "Security minister says Labour will close asylum hotels by the end of this parliament but it needs to be done ‘in a managed and ordered way’ In an interview on BBC Radio Scotland’s Good Morning Scotland programme on Friday, MSP Jeremy Balfour who has resigned from the Scottish Conservatives ( see 9.13am BST ), said he feels the party has “lost its way in Scotland” and “I don’t think it represents true Conservative values”. According to the PA news agency, when asked if Scottish Tory leader Russell Findlay is the right person for the job and whether he should stay in the post, he said: Clearly I’m no longer a member of the party so that’s no longer a decision for me to make. I get on very well as an individual with Russell, I think he’s a good individual. Whether he’s the person to lead the Scottish Conservatives is obviously for MSPs, for the membership, to decide. What I’m very clear about is that those with disabilities, other minorities and the people of Lothian need a voice for people to hear what we require within our country. I’m not sure any party is actually offering that at the moment but whether I stand or not I’ll come to a view in the next few weeks. It’s the party that’s moved, not me. We are disappointed to read these comments but grateful for Jeremy’s service and wish him well. The Scottish Conservatives, under Russell Findlay’s leadership, recognise that many people feel completely disconnected from politics. It is absolutely critical that our party continues to champion commonsense Conservative values and policies that focus on the issues of concern to hard-working Scots. Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "‘A nuisance and an eyesore’: hire ebikes accumulate at London border between rival firms", "url": "https://www.theguardian.com/uk-news/2025/aug/22/hire-ebikes-accumulate-london-border-rival-firms", "id_key": "0a599e37eb592274db819069339b8823e7fb4a6c727e9a00fd7587281b053b03", "summary": "Chiswick Bridge now a frontline in turf war as Richmond and Hounslow councils have licensed different operators Scattered across pavements, propped against trees and toppled over in bushes, dozens of electric Lime bikes have begun to dominate a 200-metre stretch of road just south of Chiswick Bridge. This is the point where the motors on the hired bikes abruptly stop functioning as they cross the boundary between Richmond and Hounslow, a frontline in what residents describe as a turf war between rival companies. While ebikes for hire have become an increasingly popular mode of transport in London, fractured regulation means customers can ride them through some boroughs with ease but find that in others they cannot ride or park them. Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "FBI director says ‘no one is above the law’ amid raid on John Bolton’s home – live updates", "url": "https://www.theguardian.com/us-news/live/2025/aug/22/donald-trump-administration-federal-reserve-republicans-democrats-us-politics-live", "id_key": "a5e6808862400c50591e428a95c0223b043d782cc91d4b29902440f9537907ce", "summary": "Federal search of home owned by Trump’s ex-national security adviser turned critic is part of an investigation involving the handling of classified documents, AP reports FBI raids home of John Bolton, Trump’s ex-national security adviser As we bring you more information about the reported FBI raid on John Bolton’s Maryland home , it’s worth pointing out that Bolton was stripped of his security clearance when Trump started his second term in office. The president also got rid of Bolton’s government detail, despite being the target of an assassination plot due to Bolton’s criticism of the Iranian regime. Bolton served as Trump’s third national security advis er in his first term in office, but has since become a vocal critic of the president . Less than an hour ago, a post from Bolton’s X account critiqued the state of negotiations between Russia and Ukraine. “Russia has not changed its goal: drag Ukraine into a new Russian Empire,” he wrote. “Meanwhile, meetings will continue because Trump wants a Nobel Peace Prize, but I don’t see these talks making any progress.” Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "Florida removes rainbow crosswalk honoring victims of Pulse nightclub shooting", "url": "https://www.theguardian.com/us-news/2025/aug/22/florida-pulse-rainbow-crosswalk-memorial-desantis", "id_key": "18bac91952d6803201422cfcd34fae89c5102e4eb44b13604b94cd3e1dd12970", "summary": "Removal of crosswalk honoring 49 people killed in 2016 is latest anti-LGBTQ+ move by DeSantis administration A rainbow crosswalk designed to honor victims of a mass shooting at a LGBTQ+ nightclub in Orlando was painted over by the Florida state government on Wednesday night. The abrupt erasure of the memorial street crossing, which honored the 49 people killed at the Pulse nightclub in 2016, was described as a “scandalous act of betrayal” by one Florida state senator. Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:13Z", "source": "Guardian_World", "title": "FBI raids home of John Bolton, Trump’s ex-national security adviser", "url": "https://www.theguardian.com/us-news/2025/aug/22/fbi-raids-john-bolton-house", "id_key": "12200ee2c371e6fb36c3a796478cc902b15174c618143a78ec6d87a82569bbe4", "summary": "Bolton’s home reportedly part of investigation into classified documents as FBI director warns ‘no one is above law’ US politics live – latest updates The FBI raided the home of Donald Trump ’s former national security adviser turned critic John Bolton on Friday morning. The federal search of Bolton’s house in the Washington DC area was as part of an investigation involving the handling of classified documents, the Associated Press reported, citing a person familiar with the matter. Continue reading...", "ingested_utc": "2025-08-22T13:35:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:30Z", "source": "BitcoinMagazine", "title": "Are Bitcoin Treasury Companies Still a Smart Investment in 2025?", "url": "https://bitcoinmagazine.com/markets/bitcoin-treasury-companies-investment", "id_key": "8ec6dc2290fb6d3ce3500234daa5724b42550bab29f5790bfa5011a95e2b55a3", "summary": "Bitcoin Magazine Are Bitcoin Treasury Companies Still a Smart Investment in 2025? Bitcoin has recently set new all-time highs, yet many of the leading Bitcoin treasury companies have been underperforming significantly. This post Are Bitcoin Treasury Companies Still a Smart Investment in 2025? first appeared on Bitcoin Magazine and is written by Matt Crosby .", "ingested_utc": "2025-08-22T13:35:30Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:32Z", "source": "CryptoSlate", "title": "Nasdaq listed BTC treasury company AsiaStrategy now sells luxury watches in Bitcoin", "url": "https://cryptoslate.com/nasdaq-listed-asiastrategy-now-sells-luxury-watches-in-bitcoin-after-10m-raise/", "id_key": "4dc45835018c1ae2eb48897e5479d5d69860f590d24836e610eb5ae203eb01f5", "summary": "Top Win International changed its corporate name to AsiaStrategy on Aug. 22 in Hong Kong, kept its Nasdaq ticker SORA, and began accepting Bitcoin for watch sales, the company said. The move follows a months-long restructuring that brought Sora Ventures into Top Win’s public company structure in May, a path that avoided a separate listing […] The post Nasdaq listed BTC treasury company AsiaStrategy now sells luxury watches in Bitcoin appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T13:35:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:33Z", "source": "CryptoBriefing", "title": "Eric Trump plans to attend key Metaplanet vote on Bitcoin capital strategy", "url": "https://cryptobriefing.com/eric-trump-metaplanet-shareholder-voting/", "id_key": "169461da99d9927371489412330539f2a14cdf1c7951276349364e9721ca7e37", "summary": "Eric Trump's involvement in Metaplanet's Bitcoin strategy highlights growing political influence in crypto finance, potentially reshaping market dynamics. The post Eric Trump plans to attend key Metaplanet vote on Bitcoin capital strategy appeared first on Crypto Briefing .", "ingested_utc": "2025-08-22T13:35:33Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:33Z", "source": "CryptoBriefing", "title": "Philippines considers establishing a national Bitcoin reserve", "url": "https://cryptobriefing.com/philippines-bitcoin-reserve-legislation/", "id_key": "c3cf4ecd7b2874a006b935f1f1eb9eda75d19926de822b24b8d96489ec008134", "summary": "The proposal could enhance financial resilience and diversify reserves, potentially influencing other nations to consider similar strategies. The post Philippines considers establishing a national Bitcoin reserve appeared first on Crypto Briefing .", "ingested_utc": "2025-08-22T13:35:33Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:34Z", "source": "Protos", "title": "Crypto fugitive busted in Seoul after tossing cigarette", "url": "https://protos.com/crypto-fugitive-busted-in-seoul-after-tossing-cigarette/", "id_key": "6b2c590680bae3ad0cee1ef767dacb3f697c0acd0ed0ac5a4bdc5a3e7d00060b", "summary": "Police arrested the 60-year-old crypto scammer after he was stopped for dropping a cigarette and tried to bribe his way out of trouble. The post Crypto fugitive busted in Seoul after tossing cigarette appeared first on Protos .", "ingested_utc": "2025-08-22T13:35:34Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:35Z", "source": "CryptoNews", "title": "SharpLink Approves $1.5B Buyback as It Leans on Ethereum Holdings", "url": "https://cryptonews.com/news/sharplink-approves-1-5b-buyback-as-it-leans-on-ethereum-holdings/", "id_key": "ef9c8e716d37eccc9630667ba94e6dabe8e1a256008fe924edca42f3beb1fc64", "summary": "SharpLink Gaming, Inc. (Nasdaq: SBET), a gaming technology firm and one of the world’s largest corporate holders of Ether (ETH), announced that its Board of Directors has approved a stock buyback program of up to $1.5 billion. The post SharpLink Approves $1.5B Buyback as It Leans on Ethereum Holdings appeared first on Cryptonews .", "ingested_utc": "2025-08-22T13:35:35Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:35:36Z", "source": "CoinJournal", "title": "TON gains momentum with $780 million treasury and Ledger staking integration", "url": "https://coinjournal.net/news/ton-gains-momentum-with-780-million-treasury-and-ledger-staking-integration/", "id_key": "da00b4f0c14e3845acf71d1cdb082f1d4fb3f48052571eb61f8204c76e7c48f1", "summary": "Verb holds $713 million in Toncoin and $67 million in cash reserves. Ledger Live integration allows TON staking from just 10 tokens. TON Sharpe ratio turned positive in August, indicating momentum. The Open Network (TON) has seen a surge in institutional and retail interest, marked by a series of developments that could strengthen its position […] The post TON gains momentum with $780 million treasury and Ledger staking integration appeared first on CoinJournal .", "ingested_utc": "2025-08-22T13:35:36Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:31Z", "source": "NYTimes_World", "title": "Global Monitors Confirm Famine in Part of Gaza. What Does That Mean?", "url": "https://www.nytimes.com/2025/08/22/world/middleeast/gaza-famine-what-to-know.html", "id_key": "4c38a8e265c70764696250ba79f14c1012048087315c8a197e2653ee159f688b", "summary": "A panel of food security experts have determined that part of Gaza is suffering from famine, and that it could spread to the rest of the enclave within weeks.", "ingested_utc": "2025-08-22T13:37:31Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:31Z", "source": "NYTimes_World", "title": "Trump’s Cuts May Spell the End for America’s Only Antarctic Research Ship", "url": "https://www.nytimes.com/2025/08/22/climate/nathaniel-b-palmer-ship-budget-cuts-polar-science.html", "id_key": "4a948f0b9839b1ab6c816800affd636f64f7faeda1fbe96aaea0625d24bf7469", "summary": "The decommissioning would leave the United States with no icebreaker to study the southern seas and cede scientific leadership to rival countries like China.", "ingested_utc": "2025-08-22T13:37:31Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:42Z", "source": "FT_Home", "title": "FBI raids home of former Trump national security adviser John Bolton", "url": "https://www.ft.com/content/b0b09037-1ab7-4c48-9a09-e173b33551c7", "id_key": "f7d0c7a3f85621bd250a1632bc7bf6c2587d91a610bdf1f6da4ab0ace11779b1", "summary": "Foreign policy hawk has emerged as a staunch critic of the US president", "ingested_utc": "2025-08-22T13:37:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:42Z", "source": "FT_Home", "title": "UK health secretary ends talks with pharma groups on NHS drug pricing", "url": "https://www.ft.com/content/d3d991a4-f789-4448-a4d9-bf1716c2ebdb", "id_key": "bd72f722ede38f436faf9f731600ed82c3b0b69d80942731b6b543d7a26fc4a5", "summary": "Wes Streeting terminates meetings after lobby group refuses to accept offer", "ingested_utc": "2025-08-22T13:37:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:43Z", "source": "FT_Markets", "title": "EU speeds up plans for digital euro after US stablecoin law", "url": "https://www.ft.com/content/8ad60169-d1e5-4d2c-b928-d53d668f0ec6", "id_key": "58ca01d6d2855430307293f7c79338a20cc3beb0f04f62acfcf5cb81dfc6b1cb", "summary": "Concern over competitiveness raises possibility of digital currency using public rather than private blockchain", "ingested_utc": "2025-08-22T13:37:43Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:58Z", "source": "TheVerge_All", "title": "Belkin’s first 25W Qi2 chargers power up multiple devices", "url": "https://www.theverge.com/news/763659/belkin-qi2-2-25w-wireless-charging-ultracharge-pro", "id_key": "41283bd4e2bef8fd88ebee6c28892b0efc62e8838ae87beaf8b6c85ea78e3717", "summary": "After announcing certification from the Wireless Power Consortium (WPC) a month ago, Belkin is now debuting its first three devices that support the Qi2.2 standard and faster 25W wireless charging speeds. The most expensive and elaborate of the new accessories is the $129.99 Belkin UltraCharge Pro 3-in-1 Magnetic Charging Dock, which is a multi-device wireless […]", "ingested_utc": "2025-08-22T13:37:58Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:58Z", "source": "TheVerge_All", "title": "Google made it easier to edit your Drive videos", "url": "https://www.theverge.com/news/764221/google-drive-video-editing-vids-shortcut", "id_key": "0537ba4dced1379aabb8737350c7f17001c4baa62f468c8a18527810242ec699", "summary": "Google has added a Drive shortcut for Workspace users that provides a quicker way to edit videos without having to manually open them in Google Vids. When previewing a video saved in their Drive, users will now see an “Open” button at the top right corner that automatically opens the file in Google Vids, where […]", "ingested_utc": "2025-08-22T13:37:58Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:58Z", "source": "TheVerge_All", "title": "Netflix’s Long Story Short is a more human successor to BoJack Horseman", "url": "https://www.theverge.com/tv-reviews/763955/long-story-short-review-netflix-bojack-horseman", "id_key": "efcee99bd49a989988f875ec2f8afb0b70304263cab059f8cec545e2ba9d3d44", "summary": "A big reason that BoJack Horseman worked so well was contrast. It took place in a silly world of talking animals, and used that to explore deep human drama in relatable ways. It's part of what made its oddball jokes work so well, as they helped balance out the darker moments that explored topics like […]", "ingested_utc": "2025-08-22T13:37:58Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:37:58Z", "source": "TheVerge_All", "title": "Digg’s new app is basic, but a great start", "url": "https://www.theverge.com/apps/763689/digg-mobile-ios-android-app-relaunch", "id_key": "8dde9ab2607b62a1e28569bbda721af3cccd40eaf23939f320e9d0a4ea699585", "summary": "Digg is making a comeback. With the backing of people like Digg cofounder Kevin Rose and Reddit cofounder Alexis Ohanian, Digg has ambitions to once again be the homepage of the internet. The revival is still in its very early days - the platform is still invite-only - but Digg launched its new mobile apps […]", "ingested_utc": "2025-08-22T13:37:58Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:00Z", "source": "WIRED_All", "title": "Rad Power Bikes RadRunner Max Review: Faster and Safer Than Ever", "url": "https://www.wired.com/review/rad-power-bikes-radrunner-max/", "id_key": "978d51f27c7e54b77c0ddab4e3250d59d299c321fba60f0fac50911ef6baea1d", "summary": "Rad Power Bikes’ newest high-end RadRunner Max has been upgraded to be faster and safety features, like radar car detection.", "ingested_utc": "2025-08-22T13:38:00Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:01Z", "source": "Engadget_All", "title": "NVIDIA reportedly stops production of H20 AI chips", "url": "https://www.engadget.com/ai/nvidia-reportedly-stops-production-of-h20-ai-chips-133020132.html?src=rss", "id_key": "552b82ade512a2d22a46f0d8cff5f3e0ec91865546eb2a7379273c293234f258", "summary": "NVIDIA has reportedly asked its suppliers to halt production related to its H20 AI chips for the Chinese market. According to The Information , the company told Arizona-based Amkor Technology and Samsung Electronics to put a pause on their work for the H20. Amkor produces advanced packaging for the H20 chips, while Samsung supplies memory for NVIDIA. Reuters has also reported that NVIDIA asked Foxconn, which is in charge of backend processing for the chip, to suspend its work. \"We constantly manage our supply chain to address market condition,\" the company told CNBC in a statement when asked to comment about the supposed production pause. The US government had blocked NVIDIA from selling the H20 in China back in April, out of concerns that the country could use it to develop AI tech for its military. It allowed the company to resume selling the chip in China by July, reportedly after closing a deal that would give it 15 percent of the sales. But China didn't welcome the H20 with open arms. Local regulators instructed the biggest Chinese tech companies, including ByteDance and Alibaba to stop new orders for H20 chips, citing security concerns. The Cyberspace Administration of China talked to NVIDIA, claiming that AI experts had revealed that the chips could be tracked and controlled remotely. NVIDIA CEO Jensen Huang had admitted that Chinese regulators asked him about the supposed \"backdoor\" and said that he made it clear it didn't exist. \"Hopefully the response that we've given to the Chinese government will be sufficient,\" Huang said. A recent report by the Financial Times , however, claimed that Chinese authorities didn't issue warnings against using NVIDIA chips just because of security concerns. Apparently, they found certain remarks by US commerce secretary Howard Lutnick \"insulting.\" When the US allowed shipments of the H20 to China again, Lutnick said during an interview: \"We don't sell them our best stuff, not our second best stuff, not even our third best. The fourth one down, we want to keep China using it... You want to sell the Chinese enough that their developers get addicted to the American technology stack.\" The H20 is currently the most advanced AI chip NVIDIA can sell in the Chinese market, but the company is reportedly developing a more powerful product. It will be based on the company's Blackwell architecture, Reuters previously reported, and will be capable of half the computing power of NVIDIA's Blackwell Ultra GPUs. This article originally appeared on Engadget at https://www.engadget.com/ai/nvidia-reportedly-stops-production-of-h20-ai-chips-133020132.html?src=rss", "ingested_utc": "2025-08-22T13:38:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:01Z", "source": "Engadget_All", "title": "My favorite Google AI features from the Pixel 10 launch", "url": "https://www.engadget.com/ai/my-favorite-google-ai-features-from-the-pixel-10-launch-130023979.html?src=rss", "id_key": "c36cf229a20fae4a88104f675dbea357a4a5a35a6eeebfdef6052dc751c402ac", "summary": "The Made By Google event was not only a showcase of Google’s latest Pixel hardware, but a launchpad for many new AI features. I’m typically skeptical of the current generation of AI, but as I checked out the new software across various demo sessions, I found myself more and more intrigued. It seems like Google, along with Apple and Samsung, has been working on making these AI-powered updates more helpful in a way that might actually make our lives easier or simply more fun. There wasn’t enough time to write up every single one of them, so I’ve put a few of my favorites in this story to give you a better sense of what to expect when the Pixel 10 series hits retail shelves later this month. Spoiler alert: Many of these have to do with voice and calls — an area Google has historically excelled at. The Recorder app can generate backing music I have long been enamored with Google’s Recorder app . It started with the on-device transcription that made getting quotes from my interviews easy and relatively secure. But when Apple introduced a multi-track recording function to its Voice Memos app , I quickly jumped ship. While the iOS recorder has inferior transcription in terms of accuracy and readability, the fact that I could basically record a duet with myself seriously appealed to the musical theater geek in me. I played both Elphaba and Glinda, crooning their parts from “For Good” into my iPhone. But when Google’s senior director of product management for Pixel software Shenaz Zack told me the Pixel 10’s recorder app would add AI-generated music to your singing, I went silent in slight disbelief. I spent much of my youth ripping karaoke tracks from YouTube videos, looking up “minus one” or “backing tracks” or “instrumentals only” on various download platforms. My friends and I were aspiring performers, looking to mix our own covers of popular songs, and a tool that would generate backing music to our voice tracks would have been a dream come true. Honestly it kind of still is. Zack walked me through the process twice — on my first try I sang a verse and part of the chorus of “Golden” from the Kpop Demon Hunters soundtrack. I giggled self-consciously at the end, before Zack hit stop. As it recorded, the app actually showed a tag that indicated it knew I was singing, and when we selected the recording after, a chip appeared saying “Create and add music.” Tapping that brought up a panel titled “Choose a vibe to create music” with two sections: Featured vibes and Your vibes. Under the first one, the options were “Chill beats,” “Cozy,” “Dance party,” “Rainy day blues,” “Romantic” and “Surprise me.” On my second attempt, when I rushed through a rendition of the all-time banger “Mary Had a Little Lamb,” the app displayed a warning at the bottom that said “The beat might not match well if the recording is short.” I chose Dance Party, hit next, and waited a minute or so while Recorder went to work. The animation at the top said the system was analyzing the audio, identifying the rhythm, locking onto the beat and harmonizing the track before delivering the result. I don’t quite know what I was expecting, but I can say that those who were at all concerned about digital rights management have nothing to worry about. The music that Google generated for “Golden” sounded nothing like the original, and while it did make my voice sound less lonely and made for a more complete track, I felt like I needed a few more adjustments to feel satisfied with it. As for “Mary Had a Little Lamb,” the result was as generic as expected for an AI-generated soundtrack to a very basic nursery rhyme. To Google’s credit, what came out seemed to be in the right key and rhythm, and I certainly will need much more time playing around with this to see if tweaking the settings will help. I also wanted to point out that the generated music also stopped as my singing stopped, so the giggling I mentioned earlier was not scored. Although this feature did not live up to my (admittedly unrealistic) fantasy, I do think it’s a fun use of AI and seems harmless. It’s not going to be a mainstay of most people’s daily routines, although Zack did say that a large percent of people actually used Recorder for singing. This update could certainly make for a nice little dose of musical creativity. View this post on Instagram A post shared by Engadget (@engadget) Voice Translate made it sound like I was speaking German I had more concerns around the Voice Translate feature that was supposed to make you or your caller sound like you were speaking in a different language. According to Google, the goal is to “break down language barriers during phone calls.” When I asked Zack why the company felt the need to make the voice resemble the caller’s, she said it was about personal connection. Zack explained that her parents live in India, and though they speak English, they’re not very fluent. That makes for some difficulty when they call Zack’s kids. Simply adding a robotic voice that’s translating between the grandparents and the children wouldn’t feel right, either. I was initially skeptical that fully replacing the caller’s original voice with a translated version would help, but after a few demos, I am certainly swayed. To be clear, the person placing the call has to do so from a Pixel phone for Voice Translate to work. Once you choose Voice Translate from the Call Assist submenu, you’ll have to choose a language. When the call is connected, the system will say to both parties that the “Call is translated by Google AI in each speaker’s voice. Audio is not saved.” I tried this out a few times with a Google representative who spoke German, whom we will refer to as “Uncle Tim” to make it easier for me to describe this demo. Each time he spoke, I could hear a couple seconds of his voice in German, before a chime played and the version in the original language became softer. What sounded like a dubbed actor playing Uncle Tim came on and conversed in English, complete with realistic replications of pitch, rhythm and expression. I also could hear feedback when I talked on the call, so I heard myself speaking German on the other end. It was truly strange, because it sort of did sound like me. One of my closest friends lives in Germany, and has had to put up with my attempts to learn German for more than 10 years. I immediately wanted to try Voice Translate on her to see if she would believe I had suddenly become fluent (but of course, I’d have to figure out how to get her to ignore the warnings that Google AI was at work). I’ll be honest, the experience wasn’t perfect. Not only were the translations sometimes off (some of what Uncle Tim said in English didn’t make sense), the generated voices seemed less like a complete replication of the caller and more like a novice dubbing artist. That’s not a bad thing, since I was very concerned about impersonation being a problem. To that end, Zack said Google was deliberate about the implementation. She reminded me of the “ducking” that was in place, which is when the original speech is still audible in the first few seconds and then softer throughout. Like the original audio is ducking below the dubbed voice — get it? And I remembered that while the AI voice might sound sort of like me, it isn’t designed to simply make up things I’m saying — it’s just translating the content. I’m the one that decides whether to go off and curse out a relative and have that conveyed in their native tongue, for example. Of course, there may still be bugs and quirks to work out. I was amused by the various accents that came through in the English-speaking version of Uncle Tim. At first he sounded American, but in subsequent conversations he took on an Australian accent. All this is powered by the Pixel 10’s Tensor G5 chip and processed on-device using “a new codec and semantic understanding,” according to Zack, to understand the speaker’s vocal expressions. For now, I see what Google is going for and cannot wait to call my friend in Frankfurt. At launch, Voice Translate will support translating to or from English with Spanish, German, Japanese, French, Hindi, Italian, Portuguese, Swedish, Russian and Indonesian. Google/Screenshot by Engadget Magic Cue surfacing your flight info when you call your airline is helpful The recorder app, translation and expressive-sounding AI are areas Google has long proven expertise in. And lest we forget, the company has also been a pioneer in suggesting actions from your emails and adding events to your calendar by scanning your inbox. With the Pixel 10’s Magic Cue feature, Google is basically bringing this functionality to your texts and calls. While Magic Cue can helpfully show shortcuts within the Messages app to help you answer questions about reservations or send photos from recent trips, I’m most into one specific aspect. When you call an airline to make changes to a flight, for instance, the Pixel 10 can pull up your reservation information and display it within the call, so you won’t have to open your email, and search for the booking confirmation to have your reference number ready. Sure, it might only save you seconds, but it’s so much easier, and Google already does a version of this in your inbox. I would love to see this particular feature expand and cover other types of appointments so you can quickly get codes or other identifying information during calls to, say, your plumber, doctor, insurance provider and more. Camera and photo features continue to improve Google continues to improve upon areas it’s led the way in, and photography remains a strength of Pixel phones. The company was one of the first major players to use its algorithmic prowess to dramatically improve the quality of low light photos and with the Pixel 10 Pro it again uses computational processing to deliver superior images. Pro Res Zoom on the new phone did manage to produce some surprisingly clean pictures of faraway buildings, at least in my demo at Google’s Manhattan office. I was impressed by how clear the lines on the underside of a skyscraper that we zoomed to a 100x level on looked. Google was also careful to clarify that Pro Res Zoom won’t work on people, and that distant text may look odd. \"We've tuned Pro Res Zoom to minimize hallucinations, however they may still occur — especially with faraway text. Additionally, when Pro Res Zoom detects a person in the scene, we use a different enhancement algorithm that prevents inaccurate representations,\" according to Google. in those situations, the algorithm will drop to Super Res Zoom quality. Depending on which Pixel phone you’re using, Super Res Zoom delivers up to either 20x or 30x zoom. In the results I saw, people standing on a deck at the top of a tower just seemed a bit pixelated compared to the building’s facade, and the effect wasn’t jarring or even really noticeable until I zoomed in. But that might be because they were a tiny part of the picture — I imagine things would look different if a person was the main subject in a scene. As someone who enjoys composing pictures, I didn’t think the Camera Coach feature would do anything for me. But I was pleasantly surprised that I actually liked some of the AI’s proposed framing options. I still don’t think I’ll use this much in the real world, but it might help other people who want tips on photography. I was initially nonplussed about the new Photos feature that lets you tell the AI how to edit your pictures, but after a brief demo I came around. Simply telling Gemini to “turn that red dress blue” or “get rid of the people in the background” was not only easier, but suprrisingly effective. I also want to point out that Google also made tweaks to the Guided Frame feature in its camera app that helps those who are blind or visually impaired know what is in the scene. It now uses Gemini models, which should help with object recognition. Finally, it’s worth calling out the support for C2PA content authenticity initiative . Google is building this into the Photos app, where metadata will show whether or not AI was used in a picture. The Pixel 10 phones will be the first to implement the new industry-standard Content Credentials (CR) within its native camera app, and companies like Adobe, Amazon, Google, Meta, Microsoft, OpenAI are all part of the initiative. An assortment of other updates worthy of mention Those were just a slice of the new AI-related features I was impressed by at my recent demos ahead of Google’s event this week. But there are quite a few more I found promising, like visual overlays in Gemini Live and the new Pixel Journal app. I didn’t spend as much time with either, but they worked in my brief demos. So did the “take a message” feature that will send transcriptions of voicemails to you, which seems like a much better way to be alerted to a missed call than a hidden section of the Phone app. I’m not yet sold on the Daily Hub, which is basically an updated version of the existing pages that sit to the left of the home page showing relevant actions and articles you might want to explore. I’m fairly intentional when it comes to looking for things to consume, and have specific apps I prefer for doomscrolling (Reddit over everything), so I’m not sure Daily Hub will suit me. Still, the fact that I liked the bulk of the new AI features coming to the Pixel 10 series is pretty significant. Of course, I will still reserve judgement until I can spend more time with them in the real world, and hope to write reviews of some of them. But it’s clear from my time with demos of the Pixel 10 that Google has been pretty thoughtful about how it imbues its hardware with AI, and I hope its competitors take notes. This article originally appeared on Engadget at https://www.engadget.com/ai/my-favorite-google-ai-features-from-the-pixel-10-launch-130023979.html?src=rss", "ingested_utc": "2025-08-22T13:38:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:01Z", "source": "Engadget_All", "title": "Trump administration official says some CHIPS Act companies won't need to give up equity", "url": "https://www.engadget.com/big-tech/trump-administration-official-says-some-chips-act-companies-wont-need-to-give-up-equity-130041299.html?src=rss", "id_key": "eaceba45e62564c8140c4985448d5e0f51dad5bbec563dfb294071f0b7bbc47e", "summary": "Last week, the Trump administration said it might take a stake in Intel in exchange for the $10.86 billion in federal grants the company is receiving from the Chips and Science (CHIPS) Act. However, not all companies receiving funds under the same program will need to give up equity, The Wall Street Journal has reported. Companies like TSMC and Micron that increased their US investments won't have any additional obligations, according to a government official familiar with the matter. Ealier, commerce secretary Howard Lutnick appeared to royally screw NVIDIA with comments about the company's H20 AI chips, and may have also rubbed chip giant TSMC the wrong way. \"The Biden administration literally was giving Intel [money] for free, and giving TSMC money for free, and all these companies, just giving them money for free,\" he told CNBC on Tuesday. \"Donald Trump turns that into saying, 'Hey, we want equity for the money. If we’re going to give you the money, we want a piece of the action.'\" However, TSMC may have noticed the Intel equity kerfuffle and executives reportedly held preliminary discussions about handing back subsidies if the US government asks to become a shareholder, according to the WSJ 's sources. TSMC was awarded $6.6 billion for its Arizona plant that started producing chips late last year for Apple and others. However, the company recently said it would invest another $100 billion over the next four years to build three more fabrication plants, two advanced packaging facilities and a major research and development center. Because of that extra investment, the Trump administration won't ask for a piece of TSMC or Micron (which also expanded its US facilities in Idaho, New York and Virginia). \"The Commerce Department is not looking to take equity from TSMC and Micron,\" an unnamed official said. In any case, attempts by the US government to take equity in companies will likely face legal challenges due to language in the contracts. Companies are already required to share revenue with the US government if profits rise above a certain amount. In another development, the US government may divert up to $2 billion in CHIPS Act funding toward critical minerals projects in the US, Reuters reported. The move aims to reduce US dependence on China for key minerals extensively used in the electronics and defense industries. \"The administration is creatively trying to find ways to fund the critical minerals sector,\" Reuters' source said, adding that those plans could change. This article originally appeared on Engadget at https://www.engadget.com/big-tech/trump-administration-official-says-some-chips-act-companies-wont-need-to-give-up-equity-130041299.html?src=rss", "ingested_utc": "2025-08-22T13:38:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:01Z", "source": "Engadget_All", "title": "The best Labor Day sales for 2025: Save on tech from Apple, Sony, Shark and others", "url": "https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-save-on-tech-from-apple-sony-shark-and-others-120049396.html?src=rss", "id_key": "fae3ab47a1fef4fde6461ae6132347ebd32e97cb6334ba5f47a219fd00049f90", "summary": "Labor Day marks the unofficial end to summer as the weather starts to get crisper and students head back to school for the new semester. It also marks a good time to check out the tech deals available across the web. While seasonal holidays like Memorial Day and Labor Day are not the boon for tech sales that shopping events like Amazon Prime Day are, they can present good opportunities to save on things like laptops, tablets, smart home gear and more. Here, we've curated the best Labor Day sales on tech we could find this year. Since this time of year does overlap with the back-to-school season, students should be first in line to check out these deals. If you need some new gadgets for college, or refreshed tech to help you out in your first job after graduating, now's the time to see if you can get it for less. Student discounts are handy and exclusive to those who can prove their student status, but the good thing about Labor Day sales is that anyone can take advantage of them — student ID not required. Best Labor Day sales: Engadget's top picks Apple AirPods Pro 2 for $169 (32 percent off): The AirPods Pro 2 are Apple’s best set of wireless earbuds for now, as they offer the full set of Apple-focused features, strong ANC, onboard volume controls, a comfy in-ear design and a warm sound profile that most should find agreeable. They can even work as a hearing aid , though their six-hour battery life still isn’t the best, and you should only get them if you’re all-in on Apple hardware. But if that’s the case, we consider them the best wireless earbuds for iPhone owners. Apple Mac mini M4 for $499 ($100 off): The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard, two front-facing USB-C ports, an extra Thunderbolt 4 port and the ability to drive three external displays. We gave the M4 Pro model a review score of 90 . Sony WH-1000XM5 headphones for $274 (32 percent off): The XM6 headphones may be the latest flagship pair from Sony, but the XM5 cans are still fantastic — especially when you can get them at a discount. They were our top pick for the best wireless headphones before the XM6 came out recently, and we still think the XM5 have excellent noise cancellation and sound quality, a comfortable design and handy features like multipoint connectivity. Google Pixel 10 smartphone + $100 Amazon gift card for $799 ($100 off): More of a pre-order deal than a Labor Day deal, this bundle includes a free gift card when you order the latest Google Pixel phone in advance. You'll find different gift card deals at Amazon depending on which phone you go with: the Pixel 10 Pro and Pro XL have a $200 gift cards included, while the Pixel 10 Pro Fold comes with a free $300 gift card. Blink Outdoor 4 security cameras (3 camera system) for $100 (47 percent off): Some of our favorite security cameras , Blink Outdoor 4 devices support 1080p video, two-way talk, motion alerts and night vision. The most convenient thing about these is that they're totally wireless and run on AA batteries that can last up to two years before you need to replace them. That combined with their weather-proof design allows you to place them both inside and outside. Eufy 11S Max robot vacuum for $150 (46 percent off): This model is one of our favorite budget robot vacuums thanks to its slim design that lets you get underneath furniture more easily and strong suction power for its size. Note that it does not have Wi-Fi connectivity, but it comes with a remote that lets you control the robot to your liking. Shark AI Ultra robot vacuum for $298 (50 percent off): This Shark robot vacuum is a version of one of our favorites and it comes with a auto-empty base that can hold up to 60 days worth of debris. It has strong suction power and home mapping capabilities, so you can tailor cleaning jobs to your liking in addition to putting the robot on a cleaning schedule. Cosori 9-in-1 air fryer for $90 (25 percent off): One of our picks for the best air fryers , this Cosori model has a spacious six-quart cooking basket and nine prep modes to choose from. In our testing, it consistently crisped up all kinds of foods, from frozen appetizers to raw proteins, and it has a nifty safety feature with its built-in basket release button. HORI Piranha Plant camera for Switch 2 for $40 (33 percent off): If you plan on taking advantage of the Switch 2's video and group chat feature, there's no cuter way to do it than with this Piranha Plant camera. In addition to using it with the pot as a stand, the plant itself detaches from the pot so you can use the camera in portable mode with the USB port on the new console. ESPN Unlimited with Disney+ and Hulu (with ads) for $30/month ($6/month off): ESPN’s new streaming service is officially available now, and new subscribers can get Disney+ and Hulu included for one year when they sign up. The regular price of the new ESPN Unlimited plan is $30 per month, but this bundle offer throws in Disney+ and Hulu (with ads) for one year at no extra cost. If you want to break it down, you’re essentially getting each of the three services for $10 monthly with this offer. NordVPN deal — Get up to 77 percent off two-year plans: Most of NordVPN's two-year plans are on sale right now. You'll get 77 percent off the Prime tier, bringing the price down to $189 for 27 months of service (Nord throws in an extra three months for free). Arguably the best plan for most people is the Plus tier, which is 73 percent off and down to $108 for the 27-month term. MasterClass deal — Get 50 percent off one-year subscriptions: You can sign up for one year of MasterClass access for as low as $5 per month thanks to this sale that runs through September 1. A subscription lets you watch hundreds of online video classes taught by experts in their fields, and subject matter ranges from writing to cooking to sports. Best Labor Day sales on tech Beats Studio Pro headphones for $180 (49 percent off) Sony WH-1000XM4 headphones for $198 (43 percent off) Anker 621 5K magnetic power bank for $28 (30 percent off) Amazon Fire Max 11 tablet for $175 (24 percent off) Nothing Headphones (1) for $269 ($30 off) Sonos back-to-school sale: Save up to 25 percent on headphones and speakers Solo Stove Labor Day sale: Get 20 percent off fire pits and 15 percent off select accessories Meater Labor Day sale: Get up to 27 percent off smart meat thermometers Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-save-on-tech-from-apple-sony-shark-and-others-120049396.html?src=rss", "ingested_utc": "2025-08-22T13:38:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:10Z", "source": "TheStreet_Top", "title": "Giant healthcare services provider files Chapter 11 bankruptcy", "url": "https://www.thestreet.com/breaking-news/giant-healthcare-services-provider-files-chapter-11-bankruptcy", "id_key": "fa812d55eca90d23754e5fd7a443d41025431de7d388f1b6eccdb47ba69b02b0", "summary": "A major national healthcare services provider files for Chapter 11 to hand ownership to its lenders.", "ingested_utc": "2025-08-22T13:38:10Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:11Z", "source": "AlJazeera_All", "title": "How Israeli army’s own data shows vast civilian death rate in Gaza", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/22/how-israeli-armys-own-data-shows-vast-civilian-death-rate-in-gaza?traffic_source=rss", "id_key": "d626530118ff6a21f9eb701579f0ad0a608059b502efcd578afe2eab6d7e0d7c", "summary": "Figures from a leaked Israeli military database indicate that 83 percent of Palestinians killed in Gaza are civilians.", "ingested_utc": "2025-08-22T13:38:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:11Z", "source": "AlJazeera_All", "title": "Former Sri Lanka President Ranil Wickremesinghe arrested", "url": "https://www.aljazeera.com/news/2025/8/22/former-sri-lanka-president-ranil-wickremesinghe-arrested?traffic_source=rss", "id_key": "defd98ef0225703682d46f157f834492c705266e11410a5a1e528703a6fd1ee7", "summary": "Police say the former leader is accused of misuse of public funds in relation to a trip to London.", "ingested_utc": "2025-08-22T13:38:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:17Z", "source": "FinancialPost_Business", "title": "Acquisition of Additional Equity Interest in St. James Gold Corp.", "url": "https://financialpost.com/globe-newswire/acquisition-of-additional-equity-interest-in-st-james-gold-corp", "id_key": "b06f3f88c5177afb618bf69c2d96c95a8e49a38c1336934126771b58e869ed5d", "summary": "Not for distribution to United States newswire services or for release publication, distribution, or dissemination directly, or indirectly, in whole or in part, in or into the United States. Vancouver, BC, Aug. 22, 2025 (GLOBE NEWSWIRE) — Florin Resources Inc. (the “Shareholder”) announces that, on August 21, 2025, pursuant to the terms of the final […]", "ingested_utc": "2025-08-22T13:38:17Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:17Z", "source": "FinancialPost_Business", "title": "St. James Gold Announces Closing of the Final Release and Settlement Agreement", "url": "https://financialpost.com/globe-newswire/st-james-gold-announces-closing-of-the-final-release-and-settlement-agreement", "id_key": "5c3981e8cf51b6dd57bfa9e509c44ca942a49dd6a36f4dfb74787ea61f52dd7b", "summary": "Vancouver, British Columbia, Aug. 22, 2025 (GLOBE NEWSWIRE) — St. James Gold Corp. (the “Company” or “St. James”) (TSXV: LORD) (OTCQB: LRDJF) (FSE: BVU3) is pleased to announce that it has closed the Final Release and Settlement Agreement with Florin Resources Inc. (“Florin”) originally announced on April 1, 2025 (the “Settlement Agreement”). Under the terms […]", "ingested_utc": "2025-08-22T13:38:17Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:17Z", "source": "FinancialPost_Business", "title": "The New Belkin UltraCharge Collection Brings Fast, Stylish Power at 25W", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/the-new-belkin-ultracharge-collection-brings-fast-stylish-power-at-25w", "id_key": "c43bf60b8377e1325f4ebf45134bc97f3ff920a1a43795f5442c06ecb4312ba2", "summary": "The world’s first Qi2 25W certified lineup offers faster and smarter wireless charging experiences, designed for next-gen devices LOS ANGELES — Belkin, a leading consumer electronics brand for over 40 years, today announced three new Qi2 25W certified wireless charging solutions, expanding its award-winning mobile power portfolio. These new products harness the power of the […]", "ingested_utc": "2025-08-22T13:38:17Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:17Z", "source": "FinancialPost_Business", "title": "Rimini Street and American Digital Partner to Deliver Alternative SAP, Oracle and VMware Support, Savings and Innovation on HPE Infrastructure", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/rimini-street-and-american-digital-partner-to-deliver-alternative-sap-oracle-and-vmware-support-savings-and-innovation-on-hpe-infrastructure", "id_key": "10f0ba9885abe701b7547e40362f2321cade7ac36f46155d2a316cf70c9cb987", "summary": "Clients can avoid low ROI software upgrades and migrations, achieve a reduction in total IT support costs by up to 90% and leverage full potential of existing systems without re-platforming LAS VEGAS — Rimini Street, Inc. (Nasdaq: RMNI), a global provider of end-to-end enterprise software support, management and innovation solutions, and the leading third-party support […]", "ingested_utc": "2025-08-22T13:38:17Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:17Z", "source": "FinancialPost_Business", "title": "Tacton Appoints Klaus Andersen as CEO to Lead Next Phase of Global Growth", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/tacton-appoints-klaus-andersen-as-ceo-to-lead-next-phase-of-global-growth", "id_key": "30a8fffe4f1405c4eedf93a17b5bccfb19f309ea3743907bdbc6707f17eeeef4", "summary": "CHICAGO & STOCKHOLM — Tacton, a global leader in Configure, Price, Quote (CPQ) software and leading SaaS platform simplifying sales and configuration processes for manufacturers of complex products, today announced that Klaus Andersen, currently serving as Chief Operating Officer, has been appointed Chief Executive Officer, effective August 21, 2025. He succeeds Bo Gyldenvang, who is […]", "ingested_utc": "2025-08-22T13:38:17Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T13:38:31Z", "source": "MIT_TechReview", "title": "The Download: Google’s AI energy expenditure, and handing over DNA data to the police", "url": "https://www.technologyreview.com/2025/08/22/1122350/the-download-googles-ai-energy-expenditure-and-handing-over-dna-data-to-the-police/", "id_key": "d720c42a220f023b7d0f1d541d122e488b486c44055ea3bd0f12e48ddde01775", "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. In a first, Google has released data on how much energy an AI prompt uses Google has just released a report detailing how much energy its Gemini apps use for each query. In…", "ingested_utc": "2025-08-22T13:38:31Z"}
