{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:47:32Z", "source": "BBC_World", "title": "Ghislaine Maxwell says Epstein list does not exist", "url": "https://www.bbc.com/news/articles/cdd3pe6189go?at_medium=RSS&at_campaign=rss", "id_key": "406e1ca8a5f2c79cfc8d126052d84610b441276e902802aecdfa922a884e2804", "summary": "Maxwell was interviewed after pressure on Trump to release information about whether prominent figures were involved in Jeffrey Epstein's crimes.", "ingested_utc": "2025-08-23T06:47:32Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:47:36Z", "source": "Guardian_World", "title": "David Littleproud vows to take nuclear energy to next election and claims ‘no malice’ behind brief Coalition split", "url": "https://www.theguardian.com/australia-news/2025/aug/23/david-littleproud-vows-to-take-nuclear-energy-to-next-election-and-claims-no-malice-behind-brief-coalition-split", "id_key": "4e3a42e6d990f7d1d7c8775556e89f13cb5425f091fa9d6cf6af253590f4a3cd", "summary": "Nationals leader rails against regional Australia becoming littered with transmission lines, solar panels and wind turbines at LNP conference Get our breaking news email , free app or daily news podcast The Nationals are vowing to introduce nuclear power to Australia’s energy mix, promising to take the policy to the next election after it contributed to a split in the Coalition. Nationals leader David Littleproud explained to party faithful on Saturday what led to his party’s week-long decoupling from the Liberals following the May federal election rout. Continue reading...", "ingested_utc": "2025-08-23T06:47:36Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:47:36Z", "source": "Guardian_World", "title": "Members of far-right party organising asylum hotel protests across UK, Facebook posts show", "url": "https://www.theguardian.com/uk-news/2025/aug/23/members-of-far-right-party-organising-asylum-hotel-protests-across-uk-facebook-posts-show", "id_key": "3c910188b3c50e3e8198352651b0fc3cafc21cd22e9fd77f3441ba664c884b9f", "summary": "Activists from Homeland party, which split from Patriotic Alternative, set up groups to spread protests beyond Epping Members of a far-right nationalist party are helping to organise protests outside hotels used to house asylum seekers across the UK, according to a series of Facebook posts and groups created in recent weeks. Activists for the Homeland party, which was formed as a splinter organisation from Patriotic Alternative, Britain’s biggest far-right group, have set up a number of online groups in an attempt to spread the protests that recently engulfed a hotel in Epping. Continue reading...", "ingested_utc": "2025-08-23T06:47:36Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:47:36Z", "source": "Guardian_World", "title": "Expert rejects Met police claim that study backs bias-free live facial recognition use", "url": "https://www.theguardian.com/technology/2025/aug/23/expert-rejects-met-police-claim-that-study-backs-bias-free-live-facial-recognition-use", "id_key": "6a6583519da1ac4eec61f974d8686be4437221e2193b706aa0533e6d6c75d41c", "summary": "Academic says sample size was too small to claim new sensitivity guidelines have removed racial, gender or age bias The Metropolitan police’s claims that their use of live facial recognition is bias-free are not substantiated by the report they cite to support their case, a leading expert on the technology has said. The Met is planning its biggest and most high profile use of LFR yet this bank holiday weekend at Notting Hill carnival in west London. Continue reading...", "ingested_utc": "2025-08-23T06:47:36Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:47:36Z", "source": "Guardian_World", "title": "Eau de courgette: rise in foodie perfumes may be linked to weight-loss drugs", "url": "https://www.theguardian.com/fashion/2025/aug/23/foodie-perfumes-weight-loss-drugs", "id_key": "f42ed994e85a16629b7e8f3fd90561a7c7f859ee74110df4c550c2b3585f2544", "summary": "‘Gourmand’ fragrances with notes of biscuit or cherries are also trending among young consumers online A rise in the number of sweet, food-scented perfumes on the market could be linked to an increase in the use of weight-loss medication, according to the market research firm Mintel. Food-inspired fragrances, with scent profiles that feature vanilla, coffee and caramel and referred to in the industry as “gourmand” perfumes, have surged in popularity in the past three years. Launches of sugary-scented, desert-themed fragrances increased by 24% last year alone, Mintel said. Continue reading...", "ingested_utc": "2025-08-23T06:47:36Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:47:36Z", "source": "Guardian_World", "title": "‘New Noel Clarkes will surface’ without change in film and TV, say female witnesses", "url": "https://www.theguardian.com/culture/2025/aug/23/new-noel-clarkes-will-surface-without-change-in-film-and-tv-say-female-witnesses", "id_key": "b2c773036719dd8b29aad4a4b39c59e7581cdead7a4a5f9de12016972fb59f18", "summary": "Women who gave evidence in failed libel trial against Guardian say industries need to safeguard women from sexual predators The culture of the television and film industries needs to change to protect women from the actions of sexual predators, women who gave evidence against Noel Clarke in his failed libel action have said. “Noel’s behaviour was an open secret, everyone knew,” said Penelope, a pseudonym for an actor who filmed a sex scene with Clarke. “He didn’t work alone. Those who enabled and protected him should be accountable. Continue reading...", "ingested_utc": "2025-08-23T06:47:36Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:47:36Z", "source": "Guardian_World", "title": "Texas senate gives final approval to redrawn congressional map that heavily favours Republicans", "url": "https://www.theguardian.com/us-news/2025/aug/22/texas-senate-redistricting-maps", "id_key": "a8d64e0a484f285d300afbde2dd3060057317774b3524f7b9d780701f1733a01", "summary": "The map will now be sent to governor Greg Abbott, a Republican, who is expected to quickly sign it into law The Texas senate has given final approval to a redrawn congressional map that gives Republicans a chance to pick up as many as five congressional seats, fulfilling a brazen political request from Donald Trump to shore up the GOP’s standing before next year’s midterm elections. It will now be sent to governor Greg Abbott, a Republican, who is expected to quickly sign it into law, however Democrats have vowed to challenge it in court. The Texas house of representatives approved the map on Wednesday on an 88-52 party-line vote, before the senate approved it early on Saturday. Continue reading...", "ingested_utc": "2025-08-23T06:47:36Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:50:02Z", "source": "FT_Home", "title": "Tech stocks are sending a warning", "url": "https://www.ft.com/content/c44c32cd-da47-4ba6-a67a-30c0059931bb", "id_key": "e8c6b66f6edebcd8faf2fff381c377b59352310443b5e78840b168c2b09c2439", "summary": "Sell-off provides a reminder of the risks of the sector’s dominance in public and private markets", "ingested_utc": "2025-08-23T06:50:02Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T06:50:31Z", "source": "AlJazeera_All", "title": "Why an Indian bill removing jailed leaders from office has sparked outrage", "url": "https://www.aljazeera.com/news/2025/8/23/a-new-indian-bill-punishes-jailed-politicians-why-has-it-sparked-outrage?traffic_source=rss", "id_key": "d00bbbf562291197e5ba1f53ed84bb10717330846fa398b60cb78972b6e7da0a", "summary": "Elected representatives jailed for 30 days on serious charges could lose their posts – even without a conviction.", "ingested_utc": "2025-08-23T06:50:31Z"}
