{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:39:13Z", "source": "Guardian_World", "title": "Australia’s peak Jewish group condemns Netanyahu’s ‘clumsy’ attack on Albanese and calls for end to ‘spat’", "url": "https://www.theguardian.com/australia-news/2025/aug/20/ecaj-letters-to-benjamin-netanyahu-anthony-albanese", "id_key": "ff7f9e33b44d5132308860966170a808cd034eae79efe27f5cbb88542c8794c9", "summary": "Executive Council of Australian Jewry says Australian and Israeli governments should use ‘diplomacy rather than public posturing’ Australia’s peak Jewish group has lambasted Benjamin Netanyahu’s attack on Anthony Albanese as “inflammatory and provocative”, adding that the “clumsy intervention” showed a “woeful lack of understanding of social and political conditions in Australia” – notwithstanding what the group describes as “unseemly” conduct from Australia’s leader. The concerned intervention by the Executive Council of Australian Jewry came as Australia and Israel entered the third day of a diplomatic tit-for-tat prompted by Australia’s visa cancellation of far-right Israeli politician, Simcha Rothman , on Monday. Continue reading...", "ingested_utc": "2025-08-20T09:39:13Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:39:13Z", "source": "Guardian_World", "title": "Dramatic rise in whale and marine mammal strandings in Scotland", "url": "https://www.theguardian.com/environment/2025/aug/20/rise-whale-marine-mammal-strandings-scotland", "id_key": "65b052ad14e8dc00bd89151d9cfc73031f4cf3a4e5cacd8846439a85f11fdac1", "summary": "University of Glasgow research shows steep increases over past 30 years, after summer of strandings across Europe The number of marine mammals stranded in Scotland has risen dramatically in the past 30 years, a study has found. From 1992 to 2022, 5,147 cetaceans died on Scottish shores, and a new paper shows steep increases in the rate of strandings of up to 800% in some species, continuing exponentially every year. Continue reading...", "ingested_utc": "2025-08-20T09:39:13Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:39:38Z", "source": "CoinJournal", "title": "AVAX price outlook: SkyBridge Capital to tokenize $300M on Avalanche blockchain", "url": "https://coinjournal.net/news/avax-price-outlook-skybridge-capital-to-tokenize-300m-on-avalanche-blockchain/", "id_key": "fa94821c9c35ee1c103c5991fe27039d0efa4cdab12d9f519da3417e276126d5", "summary": "SkyBridge will tokenize $300M of hedge funds on the AVAX blockchain. The move positions Avalanche as a leading platform for RWAs. AVAX charts suggest a potential 45% price jump if broader sentiments improve. While cryptocurrencies retreated from their recent peaks, Anthony Scaramucci’s alternative investment company, SkyBridge Capital, supercharged Avalanche’s (AVAX) fundamentals. According to the latest […] The post AVAX price outlook: SkyBridge Capital to tokenize $300M on Avalanche blockchain appeared first on CoinJournal .", "ingested_utc": "2025-08-20T09:39:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:21Z", "source": "MarketWatch_Bulletins", "title": "An ETF of 'buzzy' stocks just had its worst day since early April", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=c8319b1e-bd3d-4f82-b182-5d1671e78cbc&mod=mw_rss_bulletins", "id_key": "d86dee3dd4a5c5f9485b4d57b1fbc1153074f550eea6e6664f66800faa85d225", "summary": "", "ingested_utc": "2025-08-20T09:41:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:28Z", "source": "NYTimes_Business", "title": "Come One, Come All! Buy Your TV Subscriptions Here!", "url": "https://www.nytimes.com/2025/08/20/business/media/streaming-tv-subscription-bundle.html", "id_key": "c1f2d9fdbea49eefeb78d2c260a50bd139ecd26b7c0c28e08e7eee4bc8a5fba9", "summary": "A battle is heating up in the streaming world as millions of Americans sign up for multiple services through a single provider instead of separate apps.", "ingested_utc": "2025-08-20T09:41:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:28Z", "source": "NYTimes_Business", "title": "In Norway, Are ‘Coolcations’ Taking a Toll?", "url": "https://www.nytimes.com/2025/08/20/travel/norway-overtourism-coolcations.html", "id_key": "9664e8077935d92ff5d4669458e2895169ee0cc27b84338eeb2230b79cff37b8", "summary": "As heat and wildfires plague many parts of Europe, the desire for cooler climes is driving tourists to Nordic countries, prompting as much concern as celebration.", "ingested_utc": "2025-08-20T09:41:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:29Z", "source": "NYTimes_World", "title": "Why Georgia, Once on Democracy’s Vanguard, Is Drifting Toward Russia", "url": "https://www.nytimes.com/2025/08/20/magazine/georgia-russia-autocracy-dictatorship.html", "id_key": "d64486744a1da22f6034c3c3b7c5569e654f1f8b38dc34785a48b6939d8d7385", "summary": "Two decades after the Rose Revolution, the former Soviet satellite is turning away from the West and back toward Russia. What happened?", "ingested_utc": "2025-08-20T09:41:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:37Z", "source": "NPR_Top", "title": "Nerd! How the word popularized by Dr. Seuss went from geeky insult to mainstream", "url": "https://www.npr.org/2025/08/20/nx-s1-5507053/nerd-dr-seuss-word-of-week", "id_key": "954dd1f22e4a4630ecd4697e6046e53df2c4ec7f09b6009a8ee2d25d2d20142b", "summary": "Nerd has been part of our lexicon for three-quarters of a century, its geeky meaning embodied by some of the most recognizable characters in film and TV, but its origin story is a bit murky.", "ingested_utc": "2025-08-20T09:41:37Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:37Z", "source": "NPR_Business", "title": "Trump administration wants government to have an equity stake in chipmaker Intel", "url": "https://www.npr.org/2025/08/20/nx-s1-5507038/trump-administration-wants-government-to-have-an-equity-stake-in-chipmaker-intel", "id_key": "33a9e0313cb1539984d8f3dbb269492f8186bbeb4684b32d0b4df9911f378e2f", "summary": "The Trump administration is pursuing an unusual deal that would make the U.S. government a major stakeholder in chipmaker Intel. NPR unpacks the proposal with Bloomberg reporter Mackenzie Hawkins.", "ingested_utc": "2025-08-20T09:41:37Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:38Z", "source": "NPR_Economy", "title": "Three innovations pushing the medical field forward", "url": "https://www.npr.org/2025/08/18/nx-s1-5503741/three-innovations-pushing-the-medical-field-forward", "id_key": "3c1ecfdd362878fbc663a9fcaa644b36a500c6d44db1484cd012308200eda135", "summary": "Innovation is crucial for long-term economic prosperity. One area where that’s happening aplenty: medical technology. From a cancer vaccine to an Alzheimer’s blood test to a life-changing exoskeleton, we take you on a tour of the economics of health technology. Related episodes: The hidden costs of healthcare churn ( Apple / Spotify ) More for Palantir, less for mRNA, and a disaster database redemption arc ( Apple / Spotify ) It's actually really hard to make a robot, guys ( Apple / Spotify ) For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Fact-checking by Sierra Juarez . Voice-over by Greg Hardes. Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter .", "ingested_utc": "2025-08-20T09:41:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:39Z", "source": "NPR_World", "title": "Morning news brief", "url": "https://www.npr.org/2025/08/20/nx-s1-5505971/morning-news-brief", "id_key": "7bc3e83a71784694455eedad293f2fd5f1fbba4a8f1886d9a77e713c5b4ddf46", "summary": "Six GOP governors sending National Guard troops to D.C., European leaders weigh options for Ukraine, Texas Legislature appears on verge of redrawing congressional map to help Republicans in midterms.", "ingested_utc": "2025-08-20T09:41:39Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:39Z", "source": "NPR_World", "title": "In France, debate heats up over air conditioning", "url": "https://www.npr.org/2025/08/19/nx-s1-5506223/in-france-debate-heats-up-over-air-conditioning", "id_key": "66f7f5d70e4a11bbbeb21308b622123b4f81e9ea323d66a623c5513c2547db14", "summary": "The politics of air conditioning in France, as the country basks in yet another heatwave.", "ingested_utc": "2025-08-20T09:41:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:41:58Z", "source": "WIRED_All", "title": "It's the Economy, Donald", "url": "https://www.wired.com/story/its-the-economy-donald-no-panican/", "id_key": "2accd9a3115a08b05ddc12e58a84acd36124fbb9a642934a314d4f009eadf712", "summary": "As US labor and inflation data seemingly worsen, the White House refrain is “no panicans”—in other words, no room for panic. That isn't keeping everyone in Trumpworld from getting the jitters.", "ingested_utc": "2025-08-20T09:41:58Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:42:00Z", "source": "Engadget_All", "title": "The best portable monitors in 2025", "url": "https://www.engadget.com/computing/accessories/best-portable-monitor-120050851.html?src=rss", "id_key": "db53bbd7f6542e2ad8ec64effdf862d4a0faf6cb4c4b36a43546789b27625865", "summary": "Whether you're working on the go, gaming away from your desk or just want a second screen to boost your productivity, a portable monitor can be a handy solution. These lightweight displays are perfect for adding more screen space to your setup without taking up much room — especially useful if you're using a compact laptop or traveling often. Many of the best portable monitors now support USB Type-C connections for easy plug-and-play setups, and some even run entirely on USB power, so you don’t need to carry extra chargers. You’ll also find models with handy extras like built-in speakers, touchscreen support and wide compatibility with Windows laptops and tablets. Whether you’re after a laptop screen extender or a creative companion for photo editing on the go, there’s a portable monitor out there for you. Table of contents Best portable monitors for 2025 Things to consider before buying a portable monitor What to look for in a portable monitor Portable monitor FAQs Best portable monitors for 2025 Things to consider before buying a portable monitor Before you start looking at specific products, it’s super important to think about how and where you plan on using a second monitor as a portable display. Larger panels are great for home use where you may only need to move it or put it away when you have company over. Meanwhile, smaller screens are great for travel and whipping out at a coffee shop or shared workspace. But if you go too small, you may be adding extra weight to your bag without providing a ton of extra utility, especially if it lacks a good USB-C cable or mini HDMI for connectivity. Screen size and compatibility with your existing devices should be top considerations. It’s also important to consider your typical workload, as artists may get extra value out of monitors with higher maximum brightness, HDR, wider color accuracy and a higher contrast ratio. Those who spend all day looking at spreadsheets won’t get as much value from more vibrant displays or FHD displays with high refresh rates, but they may still benefit from having a basic plug-and-play second monitor for multitasking. What to look for in a portable monitor Aside from price and screen size, some of the most important specs in a portable monitor include panel type, pixels per inch, brightness, refresh rate and connectivity. Most portable monitors use IPS LCD displays, which generally offer good viewing angles, strong brightness and good power efficiency. However, some higher resolution models now feature OLED screens that support wider color gamuts, better color accuracy and contrast ratio, which can be a major benefit for artists and content creators. Some budget models may use TN panels, as that can help cut costs and reduce energy consumption. That said, we generally try to stay away from those as they often have worse image quality compared to IPS screens. For brightness, 300 nits is the lowest we recommend — anything less can make the monitor hard to use even in some indoor environments. Ideally, we look for screens that are closer to 350 or 400 nits and above for better accuracy and visibility. Connectivity is also important because if you can’t easily hook your phone, gaming console, or laptop to a monitor, it becomes an oversized paperweight. Most travel displays include an HDMI port or USB-C port(or both), which cover the large majority of devices. It’s rare to find a portable monitor these days with only USB-A, since the majority of devices have moved over to USB-C. However, we also like models that support passthrough power over USB-C connections, which reduces the complexity of your setup and decreases the number of cords and adapters you have to carry around. Finally, most portable monitors feature 60Hz refresh rates, which is fine for most use cases. However, if you’re looking for a gaming monitor, there are models with 120Hz or even 240Hz refresh rates. These are excellent choices for gamers looking to maintain smooth fps while playing on the go. Portable monitor FAQs What are the disadvantages of a portable monitor? The main disadvantage of a portable monitor in comparison to a regular monitor is size. Most portable monitors sit in the 14- to 17-inch range to allow them to be as portable as their name suggests. While you can find some portable monitors sized at 20 inches or larger, they become less and less convenient to take on the go the larger they get. What is the difference between a tablet and a portable monitor? A tablet is essentially a portable computer that can run apps, games and more without a supporting device. Portable monitors are indeed supportive devices designed to expand your screen real estate; in order for them to have any use, they must be connected to a laptop or tablet. What ports should I look for in a portable monitor? The most important port to look for on a portable monitor is the one with which you'll connect the monitor to your computer. Most portable monitors will have either an HDMI or USB-C port to do this. After that, it's handy for a portable monitor to have other connectors such as a USB-A port, extra USB-C ports and others for you to hook up additional accessories. This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-portable-monitor-120050851.html?src=rss", "ingested_utc": "2025-08-20T09:42:00Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:42:15Z", "source": "FinancialPost_Business", "title": "Sai Life Sciences secures SBTi validation for near-term climate targets", "url": "https://financialpost.com/globe-newswire/sai-life-sciences-secures-sbti-validation-for-near-term-climate-targets", "id_key": "88e49354e28b16a4efd624fa2432f7f2a7b00e7beda413397f403c5d66c9175c", "summary": "HYDERABAD, India, Aug. 20, 2025 (GLOBE NEWSWIRE) — Sai Life Sciences Limited (BSE: 544306 I NSE: SAILIFE), an innovator focused Contract Research, Development, and Manufacturing Organization (CRDMO), announced that its near-term targets to cut greenhouse gas (GHG) emissions have been validated by the Science Based Targets initiative (SBTi)—a corporate climate action organization that enables companies and […]", "ingested_utc": "2025-08-20T09:42:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:42:15Z", "source": "FinancialPost_Business", "title": "Green Power Firm Keen to Stay Private Despite Abu Dhabi IPO Rush", "url": "https://financialpost.com/pmn/business-pmn/green-power-firm-keen-to-stay-private-despite-abu-dhabi-ipo-rush", "id_key": "e456b330e01de26fdafce3081baded201dcca4499dc2b802b76b1bfaecbaca89", "summary": "The chief executive officer of Abu Dhabi’s largest renewables company said he prefers to stay private for now because the company is well funded — despite the regional boom in initial public offerings.", "ingested_utc": "2025-08-20T09:42:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:42:22Z", "source": "Nikkei_Asia_Top", "title": "Indonesia central bank delivers surprise cut amid tariff concerns", "url": "https://asia.nikkei.com/economy/indonesia-central-bank-delivers-surprise-cut-amid-tariff-concerns", "id_key": "ae5d3eeab1ae2039112d504fc470c813d03794c0f280672e3ddc3d75415b772d", "summary": "", "ingested_utc": "2025-08-20T09:42:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T09:42:22Z", "source": "Nikkei_Asia_Top", "title": "Japan and South Korea to allow second working holiday visas", "url": "https://asia.nikkei.com/politics/international-relations/japan-and-south-korea-to-allow-second-working-holiday-visas", "id_key": "504ce0870803c8e0860b24e8101e3fcd9013cf32746adeef52dc51dac297ee34", "summary": "", "ingested_utc": "2025-08-20T09:42:22Z"}
