{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:46:52Z", "source": "BBC_Business", "title": "Topshop returns to the High Street, but can it get its cool back?", "url": "https://www.bbc.com/news/articles/ckgl4w1zkypo?at_medium=RSS&at_campaign=rss", "id_key": "eeb99f39a1038f1798c54b12dcc5753e9853c1de16620ace1c65ce8df3c78d20", "summary": "For many, the stores defined their childhood. Now the retailer says it is reopening them, and held its first catwalk for years on Saturday.", "ingested_utc": "2025-08-16T17:46:52Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:46:55Z", "source": "Guardian_World", "title": "Putin demands full control of Donetsk and Luhansk as condition for ending Ukraine war – live", "url": "https://www.theguardian.com/world/live/2025/aug/16/putin-trump-summit-alaska-us-europe-ukraine-security-guarantees-zelenskyy-latest-news-updates", "id_key": "89f6729797089493cc700447a56d841efa63c72837a20bd30baae2a1b6b3cfe2", "summary": "Putin told Trump he would halt further advances and freeze Ukrainian frontline where Russian forces occupy significant areas, sources say Zelenskyy to meet Trump on Monday after Putin summit briefing Donald Trump hand-delivered a personal letter from first lady Melania Trump to Russian leader Vladimir Putin raising the plight of Ukrainian and Russian children caught in the middle of the ongoing war between the two European countries, it was reported on Saturday. The contents of the letter were unknown – but two Trump administration officials told Reuters that it mentioned the abductions of children resulting from the war that broke out after Russia invaded Ukraine in 2022. Continue reading...", "ingested_utc": "2025-08-16T17:46:55Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:46:55Z", "source": "Guardian_World", "title": "Zelenskyy may be asked to cede land to Russia at Trump meeting in Washington", "url": "https://www.theguardian.com/world/2025/aug/16/zelenskyy-to-meet-trump-on-monday-putin-alaska-summit-briefing", "id_key": "433dd29007274c60ead81c281906149ed157fa6814ef9859cb16dc153e57fad1", "summary": "Ukrainian leader to return to White House after Alaska summit between US president and Vladimir Putin Putin-Trump summit – latest updates Ukraine’s president has said he will fly to Washington on Monday to meet Donald Trump after the Alaska summit amid speculation that the US president will ask him to cede territory to end the war. Next week’s meeting will mark the first return to the White House for Volodymyr Zelenskyy since his infamous row with Trump and the vice-president, JD Vance, in the Oval Office in February. Continue reading...", "ingested_utc": "2025-08-16T17:46:55Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:46:55Z", "source": "Guardian_World", "title": "Thieves steal $2m in jewelry in under two minutes at Seattle store", "url": "https://www.theguardian.com/us-news/2025/aug/16/seattle-jewelry-store-robbery", "id_key": "89ee9713daf204c0d98b8d1a1e7948a3c84a27acbcee1b87d598181166d89c21", "summary": "Brazen daytime robbery involved four masked suspects taking diamonds, luxury watches and gold, police say Smash-and-grab thieves in Seattle made off with an estimated $2m in diamonds, luxury watches, gold and other items in a daring midday jewelry store robbery that took just about 90 seconds, police said on Friday. Video from the west Seattle store’s surveillance cameras shows four masked suspects shattering the locked glass front door with hammers and then ransacking six display cases on Thursday. Continue reading...", "ingested_utc": "2025-08-16T17:46:55Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:46:55Z", "source": "Guardian_World", "title": "Donald Trump reportedly delivered letter from first lady to Vladimir Putin", "url": "https://www.theguardian.com/us-news/2025/aug/16/melania-trump-vladimir-putin-letter-donald", "id_key": "d7e41277d610a4184080578eed338645a2935cccebab73ea87403fd30f99112d", "summary": "White House officials said it mentioned the abductions of Ukrainian children by Russian forces in occupied territory Donald Trump hand-delivered a personal letter from first lady Melania Trump to Russian leader Vladimir Putin raising the plight of Ukrainian and Russian children caught in the middle of the ongoing war between the two European countries, it was reported on Saturday. The contents of the letter were unknown – but two Trump administration officials told Reuters that it mentioned the abductions of children resulting from the war that broke out after Russia invaded Ukraine in 2022. Continue reading...", "ingested_utc": "2025-08-16T17:46:55Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:46:55Z", "source": "Guardian_World", "title": "Hurricane Erin intensifies to category 5 as it moves through north-east Caribbean", "url": "https://www.theguardian.com/world/2025/aug/16/hurricane-erin-gathers-force-as-it-nears-north-east-caribbean-leeward-islands", "id_key": "ea0cb0b1f4e0f218d772e67b1e4990e95de283b1fc36332275bfb1ed70c2517d", "summary": "Erin not expected to make landfall, though nearby islands, including Puerto Rico, brace for flooding Hurricane Erin has intensified into a category 5 storm as it churns its way over the Atlantic, brushing past islands in the north-east Caribbean. The National Hurricane Center (NHC), in Miami, said on Saturday that Erin – which it described as “catastrophic” – was still not expected to hit land in the US and would swerve away, but forecasters have warned that strong winds and heavy rain could cause flooding and landslides on nearby islands. Continue reading...", "ingested_utc": "2025-08-16T17:46:55Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:49:12Z", "source": "NYTimes_World", "title": "Masaoki Sen, a Kamikaze Volunteer and Japan Tea Ceremony Grandmaster, Dies", "url": "https://www.nytimes.com/2025/08/15/world/asia/japan-masaoki-sen-kamikaze-tea.html", "id_key": "fa164c4437436ef754898a196cecf79119f15c4f8dc243a6b191cab3506b4924", "summary": "Spared from flying a suicide mission in World War II, he became a grandmaster of Japan’s venerable tea ceremony and used his stature to speak out against all wars.", "ingested_utc": "2025-08-16T17:49:12Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:49:19Z", "source": "NPR_Top", "title": "Government forces Air Canada flight attendants back to work, into arbitration", "url": "https://www.npr.org/2025/08/16/nx-s1-5504621/air-canada-suspends-operations-strike-flight-attendants", "id_key": "fbeb49c248333bbb81d21e11233393c4d2eb8d91363ac22f1de041c54edae62e", "summary": "Canada's government forced Air Canada and its striking flight attendants back to work and into arbitration Saturday after a work stoppage stranded more than 100,000 travelers around the world.", "ingested_utc": "2025-08-16T17:49:19Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:50:02Z", "source": "FinancialPost_Business", "title": "Ottawa imposes binding arbitration, forcing Air Canada flight attendants back to work", "url": "https://financialpost.com/pmn/ottawa-imposes-binding-arbitration-forcing-air-canada-flight-attendants-back-to-work", "id_key": "cde14d9983abbe0acd9dcc5c6ef4fb1e9731f1d0808f024fc5aa9b5d177cafef", "summary": "Less than 12 hours after it began, the federal government ordered Air Canada and its flight attendants into binding arbitration on Saturday, putting an abrupt end to the strike and lockout situation that left airplanes grounded and thousands of Canadians struggling to find alternate ways home. The union representing more than 10,000 flight attendants with […]", "ingested_utc": "2025-08-16T17:50:02Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:50:02Z", "source": "FinancialPost_Business", "title": "Ottawa steps in to end Air Canada strike, seeks binding arbitration", "url": "https://financialpost.com/transportation/airlines/ottawa-seeks-end-air-canada-strike-labour-board-referral", "id_key": "0f4db42574edd333f32a6ae7d02ed79984e2051aa21a3652b206ba2dff1321d8", "summary": "Airline’s 10,500 flight attendants went on strike Saturday, grounding hundreds of flights", "ingested_utc": "2025-08-16T17:50:02Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:50:02Z", "source": "FinancialPost_Business", "title": "ExpandCommunication Launches, Defining Intelligent PR", "url": "https://financialpost.com/globe-newswire/expandcommunication-launches-defining-intelligent-pr", "id_key": "c485da0e5cd51761a8a807fb4000dca3cde9196a11a14522ead884c27c0faa5d", "summary": "Partnering with GridStrat, ExpandCommunication offers AI Visibility Audits and Customized Strategy to Maximize Visibility Calgary, Aug. 16, 2025 (GLOBE NEWSWIRE) — A bold new player has entered the public relations landscape with the official launch of ExpandCommunication, an intelligent PR firm built to accelerate client growth through strategic visibility, cutting-edge tools, and global reach. “Our mission […]", "ingested_utc": "2025-08-16T17:50:02Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T17:50:02Z", "source": "FinancialPost_Business", "title": "A Startup Is Tapping Underground Parking Garages for Clean Energy", "url": "https://financialpost.com/pmn/business-pmn/a-startup-is-tapping-underground-parking-garages-for-clean-energy", "id_key": "442137a1e37354a92bfd710fd3fcfaed1c39049d17768a390d0090aac1f63d9b", "summary": "As cities look to harness zero-carbon power and heating, Enerdrape is offering a novel no-drill solution for geothermal energy.", "ingested_utc": "2025-08-16T17:50:02Z"}
