{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T14:37:55Z", "source": "Guardian_World", "title": "Zelenskyy says territorial swaps not possible under Ukrainian constitution ahead of White House meeting – live", "url": "https://www.theguardian.com/world/live/2025/aug/17/trump-putin-meeting-european-leaders-ukraine-peace-deal-latest-updates-news", "id_key": "aacd5323aa3b927d25b4eed23e52a147bd617540dc0fa8061ecc5ad4b343db78", "summary": "Steve Witkoff says Russian president agreed to allow US and European allies to offer Ukraine security guarantee and also unspecified concessions on five Ukrainian regions Germany’s chancellor, Friedrich Merz , will also be travelling to Washington tomorrow for the Trump-Zelenskyy talks, according to the federal government. The chancellor’s spokesperson has been quoted by BBC News as having said: The trip will serve as an exchange of information with US President Donald Trump following his meeting with Russian President Vladimir Putin in Alaska. Chancellor Merz will discuss the status of peace efforts with the heads of state and government and underscore Germany’s interest in a swift peace agreement in Ukraine. Continue reading...", "ingested_utc": "2025-08-17T14:37:55Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T14:37:55Z", "source": "Guardian_World", "title": "Sanjeev Gupta readies last-ditch plan to save UK speciality arm of Liberty Steel", "url": "https://www.theguardian.com/business/2025/aug/17/sanjeev-gupta-readies-last-ditch-plan-to-save-specialty-arm-of-liberty-steel", "id_key": "7ea70d36c6aef61cf0323e92f9918d8545138fad858e7edbf77c2407bf542c0a", "summary": "Attempt to secure pre-pack administration deal comes as government officials step up planning for its collapse Sanjeev Gupta is preparing a last-ditch attempt to save the remaining arm of his Liberty Steel business as government officials step up planning for a collapse of the business within days. Gupta is understood to have spent the weekend planning an 11th-hour rescue deal to save the company’s Speciality Steel UK (SSUK) division days before a courtroom showdown with its creditors on Wednesday. Continue reading...", "ingested_utc": "2025-08-17T14:37:55Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T14:38:21Z", "source": "CryptoNews", "title": "Solana Votes on Alpenglow Upgrade to Cut Block Finality from 12.8s to 150ms", "url": "https://cryptonews.com/news/solana-votes-on-alpenglow-upgrade-to-cut-block-finality-from-12-8s-to-150ms/", "id_key": "cf3fa18c4acb649b9d9e0a64534e68e0c5689ea9af7cf603624f72dd23919522", "summary": "Solana validators vote on SIMD-0326 Alpenglow upgrade to cut block finality from 12.8 seconds to 150ms replacing TowerBFT consensus with direct voting and signature aggregation. The post Solana Votes on Alpenglow Upgrade to Cut Block Finality from 12.8s to 150ms appeared first on Cryptonews .", "ingested_utc": "2025-08-17T14:38:21Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T14:40:08Z", "source": "NYTimes_World", "title": "Putin’s Ukraine Proposal Backed by Trump Centers on Donbas. Here’s Why.", "url": "https://www.nytimes.com/2025/08/17/world/europe/russia-donbas-importance.html", "id_key": "c1334e704644ebc23a7168f06f4382372570734e8a8d1d9111c429860cc3ac0d", "summary": "The traditionally Russian-speaking area is at the heart of what the Russian president calls the “root causes” of the war, and taking it over is near the top of his list of territorial and political demands.", "ingested_utc": "2025-08-17T14:40:08Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T14:40:55Z", "source": "FinancialPost_Business", "title": "Midterm Fight Over Trump Bill, Tariffs Starts Early at Iowa Fair", "url": "https://financialpost.com/pmn/business-pmn/midterm-fight-over-trump-bill-tariffs-starts-early-at-iowa-fair", "id_key": "4c102bcca64a2d3af6307837994a1fc8de1598b1222cda7e2339b98fbbae82a6", "summary": "Republican Representative Zach Nunn is making an Iowa State Fair video about President Donald Trump’s tax law, shot on a John Deere tractor under the blazing August sun.", "ingested_utc": "2025-08-17T14:40:55Z"}
