{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T07:32:33Z", "source": "Guardian_World", "title": "Australia politics live: Lambie says crossbench ‘not important’ after Labor’s election landslide; Bowen says Coalition ‘refused to get the memo’ on net zero", "url": "https://www.theguardian.com/australia-news/live/2025/aug/25/australia-politics-live-labor-housing-first-home-buyers-anthony-albanese-sussan-ley-question-time-ntwnfb", "id_key": "6f2f30b52a49a3e721e80b038b3cf4cd3107b45c448cbeb49b516f6248f2c077", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast PM to seek meeting with Trump as ‘summit season’ approaches Anthony Albanese and Clare O’Neil have taken a venture out to the Canberra ‘burbs this morning, to spruik the 5% deposit scheme. [There are] a number of events over the coming months, we’re about to enter summit season, and I look forward to discussions continuing face to face, as they have been constructive when I’ve had discussions with President Trump up to now. This is an uncapped scheme which is available to billionaires or the children of billionaires if they want to use a government program. I think we’re getting to a point where Australia is becoming a ridiculous nation where the taxpayer is underwriting mortgage insurance schemes for extremely wealthy people. Just because a bird flew over a housing lot in 1971 shouldn’t mean we can’t have houses built today. And that’s frankly what’s happening now. Continue reading...", "ingested_utc": "2025-08-25T07:32:33Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T07:32:56Z", "source": "CoinJournal", "title": "ZRO targets $2.60 as Stargate approves LayerZero’s acquisition proposal", "url": "https://coinjournal.net/news/zro-targets-2-60-as-stargate-approves-layerzeros-acquisition-proposal/", "id_key": "4fd92229b6ca7b756fd2224543f532a1aa6a5ae35fcc82bcefe27ae1a6c65ebb", "summary": "TL;DR ZRO is down 7.5% and is now trading at $2.01. The bearish performance comes despite Stargate DAO approving LayerZero’s acquisition proposal. Stargate DAO approves LayerZero’s acquisition proposal The cryptocurrency market was volatile over the weekend, with massive gains recorded on Friday wiped out on Sunday. Bitcoin briefly dropped to the $110k region while Ether […] The post ZRO targets $2.60 as Stargate approves LayerZero’s acquisition proposal appeared first on CoinJournal .", "ingested_utc": "2025-08-25T07:32:56Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T07:35:23Z", "source": "Engadget_All", "title": "The 16 best portable Bluetooth speakers for 2025", "url": "https://www.engadget.com/audio/speakers/best-portable-bluetooth-speakers-133004551.html?src=rss", "id_key": "6a1ac36471e2ed1695ea186270214fa13cd3fe53f1ff82b0dc5fe7dc65c7cc8b", "summary": "Portable Bluetooth speakers are an easy way to bring your music anywhere without worrying about cables or power outlets. Whether you want something compact for relaxing at home, a tough waterproof model for the beach or a party speaker that fills the room, there’s an option for every need. The best portable speakers give you solid battery life, simple pairing and reliable sound no matter where you are. Some models focus on balanced audio for the casual listener while others aim for the best sound possible to please an audiophile. You can find speakers with extra bass for outdoor gatherings, built-in lights for an added vibe or rugged designs that can handle rough conditions. With so many choices available, it helps to know what features matter most for your listening style. Here’s a look at some of the top picks worth considering right now. Table of contents Best portable Bluetooth speakers: $50 to $200 Best portable Bluetooth speakers: $200 to $450 Best portable Bluetooth speakers: $450 and higher Factors to consider in a portable Bluetooth speaker Other portable Bluetooth speakers we tested Bluetooth speaker FAQs Best portable Bluetooth speakers: $50 to $200 Best portable Bluetooth speakers: $200 to $450 Best portable Bluetooth speakers: $450 and higher Factors to consider in a portable Bluetooth speaker Weather-proofing IP ratings (Ingress Protection) are the alphanumeric indicators you often see in a product’s spec sheet that define water and dust resistance. It’s usually a combo of two numbers with the first indicating solid object ingress and the second being water. The former goes from 0 (no protection) to 6 (dustproof). The water-resistance rating goes from 0 (no protection) to 9 (protected against immersion and high pressure jets). When an X is used instead of a number, that means the product wasn’t tested for resistance. If it’s a waterproof speaker, it may have some innate resistance to solids, but there’s no guarantee. IP67 is a common rating these days indicating highly resistant and potentially rugged speakers often featured in audio products like outdoor speakers. These are safe for quick dunks in the pool or tub and should be more than OK in the rain or in the shower. They’re also good options for the beach, playground and other rough environs. Additionally, speakers with ports and a high rating will often include a tight-fitting cover over the charging or auxiliary ports. If you plan on using the ports, that may limit the product's rated ability to fend off the elements. When looking for the best portable Bluetooth speaker, consider the IP rating and also how you plan to use your Bluetooth speaker when making your decision. It may be worth splurging on a better sounding model with a lower IP rating if you’ll mostly be using it indoors, for instance. Battery life The focus of this guide is on the best portable speakers, and while “portable” can be a relative term, these devices are generally for people who are likely to find themselves far from a power outlet. These days, around 12 hours of playtime seems to be the baseline but obviously, the more battery life you can get out of a speaker, the better, especially if you plan to listen to podcasts or music on the go. That said, be careful when looking at battery specs, as they frequently list a maximum runtime (“up to” x amount of hours). This usually means they tested at a low to mid volume. If you like your tunes loud with punchy bass, it can often end up cutting the expected usage time in half or more. Luckily, some manufacturers also list the expected hours of battery life when used at full volume and that transparency is appreciated. Bear in mind, however, that not all of the best Bluetooth speakers use the same charging port. Some support USB-C charging, while others use micro-USB, and some may even come with an adapter for added convenience. Additionally, if your audio system or mini Bluetooth speaker also happens to have Wi-Fi connectivity, they're usually designed for always-on functionality. Unlike normal Bluetooth speakers that go to sleep after a short period without use, these will usually stay awake (to listen for your commands) and slowly run down the battery. If you're out and about, you'll want to remember to turn these speakers off manually when not in use to maximize battery life. Range Bluetooth 5 offers better range and more reliable connectivity than its predecessors, making it a great feature to look for in the best Bluetooth speaker. That said, Bluetooth range can still be tricky. Some companies list their product’s longest possible range, usually outdoors and in an unobstructed line-of-sight test environment. Other companies stick with a 30-foot range on the spec sheet and leave it at that, even though they may be running Bluetooth 4.x or 5.x. That’s likely underselling the speaker's potential, but unpredictable environments can affect range and there’s little point in promising the moon only to get complaints. I’ve seen signal drop issues when crouching down, with my phone in the front pocket of my jeans, and barely 30 feet away from a speaker inside my apartment. I ran into this issue across several devices regardless of their listed Bluetooth connectivity range. If you’re hosting a patio party and duck inside, it’s wise to keep any wireless Bluetooth speakers relatively close by just in case. It’s hard to gauge what aspects of any environment may interfere with a Bluetooth signal. In general, take range specs around 100 feet or more as a perfect-world scenario. Latency This is a minor mention for those out there who use a speaker for their computer output, or as a mini Bluetooth soundbar solution for setups like a monitor and streaming box. It’s annoying to find that your speaker’s latency isn’t low enough to avoid lip sync issues. Luckily, it seems that most speakers these days don’t often have these problems. Only a handful of the few dozen speakers I tried had persistent, noticeable lip-sync issues. Aside from occasional blips, all of our picks worked well in this regard. If you plan to frequently use a speaker for video playback, look for devices with the most recent Bluetooth 5 technology and lower latency codecs like aptX. Also make sure the speaker is close to the source device as distance can be a factor. To avoid the issue altogether, though, consider getting one with a wired auxiliary input. Extra features Some speakers don’t just play music — they bring the party to life with built-in LED light effects and a full-on light show that syncs to your music. If you love a bit of visual flair with your tunes, it’s worth checking out models that offer LED light customization options. Sound quality also plays a huge role in picking the right speaker. The best Bluetooth speaker should deliver a balanced mix of punchy bass, clear highs and strong vocals. Many models also include customizable sound modes that let you tweak the EQ to better suit different genres — whether you’re blasting EDM, listening to a podcast, or just want a more immersive experience that would impress even an audiophile. If aesthetics matter, many models come in a tiny size that makes them extra portable, with plenty of color options to match your personal style. Whether you want a sleek black speaker or a vibrant eye-catching design, there are plenty of choices to fit your vibe. Other portable Bluetooth speakers we tested Sonos Roam While there's a lot to like about the Sonos Roam , there are plenty of other Bluetooth speakers with more features and better battery life. In our review , we gave the Roam a score of 87, praising it for its good sound quality, durable waterproof design and ability to work well within an existing Sonos speaker ecosystem. But the price is just fine at $180, and we found Bluetooth speakers that offer more at lower price points. Plus, the Roam taps out at 10 hours of battery life, and all of our top picks can run for longer than that on a single charge. Monoprice Soundstage3 The Monoprice Soundstage3 offers relatively big sound at a midrange $250 price, with a variety of inputs rarely found on a portable Bluetooth speaker. The boxy, minimalist design is no nonsense, even if it's more of a less-rugged, bookshelf-styled homebody. While the speaker puts out crisp highs alongside booming lows, we found the bass can overpower the rest of the output, so it's not for everyone. And after using the speaker for many months, we also found the low-slung, poorly labeled button panel along the top can be a bit annoying to use. If you want a speaker for road trips, favor mids and highs, and plan on using physical buttons for volume control and input selections, there are better options out there. JBL Boombox 3 Fans of JBL’s bluetooth speaker sound profile who want to crank up the volume, but also want a rugged and portable option, may enjoy the JBL Boombox 3 . It’s a decent grab-and-go speaker with a very loud output, although it's not as good as some of the loud-speaker styled options for long-throw sound and big outdoor areas. However, the price for this speaker line remains prohibitively expensive compared to other options with big sound that cover a bit more ground. If the JBL brand is your thing and you like the rugged, portable form factor, we recommend looking for discounts, or shopping around and exploring the available options including the (less portable) JBL PartyBox series. Soundcore Motion X500 Soundcore speakers have generally been good and often reasonably priced. The Motion X500 loosely falls into that category. It has a tall, metallic lunchbox vibe with a fixed handle and pumps out a respectable 40 watts of crisp, clear sound for its size. It can get pretty loud and serves up a good dose of bass, although its primarily a front-facing speaker. There’s LDAC hi-res audio support for Android users, but the main selling point on this is spatial audio. This is done through an EQ change and the activation of a small, up-firing driver. There’s a slight benefit from this if you’re up close and directly in front of it, but it’s not a total game changer for your listening experience. The original pre-order price of $130 made it a decent option in terms of bang for your buck. But it went up to $170 at launch, making it less appealing even if it’s still a good middle-of-the-road option if you want small-ish, clear and loud. If you can find one on sale for the lower price , it’s definitely worth considering. There’s also the larger and louder X600 ($200) if the overall concept is working for you. Portable Bluetooth speaker FAQs How does a Bluetooth speaker work? Bluetooth technology lets devices connect and exchange data over short distances using ultra high frequency (UHF) radio waves. It’s the frequency range that’s carved out for industrial, scientific and medical purposes, called the 2.4GHz ISM spectrum band. This range is available worldwide, making it easy for companies to use with devices for global markets. Bluetooth speakers include this tech, which lets them communicate with source devices like smartphones, tablets or computers in order to exchange data. The two devices pair by sharing a unique code and will work within the proscribed range for the device and Bluetooth version. Ever since Bluetooth 4.0 was released over a decade ago, new iterations usually improve on range, use less power and offer expanded connectivity with features like multipoint (allowing more than one device to be connected at the same time, for instance). Who should buy a Portable Bluetooth speaker? If you want to play music while you’re out-and-about on something other than headphones, a portable Bluetooth speaker is probably what you want. There’s a broad range of devices for all types of circumstances. Many adventurous people will want a relatively lightweight portable that’s rugged enough to handle the elements while also packing enough charge to play for hours on end. Others may simply need a speaker they can move around the house or use in the backyard. In this case, you can choose larger less rugged models that may offer better sound. This article originally appeared on Engadget at https://www.engadget.com/audio/speakers/best-portable-bluetooth-speakers-133004551.html?src=rss", "ingested_utc": "2025-08-25T07:35:23Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T07:35:39Z", "source": "FinancialPost_Business", "title": "SBC Medical Appoints Dr. Ewen Chee as Lead Doctor for Asia Strategy to Accelerate Global Expansion", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/sbc-medical-appoints-dr-ewen-chee-as-lead-doctor-for-asia-strategy-to-accelerate-global-expansion", "id_key": "6ba7eb86dd968a218bea51d919a44cc7568bfd48a4bd36cb141f15593d1f77cd", "summary": "IRVINE, Calif. — SBC Medical Group Holdings Incorporated (Nasdaq: SBC) (“SBC Medical”), a global provider of comprehensive consulting and management services to the medical corporations and their clinics, today announced that Dr. Ewen Chee, founder of Singapore’s leading aesthetic medical company Aesthetic Healthcare Holdings (“AHH”), has been appointed President of AHH and Lead Doctor for […]", "ingested_utc": "2025-08-25T07:35:39Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T07:35:39Z", "source": "FinancialPost_Business", "title": "Austria and Germany to become the first markets in the European Union (EU) to launch LEQEMBI® (lecanemab)", "url": "https://financialpost.com/globe-newswire/austria-and-germany-to-become-the-first-markets-in-the-european-union-eu-to-launch-leqembi-lecanemab", "id_key": "86f272ff48669b058f6019272cc8343188ae508350ec56026ca0ba0490ae76d2", "summary": "TOKYO and CAMBRIDGE, Mass., Aug. 25, 2025 (GLOBE NEWSWIRE) — Eisai Co., Ltd. (Headquarters: Tokyo, CEO: Haruo Naito, “Eisai”) and Biogen Inc. (Nasdaq: BIIB, Corporate headquarters: Cambridge, Massachusetts, CEO: Christopher A. Viehbacher, “Biogen”) announced today that the anti-amyloid beta (Aβ) monoclonal antibody “LEQEMBI®” has been launched in Austria on August 25, 2025 and will be […]", "ingested_utc": "2025-08-25T07:35:39Z"}
