{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T19:23:33Z", "source": "Guardian_World", "title": "Russia says Europe’s leaders don’t want peace in Ukraine as Vance says US will keep trying", "url": "https://www.theguardian.com/us-news/2025/aug/24/russia-ukraine-vance-trump", "id_key": "63ac721f03e3dc61bf5e191275751e417b55091bacadee31cc9901727375e70e", "summary": "Russian foreign minister praises Trump’s effort and was defensive when asked if Putin was ‘stringing along’ Trump Russia accused western European leaders on Sunday of not wanting peace in Ukraine, as Moscow’s most senior diplomat praised efforts by Donald Trump to end the war, while Vice-President JD Vance said the US would “keep on trying” to broker talks in the absence of a deal. Sergei Lavrov, the Russian foreign minister, made the comments during a sometimes contentious interview on NBC on Sunday morning, during which he denied his country had bombed civilian targets in Ukraine. Continue reading...", "ingested_utc": "2025-08-24T19:23:33Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T19:23:33Z", "source": "Guardian_World", "title": "UK MPs voice alarm at rise in online abuse over immigration debate", "url": "https://www.theguardian.com/uk-news/2025/aug/24/mps-voice-alarm-at-rise-in-online-abuse-over-immigration-debate", "id_key": "c233f7e9dc4df5dff8920bdb681955f724792a77c91fe3e21dc3540ab5cc535c", "summary": "After further demonstrations at hotels housing asylum seekers, MPs say harassment is worse than during Brexit MPs have raised the alarm about a rise in abuse linked to debates around immigration, with some reporting levels of online harassment and death threats worse than during the Brexit years. The warning came after a weekend of protests and counter protests at hotels used to house asylum seekers , with 15 people arrested on Saturday and demonstrations continuing into Sunday. Continue reading...", "ingested_utc": "2025-08-24T19:23:33Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T19:26:31Z", "source": "ArsTechnica_All", "title": "Time is running out for SpaceX to make a splash with second-gen Starship", "url": "https://arstechnica.com/space/2025/08/whats-the-goal-of-spacexs-10th-starship-test-flight-right-the-ship/", "id_key": "0ab8c7a9f3ebe61a59511b31995b8e4237174632d22f80d45a2b836c202ffe74", "summary": "SpaceX is gearing up for another Starship launch after three straight disappointing test flights.", "ingested_utc": "2025-08-24T19:26:31Z"}
