{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T11:37:37Z", "source": "Guardian_World", "title": "Nicola Sturgeon’s memoir Frankly taps into SNP discontent over party’s future", "url": "https://www.theguardian.com/politics/2025/aug/24/nicola-sturgeon-memoir-frankly-taps-into-voters-discontent-over-future-of-snp", "id_key": "bdeb89eddc9c688f93ec5206d3e7d4205c481cbfe21b652b7c048365e72b3b61", "summary": "Her critics reacted with fury but some in party felt nostalgia and ‘sense of loss for independence movement’ Nicola Sturgeon’s month-long promotional tour for her memoir Frankly comes to an end this Friday at the Southbank Centre in London where, according to one of many carefully placed publication interviews, she may consider moving to escape the “goldfish bowl scrutiny” of Scotland. The former first minister’s political memoir has generated a blizzard of headlines since its launch on 12 August . Some were diverting but ultimately inconsequential, like her choice of future base, others rubbed salt in raw wounds, reprising two of the most divisive episodes in the SNP’s recent history – the Scottish government’s investigation into allegations of sexual harassment made against predecessor Alex Salmond, and her flagship gender recognition reforms. Continue reading...", "ingested_utc": "2025-08-24T11:37:37Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T11:40:27Z", "source": "AlJazeera_All", "title": "There is something worse than starvation in Gaza", "url": "https://www.aljazeera.com/opinions/2025/8/24/there-is-something-worse-than-starvation-in-gaza?traffic_source=rss", "id_key": "16113079ff2c8a292b02e1076aa5aa69a8288757d106e1307688386cbd3b89e8", "summary": "It is Israel killing hope with its ceasefire negotiations games.", "ingested_utc": "2025-08-24T11:40:27Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T11:40:34Z", "source": "FinancialPost_Business", "title": "Ukraine Claims Drone Strike on Russian Ust-Luga Gas Facility", "url": "https://financialpost.com/pmn/business-pmn/russia-says-novatek-fuel-terminal-at-ust-luga-port-catches-fire", "id_key": "f3de76a47d1413299bfd14fc2e349d1df6b3c6756ebb09356d3edaf5490c73ec", "summary": "Ukraine’s state security service and special forces struck Russia’s Baltic port of Ust-Luga with long-range drones overnight, part of a continued effort to undermine Moscow’s energy infrastructure.", "ingested_utc": "2025-08-24T11:40:34Z"}
