{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:51:13Z", "source": "Guardian_World", "title": "Donald Trump accused of ‘turning military on American citizens’ over plans to send National Guard to Chicago – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/25/donald-trump-national-guard-plans-chicago-washington-dc-us-politics-latest-updates-news", "id_key": "fd6a609d774877cb3b3ed8c45ca7df38db173f1fcc45bcce7c2b50f5800a2ae0", "summary": "Illinois attorney general says president’s actions are ‘un-American’ and there is no emergency as Pentagon official confirms plans to send troops to city Hello and welcome to the US politics live blog. My name is Tom Ambrose and I’ll be bringing you the latest news lines over the next few hours. We start with news that Donald Trump has been accused of “turning the military on American citizens” after a Pentagon official confirmed that planning is under way to send National Guard troops to Chicago . His actions are not just un-American. They are unwise strategically. Our cities are not made safer by deploying the nation’s service members for civilian law enforcement duties when they do not have the appropriate training. To be clear: We have made no such request for the type of federal intervention we have seen in Los Angeles or Washington DC. There is no emergency in the state of Illinois. Tonight’s reporting from the Washington Post that President Trump is preparing to deploy federal troops in Chicago proves what we all know: he is willing to go to any lengths possible to create chaos if it means more political power-no matter who gets hurt. As lieutenant-governor and throughout my career, I’ve fervently fought for the reformation of our criminal legal system and under the Pritzker-Stratton administration, we’ve made tremendous progress. France summoned the American ambassador Charles Kushner after he wrote a letter to president Emmanuel Macron alleging France had failed to do enough to stem antisemitic violence , a French foreign ministry spokesperson said on Sunday. Sergei Lavrov, Moscow’s most senior diplomat, praised efforts by Donald Trump to end the war, in an interview on NBC on Sunday , while US vice-president JD Vance said Washington would “keep on trying” to broker talks in the absence of a deal. In the opening weeks of Donald Trump ’s second term, Gavin Newsom wagered that peacemaking was best: a tarmac greeting for Air Force One, an Oval Office visit and a podcast slot for Maga’s biggest names . But then Trump came for California , and its governor dropped the niceties. Read the full report here . The president and his allies have been accused of executing a “pattern of lawfare” akin to those exerted by authoritarian regimes in Hungary and Russia after adopting a new strategy to target political opponents: allegations of mortgage fraud. Read the full report here . The justice department is alleging in a new court filing that three Smartmatic executives who were indicted last year on bribery and money-laundering charges transferred money from a 2018 voting machine contract with Los Angeles county into slush funds that were originally set up to pay bribes to overseas election officials. Continue reading...", "ingested_utc": "2025-08-25T09:51:13Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T09:54:15Z", "source": "FinancialPost_Business", "title": "Canadians Load Up on US Stocks Despite Donald Trump’s Trade War", "url": "https://financialpost.com/pmn/business-pmn/canadians-load-up-on-us-stocks-despite-donald-trumps-trade-war", "id_key": "acad0e86264b48c52ad74a53733ad1796c8921911d661e758423ef647a62a3fc", "summary": "US President Donald Trump’s tariffs, threats of annexation and assorted insults have infuriated Canadians, leading them to sell off American real estate and boycott products. The nation’s investors seemingly never got the memo.", "ingested_utc": "2025-08-25T09:54:15Z"}
