{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:41:24Z", "source": "Guardian_Business", "title": "Fed chair Powell to give high-stakes speech at Jackson Hole amid Trump attacks", "url": "https://www.theguardian.com/business/2025/aug/22/jerome-powell-speech-jackson-hole", "id_key": "dbce6e062e8c21017fed0d03cc1da166ef225de079b9c9e5063a847ca8e5a109", "summary": "Jerome Powell – who Trump has urged to resign – will address the economic outlook at a symposium in Wyoming For months, the Federal Reserve chair, Jerome Powell, has ignored demands from Donald Trump to cut interest rates and defied the US president’s calls to resign. On Friday, as Trump ramps up his extraordinary attack on the central bank’s independence, Powell will set out where he thinks the world’s largest economy is headed in a closely scrutinized speech at the Jackson Hole symposium in Wyoming. Continue reading...", "ingested_utc": "2025-08-22T11:41:24Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:41:24Z", "source": "Guardian_Business", "title": "Government workers are ‘canary in coalmine’ for Trump bid to gut union rights, leaders warn", "url": "https://www.theguardian.com/us-news/2025/aug/22/trump-federal-workers-union-rights", "id_key": "5371bea59f102fcaac3120bead64941ef7806d0fb568fcc199ac777205c5817a", "summary": "Administration has stripped hundreds of thousands of their union contracts as White House says it is just getting started The Trump administration has unilaterally stripped hundreds of thousands of federal workers of their union contracts after a federal appeals court overruled an injunction which halted the plans. It is just getting started, according to the White House. An executive order issued in March sought to cancel all collective bargaining agreements for most federal employees, citing national security concerns – and remove collective bargaining rights from more than a million workers. Continue reading...", "ingested_utc": "2025-08-22T11:41:24Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:41:25Z", "source": "Guardian_World", "title": "Lyle Menendez to face California parole board after brother Erik denied freedom", "url": "https://www.theguardian.com/us-news/2025/aug/22/lyle-erik-menendez-parole-board", "id_key": "66ebbb298ae50c6d8f8269eab6aee5d5a5926697c763e010d821afcc95fe9019", "summary": "Erik will be eligible after three years as two brothers have spent 30 years in prison for the murder of their parents Lyle Menendez is set to face a California parole board a day after his brother was denied freedom after spending 30 years in prison in the slaying of their parents inside their California mansion. A panel of two California commissioners denied Erik Menendez parole for three years, after which he will be eligible again, in a case that continues to fascinate the public. A parole hearing for his brother Lyle Menendez, who is being held at the same prison in San Diego, is scheduled for Friday morning. The commissioners determined that Menendez should not be freed after an all-day hearing during which they questioned him about why he committed the crime and violated prison rules. They rejected parole despite strong support from family members who have advocated for the brothers’ release for months. Continue reading...", "ingested_utc": "2025-08-22T11:41:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:41:25Z", "source": "Guardian_World", "title": "First Thing: Israeli military’s own data indicates 83% civilian death rate in Gaza", "url": "https://www.theguardian.com/us-news/2025/aug/22/first-thing-israeli-military-own-data-83-per-cent-civilian-death-rate-gaza", "id_key": "3392065f45b514c72e0e699d18d1ac1b10dfd77012fd0aed398dc2b1d937da08", "summary": "Figures from classified IDF database listed 8,900 named fighters as dead or probably dead in May, as overall death toll reached 53,000. Plus, John Roberts and the death of rule of law in America Good morning. Figures from a classified Israeli military intelligence database indicate five out of six Palestinians killed by Israeli forces in Gaza have been civilians , an extreme rate of slaughter rarely matched in recent decades of warfare. How has Israel responded? The Israel Defense Forces said “figures presented in the article are incorrect”, without specifying which data the Israeli military disputed. It also said the numbers “do not reflect the data available in the IDF’s systems”, without detailing which systems. What are human rights experts and legal scholars saying about Israel’s actions in Gaza? Many genocide scholars, lawyers and human rights activists, including Israeli academics and campaign groups, say Israel is committing genocide in Gaza, citing the mass killing of civilians and imposed starvation. This is a developing story. Follow our updates here . Why did the judge decide to close it? In her 82-page order, published in the US district court’s southern district of Florida on Friday, Williams determined the facility was causing severe and irreparable damage to the fragile Florida Everglades. Continue reading...", "ingested_utc": "2025-08-22T11:41:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:41:46Z", "source": "Protos", "title": "Bitcoin Core devs call dissidents ‘Knotzis,’ find bug in their software", "url": "https://protos.com/bitcoin-core-devs-call-dissidents-knotzis-find-bug-in-their-software/", "id_key": "ba15e233afb655a0e9280e621dde317c2d3ff773525796f2dc5b673c18312a88", "summary": "The OP_RETURN war has degraded into childish rhetorical tactics, with Bitcoin Core devs laughing at Knots node operators. The post Bitcoin Core devs call dissidents ‘Knotzis,’ find bug in their software appeared first on Protos .", "ingested_utc": "2025-08-22T11:41:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:41:48Z", "source": "CryptoNews", "title": "[LIVE] SOL Price Tracker: Latest Solana News and Price Updates for August 22, 2025", "url": "https://cryptonews.com/news/sol-price-tracker-latest-solana-news-and-price-updates-for-august-22-2025/", "id_key": "608dceb6ae4e1fadb610a568fa63793a618b89db0c16402c0a1fb1cc22dc3dc7", "summary": "Solana’s native token SOL continues to draw attention from traders and investors as the crypto market navigates a mix of bullish signals and regulatory uncertainties. On August 22, 2025, SOL remains one of the top-performing altcoins by market capitalization, with its price movements closely watched for hints of broader market sentiment. Known for its high-speed […] The post [LIVE] SOL Price Tracker: Latest Solana News and Price Updates for August 22, 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-22T11:41:48Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:43:45Z", "source": "FT_Home", "title": "JPMorgan to pay $330mn to Malaysia to settle 1MDB claims", "url": "https://www.ft.com/content/63b81c66-efb5-4264-a73b-0617d856f441", "id_key": "0187267b70ebcffa08308d0b574efdbb78633228649721063f4972a6d3c5b72c", "summary": "Fraud on country’s sovereign wealth fund was one of the biggest in history", "ingested_utc": "2025-08-22T11:43:45Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:44:05Z", "source": "Engadget_All", "title": "Engadget Podcast: Google's Pixel 10 blowout", "url": "https://www.engadget.com/transportation/evs/engadget-podcast-googles-pixel-10-blowout-113041797.html?src=rss", "id_key": "41648abec1e39de9f30e3390b3f564c50202cf51392ea67c498495bc8c4e1495", "summary": "This week, Google unveiled its full suite of Pixel 10 devices during an event hosted by Jimmy Fallon, of all people. In this episode, Devindra and Engadget's Sam Rutherford dive into all of the new phone models and try to determine if Google has finally cracked the code on premium smartphones. Also, they chat about a few announcements from Gamescom 2025. Topics Google announces Pixel 10 and Pixel 10 Pro – 1:08 The Pixel 10 Pro Fold – 7:13 Pro Res Zoom promises up to 100x virtual zoom with an AI assist – 20:34 Pixel Watch 4: a more vibrant screen and satellite connectivity – 26:04 What’s hot at Gamescom: new details on the Xbox ROG Ally handset – 29:43 New updates to NVIDIA GeForce now – 34:43 Unfortunately, Elden Ring Tarnished Edition runs poorly on the Switch 2 – 37:43 Working on – 40:56 Pop culture picks – 41:57 Subscribe! iTunes Spotify Pocket Casts Stitcher Google Podcasts Credits Hosts: Devindra Hardawar and Sam Rutherford Producer: Ben Ellman Music: Dale North and Terrence O'Brien This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/engadget-podcast-googles-pixel-10-blowout-113041797.html?src=rss", "ingested_utc": "2025-08-22T11:44:05Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:44:20Z", "source": "FinancialPost_Business", "title": "Stocks Halt Run of Losses Ahead of Powell Address: Markets Wrap", "url": "https://financialpost.com/pmn/business-pmn/stocks-halt-run-of-losses-ahead-of-powell-address-markets-wrap", "id_key": "041ab26a90f31dc02192feba4514e76e36fca5f588831904ae28c135df98ac82", "summary": "US stock futures paused this week’s string of declines amid subdued trading ahead of Federal Reserve Chair Jerome Powell’s Jackson Hole speech, with markets scaling back bets on imminent rate cuts.", "ingested_utc": "2025-08-22T11:44:20Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:44:20Z", "source": "FinancialPost_Business", "title": "Harvest ETFs Announces August 2025 Distributions", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/harvest-etfs-announces-august-2025-distributions", "id_key": "a703e59acf6a6fabfc35c46f6a573f4de7a726f7e6ef9bd1d053186d4fc612f1", "summary": "OAKVILLE, Ontario — Harvest Portfolios Group Inc. (“Harvest”) announces the following monthly distributions for Harvest ETFs for the month ending August 31, 2025. The distributions will be paid on or about September 9, 2025 to unitholders of record on August 29, 2025 with an ex-dividend date of August 29, 2025. Harvest ETF Ticker Distribution Harvest […]", "ingested_utc": "2025-08-22T11:44:20Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:44:20Z", "source": "FinancialPost_Business", "title": "Harvest High Income Shares ETFs announces August 2025 Distributions", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/harvest-high-income-shares-etfs-announces-august-2025-distributions", "id_key": "d5602985069262297570bb01c82bde571875572846567c4627c155a118deebdb", "summary": "OAKVILLE, Ontario — Harvest Portfolios Group Inc. (“Harvest”) announces the following distributions for Harvest High Income Shares ETFs for the month ending August 31, 2025. The distribution will be paid on or about September 9, 2025 to unitholders of record on August 29, 2025 with an ex-dividend date of August 29, 2025. Harvest High Income […]", "ingested_utc": "2025-08-22T11:44:20Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:44:20Z", "source": "FinancialPost_Business", "title": "Three Powerhouse Real Teams Unite to Form Benson Crew", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/three-powerhouse-real-teams-unite-to-form-benson-crew", "id_key": "f249e2cbe337c332e194ccb66b681c39df215280793cc45f58cfa3c36b93679d", "summary": "With $6 billion in lifetime sales, the newly formed team sets a benchmark for culture, collaboration and performance MIAMI — The Real Brokerage Inc. (NASDAQ: REAX), a leading real estate technology platform transforming the industry through innovation and culture, today announced the formation of Benson Crew—now the largest Real team in Canada and the No. […]", "ingested_utc": "2025-08-22T11:44:20Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:44:20Z", "source": "FinancialPost_Business", "title": "BULGOLD Announces Filing of Second Quarter Financial Results for the Three and Six Months Ended June 30, 2025", "url": "https://financialpost.com/globe-newswire/bulgold-announces-filing-of-second-quarter-financial-results-for-the-three-and-six-months-ended-june-30-2025", "id_key": "b25dd1bfec4218a8b8992fac306c6111fc72d7006274b492b0896aa65e6ab44e", "summary": "TORONTO, Aug. 22, 2025 (GLOBE NEWSWIRE) — BULGOLD Inc. (TSXV: ZLTO) (the “Company” or “BULGOLD”) is pleased to announce that it has filed its unaudited condensed interim financial statements and MD&A for the second quarter ended June 30, 2025. For the 3 and 6 months ending June 30, 2025, the company incurred a net comprehensive […]", "ingested_utc": "2025-08-22T11:44:20Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:44:20Z", "source": "FinancialPost_Business", "title": "AGF Investments Announces August 2025 Cash Distributions for AGF Enhanced U.S. Equity Income Fund, AGF Total Return Bond Fund and AGF Systematic Global Infrastructure ETF", "url": "https://financialpost.com/globe-newswire/agf-investments-announces-august-2025-cash-distributions-for-agf-enhanced-u-s-equity-income-fund-agf-total-return-bond-fund-and-agf-systematic-global-infrastructure-etf", "id_key": "2aab5338965ed788db8b7bc4fc0b91df4e172a30f76f227e35ca3b7b983cffdc", "summary": "TORONTO, Aug. 22, 2025 (GLOBE NEWSWIRE) — AGF Investments Inc. (AGF Investments) (TSX:AGF.B) today announced the August 2025 cash distributions for AGF Enhanced U.S. Equity Income Fund*, AGF Total Return Bond Fund* and AGF Systematic Global Infrastructure ETF, which pay monthly distributions. Unitholders of record on August 29, 2025 will receive cash distributions payable on September 5, 2025. […]", "ingested_utc": "2025-08-22T11:44:20Z"}
