{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T16:57:32Z", "source": "Protos", "title": "What is Omar Rossi doing for Tether?", "url": "https://protos.com/what-is-omar-rossi-doing-for-tether/", "id_key": "693747850d257440382c75dc158a0e43a6ac824fc32f246580b89bd4d1ac565f", "summary": "Omar Rossi has worked for a variety of interesting financial firms in Switzerland and the Bahamas and now seems to be involved with Tether. The post What is Omar Rossi doing for Tether? appeared first on Protos .", "ingested_utc": "2025-08-22T16:57:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T16:57:34Z", "source": "CryptoNews", "title": "Hollywood Embraces Blockchain: Ron Perlman Launches Decentralized Film and TV  Platform", "url": "https://cryptonews.com/news/hollywood-embraces-blockchain-ron-perlman-launches-decentralized-film-and-tv-platform/", "id_key": "ecf646cf5ec5e542e657c19c582302b9b4e1e0f852d4d81ae565d83c0cc3c4d9", "summary": "Hollywood, the world’s oldest national film industry worth billions, faces new challenges as film makers struggle to remain in control of their data, IP rights and financial earnings.At the same time, moviegoers that once visited theatres to watch films have begun streaming movies at home. The issues facing the film industry have resulted in declining […] The post Hollywood Embraces Blockchain: Ron Perlman Launches Decentralized Film and TV Platform appeared first on Cryptonews .", "ingested_utc": "2025-08-22T16:57:34Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T16:59:54Z", "source": "Engadget_All", "title": "Is this Google's first Gemini-powered smart speaker?", "url": "https://www.engadget.com/home/smart-home/googles-first-gemini-smart-speaker-detailed-in-leak-164227031.html?src=rss", "id_key": "4d2293c7c18f0ff028ba75637e71162056b9036e9e41029fece0d98a6d962354", "summary": "Google held its annual Made by Google showcase this week, during which it unveiled the latest Pixel phones and various new AI features . What it didn’t announce is a Gemini-powered smart home speaker, but it might have snuck one into the presentation as an easter egg. As spotted by The Verge , about 15 minutes into the stream, on a table next to F1 driver Lando Norris during a Gemini demonstration, you can clearly see what looks a lot like a smart speaker. The fabric-wrapped device we see in the video is white with a light around its base, and it looks more like an upside down HomePod mini than any of Google's other speakers. According to Android Headlines , it’s called the Google Home Speaker, and is unsurprisingly powered by Gemini. Android Headlines claims to have seen more images of the as-yet unannounced smart speaker, which it says will also be available in red, light green and black. It adds that Google’s Gemini Live AI assistant will be a baked-in feature for voice conversations, though without a screen or camera there’s no visual element here. There could also be new natural voice options on the speaker, as well as standard features like media control and smart home automations. It can reportedly also detect unusual sounds like breaking glass or smoke alarms and can send an alert to your phone or tablet if this happens. According to the Android Headlines report, the Home Speaker can pair with a Google TV Streamer and double as an additional surround sound speaker, much like the HomePod does with Apple TV. It functions as a smart hub too, with support for Matter. Google announced Gemini for Home this week, which will gradually replace Google Assistant on the company’s existing smart devices, with free and paid tiers offered to users. What the leak doesn’t contain is a launch date for this mysterious speaker. But given that Google was seemingly happy enough to have one sitting there in its most important keynote of the year, the smart money would be on an official reveal pretty soon. Engadget reached out to Google for comment, but the company said it had nothing to share at this time. This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/googles-first-gemini-smart-speaker-detailed-in-leak-164227031.html?src=rss", "ingested_utc": "2025-08-22T16:59:54Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T17:00:10Z", "source": "FinancialPost_Business", "title": "Pop Mart rolling out mini Labubus and a long-fur version of the popular plush toy", "url": "https://financialpost.com/pmn/pop-mart-rolling-out-mini-labubus-and-a-long-fur-version-of-the-popular-plush-toy", "id_key": "987532443a2456930eec9d7ba4e52fb04b15361e9de2cf533805de1cb0526297", "summary": "China’s Pop Mart says it is rolling out a mini version of its popular Labubu plush toys this month, along with a new long-fur version of the toothy little monster. The Labubu, by artist and illustrator Kasing Lung, first appeared with pointed ears and pointy teeth, in three picture books inspired by Nordic mythology in […]", "ingested_utc": "2025-08-22T17:00:10Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T17:00:26Z", "source": "HackerNews_Top", "title": "A Guide to Gen AI / LLM Vibecoding for Expert Programmers", "url": "https://www.stochasticlifestyle.com/a-guide-to-gen-ai-llm-vibecoding-for-expert-programmers/", "id_key": "561a5a464836bef4c7e2bc2886053c6542a6925e69af6011fa822c99f90c3570", "summary": "Comments", "ingested_utc": "2025-08-22T17:00:26Z"}
