{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:47:46Z", "source": "Guardian_World", "title": "Trump ‘definitively’ rules out sending US ground troops to Ukraine, White House confirms – live", "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news", "id_key": "a2b011f26f1e9a59270decdbea7cdb83d56c028699c76bee4fc5437e8c586d4a", "summary": "Spokeswoman says national security team to work with Europe on Ukraine safety; Trump warns Putin of ‘rough situation’ if he does not move towards peace Volodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February , which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough. In his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports. A meeting between Zelenskyy and Putin ... could it finally happen? The need for security guarantees agreed – but details unclear Trump believes he is very good at solving conflicts A potential boost for the US arms industry Continue reading...", "ingested_utc": "2025-08-19T17:47:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:47:46Z", "source": "Guardian_World", "title": "Asda is still misfiring in supermarkets’ non-existent price war | Nils Pratley", "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2025/aug/19/asda-is-still-misfiring-in-supermarkets-non-existent-price-war", "id_key": "d26425bd0278bca1dd6f26090562bc82c06852cd6f7869a85bf12dc64ad08085", "summary": "The chain’s sales are down for the 15th month in a row and its market share has slumped from 14.8% to 11.8% since 2021 Lidl close to overtaking Morrisons as UK’s fifth-biggest supermarket Five months ago, the talk in supermarket-land was of price wars . A wounded Asda, with the corporate hero Allan Leighton back at the helm 25 years after leading the last turnaround, was out to restore the chain’s “DNA” as the price-setter among the traditional groups. A “pretty significant war chest” would be dedicated to the task, he promised . The group’s owners – the private equity firm TDR Capital and the remaining Issa brother from the 2021 leveraged buyout – were prepared to suffer a “material reduction in our profit” in the coming year in order to get the sales line moving again. Even shares in the mighty Tesco shuddered in the face of this apparent sudden shift in competitive conditions. Continue reading...", "ingested_utc": "2025-08-19T17:47:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:47:46Z", "source": "Guardian_World", "title": "‘Even Puerto Rico paid its bill’: Thames Water creditor suggests backers are safe", "url": "https://www.theguardian.com/business/2025/aug/19/thames-water-creditor-compares-uk-to-puerto-rico-over-treatment-of-lenders", "id_key": "9fee8df9eb2509064fc92e86f0edd40ea751e46618d01e5c07b3c2a93c90ab94", "summary": "Creditors of US territory’s were protected during municipal default, says Assured Guaranty’s chief executive The largest creditor to struggling water company Thames Water has said it is confident that it will not lose money, joking that the UK was comparable to Puerto Rico, which paid lenders to its water company despite a crippling debt crisis. Dominic Frederico, the chief executive of US insurer Assured Guaranty, suggested that the UK government would not impose losses on creditors. The company – which has an exposure of $2.4bn (£1.8bn) to Thames Water’s bonds – was “well protected in terms of the legal structure” from losing money, he told investors on a call on 8 August. Continue reading...", "ingested_utc": "2025-08-19T17:47:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:50:03Z", "source": "Arbitrum_Nitro_Releases", "title": "Arbitrum Nitro v3.7.0-rc.8", "url": "https://github.com/OffchainLabs/nitro/releases/tag/v3.7.0-rc.8", "id_key": "597271a6f50d912a2331d62ac90876e569ccc10f9f980727211ff16b9fe8ac16", "summary": "This release is available as a Docker Image on Docker Hub at offchainlabs/nitro-node:v3.7.0-rc.7-efa52d5 This Docker image specifies default flags in its entrypoint which should be replicated if you're overriding the entrypoint: /usr/local/bin/nitro --validation.wasm.allowed-wasm-module-roots /home/user/nitro-legacy/machines,/home/user/target/machines If you're running a validator without a split validation server (this will be true of most validators), you should instead use the image offchainlabs/nitro-node:v3.7.0-rc.7-efa52d5-validator which has the extra script /usr/local/bin/split-val-entry.sh as the entrypoint. ** Special Note Nitro 3.7.0 uses go-ethereum 1.15.11 and includes a brand new log indexing system called filtermaps that has resulted in an increase in log indexing latency due to Nitro’s current reliance on HashDB (instead of PathDB). In some cases, this can delay log queries from being served anywhere between 5 seconds to 2 minutes on Arbitrum One during long tail unindexing. We’ve observed that this happens roughly once per day based on Arbitrum One mainnet traffic levels. As such, Nitro 3.7.0 is not recommended for teams who need to serve log queries with consistent latency (e.g. eth_getLogs , eth_getFilterLogs , eth_getFilterChanges ). Teams running their own log indexers may be unaffected by these changes though. Future releases of Nitro are expected to fix the issue of log indexing being able to block log queries. What's Changed Various internal bugfixes Internal highlights bump actions/checkout to v5: #3478 correct workflow file references from .yaml to .yml: #3481 Fix ArbNativeTokenManager precompile inclusion: #3497 add configurable jit executable path via CLI flag: #3495 github actions: use foundry v1.0.0: #3499 block validator benchmark to use Options-based signature: #3502 Improve description of trivial contributions: #3504 stylus wasmer version: don't upgrade if unnecessary: #3508 Stylus cranelift: #3480 Update fastcache: #3503 GlobalState not in chain should be a fatal error when requesting a confirmed assertion: #3449 Basic seq-coordinator config validation: #3489 Close part files after the copy is done: #3512 resolve race condition in storage test goroutines: #3509 Fix relay backlog corruption at segment boundaries: #3516 Revert \"Disable HTTP/2 for das aggregator by default\": #3517 Return a fatal error instead of stopping the StopWaiter in case of Er…: #3520 Full Changelog : v3.7.0-rc.7...v3.7.0-rc.8", "ingested_utc": "2025-08-19T17:50:03Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:50:52Z", "source": "NPR_Top", "title": "Hurricane Erin update: Forecast sees huge storm moving closer to U.S.", "url": "https://www.npr.org/2025/08/19/nx-s1-5507004/hurricane-erin-forecast-outer-banks-east-coast", "id_key": "4cc09141220cce2272cc0db9357ccafadf91d637aab0c8bdb81c265357fd3eed", "summary": "Forecasts nudge Erin's likely path to the west, increasing the risks at U.S. beaches. Experts say the storm's massive size, rather than windspeed, is what makes it a threat.", "ingested_utc": "2025-08-19T17:50:52Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:51:13Z", "source": "TechCrunch_All", "title": "Databricks CEO says fresh $1B will help him attack a new AI database market", "url": "https://techcrunch.com/2025/08/19/databricks-ceo-says-fresh-1b-will-help-him-attack-a-new-ai-database-market/", "id_key": "6a34411a5a3de7e1a194472016e59ecf77afbc11a040b1a5d5e3246e07d0ede9", "summary": "The round, which pushes Databricks' valuation to $100B, was co-led by Insight Partners and Thrive. CEO Ali Ghodsi says he's found an enormous untapped AI agent market to spend the funds.", "ingested_utc": "2025-08-19T17:51:13Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:51:17Z", "source": "Engadget_All", "title": "Denshattack! is a blend of Tony Hawk, trains and shonen anime", "url": "https://www.engadget.com/gaming/denshattack-is-a-blend-of-tony-hawk-trains-and-shonen-anime-174106792.html?src=rss", "id_key": "f17ce5df3cefed8b2c6bb462475cf6af44f4beb5cac726077616fc8523bc7cd2", "summary": "Denshattack! is what happens when Tony Hawk trades in his skateboard for a high-speed Japanese train. Yes, you read that correctly. Denshattack! is the latest game from Barcelona indie studio Undercoders, and it's a delirious, high-speed action experience complete with flow states, a banging original soundtrack, flamboyant characters and coming-of-age drama. Players attempt to keep their train moving while jumping, wall riding, spinning, landing tricks and nailing combos. Between the rail-hopping action, there's a fully voice-acted story (in English and Japanese) about overcoming oppression and finding your true friends. It's a wacky mix of ideas, but it all comes together in a Jet Set Radio type of world that looks like a real thrill. Undercoders is based in Spain, but the studio founders have spent a lot of time backpacking through Japan, visiting the trains specifically. In a virtual briefing ahead of Denshattack! 's reveal at Gamescom Opening Night Live 2025 , director David Jaumandreu and his team couldn't stop giggling about how much they loved trains, and it was all fairly adorable. Denshattack! is due out in early 2026 for PC , PlayStation 5 and Xbox Series X/S, and it'll be available day-one on Game Pass. It features music from lead composer Tee Lopes, who's best known for Sonic Mania , Sonic Frontiers and Teenage Mutant Ninja Turtles: Shredder’s Revenge , and additional artists from video game music label Kid Katana will contribute to the soundtrack. This article originally appeared on Engadget at https://www.engadget.com/gaming/denshattack-is-a-blend-of-tony-hawk-trains-and-shonen-anime-174106792.html?src=rss", "ingested_utc": "2025-08-19T17:51:17Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:51:33Z", "source": "FinancialPost_Business", "title": "Unpaid work for flight attendants could be on the way out as union declares win", "url": "https://financialpost.com/pmn/unpaid-work-for-flight-attendants-could-be-on-the-way-out-as-union-declares-win", "id_key": "a37e6a502a3cc2779d7b2aacc05bf46dc8eed23f03588feb303cebc7c14fa626", "summary": "TORONTO — Unpaid ground time for flight attendants could be on the way out as Air Canada looks to be joining a growing number of airlines that have agreed to move away from the widespread practice. In announcing a tentative deal with the airline, the Canadian Union of Public Employees said “unpaid work is over” […]", "ingested_utc": "2025-08-19T17:51:33Z"}
