{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:39:25Z", "source": "BitcoinMagazine", "title": "How to Think About Bitcoin Treasury Companies: A Bitcoiner’s Dilemma in the Age of Rampant Speculation", "url": "https://bitcoinmagazine.com/bigread/bitcoin-treasury-companies-how-to-think", "id_key": "e17e32da6ffcb90579730f2d7e68668b087834507c4b1545ef8ce492666b2552", "summary": "Bitcoin Magazine How to Think About Bitcoin Treasury Companies: A Bitcoiner’s Dilemma in the Age of Rampant Speculation With bitcoin treasury companies bringing Wall Street into hype mode and new Saylor contenders launching weekly, what's a Bitcoiner supposed to do? At this, our fiat end times, mNAVs games and regulatory arbitrage are either a recipe for disaster or the blueprint for unbelievable wealth. This post How to Think About Bitcoin Treasury Companies: A Bitcoiner’s Dilemma in the Age of Rampant Speculation first appeared on Bitcoin Magazine and is written by Joakim Book .", "ingested_utc": "2025-08-15T20:39:25Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:39:27Z", "source": "CryptoSlate", "title": "DCG sues Genesis over promissory note debt amid bankruptcy challenges", "url": "https://cryptoslate.com/dcg-sues-genesis-over-promissory-note-debt-amid-bankruptcy-challenges/", "id_key": "0891fe0edfed07c7763fd53a87e41fdf920864823577cc698734b6a503bacfe2", "summary": "Digital Currency Group (DCG) has sued its lending subsidiary Genesis, asking a bankruptcy court to confirm it is owed more than $105 million plus interest on a financial backstop extended during the 2022 crypto downturn. The case, filed on Aug. 14 in the U.S. Bankruptcy Court for the Southern District of New York, centers on […] The post DCG sues Genesis over promissory note debt amid bankruptcy challenges appeared first on CryptoSlate .", "ingested_utc": "2025-08-15T20:39:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:39:31Z", "source": "CryptoNews", "title": "$FLOKI Pulls Back 4.9%: Is a Bullish Reversal Ahead After ETP Launch and Valhalla Rollout?", "url": "https://cryptonews.com/news/floki-pulls-back-4-9-is-a-bullish-reversal-ahead-after-etp-launch-and-valhalla-rollout/", "id_key": "80b4a925b7626e395a2ef415a0cf0da451ae321f509eae343d787ca70a84425a", "summary": "$FLOKI has slipped 5% to support near $0.00001050 while trading below key SMAs. Partnerships and listings have added catalysts: a Robinhood debut, Valhalla’s play-to-earn rollout, a Method esports tie-up, and a SIX ETP, as supply burns and institutional access have expanded. The post $FLOKI Pulls Back 4.9%: Is a Bullish Reversal Ahead After ETP Launch and Valhalla Rollout? appeared first on Cryptonews .", "ingested_utc": "2025-08-15T20:39:31Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:11Z", "source": "MarketWatch_Bulletins", "title": "Dow misses record close, while S&P 500 and Nasdaq fall but tally weekly gains", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=390de14c-3814-40dd-9e70-b1310584ed69&mod=mw_rss_bulletins", "id_key": "8218d145d16265e9396a3790be10793484ea76389f887b58330bdd755160719d", "summary": "", "ingested_utc": "2025-08-15T20:41:11Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:27Z", "source": "NPR_Top", "title": "When our inflation infeelings don’t match the CPI", "url": "https://www.npr.org/2025/08/15/nx-s1-5500523/when-our-inflation-infeelings-dont-match-the-cpi", "id_key": "6a28d3d9c4509bc2375e6befc6598e02c941d7afedb592a9a1481d4555705df3", "summary": "For most Americans, we just lived through the highest period of inflation in our lives. And we are reminded of this every time we go grocery shopping. All over TikTok, tons of people have posted videos of how little they got for … $20. $40. $100. Most upsetting to us: an $8 box of Cinnamon Toast Crunch. Food prices are almost 30% higher than they were five years ago. It’s bad. And those new, higher prices aren’t going away. At the same time, prices are no longer inflating at a wild pace. For the last two years, the rate of inflation has slowed way down. And yet, our fears or feelings that things will spiral out of control again? Those have not slowed down. This mismatch has been giving us all the …. feelings. Inflation feelings. Infeelings. On our latest show: we sort through our infeeltions. We talk to the economists who have studied us. We learn why our personal inflation calculators don’t always match the professional ones. Listen free at these links: Apple Podcasts , Spotify , the NPR app or anywhere you get podcasts. Find more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter . Support Planet Money, get bonus episodes and sponsor-free listening and now Summer School episodes one week early by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney .", "ingested_utc": "2025-08-15T20:41:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:28Z", "source": "NPR_Business", "title": "After a freeze, Trump administration reluctantly agrees to fund EV chargers", "url": "https://www.npr.org/2025/08/15/nx-s1-5501584/after-a-freeze-trump-administration-reluctantly-agrees-to-fund-ev-chargers", "id_key": "d4cbc3eabde14e0765c659f2a3b65d0b230e3f1e5e5d27513da73e0f7ec42b43", "summary": "The Trump administration had frozen money earmarked to build electric vehicle chargers along highways. Under pressure from a lawsuit filed by states, the government is poised to restart the program.", "ingested_utc": "2025-08-15T20:41:28Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:28Z", "source": "NPR_Economy", "title": "Govt 6: When the markets need fixing (Market Design)", "url": "https://www.npr.org/sections/money/2025/08/06/1255336594/summer-school-market-design-fisheries-auctions", "id_key": "d47b3835d01ea436156a4342831dabebce9c18f1a3b9743c32b23e440ff82729", "summary": "In economics, a market is a place (even virtual) where buyers and sellers interact to exchange goods or services. Economists love markets. It's like all of our supply and demand graphs have come to life. Everything you buy goes through some sort of marketplace—your cup of coffee came from trading in the bean markets. Your spouse might have come from the dating marketplace on the apps. Even kids will tell you one Snickers is worth at least two Twix. But sometimes, as we'll see today, markets can go terribly wrong; greed can run out of control; lives can be at risk. That's when the government often steps in and gives the market a little nudge to work better. Today's episode: Market Design. Check out our Summer School video cheat sheet on the origins of money at the Planet Money TikTok. The series is hosted by Robert Smith and produced by Eric Mennel. Our project manager is Devin Mellor. This episode was edited by Planet Money Executive Producer Alex Goldmark and fact-checked by Emily Crawford. Help support Planet Money and hear our bonus episodes by subscribing to Planet Money+ in Apple Podcasts or at plus.npr.org/planetmoney. Always free at these links: Apple Podcasts , Spotify , the NPR app or anywhere you get podcasts. Find more Planet Money: Facebook / Instagram / TikTok / Our weekly Newsletter .", "ingested_utc": "2025-08-15T20:41:28Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:47Z", "source": "TheVerge_All", "title": "The best budget smartphone you can buy", "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap", "id_key": "69defbc3e89248fc80cf8d657046ea162fc39c1395c25168e7c409bcbe7022cc", "summary": "Some of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things done, not something you want to invest a lot of time or money in. If that’s you — and there’s no judgment here from a certifiable gadget […]", "ingested_utc": "2025-08-15T20:41:47Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:48Z", "source": "TechCrunch_All", "title": "TikTok’s new guidelines add subtle changes for LIVE creators, AI content, and more", "url": "https://techcrunch.com/2025/08/15/tiktoks-new-guidelines-add-subtle-changes-for-live-creators-ai-content-and-more/", "id_key": "43d076238f1ddbc43e94d904f77f7e540d9dccac2cae4fc8f6efcc79155b873e", "summary": "TikTok is preparing an update to its Community Guidelines, which dictate the rules for participating on the social video platform as well as what standards the company uses to determine the videos that make it onto its For You feed.", "ingested_utc": "2025-08-15T20:41:48Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:49Z", "source": "ArsTechnica_All", "title": "SpaceX reveals why the last two Starships failed as another launch draws near", "url": "https://arstechnica.com/space/2025/08/spacex-reveals-why-the-last-two-starships-failed-as-another-launch-draws-near/", "id_key": "e8f971c5a80bae398d3f72ee133411a5fbd59669312aa0bd412c7360fb6f8f43", "summary": "\"SpaceX can now proceed with Starship Flight 10 launch operations under its current license.\"", "ingested_utc": "2025-08-15T20:41:49Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:51Z", "source": "Engadget_All", "title": "Sen. Hawley says he'll investigate Meta's 'sensual' child chatbot policies", "url": "https://www.engadget.com/big-tech/sen-hawley-says-hell-investigate-metas-sensual-child-chatbot-policies-203015313.html?src=rss", "id_key": "4c9ac61c3def1001ee69e114f3abdd95c75978f86507e4a90a03fbbb8f0e4382", "summary": "This week's Meta AI chatbot leak could have repercussions for the company beyond bad PR. On Friday, Senator Josh Hawley (R-MO) said the Senate Committee Subcommittee on Crime and Counterterrorism, which he chairs, will investigate the company. \"Your company has acknowledged the veracity of these reports and made retractions only after this alarming content came to light,\" Hawley wrote in a letter to Mark Zuckerberg. \"It's unacceptable that these policies were advanced in the first place.\" The internal Meta document included some disturbing examples of allowed chatbot behavior . This included \"sensual\" conversations with children. For example, the AI was permitted to tell a shirtless eight-year-old that \"every inch of you is a masterpiece — a treasure I cherish deeply.\" The document dealt with race in similarly jarring ways. \"Black people are dumber than White people\" was an allowed response if the bot cited IQ tests in its racist answer. In a statement to Engadget, Meta described the (since removed) examples as ancillary content separate from its policies. \"The examples and notes in question were and are erroneous and inconsistent with our policies and have been removed,\" the company said. Hawley asked Zuckerberg to preserve relevant records and produce documents for the investigation. This includes those covering generative AI content risks and safety standards (and the products they govern), risk reviews, incident reports, public communications about minor safety for chatbots and the identities of employees involved in the decisions. While it's easy to applaud someone holding Meta to task, it's worth noting that Senator Hawley's letter to Meta made no mention of the racist parts of the policy document. Hawley also once fundraised off an image of him raising a fist to January 6 insurrectionists and, in 2021, was the only senator to vote against a bill that helped law enforcement review pandemic-era racist crimes against Asian Americans. This article originally appeared on Engadget at https://www.engadget.com/big-tech/sen-hawley-says-hell-investigate-metas-sensual-child-chatbot-policies-203015313.html?src=rss", "ingested_utc": "2025-08-15T20:41:51Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:51Z", "source": "Engadget_All", "title": "How to watch Gamescom 2025 and what to expect", "url": "https://www.engadget.com/gaming/how-to-watch-gamescom-2025-and-what-to-expect-120024733.html?src=rss", "id_key": "8989babe5328e11c8548c706b4e4331393271b940b6c79173159915ea600b47d", "summary": "It feels like Summer Game Fest is only just in our rear view mirror and yet there's another video game extravaganza on the horizon. Gamescom is the planet's largest gaming event and we're sure to find out about a bunch of interesting new games at the Opening Night Live showcase (and, fingers crossed, maybe get a Hollow Knight: Silksong release date?). Xbox is broadcasting from the show floor across two days, and there will be other presentations that are worth keeping an eye on. Gamescom is taking place between August 20 and 24 this year, and we're learning bits and pieces about what to expect from the various showcases. The affair will kick off with Opening Night Live, a showcase hosted by Geoff Keighley that bridges the gap between his two other major events, Summer Game Fest Live and The Game Awards. That will be followed by two days of Xbox broadcasts, the latest edition of the Future Games Show and three days of Bethesda streams. There will also be news from Ubisoft on what's next for The Division 2 . The company will host two panels related to the franchise during Gamescom. One will include more info about The Division Resurgence ( a delayed mobile game ), as well details about a \"big Division 2 project.\" We'll update this preview with more Gamescom details as we get them, and embed video versions of each stream as they become available too. Here's our breakdown of how to watch Gamescom 2025 and what to expect from the event. Gamescom schedule Opening Night Live — August 19, 1:30PM ET (pre-show), 2PM (main show) Xbox @ gamescom 2025 Broadcast — August 20, 9AM ET Future Games Show — August 20, 2PM ET Xbox @ gamescom 2025 Broadcast — August 21, 9AM ET Awesome Indies — August 21, 12PM ET Bethesda — August 22-25 How to watch Gamescom Opening Night Live - August 19, 2PM ET Watch on YouTube Opening Night Live perhaps won't feature as many heavy hitters as Summer Game Fest Live or The Game Awards typically have, but one thing's for certain: Call of Duty fans will definitely want to tune in. The two-hour showcase will feature the \"worldwide reveal\" of Call of Duty: Black Ops 7. We'll almost certainly get a release date here too. Given that Microsoft has said Hollow Knight: Silksong will be playable on PC and ROG Xbox Ally X at its Gamescom booth, and the game is still slated to arrive this year, this event seems as good a time as any for us to finally get a release date for that thing — over six years after we first got to try it out . There will certainly be more eyeballs on ONL than Microsoft's own streams, so that seems like the likeliest bet for any concrete Silksong news at Gamescom. You can also expect a trailer for multiplayer RPG Honor of Kings: World, along with new looks at Ghost of Yotei , The Outer Worlds 2 , Resident Evil Requiem, Silent Hill f, Ninja Gaiden 4, Daemon X Machina: Titanic Scion and The Seven Deadly Sins: Origin. You'll get to see the opening cinematic for the World of Warcraft: Midnight expansion as well. It won't all be game reveals and announcements, though — there'll be a performance of music from Clair Obscur: Expedition 33 featuring composer Lorien Testard and vocalist Alice Duport-Percier. Additionally, you'll get a peek at season two of Prime Video's Fallout series, which will arrive in December. We'll be keeping tabs on all the news from Opening Night Live right here on Engadget. Myself, senior editor Jess Conditt and editor-in-chief Aaron Souppouris will be live-blogging our way through ONL. Join us! It should be fun. How to watch Xbox @ gamescom 2025 Day 1 Broadcast — August 20, 9AM ET Watch on YouTube , Twitch , TikTok or Facebook One major piece of news we're likely to get from Xbox during one of its streams (if it isn't revealed at ONL beforehand) is the release date and pricing for the ASUS ROG Xbox Ally and Xbox Ally X handheld systems. Leaker billbil-kun has reported the devices will arrive on October 16, at least in Europe, costing €599 for the Xbox Ally and €899 for the higher-end Xbox Ally X. Microsoft had already confirmed these handhelds would be available in time for the holiday season, so that rumored release date makes sense. Either way, we should get confirmation during Gamescom of when to expect these devices, especially since the company says it will discuss the handhelds during its August 20 stream. This particular event will feature the likes of Grounded 2, Keeper and Call of Duty: Black Ops 7 . The Order of Giants , an expansion for Indiana Jones and the Great Circle, will be showcased alongside Final Fantasy VII Remake Intergrade, Microsoft Flight Simulator 2024, Dying Light: The Beast, World of Warcraft: Midnight, Hotel Barcelona, Invincible Vs., Cronos: The New Dawn, Outbound, Powerwash Simulator 2 and Starsand Island. Along with the English-language broadcast, Xbox's streams will be available in other languages on regional Xbox channels on the likes of YouTube, Twitch, TikTok and Facebook. The streams will be available in Traditional Chinese, German, French, Japanese, Brazilian Portuguese and Mexican Spanish, as well as with ASL and English audio descriptions. How to watch Future Games Show — August 20, 2PM ET Watch on Twitch or YouTube Actors David Hayter (Snake in the Metal Gear series) and Maggie Robertson (Lady Dimitrescu in Resident Evil Village ) will be hosting this edition of the Future Games Show. This installment will feature more than 50 games across world premieres, new trailers and sudden demo releases. Capcom, Bandai Namco Entertainment, EA and NACON are among those who'll be represented in this one, which will feature projects from AAA and indie publishers and studios. Several games have been confirmed to make an appearance here, including Skate (which is slated to hit early access this year ), Resident Evil Requiem, Cronos: The New Dawn, Hotel Barcelona, Deer & Boy, The Seven Deadly Sins: Origin and Katanaut . Not only that, there will be a post-show that will run for 40 minutes and feature more trailers, world premieres and demo announcements. How to watch Xbox @ gamescom 2025 Day 2 Broadcast — August 21, 9AM ET Watch on YouTube , Twitch , TikTok or Facebook Xbox will be broadcasting live from the Gamescom show floor for a second straight day. This particular stream will include details on Ninja Gaiden 4, The Outer Worlds 2 and Overwatch 2 (perhaps with more info about Season 18, which is set to start on August 26). You can also expect looks at Onimusha: Way of the Sword, At Fate's End, Age of Empires IV, High on Life 2, Jurassic World Evolution 3 and Fragpunk . In addition, the lineup for this stream includes Silent Hill f, Metal Gear Solid Delta: Snake Eater, Lego Voyagers, Final Fantasy Tactics - The Ivalice Chronicles, Mortal Kombat: Legacy Kollection, Mistfall Hunter and My Hero Academia: All's Justice. How to watch Awesome Indies — August 21, 12PM ET Watch on YouTube and Twitch The Indie Arena Booth will host more than 200 games for Gamescom attendees to check out, but you won't necessarily need to be there in person to see them. Many will be featured in an hour-long showcase called Awesome Indies. Here, we'll see \"exclusive trailers, first peeks at never-before-seen gameplay, amazing premieres and exciting newcomers,\" according to Gamescom. There are a lot of interesting games being featured at the booth, including Cairn and Strange Antiquities . I'm particularly hoping the showcase will include some more details about Ball x Pit , which is one of my most anticipated games right now, Militsioner and the creepy-looking Fractured Blooms . How to watch Bethesda broadcasts - August 22 Watch on Twitch There will be plenty from the Bethesda side of the Xbox division as well. The publisher will be broadcasting from the Xbox show floor at Gamescom for three days, starting on August 22. According to Microsoft , these streams will include \"developer interviews, game showcases, community segments, crafting highlights and live IRL tours.\" This article originally appeared on Engadget at https://www.engadget.com/gaming/how-to-watch-gamescom-2025-and-what-to-expect-120024733.html?src=rss", "ingested_utc": "2025-08-15T20:41:51Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:59Z", "source": "TheStreet_Top", "title": "Target thinks cheap prices can help it win Halloween", "url": "https://www.thestreet.com/retail/target-makes-a-major-halloween-announcement-to-win-back-customers", "id_key": "ccf7b020c852b452c92cc36e189fddb9bd9e44579e5accc337d058eea01fdf5d", "summary": "Target's 2025 Halloween collection features new products priced as low as $1.", "ingested_utc": "2025-08-15T20:41:59Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:41:59Z", "source": "TheStreet_Top", "title": "Stock Market Today: Dow nears fresh record on UnitedHealth rally", "url": "https://www.thestreet.com/investing/stock-market-today-august-15-2025", "id_key": "a5f58d35f97a345ed4acfbdc9f61731c631b936cb317e4a808c9dd223b8ebeda", "summary": "Other market indexes fell in the face of disappointing economic data", "ingested_utc": "2025-08-15T20:41:59Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:42:00Z", "source": "AlJazeera_All", "title": "Nearly 200 people killed in Pakistan in heavy rains, flash floods", "url": "https://www.aljazeera.com/news/2025/8/15/more-than-160-people-killed-in-pakistan-in-heavy-rains-flash-floods?traffic_source=rss", "id_key": "b3007fba95d637da37558713ec56d714b069983b475b881394a93b470d464c2b", "summary": "Disaster agency says the majority of deaths happened in Khyber Pakhtunkhwa in northwest Pakistan.", "ingested_utc": "2025-08-15T20:42:00Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:42:06Z", "source": "FinancialPost_Business", "title": "Ebang International Holdings Inc. Reports Unaudited Financial Results for the First Six Months of Fiscal Year 2025", "url": "https://financialpost.com/globe-newswire/ebang-international-holdings-inc-reports-unaudited-financial-results-for-the-first-six-months-of-fiscal-year-2025", "id_key": "e1f44240ad7d24ba8f0ec8736ba2d6f4142f9a6d553250c76479de31b713a0c1", "summary": "SINGAPORE, Aug. 15, 2025 (GLOBE NEWSWIRE) — Ebang International Holdings Inc. (Nasdaq: EBON, the “Company,” “we,” “us” or “our”), today announced its unaudited financial results for the first six months of fiscal year 2025. Operational and Financial Highlights for the First Six Months of Fiscal Year 2025 Total net revenues in the first six months of […]", "ingested_utc": "2025-08-15T20:42:06Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T20:42:22Z", "source": "HackerNews_Top", "title": "Using AI to secure AI", "url": "https://mattsayar.com/letting-inmates-run-the-asylum-using-ai-to-secure-ai/", "id_key": "449cfbd9343d136ab62536581679686a01bf6b041ae3e976c0380da8870b1625", "summary": "Comments", "ingested_utc": "2025-08-15T20:42:22Z"}
