{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T19:37:31Z", "source": "Guardian_World", "title": "Ghislaine Maxwell interview transcript released by US justice department", "url": "https://www.theguardian.com/us-news/2025/aug/22/ghislaine-maxwell-interview-transcript-justice-department", "id_key": "1f1584939ac3bc4e58db577f5f71ca16f089b0cf69ce8bae117c89131f59eef9", "summary": "Interview with deputy attorney general Todd Blanche in July released by DoJ ‘in the interests of transparency’ US politics – latest updates The US Department of Justice has released the transcript and audio recording of an interview conducted by deputy attorney general Todd Blanche with the convicted sex trafficker Ghislaine Maxwell. In a post on X , Blanche said the materials were being released “in the interest of transparency”, providing links to the transcript and to audio files . Continue reading...", "ingested_utc": "2025-08-22T19:37:31Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T19:37:31Z", "source": "Guardian_World", "title": "Justice department releases transcripts of Ghislaine Maxwell interview with deputy attorney general – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/22/donald-trump-administration-federal-reserve-republicans-democrats-us-politics-live", "id_key": "106acef1c279e4a5206110b9f2c811db9fc4326de67ae3b7b3c61a74de3b2312", "summary": "Transcripts and audio recordings from Maxwell’s interviews with deputy attorney general Todd Blanche released As we bring you more information about the reported FBI raid on John Bolton’s Maryland home , it’s worth pointing out that Bolton was stripped of his security clearance when Trump started his second term in office. The president also got rid of Bolton’s government detail, despite being the target of an assassination plot due to Bolton’s criticism of the Iranian regime. Bolton served as Trump’s third national security advis er in his first term in office, but has since become a vocal critic of the president . Less than an hour ago, a post from Bolton’s X account critiqued the state of negotiations between Russia and Ukraine. “Russia has not changed its goal: drag Ukraine into a new Russian Empire,” he wrote. “Meanwhile, meetings will continue because Trump wants a Nobel Peace Prize, but I don’t see these talks making any progress.” Continue reading...", "ingested_utc": "2025-08-22T19:37:31Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T19:37:50Z", "source": "CryptoSlate", "title": "Second Circuit Court officially dismisses Ripple-SEC appeals, ending four-year legal battle", "url": "https://cryptoslate.com/second-circuit-court-officially-dismisses-ripple-sec-appeals-ending-four-year-legal-battle/", "id_key": "60f6516e5b73b6eb9ffc3f54156029758ccb2f4b4982beddcec8898adf04c273", "summary": "The US Court of Appeals for the Second Circuit issued a mandate on Aug. 22 approving the dismissal of the appeals in the case between Ripple and the Securities and Exchange Commission (SEC). The court order, shared by lawyer James Filan on X, officially ends one of crypto’s most consequential legal battles. Despite the news, […] The post Second Circuit Court officially dismisses Ripple-SEC appeals, ending four-year legal battle appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T19:37:50Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T19:37:55Z", "source": "CryptoNews", "title": "ChatGPT’s Bitcoin Analysis Flags $116K Rebound, But Will Powell’s Rate Cut Truly Spark Optimism? – Here’s What Data Says", "url": "https://cryptonews.com/news/chatgpts-bitcoin-analysis-reveals-116k-recovery-as-powells-rate-cut-hints-trigger-risk-on-rally/", "id_key": "ea556b8a39c5d839430b77eca7f73cf52c50ff515701ca663a24f82980142b08", "summary": "ChatGPT's Bitcoin analysis reveals dramatic recovery to $116,859 following sharp rally from $112,320 after Fed Chair Jerome Powell hinted at September rate cuts triggering risk-on sentiment despite facing $1.17B in ETF outflows and institutional selling pressure throughout the week while maintaining bullish structure above all major EMAs. The post ChatGPT’s Bitcoin Analysis Flags $116K Rebound, But Will Powell’s Rate Cut Truly Spark Optimism? – Here’s What Data Says appeared first on Cryptonews .", "ingested_utc": "2025-08-22T19:37:55Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T19:38:14Z", "source": "CoinMetrics_Blog", "title": "CMBI Multi-Asset Update: Focus CMBI 10", "url": "https://coinmetrics.io/wp-content/uploads/2025/08/Consultation-CMBI-10-Annualized-Traded-Value-Ratio.pdf", "id_key": "4ccec1a2bf1f602b519f718523cf58814e8e65a06bffa349e56bfb47ed26409f", "summary": "Coin Metrics is committed to ensuring that the CMBI 10 Index continues to remain representative of the market it is intended to track and meets the needs of investors. Regular reviews of index rules are undertaken to ensure they are aligned with stated index objectives. Coin Metrics periodically consults the market regarding significant changes to […] The post CMBI Multi-Asset Update: Focus CMBI 10 appeared first on Coin Metrics .", "ingested_utc": "2025-08-22T19:38:14Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T19:38:14Z", "source": "CoinMetrics_Blog", "title": "CMBI Total Market Update: Focus CMBITM", "url": "https://coinmetrics.io/wp-content/uploads/2025/08/Consultation-CMBITM-Annualized-Traded-Value-Ratio-.pdf", "id_key": "56fc23ea72687a0c2238706f257c4ef5e1bc1443164ffe1d0a263921b212bd2a", "summary": "Coin Metrics is committed to ensuring that the CMBITM Index continues to remain representative of the market it is intended to track and meets the needs of investors. Regular reviews of index rules are undertaken to ensure they are aligned with stated index objectives. Coin Metrics periodically consults the market regarding significant changes to the […] The post CMBI Total Market Update: Focus CMBITM appeared first on Coin Metrics .", "ingested_utc": "2025-08-22T19:38:14Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T19:40:17Z", "source": "TechCrunch_All", "title": "US government plans to take a 10% stake in Intel", "url": "https://techcrunch.com/2025/08/22/u-s-government-plans-to-take-a-10-stake-in-intel/", "id_key": "7a50958ccdeef95d8689f39efd5173d14ffc2272510fb62f6dd9488b46493ca0", "summary": "Such federal government ownership of a major corporation would mark a dramatic departure from long-standing U.S. policy.", "ingested_utc": "2025-08-22T19:40:17Z"}
