{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T20:50:40Z", "source": "Guardian_World", "title": "News live: Australia says Israel’s West Bank settlement plan is ‘unacceptable’ and demands press access to Gaza", "url": "https://www.theguardian.com/australia-news/live/2025/aug/22/australia-news-live-penny-wong-gaza-israel-netanyahu-anthony-albanese-childcare-safety-education-database-ntwnfb", "id_key": "71c1be00e7452374b85130994eb1da395319103d1fb700fabe3c8c8075a491e4", "summary": "Albanese government joins 20 other countries in condemning Israeli plan to expand Jewish settlements. Follow today’s news live Get our breaking news email , free app or daily news podcast Australia has joined 20 other countries in condemning Israel’s plans to expand Jewish settlements on the West Bank. In a move likely to further enrage benjamin Netanyahu and his rightwing-dominated ruling coalition, foreign minister Penny Wong said the Israeli plan for the E1 area east of Jerusalem was “unacceptable and a violation of international law”. The decision by the Israeli higher planning committee to approve plans for settlement construction in the E1 area, East of Jerusalem, is unacceptable and a violation of international law. We condemn this decision and call for its immediate reversal in the strongest terms. Continue reading...", "ingested_utc": "2025-08-21T20:50:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T20:50:40Z", "source": "Guardian_World", "title": "Lil Nas X arrested and hospitalized after altercation with police – reports", "url": "https://www.theguardian.com/music/2025/aug/21/lil-nas-x-arrested-hospitalized-police", "id_key": "41b13c894f1e591364949ee612355bc8e78d9da3dc1e22a939c8fcf4370ef0c8", "summary": "The 26-year-old rapper and singer was seen walking down the street in his underwear Thursday morning in LA Lil Nas X has been arrested after an altercation with police, according to reports. Officials confirmed to NBC that the 26-year-old rapper and singer was booked on suspicion of misdemeanour battery after he was confronted while walking down the street in his underwear. Continue reading...", "ingested_utc": "2025-08-21T20:50:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T20:51:03Z", "source": "CryptoNews", "title": "ChatGPT’s XRP Analysis Flags Bearish Setup Below EMAs – Eyes on SWIFT’s Integration", "url": "https://cryptonews.com/news/chatgpt-xrp-analysis-bearish-below-emas-swift-150t/", "id_key": "d7b8b4e06714f2ca81e14d0baa2ee9f3ec37ab00248c6526f06db8eef1cca6fc", "summary": "ChatGPT's XRP Analysis has detailed consolidation at $2.8993 under key EMAs with RSI 41, mixed MACD and light volume, as SWIFT has scheduled live trials for Nov. 2025 on a $150T network, with XRP and HBAR cited as candidates. Scenarios have outlined recovery toward $3.20–$3.40 or extended range. The post ChatGPT’s XRP Analysis Flags Bearish Setup Below EMAs – Eyes on SWIFT’s Integration appeared first on Cryptonews .", "ingested_utc": "2025-08-21T20:51:03Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T20:52:11Z", "source": "Arbitrum_Nitro_Releases", "title": "Arbitrum Nitro v3.7.0-rc.8", "url": "https://github.com/OffchainLabs/nitro/releases/tag/v3.7.0-rc.8", "id_key": "a3ea4e06b69065950fa0e75d2d75c79cafbe37baf3cd92ab15e38f401a1d9fbd", "summary": "This release is available as a Docker Image on Docker Hub at offchainlabs/nitro-node:v3.7.0-rc.8-6d34456 This Docker image specifies default flags in its entrypoint which should be replicated if you're overriding the entrypoint: /usr/local/bin/nitro --validation.wasm.allowed-wasm-module-roots /home/user/nitro-legacy/machines,/home/user/target/machines If you're running a validator without a split validation server (this will be true of most validators), you should instead use the image offchainlabs/nitro-node:v3.7.0-rc.8-6d34456-validator which has the extra script /usr/local/bin/split-val-entry.sh as the entrypoint. Special Note Nitro 3.7.0 uses go-ethereum 1.15.11 and includes a brand new log indexing system called filtermaps that has resulted in an increase in log indexing latency due to Nitro’s current reliance on HashDB (instead of PathDB). In some cases, this can delay log queries from being served anywhere between 5 seconds to 2 minutes on Arbitrum One during long tail unindexing. We’ve observed that this happens roughly once per day based on Arbitrum One mainnet traffic levels. Teams who need to serve log queries with consisten latency (e.g. eth_getLogs , eth_getFilterLogs , eth_getFilterChanges ) can use the configuration parameter --execution.rpc.log-history=0 to keep all log history, which will only slightly increase database growth. Teams running their own log indexer may be unaffected. Future releases of Nitro are expected to fix the issue of log indexing being able to block log queries. What's Changed Various internal bugfixes Internal highlights Fix ArbNativeTokenManager precompile inclusion: #3497 add configurable jit executable path via CLI flag: #3495 github actions: use foundry v1.0.0: #3499 block validator benchmark to use Options-based signature: #3502 Improve description of trivial contributions: #3504 stylus wasmer version: don't upgrade if unnecessary: #3508 Stylus cranelift: #3480 Update fastcache: #3503 BoLD GlobalState not in chain should be a fatal error:: #3449 Basic seq-coordinator config validation: #3489 Close part files after the copy is done: #3512 resolve race condition in storage test goroutines: #3509 Fix relay backlog corruption at segment boundaries: #3516 Revert \"Disable HTTP/2 for das aggregator by default\": #3517 Return a fatal error instead of stopping the StopWaiter in case of Er…: #3520 Full Changelog : v3.7.0-rc.7...v3.7.0-rc.8", "ingested_utc": "2025-08-21T20:52:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T20:53:39Z", "source": "FinancialPost_Business", "title": "CPABC: Tariff uncertainty disrupts Lower Mainland housing market as population growth outpaces housing completions", "url": "https://financialpost.com/globe-newswire/cpabc-tariff-uncertainty-disrupts-lower-mainland-housing-market-as-population-growth-outpaces-housing-completions", "id_key": "cfbc79fe937bb2a8f4b871e066a271b10000365e174a4a45c3f0c72519b7a28a", "summary": "VANCOUVER, British Columbia, Aug. 21, 2025 (GLOBE NEWSWIRE) — According to BC Check-Up: Live, an annual report by the Chartered Professional Accountants of British Columbia (CPABC) on demographic and affordability trends across the province, Southwest B.C.’s population grew by 137,616 new residents in 2024. “Population growth eclipsed the four per cent mark for the second […]", "ingested_utc": "2025-08-21T20:53:39Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T20:53:39Z", "source": "FinancialPost_Business", "title": "Stock Slide Deepens Before Powell as Yields Rise: Markets Wrap", "url": "https://financialpost.com/pmn/business-pmn/stock-slide-deepens-before-powell-as-yields-rise-markets-wrap", "id_key": "5b4bf668f03985fee53068e8751a6e171ca63ef39e362cf9772d3de07cb5768d", "summary": "Caution prevailed on Wall Street ahead of Jerome Powell’s speech, with stocks falling and bond yields rising as a key factory report raised concern that inflation pressures could dim the outlook for rate cuts.", "ingested_utc": "2025-08-21T20:53:39Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T20:53:54Z", "source": "HackerNews_Top", "title": "The power of two random choices (2012)", "url": "https://brooker.co.za/blog/2012/01/17/two-random.html", "id_key": "04f67972ac12ccd30394c1d3170cf65eddd6a0bb072badafd9c868c21c7af4ae", "summary": "Comments", "ingested_utc": "2025-08-21T20:53:54Z"}
