{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T21:50:19Z", "source": "CryptoSlate", "title": "Federal Reserve says US banks should serve crypto without fear of penalties", "url": "https://cryptoslate.com/federal-reserve-says-us-banks-can-now-serve-crypto-without-fear-of-penalties/", "id_key": "83e88c540cf23a92ece9ff5b4702ed9a03ba7816030de0a0ef3e4b0a9f82781b", "summary": "Federal Reserve Vice Chair for Supervision Michelle Bowman acknowledged that crypto firms experienced debanking due to regulatory uncertainty. During the Wyoming Blockchain Symposium on Aug. 19, Bowman also announced a fundamental shift in the Fed’s approach to blockchain innovation. She revealed the central bank eliminated reputational risk considerations from bank supervision in late June to […] The post Federal Reserve says US banks should serve crypto without fear of penalties appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T21:50:19Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T21:50:24Z", "source": "CryptoNews", "title": "Chair Paul Atkins Praise The Genius Act As A ‘Seminal’ Step For Crypto", "url": "https://cryptonews.com/news/theres-a-lot-of-spring-cleaning-to-be-done-at-the-sec-chair-paul-atkins-says/", "id_key": "31ebd884480b59beec909d3d753d515931474a628adcbf678559ca8166ba01ca", "summary": "Paul Atkins has praised the GENIUS Act at SALT Wyoming, calling Congress’s passage a “seminal” step toward crypto clarity. Treasury has sought public comment on illicit finance risks, Donald Trump has signed the law, and Scott Bessent has said stablecoins could expand dollar access. The post Chair Paul Atkins Praise The Genius Act As A ‘Seminal’ Step For Crypto appeared first on Cryptonews .", "ingested_utc": "2025-08-19T21:50:24Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T21:52:41Z", "source": "TheVerge_All", "title": "Google Gemini can now read your Docs aloud", "url": "https://www.theverge.com/news/761920/google-docs-gemini-ai-read-aloud", "id_key": "bb978ecbf2ddc586559ab4bdf5bb0e2debc4d91ec777ec9d0e57b42b0ba0eace", "summary": "Google Docs will now let you generate an audio version of your documents using AI. In a post announcing the rollout, Google says you can customize Gemini’s AI audio output with different voices and playback speeds. This feature isn’t just for a document’s creator, as Google says readers can access a shared document’s AI-generated audio […]", "ingested_utc": "2025-08-19T21:52:41Z"}
