{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:36:42Z", "source": "BBC_World", "title": "Russia is trying to stop meeting on peace and prolong war, Zelensky says", "url": "https://www.bbc.com/news/articles/ckgjpmg4r23o?at_medium=RSS&at_campaign=rss", "id_key": "a5d181b34e2a3976dcf0985f2eec673e5adac83eeac7e5d00c96b7b540ffdbd0", "summary": "Volodymyr Zelensky urges Western allies to impose fresh sanctions on Moscow if it shows no interest in peace.", "ingested_utc": "2025-08-22T20:36:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:36:42Z", "source": "BBC_World", "title": "Canada to drop some of its retaliatory tariffs on the US", "url": "https://www.bbc.com/news/articles/c5yk9dqlvygo?at_medium=RSS&at_campaign=rss", "id_key": "3e49960a6f9545754a195e810768fb1b52ee1c6edc53dfc4c753d551702b59de", "summary": "The move comes after the two countries blew past a self-imposed deadline to reach a trade agreement.", "ingested_utc": "2025-08-22T20:36:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:36:42Z", "source": "BBC_World", "title": "How Israel's policies created famine in Gaza", "url": "https://www.bbc.com/news/articles/ckg4p90z1kxo?at_medium=RSS&at_campaign=rss", "id_key": "af6f1046739529cec3e77cd006258cdef21e44b58c12f1af431d5336fc116068", "summary": "Israel has systematically obstructed food entering Gaza, aid agencies say, as a UN-backed body confirms a famine.", "ingested_utc": "2025-08-22T20:36:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:36:46Z", "source": "Guardian_World", "title": "John Bolton raid shows weaponization of FBI against Patel’s ‘gangsters’ list", "url": "https://www.theguardian.com/us-news/2025/aug/22/john-bolton-kash-patel-book-list", "id_key": "685e5d8b77cda44f2de4c91203993f51b71cc9ac5d747700491632be27651c72", "summary": "Ex-national security adviser and Trump critic is fifth in a list of 60 to have been investigated in the last seven months When Kash Patel, the FBI director, faced senators during his confirmation hearings on 30 January, he bristled at suggestions that his 2023 book contained an “enemies list”. The appendix to Government Gangsters, which included a list of names for 60 people , was simply documentation of those who had “weaponized” the government, he insisted. Seven months later, that denial appears increasingly hollow. Friday’s FBI search of the former national security adviser John Bolton’s home and office, reportedly to find classified documents, marks the fifth investigation targeting people from Patel’s book. Continue reading...", "ingested_utc": "2025-08-22T20:36:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:36:46Z", "source": "Guardian_World", "title": "Ghislaine Maxwell said she never saw Trump in ‘any inappropriate setting’, transcript shows", "url": "https://www.theguardian.com/us-news/2025/aug/22/ghislaine-maxwell-interview-transcript-justice-department", "id_key": "7c48364a63eb09206024cf5d99ccff930b1b80a3d7247e5b78675e167cd6d302", "summary": "Newly released files from June DoJ interview shows Maxwell detailed Epstein-Trump social relationship The US Department of Justice has released the transcript and audio recording of an interview conducted by deputy attorney general Todd Blanche with the convicted sex trafficker Ghislaine Maxwell. In a post on X , Blanche said the materials were being released “in the interest of transparency”, providing links to the transcript and to audio files . Continue reading...", "ingested_utc": "2025-08-22T20:36:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:37:01Z", "source": "Blockworks", "title": "Issuers keep filing ahead of expected crypto ETF launch frenzy", "url": "https://blockworks.co/news/issuers-filing-crypto-etf-frenzy", "id_key": "6fe956619799ec8b552b4abcb625140715397085cc3367f8245c49b61296d57c", "summary": "21Shares files for active crypto ETF, leveraged funds to “deliver strategies that adapt in real time to a rapidly evolving market”", "ingested_utc": "2025-08-22T20:37:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:37:05Z", "source": "CryptoSlate", "title": "Philippines lawmaker introduces legislation to acquire 10,000 Bitcoin for national security reserve", "url": "https://cryptoslate.com/philippines-lawmaker-introduces-legislation-to-acquire-10000-bitcoin-for-national-security-reserve/", "id_key": "c11ee1dff53d2bda3f9de953b8fcf6428177251867419d2f4300b1aea5d0834d", "summary": "A Philippine lawmaker has introduced a measure that would require the central bank to build a strategic Bitcoin reserve, marking one of the most ambitious crypto policy proposals in Southeast Asia. Representative Migz Villafuerte filed the “Strategic Bitcoin Reserve Act” in June, calling for the country’s central bank, Bangko Sentral ng Pilipinas (BSP), to purchase […] The post Philippines lawmaker introduces legislation to acquire 10,000 Bitcoin for national security reserve appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T20:37:05Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:38:54Z", "source": "MarketWatch_Bulletins", "title": "Stocks end sharply higher after Powell opens door to rate cut in Jackson Hole", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=6cbd6756-cc8c-4405-97e0-39cbac332b86&mod=mw_rss_bulletins", "id_key": "2afd5dd26fff1b410f9d9d6a2be73ab01fc3c9cb9dc8fddc190327e5e63beae9", "summary": "", "ingested_utc": "2025-08-22T20:38:54Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:10Z", "source": "NPR_Top", "title": "Kilmar Abrego Garcia released from federal custody pending criminal trial", "url": "https://www.npr.org/2025/08/22/nx-s1-5511177/kilmar-abrego-garcia-released-from-federal-custody-pending-criminal-trial", "id_key": "e969d6098d4c4a4a6dc53bb85f149c87dd6b769e4dea33d1d80cce5fe5f2c117", "summary": "The case of Abrego Garcia, a Maryland man originally from El Salvador, raised basic questions of due process in Trump's crackdown on undocumented immigrants after he was arrested and sent to a maximum security prison in El Salvador, violating a U.S. immigration judge's 2019 order prohibiting his deportation to his home country.", "ingested_utc": "2025-08-22T20:39:10Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:10Z", "source": "NPR_Top", "title": "Release of Uvalde school shooting documents raises questions for victims' families", "url": "https://www.npr.org/2025/08/22/nx-s1-5509904/release-of-uvalde-school-shooting-documents-raises-questions-for-victims-families", "id_key": "11efd530cb987f23d86e24349a93e46ceb9d41171846b72e53c81722b22eddd3", "summary": "Family members of the victims of the 2022 Uvalde school shooting where 19 students and two teachers died, recently got a look at newly released files from the Uvalde Consolidated School District and Uvalde County from the day of the shooting. More than three years after the tragedy, their suffering lingers without answers to their questions about how the security protocols failed that day.", "ingested_utc": "2025-08-22T20:39:10Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:10Z", "source": "NPR_Business", "title": "Fed Chair Jerome Powell signals possible rate cut, sending stocks sharply higher", "url": "https://www.npr.org/2025/08/22/nx-s1-5509941/jerome-powell-federal-reserve-interest-rates-jackson-hole", "id_key": "8693f423857a6340c88ed3c69feb1155fe01054717baae08c0b15b7bb9e38331", "summary": "Federal Reserve chairman Jerome Powell signaled a possible interest rate cut in the months to come, sending stocks sharply higher.", "ingested_utc": "2025-08-22T20:39:10Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:11Z", "source": "NPR_Economy", "title": "'I regret that I didn't fight harder,' former labor secretary Robert Reich says", "url": "https://www.npr.org/2025/08/21/nx-s1-5507068/i-regret-that-i-didnt-fight-harder-former-labor-secretary-robert-reich-says", "id_key": "2863e145b6ae087861ab11b60faf485ba78203efb37ffd8d115d4d6b753635f1", "summary": "Reich served under President Clinton from 1993 to 1997. He opens his new memoir, Coming Up Short, with an apology on behalf of the Baby Boom generation for failing to build a more just society.", "ingested_utc": "2025-08-22T20:39:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:12Z", "source": "NPR_World", "title": "U.N.-backed panel confirms famine in Gaza. And, DOJ to send Congress some Epstein docs", "url": "https://www.npr.org/2025/08/22/g-s1-84522/up-first-newsletter-famine-gaza-israel-jeffrey-epstein-jan-6-riot-doj", "id_key": "e04c976b5c1fd063b99ad8b08f7c400d5ce839459c02fac81c0d5ef62805622f", "summary": "A U.N.-backed panel of experts has declared that northern Gaza is suffering from famine. And, the DOJ is expected to release to Congress the first wave of documents related to its Jeffrey Epstein probe.", "ingested_utc": "2025-08-22T20:39:12Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:31Z", "source": "TheVerge_All", "title": "The power shift inside OpenAI", "url": "https://www.theverge.com/command-line-newsletter/764650/openai-chatgpt-fidji-simo-sam-altman-power-shift", "id_key": "4c23535b4222356c4dd83e15f65187266734a293b8b07b9cd1d10f1ba56bf06b", "summary": "Fidji Simo is wrapping up her first week at OpenAI, where she is expected to oversee most of the company's roughly 3,000 employees. To investors and partners, OpenAI leaders have been describing the former Instacart CEO as the kind of steady hand the company needs. Her mandate is clear: turn a chaotic, unprofitable startup into […]", "ingested_utc": "2025-08-22T20:39:31Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:31Z", "source": "TechCrunch_All", "title": "Bluesky blocks service in Mississippi over age assurance law", "url": "https://techcrunch.com/2025/08/22/bluesky-blocks-service-in-mississippi-over-age-assurance-law/", "id_key": "7d3d1c0d4cab86d2c7dd9a7c553c84c74132a2d0b9f4df8dae6c13eb137a37e1", "summary": "Bluesky has decided to block its service in Mississippi, rather than comply with the state's age verification law.", "ingested_utc": "2025-08-22T20:39:31Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:31Z", "source": "TechCrunch_All", "title": "Apple gets ready for AI in the enterprise with new ChatGPT configuration options", "url": "https://techcrunch.com/2025/08/22/apple-gets-ready-for-ai-in-the-enterprise-with-new-chatgpt-configuration-options/", "id_key": "805c9b7d1472befc6ff8419858dd0fd21b7f0ac0999de18fe4b382c303f6f0de", "summary": "Apple will let businesses configure ChatGPT enterprise access in the fall.", "ingested_utc": "2025-08-22T20:39:31Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:33Z", "source": "WIRED_All", "title": "The Best Big Screen Chromebook Is on Sale Now", "url": "https://www.wired.com/story/acer-cx15-deal/", "id_key": "e4c6024abdb4e1c9faa9df1fbbd59f99583e52c67324dacfe15e654ea5ee20d2", "summary": "A discount on the Asus CX15 Chromebook brings the price down to just $159.", "ingested_utc": "2025-08-22T20:39:33Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:34Z", "source": "Engadget_All", "title": "Samsung's new $29,999 Micro RGB TV looks ridiculously good", "url": "https://www.engadget.com/home/home-theater/samsungs-new-29999-micro-rgb-tv-looks-ridiculously-good-194629549.html?src=rss", "id_key": "d456ccd77f4c7f66048427bfc1be3cec320f2664b144c159f26f8c719a700907", "summary": "Last week, Samsung announced the world's first Micro RGB TV and while it sounded fantastic on paper, you can never really get a good sense of what a fresh display looks like until you see it in person. But after going to Samsung's new headquarters in New Jersey, I can attest that it is truly a sight to behold. Now, before we get to the TV itself, it's probably a good idea to dive into what's going on with Samsung's latest panel tech. In many ways, Micro RGB is a step up from current Mini LED screens. On a technical level, the Micro LEDs and the self-emissive pixels of Samsung's The Wall probably remain the more sophisticated end goal for next-gen TVs. At its core, Micro RGB is still based on LCD tech, the difference is that instead of using blue or white backlighting like a lot of sets today, it features individually controlled red, green and blue Micro LEDs (hence the name Micro RGB) to produce an even wider range of colors. The result is that Samsung claims this is the first TV to cover 100 percent of the BT.2020 standard. For context, that covers more than 75 percent of the visible spectrum and has an even wider color range than what you get from DCI-P3, which is one of the most commonly used high-end standards for modern filmmaking. In person, that means the TV can produce stunningly rich and vivid colors that put Samsung's other top-tier TVs to shame, including the new Neo QLED QN90F which starts at a whopping $26,999. Like its sibling, Samsung's Micro RGB TV is only available in one size (115 inches) and has a similar design, while its panel features a 144Hz refresh rate and a matte glare-free coating. But that's kind of where the similarities end, because this new flagship model features four times the number of dimming zones. Furthermore, because the Micro RGB LEDs require more computing power to manage all those pixels, Samsung had to create a new RGB Engine AI processor to properly control everything. In short, this is a lot of words to describe what might be the best-looking TV I've ever seen. While I only got to view some demo footage (which admittedly is designed to make the set look its best), I couldn't help but appreciate the sheer intensity of the hues and shades on display. When the video loop shifted to primarily blue and green scenes, the TV's color depth was almost overwhelming. That said, due to the immense size of the panel, when you get up close, it's easy to see individual pixels. However, when you're sitting in its sweet spot (about 11.5 feet from the display), everything looks ridiculously sharp and overflows with detail. And even for those off-center, there appeared to be no falloff in brightness or saturation. While Samsung's $26,999 Neo QLED QN90F boasts a price tag that's nearly as expensive as the $29,999 Micro RGB TV, there's still a very obvious difference in color. Sam Rutherford for Engadget Now, of course, the major downside of Samsung's new Micro RGB TV is that at $29,999, it makes everything but The Wall (which starts at a cool $40,000) seem cheap. But the funny thing is that when compared to the Neo QLED QN90F, which Samsung also had on display in a nearby room, the difference in quality and color was immediately obvious. This sort of makes me wonder why anyone with super deep pockets would even consider the latter just to save a few thousand dollars, because when you see them in person, there's no doubt which set is superior. Unfortunately, the Micro RGB's full glory doesn't translate across the internet due to the much more limited specs of the web. It's one of those things you need to see for yourself to fully grasp. But if you're the kind of person with enough money that you don't need to care about price tags, Samsung's latest flagship should be an immediate contender as the centerpiece in your mansion. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/samsungs-new-29999-micro-rgb-tv-looks-ridiculously-good-194629549.html?src=rss", "ingested_utc": "2025-08-22T20:39:34Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:42Z", "source": "TheStreet_Top", "title": "Amazon is selling a $60 lighted makeup mirror for $38 that's 'stylish and practical'", "url": "https://www.thestreet.com/deals/gvnkvn-lighted-makeup-mirror-amazon-sale", "id_key": "bdb7e5fb4e0aec28461a242bd961e5feb95d9692d675844bfba5715db41b5ee5", "summary": "\"I highly recommend this mirror for anyone looking to upgrade their beauty routine!\"", "ingested_utc": "2025-08-22T20:39:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:42Z", "source": "TheStreet_Top", "title": "Amazon is selling a $390 porch swing for $214 that's perfect for outdoor lounging year-round", "url": "https://www.thestreet.com/deals/outsunny-two-person-patio-swing-bench-amazon-sale", "id_key": "116a481d6de1c24d2601f67b56ba9d8fff776d3168b04845a671b1ceca89d19a", "summary": "It’s a nice addition to my deck, and very relaxing.\"", "ingested_utc": "2025-08-22T20:39:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:50Z", "source": "FinancialPost_Business", "title": "Citibank Announces $1.75 Billion Redemption of 5.864% Notes Due 2025 and $750 Million Redemption of Floating Rate Notes Due 2025", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/citibank-announces-1-75-billion-redemption-of-5-864-notes-due-2025-and-750-million-redemption-of-floating-rate-notes-due-2025", "id_key": "298ea0505e7916cfea7b90f79039c8c810a234bbe40179778d66b1b39bab5928", "summary": "NEW YORK — Citibank, N.A. is announcing the redemption, in whole, constituting $1,750,000,000 of its 5.864% Notes due 2025 (the “fixed rate notes”) (ISIN: US17325FBA57) and $750,000,000 of its Floating Rate Notes due 2025 (the “floating rate notes” and together with the fixed rate notes, the “notes”) (ISIN: US17325FAZ18). The redemption date for the notes […]", "ingested_utc": "2025-08-22T20:39:50Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:39:50Z", "source": "FinancialPost_Business", "title": "Devonian Provides Corporate Update and Additional Information Regarding its Previously Announced Private Placement", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/devonian-provides-corporate-update-and-additional-information-regarding-its-previously-announced-private-placement", "id_key": "42362a4d3ae08111571b151ac21cf030f7d3759f6fec47f4febb5dcb10569395", "summary": "QUEBEC CITY — Devonian Health Group Inc. (“Devonian” or the “Corporation”) (TSXV: GSD; OTCQB: DVHGF), a clinical stage corporation focused on developing unique solutions to inflammatory diseases, provides today corporate update: Thykamine™: Pipeline Advances on Multiple Fronts On the manufacturing front, batch-to-batch consistency of Thykamine™ has been validated through advanced analytical techniques, including High Performance […]", "ingested_utc": "2025-08-22T20:39:50Z"}
