{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:35:45Z", "source": "Guardian_World", "title": "Middle East crisis live: time not right to recognise Palestinian state, says Danish PM – updates", "url": "https://www.theguardian.com/world/live/2025/aug/16/middle-east-crisis-gaza-israel-hamas-lebanon-hezbollah-latest-news-updates", "id_key": "d0ae82e6b312d41ee8ae78107226f3a10cb6d89251ee1bdb6d5ce8cb479896f1", "summary": "Mette Frederiksen says recognition should take place when a ‘sustainable and democratic state’ could be created, and that Denmark would use its EU presidency to increase pressure on Israel and Hamas The Metropolitan police has said that 60 more people will be prosecuted for showing support for Palestine Action, which was proscribed by the UK government last month. More than 700 people have been arrested for supporting the group since its proscription on 5 July. We are deeply concerned about the unimaginable crisis in Gaza, which is having a terrible impact on civilians and especially the children. Starvation is deepening. Water scarcity is increasing very much each day. Colleagues on the ground are reporting that people are now basically rationing between either using water for drinking or for hygiene. Continue reading...", "ingested_utc": "2025-08-16T14:35:45Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:35:45Z", "source": "Guardian_World", "title": "Israeli government official arrested in Nevada in internet crimes against children sting", "url": "https://www.theguardian.com/us-news/2025/aug/16/nevada-arrest-israeli-official", "id_key": "b7a48571cd85aea146fbb977cc79b1cf0f3e1c171d4b529b4095628379724a78", "summary": "Tom Artiom Alexandrovich was released and returned to Israel after being charged with luring a child for a sex act An Israeli government cybersecurity official was reportedly arrested recently by Las Vegas police and other authorities in Nevada who were conducting an undercover investigation aimed at online users seeking to sexually prey on children. Tom Artiom Alexandrovich, 38, faces felony charges of luring a child with a computer for a sex act, alongside several other suspects who were apprehended during the two-week sting operation, the Las Vegas metropolitan police department said in a statement published on Friday. He has since evidently been released from custody and returned to Israel. Continue reading...", "ingested_utc": "2025-08-16T14:35:45Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:36:08Z", "source": "CryptoNews", "title": "Spot Ethereum ETFs Post $59M Outflows, Breaking 8-Day $3.7B Buying Streak", "url": "https://cryptonews.com/news/spot-ether-etfs-post-59m-outflows-breaking-8-day-3-7b-buying-streak/", "id_key": "d345bb6905f1546e8753a46b16c957fffbfe2d5e0d9a3b6b58f7b08837b2e19f", "summary": "Spot Ethereum ETFs record $59.3M outflows ending unprecedented 8-day buying streak that brought in $3.7B as BlackRock accumulates $1B during market selloff with ETH approaching all-time high. The post Spot Ethereum ETFs Post $59M Outflows, Breaking 8-Day $3.7B Buying Streak appeared first on Cryptonews .", "ingested_utc": "2025-08-16T14:36:08Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:36:08Z", "source": "CryptoNews", "title": "Grayscale Moves Forward With Dogecoin ETF Plan Under Ticker ‘GDOG’", "url": "https://cryptonews.com/news/grayscale-moves-forward-with-dogecoin-etf-plan-under-ticker-gdog/", "id_key": "a54b7b579643f31400d7baf0c538067c757169d40a481b33126d2891c37f675a", "summary": "Grayscale is pushing ahead with its bid to launch a Dogecoin exchange-traded fund, revealing the ticker “GDOG” in its latest SEC filing. The post Grayscale Moves Forward With Dogecoin ETF Plan Under Ticker ‘GDOG’ appeared first on Cryptonews .", "ingested_utc": "2025-08-16T14:36:08Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:37:51Z", "source": "MarketWatch_Bulletins", "title": "Inflation alarm bells went off again and prices are rising. How bad will it get?", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=80f039cf-defe-4d93-9bcc-e180dd4482b8&mod=mw_rss_bulletins", "id_key": "0f294c92d616c50ddc92809a4aa057c3db76ae07684f1b6a95dfe622cfb7b446", "summary": "", "ingested_utc": "2025-08-16T14:37:51Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:37:59Z", "source": "NYTimes_World", "title": "Live Updates: Trump Backs Plan to Cede Land for Peace in Ukraine", "url": "https://www.nytimes.com/live/2025/08/16/world/trump-putin-meeting-alaska", "id_key": "e09be6c6c654a96012b1477c8182738ed6143f3854dc5e9b1006fff02a13c798", "summary": "After meeting the Russian president, President Trump told European leaders he now favors giving up unoccupied Ukrainian land to Russia to end the fighting, a concession Ukraine has long opposed.", "ingested_utc": "2025-08-16T14:37:59Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:38:29Z", "source": "Engadget_All", "title": "Apple's iPad Air M3 is cheaper than ever right now", "url": "https://www.engadget.com/deals/apples-ipad-air-m3-is-cheaper-than-ever-right-now-162908763.html?src=rss", "id_key": "b197975fd0273b0875ade97dc0b3780a62ef4025d76969439f3cbd162703013b", "summary": "For a lot of people, the iPad Air is Apple’s goldilocks tablet. It’s more powerful and available in a larger size than the entry-level iPad, but a lot less expensive than the iPad Pro, which can be overkill for some. Right now, there's a great Apple iPad Air M3 price drop on Amazon: you can get one for $150 less than usual. This deal applies to each configuration of the 11-inch and 13-inch versions of the most recent iPad Air. So, the 11-inch model is as low as $449, while the 13-inch model is down to $649. The same deals can be found at Best Buy and Target if you prefer to shop somewhere other than Amazon. This is an all-time low price and beats the deal we saw on Prime Day by $30. The iPad Air M3 is more of an iterative refresh than a grand overhaul, but the spec bump means it’ll last you a long time before the tablet’s performance becomes a problem. This iPad occupies the position of \"best for most\" in our iPad buying guide , reinforcing that goldilocks analogy. The M3 chip is the main draw here, with Geekbench 6 scores proclaiming it around 16 percent more powerful than the M2 iPad Air, which is no slouch itself. Beyond the chip, it has a superior display and speakers to the entry-level model , and wider accessory support. You also get the option of a 13-inch display, which is great for artists or anyone who sees the iPad as a viable laptop replacement. If there’s an obvious downside to the iPad Air M3, it’s that it doesn't have the nice 120Hz OLED display of the iPad Pro. This is hardly surprising, as Apple often focuses on display tech to differentiate its Pro and non-Pro devices, but it’s probably time the refresh rate on the middle-of-the-road iPad at least jumped up to ProMotion. Face ID is long overdue too. If you can live with these caveats, though, the iPad Air is an excellent option, particularly at this price. There are a couple of other iPads on sale at Amazon right now, too, if you think the Air is too much for your needs. The iPad A16 , Apple's entry-level tablet, is down to $299, while the latest iPad mini is on sale for $399. Both models were slightly cheaper during Prime Day in July, but these discounts are still worth considering if you're looking to pick up a newer iPad for less. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/apples-ipad-air-m3-is-cheaper-than-ever-right-now-162908763.html?src=rss", "ingested_utc": "2025-08-16T14:38:29Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:38:29Z", "source": "Engadget_All", "title": "How to use (or turn off) your Instagram Map", "url": "https://www.engadget.com/social-media/how-to-use-or-turn-off-your-instagram-map-140035365.html?src=rss", "id_key": "4ee4859ef76871c16f4a546754347fae883663632aa59dce93012803bcef9ad3", "summary": "Instagram Map , the new Instagram feature copying Snapchat's Snap Map , makes it simple to share your location with friends. So simple you might not understand who you're sharing it without digging into your settings. That's naturally led to confusion from some Instagram users as to how the feature works. If you already spend a lot of time on Instagram and are looking for a way to see where your friends have been, it's worth familiarizing yourself with how Instagram Map works. And if you're worried about what information Instagram is broadcasting without your knowledge, you might as well get comfortable with the feature's settings. Here's how to do both in the Instagram app. How to use Instagram Map Ian Carlos Campbell for Engadget To access Instagram Map, you'll have to head to the DMs section of Instagram, and then tap on the Map icon in the top row of status icons. The first time you tap on the map, Instagram will walk you through how Instagram Map shares your location, and why Location Services needs to be enabled for it will work. Then, if you're not already sharing your location with Instagram, you'll receive a pop-up from your phone asking if you want to share your location. Tapping through that will take you to the map itself. The majority of the Instagram Map is taken up by a map displaying your current location, with a search bar at the bottom for looking up the location of your friends. Scroll around for a bit and your might see a profile picture marking a friend's current location, or miniature posts tagged with a specific location. There's a few basic things you can do with Instagram Map: Swipe around and see friends' posts displayed geographically Use the search bar to find a friend's current location or recent tagged posts Tap on a friend to be taken to their profile, or a post to see it in full Instagram Map is primarily informational. It can tell your where your friends are or where they've recently been, and let you view content based on where it was posted. It's really not much more complicated then that. Unless you're picky about who can see your location. How to stop sharing your location with Instagram Map Ian Carlos Campbell for Engadget Sharing your location on Instagram Map is opt-in. Your current location won't be shared on Instagram unless you actively choose to share it. What will be there are any posts that have a location tagged in them, something that's an option every time you add photos and videos to your Stories or your grid. Instagram gives you four different sharing options for the Map. You can share with: Friends: Followers that you follow back Close Friends: Followers already in your Close Friends list Only these friends: Specific people you choose No one: Don't share your location (except for posts with tagged locations) So to disable location sharing entirely in Instagram Map, or change who can see your location: Open the Instagram app. Tap on the DMs icon in the top-right corner . Tap on the Map icon. Tap on the Location Settings menu (shaped like a gear) in the top-right corner. And then tap on \"No one\" , to disable location sharing. To change who you share your location with, follow the same steps except instead of choosing \"No one,\" choose one of the other options Instagram offers. How to never share specific locations on Instagram Map Ian Carlos Campbell for Engadget For even more granular control over location sharing, you can also add specific locations to a list of \"Hidden Places\" that will never appear on Instagram Map while you're visiting. If you want to modify that list, open the Map feature, then: Tap on Location Settings (the gear icon) in the top-right corner. Tap on the three-dot menu in the corner of the settings menu. Tap on Hide Places . Tap and drag a pin on the map to mark a hidden place, and then set a radius around it with the slider. Type in the name of the place and then tap Done . This article originally appeared on Engadget at https://www.engadget.com/social-media/how-to-use-or-turn-off-your-instagram-map-140035365.html?src=rss", "ingested_utc": "2025-08-16T14:38:29Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:38:38Z", "source": "AlJazeera_All", "title": "A hundred Hiroshimas", "url": "https://www.aljazeera.com/video/business-of-war/2025/8/16/a-hundred-hiroshimas?traffic_source=rss", "id_key": "623061769bb9dd84065fbc2508ce0438a06178244f6257f9ced16ddfd6eb374f", "summary": "Hind Hassan examines the prospect of a new nuclear arms race, the companies helping to fuel it and the dangers it poses.", "ingested_utc": "2025-08-16T14:38:38Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T14:39:02Z", "source": "HackerNews_Top", "title": "Toothpaste made from hair provides natural root to repair teeth", "url": "https://www.kcl.ac.uk/news/toothpaste-made-from-hair-provides-natural-root-to-repair-teeth", "id_key": "6c70b7e5e3505fa0f7c3a0538de461f1d9823cab00d0d563d1a2b98f7c61cecf", "summary": "Comments", "ingested_utc": "2025-08-16T14:39:02Z"}
