{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T16:43:08Z", "source": "Guardian_World", "title": "Farage  adviser said UK would be better off if it had not fought Nazi Germany", "url": "https://www.theguardian.com/politics/2025/aug/16/nigel-farage-adviser-uk-would-be-better-off-if-it-had-not-fought-nazi-germany", "id_key": "3b623d622fd636e95939715925c451d50ffe2f923d7b894b453d75433b34c4a1", "summary": "Exclusive: Jack Anderton says UK may ‘regain’ former colonies in future and suggests end to support for Ukraine An adviser used by Nigel Farage and others in Reform UK to boost their social media popularity has suggested that Britain would be better off had it stayed neutral in the second world war instead of fighting Nazi Germany. Jack Anderton, who ran Farage’s hugely successful TikTok account before helping Luke Campbell become the Reform mayor of Hull and East Yorkshire, also said the UK should not support Ukraine in its fight against Russian aggression. Continue reading...", "ingested_utc": "2025-08-16T16:43:08Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T16:45:57Z", "source": "Engadget_All", "title": "Court blocks FTC investigation into Media Matters' alleged scheme against X", "url": "https://www.engadget.com/social-media/court-blocks-ftc-investigation-into-media-matters-alleged-scheme-against-x-160021473.html?src=rss", "id_key": "243d6676e9548da7a7e9b7affbbb007f6ebf4ce8c125cca1f41758d0e30c1487", "summary": "The court has blocked the Federal Trade Commission's investigation into Media Matters, the media nonprofit that previously published research showing that ads appeared on X alongside neo-Nazi and other antisemitic content. In 2023, Elon Musk's X filed a lawsuit against the media watchdog following an advertiser exodus. It accused Media Matters of \"knowingly and maliciously manufactur[ing] side-by-side images depicting advertisers' posts on X Corp.'s social media platform beside Neo-Nazi and white national fringe content.\" Just this May, the FTC started looking into whether the nonprofit violated antitrust laws by allegedly colluding with advertising and advocacy groups to boycott X. In June, Media Matters sued the FTC , accusing it of unfairly targeting the group in retaliation for past criticisms of X. \"The Federal Trade Commission seeks to punish Media Matters for its journalism and speech in exposing matters of substantial public concern — including how X.com has enabled and profited from extremist content that proliferated after Elon Musk took over the platform formerly known as Twitter,\" the group said at the time. Now, Judge Sparkle L. Sooknanan has granted a preliminary injunction in the nonprofit's favor. Sooknanan has agreed with the group that the FTC's investigation is \"a retaliatory act\" and has noted that it is \"likely to succeed on its First Amendment retaliation claim.\" She wrote in her decision that such probes would deter other reporters from speaking again. \"Indeed, the FTC's [investigation] has had its intended effect.\" Apparently, because of the probe, Media Matters has \"decided against pursuing certain stories about the FTC, Chairman Ferguson, and Mr. Musk.\" \"The court’s ruling demonstrates the importance of fighting over folding, which far too many are doing when confronted with intimidation from the Trump administration,\" Angelo Carusone, the president of Media Matters, told The New York Times . \"We will continue to stand up and fight for the First Amendment rights that protect every American.\" As the publication notes, courts had also blocked investigations into the group by the attorneys general in Texas and Missouri. Musk's lawsuits against the nonprofit, however, are still ongoing. This article originally appeared on Engadget at https://www.engadget.com/social-media/court-blocks-ftc-investigation-into-media-matters-alleged-scheme-against-x-160021473.html?src=rss", "ingested_utc": "2025-08-16T16:45:57Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T16:46:06Z", "source": "TheStreet_Top", "title": "Ford Motor Co. has a much bigger issue than tariffs at its door", "url": "https://www.thestreet.com/automotive/ford-motor-co-has-a-much-bigger-issue-than-tariffs-at-its-door", "id_key": "b26aaf1a2d4cc2829e1f6ce65fd7c758cc945648875f0ee83c142e2a96dd02db", "summary": "Ford set a record for this issue earlier this year, and the problem has only continued since.", "ingested_utc": "2025-08-16T16:46:06Z"}
