{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T07:49:20Z", "source": "Guardian_World", "title": "Putin wants to ‘wriggle out’ of meeting, Zelenskyy claims, and says Russia does not want to end war – Europe live", "url": "https://www.theguardian.com/world/live/2025/aug/22/ukraine-war-latest-updates-zelenskyy-putin-trump-news", "id_key": "a7cd6909d2aac50d760b4dbe14578121b584013a05aff6e7313327c939c46e16", "summary": "Ukrainian president backs Donald Trump suggestion of more offensive reaction to Russian attacks Ukrainian president Volodymyr Zelenskyy has accused Russia’s Vladimir Putin of “trying to wriggle out of holding a meeting” to discuss peace arrangements, saying: “They don’t want to end this war.” Zelenskyy pointed to continuing Russian strikes on Ukraine , including on an American company’s facilities in Mukachevo , and a growing number of alleged provocations against Nato countries , including Lithuania and Poland . “[These are] not accidents – Russian impudence,” he said. “We expect our partners to respond in a principled manner. This war must be brought to an end. Pressure must be exerted on Russia to end the war. Putin understands nothing but force and pressure.” “It is very hard, if not impossible, to win a war without attacking an invaders country. It’s like a great team in sports that has a fantastic defense, but is not allowed to play offense. There is no chance of winning! It is like that with Ukraine and Russia. Crooked and grossly incompetent Joe Biden would not let Ukraine FIGHT BACK, only DEFEND. How did that work out? … Interesting times ahead!!!” Of course, we will continue doing everything to protect our country and people. President Trump is absolutely right—this must be done not only in defense. Meanwhile, we do not slow down in diplomacy, so that negotiations to bring peace closer can finally take place. Continue reading...", "ingested_utc": "2025-08-22T07:49:20Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T07:52:13Z", "source": "AlJazeera_All", "title": "Drone attack destroys UN aid convoy in Sudan’s famine-hit Darfur region", "url": "https://www.aljazeera.com/news/2025/8/22/drone-attack-destroys-un-aid-convoy-in-sudans-famine-hit-darfur-region?traffic_source=rss", "id_key": "2ec67538a3cdd7a91ee78554c906ae894b6dc693675226f53a9e1f4b5d5617d2", "summary": "The attack is the second in the past three months to prevent a UN aid convoy from delivering to North Dafur.", "ingested_utc": "2025-08-22T07:52:13Z"}
