{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:48:22Z", "source": "Guardian_World", "title": "Government orders striking Air Canada flight attendants to return to work", "url": "https://www.theguardian.com/world/2025/aug/17/government-orders-striking-air-canada-flight-attendants-return-work", "id_key": "125f5c97d60cec48838fddad023993fcba36f9d63d1304500151c2c6e2a86f21", "summary": "Union criticises move less than 12 hours after start of action that has left more than 100,000 travellers stranded The Canadian government has forced flight attendants at Air Canada back to work, less than 12 hours after they began striking, and ordered binding arbitration over a dispute that has left more than 100,000 travellers stranded around the world during the peak summer travel season. Since March, Canada’s largest airline and the union representing its flight attendants have been locked in an increasingly bitter dispute over what the union has described as “poverty wages” and unpaid labour. Flight attendants are currently not paid for any work before or after the plane takes off. Continue reading...", "ingested_utc": "2025-08-17T11:48:22Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:48:23Z", "source": "Guardian_World", "title": "European leaders including Starmer to join Zelenskyy in Washington for meeting with Trump", "url": "https://www.theguardian.com/world/2025/aug/17/european-leaders-to-join-zelenskyy-washington-meeting-trump-ukraine-russia", "id_key": "cb233922c05f5659da6f493b092cc406873309194637c7ead7657ca096f8bbc2", "summary": "Emmanuel Macron, Friedrich Merz and others will aim to push back against ceding of Ukraine territory in ‘peace plan’ Ukraine war live – latest updates European leaders including Britain’s Keir Starmer will join Ukraine’s president, Volodymyr Zelenskyy, at a White House meeting on Monday with Donald Trump, in a coordinated effort to push back on a US-endorsed “peace plan” that would allow Russia to take further Ukrainian territory. The French president, Emmanuel Macron, Germany’s chancellor, Friedrich Merz, the European Commission president, Ursula von der Leyen, the Finnish president, Alexander Stubb, and Italy’s prime minister, Giorgia Meloni, will all accompany Zelenskyy in the Oval Office. Continue reading...", "ingested_utc": "2025-08-17T11:48:23Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:50:32Z", "source": "NYTimes_World", "title": "Ukraine Weighs Trump’s Offer of Security Guarantees With Caution", "url": "https://www.nytimes.com/2025/08/17/world/europe/ukraine-security-guarantees-trump-russia.html", "id_key": "86585564d5a656261abeb9b15ff1ee40e4cb4535a5c122ddaeaa7b9b6624116e", "summary": "President Trump offered security guarantees to deter future Russian aggression. But the offer was vague, prompting Kyiv to seek clarity.", "ingested_utc": "2025-08-17T11:50:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T11:51:19Z", "source": "FinancialPost_Business", "title": "Republicans look to make a U-turn on federal commitment to electric vehicles for the Postal Service", "url": "https://financialpost.com/pmn/republicans-look-to-make-a-u-turn-on-federal-commitment-to-electric-vehicles-for-the-postal-service", "id_key": "f2231433f4f954420dbcd3d2f979627382a6aab4d2311075ee26c09e307011a4", "summary": "WASHINGTON (AP) — A year after being lauded for its plan to replace thousands of aging, gas-powered mail trucks with a mostly electric fleet, the U.S. Postal Service is facing congressional attempts to strip billions in federal EV funding. In June, the Senate parliamentarian blocked a Republican proposal in a major tax-and-spending bill to sell […]", "ingested_utc": "2025-08-17T11:51:19Z"}
