{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:18Z", "source": "BBC_World", "title": "Israel calls up 60,000 reservists ahead of planned Gaza City offensive", "url": "https://www.bbc.com/news/articles/c7417pl3ddpo?at_medium=RSS&at_campaign=rss", "id_key": "7446e1c384e544afc710e5fe090039c62e46add664319b16444752661b858998", "summary": "The military says troops are already operating in some areas ahead of the planned operation to occupy all of the city.", "ingested_utc": "2025-08-20T11:28:18Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:21Z", "source": "Guardian_World", "title": "Nato military chiefs to discuss Ukraine and eventual security guarantees – Ukraine war live", "url": "https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news", "id_key": "ae70bcf245c9234ac58c1fd62b3150d13ac433b3e5f2c1307dfcb01221a7afe6", "summary": "Military leaders meeting to discuss what support could be provided in case of a peace arrangement as Donald Trump rules out putting troops on the ground An object which fell and exploded in a cornfield in eastern Poland may have been a component of an old propeller engine, the Polish army said on Wednesday, adding that there had been no violation of Poland’s airspace from Ukraine or Belarus. Police had earlier announced that an unidentified object had fallen in a field in the village of Osiny in eastern Poland’s Lublin province, which borders Ukraine. “...after conducting preliminary analyses of radar system records, no violation of Polish airspace was recorded last night from either Ukraine or Belarus,” the Operational Command of the Polish Armed Forces said on X. Continue reading...", "ingested_utc": "2025-08-20T11:28:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:21Z", "source": "Guardian_World", "title": "Dramatic rise in whale and dolphin strandings in Scotland", "url": "https://www.theguardian.com/environment/2025/aug/20/rise-whale-marine-mammal-strandings-scotland", "id_key": "c32740e294dab60f280124b2273cd66895503541085e18d0972b191786a55519", "summary": "Research shows steep increases over past 30 years, after summer of strandings across Europe The number of marine mammals stranded in Scotland has risen dramatically in the past 30 years, a study has found. From 1992 to 2022, 5,147 cetaceans died on Scottish shores, and a new paper shows steep increases in the rate of strandings of up to 800% in some species, continuing exponentially every year. Continue reading...", "ingested_utc": "2025-08-20T11:28:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:21Z", "source": "Guardian_World", "title": "Israel to call up 50,000 reservists before planned offensive on Gaza City, says Israeli military official – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/20/israeli-army-reservists-gaza-city-offensive-ceasefire-proposal-middle-east-crisis-latest-updates-news", "id_key": "6b33578d91e02d46deaec8c8a722e9ab10cebe8fdc0ad06d193824f406ee31c8", "summary": "Call-up notices sent as Israeli plans to increase its offensive; Israel studies Hamas’ response to proposal for 60-day ceasefire Israel gave final approval Wednesday for a controversial settlement project in the occupied West Bank that would effectively cut the territory in two, and that Palestinians and rights groups say could destroy hopes for a future Palestinian state. Settlement development in E1, an open tract of land east of Jerusalem, has been under consideration for more than two decades, but was frozen due to U.S. pressure during previous administrations. The international community overwhelmingly considers Israeli settlement construction in the West Bank to be illegal and an obstacle to peace. Prime minister Anthony Albanese said on Wednesday that he treats leaders of other countries with respect after his Israeli counterpart Benjamin Netanyahu attacked him over his decision to recognise a Palestinian state. “I don’t take these things personally, I engage with people diplomatically. He has had similar things to say about other leaders,” Albanese said during a media briefing. A 58% majority of Americans believe that every country in the United Nations should recognise Palestine as a nation, according to a new Reuters/Ipsos poll, as Israel and Hamas considered a possible truce in the nearly two-year-long war. 33% of respondents did not agree that UN members should recognise a Palestinian state and 9% did not answer. German prosecutors have charged a Russian national they suspect of planning an attack on the Israeli embassy in Berlin and of trying to join militant organisation Islamic State, they said on Wednesday. Prosecutors believe the accused, identified only as Akhmad E. in line with German privacy rules, obtained instructions from the Internet on how to make explosives but the plan failed as he could not get the components he needed. Continue reading...", "ingested_utc": "2025-08-20T11:28:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:21Z", "source": "Guardian_World", "title": "CrossCountry passengers face strike disruption on bank holiday weekend", "url": "https://www.theguardian.com/business/2025/aug/20/crosscountry-passengers-face-strike-disruption-on-bank-holiday-weekend", "id_key": "a5ed0e3e2568756151ae4fda50a072d6832a10726927ab5ea6d177702c28ea21", "summary": "RMT action over pay and conditions means no services on Saturday and reduced rail timetable on Monday Rail fares in England on path to rise by 5.8% next year Rail passengers have been warned that a strike by rail workers could disrupt services on the bank holiday weekend when transport networks are expected to be packed with holidaymakers. Members of the Rail, Maritime and Transport (RMT) union at the operator CrossCountry are going on strike on Saturday 23 August and bank holiday Monday over pay and conditions. Continue reading...", "ingested_utc": "2025-08-20T11:28:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:21Z", "source": "Guardian_World", "title": "Texas Republicans set to approve Trump-backed new congressional map – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates", "id_key": "0493be9e2cd6d664cfd07468e92179d3af1538f6494021d32d4d2a531ad2c4f9", "summary": "Congressional map intended to flip five Democrat-held House seats in the midterms set to be taken up on Wednesday following protests and walkouts The White House launched an official TikTok account on Tuesday, as Donald Trump continues to permit the Chinese-owned platform to operate in the US despite a law requiring its sale. “America we are BACK! What’s up TikTok ?” read a caption on the account’s first post, a 27-second clip, on the popular video-sharing app. Continue reading...", "ingested_utc": "2025-08-20T11:28:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:21Z", "source": "Guardian_World", "title": "‘I’m just waiting and waiting’: Filipino survivors feel left out of Maui fire recovery efforts", "url": "https://www.theguardian.com/us-news/2025/aug/20/filipino-survivors-hawaii-wildfire-recovery", "id_key": "ff8a0e67ca027d5abd6b61632bef21266f27569adac483c5e02f1bcb1f875a83", "summary": "Filipino immigrant made up about 40% of Lahaina’s pre-fire population – but many feel left behind in a systemic failure that reflects Hawaii’s colonial history Alfred Dasugo, 84, says he’s tired of waiting for help. A Filipino immigrant, Dasugo has called Lahaina home for more than a half century. As a young musician, he performed at the Royal Lahaina Resort with famed ukulele player Nelson Waikiki. Later, he spent 25 years working for Maui county parks and recreation, coaching volleyball and basketball to generations of youths. Continue reading...", "ingested_utc": "2025-08-20T11:28:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:28:21Z", "source": "Guardian_World", "title": "‘Did I just save her life?’: US trucker honored as ‘angel’ for role in abduction rescue", "url": "https://www.theguardian.com/us-news/2025/aug/20/tennessee-trucker-abduction-rescue", "id_key": "e221eba33dcde40d03ce05117342418085c3e0f39171ab932ca5e2a12fd45deb", "summary": "Ron Ross called 911 after he saw a young woman running in distress while he was parked at a rest area in Tennessee A professional trucker who had a hand in saving a California abduction victim while driving through Tennessee – and recording key video evidence with his windshield camera – recently earned recognition as an “angel” of the US’s highways, according to officials. Ron Ross, who drives for MCK Trucking in Madison, Alabama, is at the center of the dramatic story, which has seized attention in media circles dedicated to unearthing uplifting news stories. Continue reading...", "ingested_utc": "2025-08-20T11:28:21Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:30:36Z", "source": "NYTimes_Business", "title": "Target Names New C.E.O. as It Tries to Break Sales Slump", "url": "https://www.nytimes.com/2025/08/20/business/target-retail-sales-outlook-tariffs.html", "id_key": "4506ae7f7db2bd9b56512a08c50b9541dde40894a9f3d1213cd25b1993fec97e", "summary": "Michael Fiddelke, the company’s chief operating officer, will step into the role in February.", "ingested_utc": "2025-08-20T11:30:36Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:09Z", "source": "WIRED_All", "title": "FEMA Now Requires Disaster Victims to Have an Email Address", "url": "https://www.wired.com/story/fema-now-requires-disaster-victims-to-have-an-email-address/", "id_key": "053d053b3933f51eca598b337a034163ce7609ce0e714160a008e9d441bf29db", "summary": "Workers at FEMA worry that demanding disaster survivors access services using email could shut out people without internet connectivity from receiving government aid.", "ingested_utc": "2025-08-20T11:31:09Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:10Z", "source": "Engadget_All", "title": "Onimusha: Way of the Sword might be a more forgiving kind of samurai epic", "url": "https://www.engadget.com/gaming/onimusha-way-of-the-sword-might-be-a-more-forgiving-kind-of-samurai-epic-110020221.html?src=rss", "id_key": "f9f2b3e8dbbdc4cf8b50c92910272adcbc8a5c656e3be345a27d2463393445eb", "summary": "Capcom’s Onimusha series has been on a long hiatus. Combining Resident Evil-style rendered backgrounds with more agile characters, adding in demons, magic and a feudal Japan setting, the series span multiple sequels — and consoles — til the fourth entry in 2006. Roughly two decades (and console eras) later, Capcom has returned to the series , even getting the definitive samurai actor, Tom Cruise Mifune Toshiro, to play the hero, the legendary swordsman Miyamoto Musashi. At Gamescom, the company is now demoing an early slice of Way of the Sword, which covers most (but not all) of the game shown at SGF 2025 just a few months ago. It’s an interesting time to return to the samurai-meets-demonic-threat universe of Onimusha, following a sudden boom in games tapping into feudal Japan. Most recently, the latest Assassin’s Creed was set there, while, Sony’s upcoming Ghost of Yotei (not to mention its predecessor) both tap bushido and swordplay in historical Japan. While I played through the demo, I made a lot of mental comparisons to Sekiro – a game that’s now several years old and still unbeaten by me. Onimusha draws together similar themes of demon forces run amok, but has a more forgiving approach. Gameplay centers around blocks and parries, plus weak and strong attacks, all while pulling in orbs dropped by dying enemies that act as the game’s currency. (Health orbs are also dropped by certain foes.) Capcom The Oni gauntlet that absorbs these souls can also be used to see invisible demons and unlock areas that are spiritually blocked. It’ll also act like a sort-of demonic movie projector, showing what happened during the demon invasion in the area. Early enemies were predictably sluggish demon swordsmen and archers, getting me back up to speed with how Onimusha fights play out. Even if it predictably looks lightyears ahead of its predecessors, Way of the Sword doesn’t reinvent how you cut up these demon hordes. In comparison to other action games, guarding seems very forgiving. You can hold the guard button down, and it’ll block basic projectiles and melee attacks from all directions I spent some time leaning into exhausting stamina gauges, timing parries for one-hit Issen critical attack and batting away arrows back where they came from. Don’t get me wrong, it’s satisfying and fun, but I’m itching to see how the series will build on what’s pretty basic attack flow. Musashi had acccess to a dual-short sword special attack, Two Celestials, that barrages the enemy with attacks and tops up his health levels. This suggests more special attacks and magical flourishes should open up later in the game. The preview during SGF 2025 also showed ways to utilize the environment for defensive attacks, holding up wooden boards to block arrows, for instance, although that didn’t trigger during my playthrough. Capcom The highlight of the demo was a confrontation with Musashi’s rival, Ganryu Sasaki. He’s great villain fodder — and has also been somehow gifted his own Oni gauntlet. The duel was the only time I felt under threat during the demo, and even then, I didn’t die once. There’s enough of a health meter to test yourself against Sasaki’s lavish sword attacks and lunges. Once you wear down more powerful enemies, you can make a single, concentrated attack to either glean more orbs from them or hit for heavy-duty damage. The early taste of Way of the Sword is a fun, easy romp, so I’m curious to see how Capcom evolves the formula of Onimusha — and where the true challenges might lie. Onimusha: Way of the Sword is set to be released in 2026 on PS5, Xbox Series S|X, and PC. This article originally appeared on Engadget at https://www.engadget.com/gaming/onimusha-way-of-the-sword-might-be-a-more-forgiving-kind-of-samurai-epic-110020221.html?src=rss", "ingested_utc": "2025-08-20T11:31:10Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:19Z", "source": "TheStreet_Top", "title": "Treasury Secretary delivers candid take on US buying Intel stock", "url": "https://www.thestreet.com/investing/stocks/treasury-secretary-delivers-candid-take-on-us-buying-intel-stock", "id_key": "f02b9296c9636f398e32ad129617f8237292956779544e7e29ae105ba7719c23", "summary": "Secretary Scott Bessent weighed in on the chipmaker's future.", "ingested_utc": "2025-08-20T11:31:19Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "CIBC Innovation Banking Provides Growth Capital Financing to MedMe Health", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/cibc-innovation-banking-provides-growth-capital-financing-to-medme-health", "id_key": "d986990ddb43a1d00c848885130b012bf1811bdb39de3d45c5b0dc39aa790966", "summary": "TORONTO — CIBC Innovation Banking announced today that it has provided a growth-focused credit facility to MedMe Health (“MedMe”). The company will use the financing to expand its product suite and scale its operations in North America. Founded in 2019, MedMe has rapidly established itself as a leading platform for pharmacy care delivery in Canada, […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "Covalon Technologies Ltd. Achieves DTC Eligibility in the United States", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/covalon-technologies-ltd-achieves-dtc-eligibility-in-the-united-states", "id_key": "3f1680ee5588b85bf69e555f6c999e60e97b98085e000341de702d19820eac5a", "summary": "Improving Access for U.S. Investors and Supporting Share Price Appreciation for Canadian MedTech Innovator MISSISSAUGA, Ontario — Covalon Technologies Ltd. (the “Company” or “Covalon”) (TSXV: COV; OTCQX: CVALF), an advanced medical technologies company, is pleased to announce that its common shares are now eligible for electronic clearing and settlement in the United States through The […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "Kobo Resources Announces Non-Brokered Private Placement of up to $3.0 Million", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/kobo-resources-announces-non-brokered-private-placement-of-up-to-3-0-million", "id_key": "6074b95501d4e2b55c776950b4238210e6fccead9682bca9ae0dc1216b1f32a9", "summary": "NOT FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR FOR RELEASE PUBLICATION, DISTRIBUTION OR DISSEMINATION DIRECTLY, OR INDIRECTLY, IN WHOLE OR IN PART, IN OR INTO THE UNITED STATES. QUEBEC CITY — Kobo Resources Inc. (“Kobo” or the “Company”) (TSX.V: KRI) intends to complete a non-brokered private placement of up to 10,000,000 units (the “Units”) […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "Goodfood Announces CEO Transition and New Board Chair", "url": "https://financialpost.com/globe-newswire/goodfood-announces-ceo-transition-and-new-board-chair", "id_key": "21290a45853c40e63bef95b4154a0c0e842e86119df21dea54cc99010e56738f", "summary": "MONTREAL, Aug. 20, 2025 (GLOBE NEWSWIRE) — Goodfood Market Corp. (“Goodfood” or the “the Company”) (TSX: FOOD) announced today changes to its management and board of directors. Jonathan Ferrari, Goodfood’s co-founder, Chair and CEO, will be stepping down from his executive roles, effective immediately. Mr. Ferrari will continue to serve as a director on the […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "Q2 Metals Metallurgy Confirms Cisco Lithium Project Suitability for DMS Processing", "url": "https://financialpost.com/globe-newswire/q2-metals-metallurgy-confirms-cisco-lithium-project-suitability-for-dms-processing", "id_key": "d8ba6f0ba823227de3df668afe9983b8018b2beb66c0c8406368b5219d1c5234", "summary": "Highlights Three (3) composite samples were provided to SGS Canada Inc. for Heavy Liquid Separation (HLS) testing to assess the suitability of large-scale Dense Media Separation (DMS) processing. Composite 18 achieved a 74.1% recovery to produce a 5.69% Li2O concentrate with low iron of 0.42% Fe2O3. Composite 21 achieved a 69.6% recovery to produce a […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "Dayforce and Thoma Bravo Discussing Possible Acquisition", "url": "https://financialpost.com/globe-newswire/dayforce-and-thoma-bravo-discussing-possible-acquisition", "id_key": "87df671083297c31670e25d18af459c2955943a22704922bb1a103c3cb38d98c", "summary": "MINNEAPOLIS and TORONTO, Aug. 20, 2025 (GLOBE NEWSWIRE) — Dayforce, Inc. (NYSE: DAY; TSX: DAY), a global human capital management (HCM) leader that makes work life better, announced today that it is engaged in advanced discussions with Thoma Bravo regarding a potential acquisition of Dayforce by Thoma Bravo for US$70 per share. There can be no […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "HPQ’s Phase 2 Fumed Silica Pilot Reactor Test Achieves Strong Operational Gains", "url": "https://financialpost.com/globe-newswire/hpqs-phase-2-fumed-silica-pilot-reactor-test-achieves-strong-operational-gains", "id_key": "e3f358b35f86e3bea06c6e1f15679e05da8f516b594323cfc6283f78a28107b5", "summary": "Material from the first Phase 2 test has been sent to a leading global fumed silica manufacturer (under LOI) and to an independent university lab for analysis MONTREAL, Aug. 20, 2025 (GLOBE NEWSWIRE) — HPQ Silicon Inc. (“HPQ” or the “Company”) (TSX-V: HPQ, OTCQB: HPQFF, FRA: O08), a technology company driving innovation in advanced materials and critical […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "Emerita Intersects 16.9 Meters Grading 1.4% Copper, 2.1% Zinc, 0.93 g/t Gold, 42.66 g/t Silver and 7.2 Meters Grading 1.0% Copper, 1.9% Zn, 1.31 g/t Gold, 60.10 g/t Silver at El Cura Deposit", "url": "https://financialpost.com/globe-newswire/emerita-intersects-16-9-meters-grading-1-4-copper-2-1-zinc-0-93-g-t-gold-42-66-g-t-silver-and-7-2-meters-grading-1-0-copper-1-9-zn-1-31-g-t-gold-60-10-g-t-silver-at-el-cura-deposit", "id_key": "797f0dfeb9825571b6d41d962128bf989e7f2b713b7d53ce403c6273b1f78e61", "summary": "TORONTO, Aug. 20, 2025 (GLOBE NEWSWIRE) — Emerita Resources Corp. (TSX-V: EMO; OTCQB: EMOTF; FSE: LLJA) (the “Company” or “Emerita”) announces results from its ongoing resource expansion and in-fill drilling campaign at its El Cura deposit. El Cura is part of Emerita’s wholly owned Iberian Belt West project (“IBW” or the “Project”; Figure 1) which […]", "ingested_utc": "2025-08-20T11:31:29Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T11:31:29Z", "source": "FinancialPost_Business", "title": "NexGold Intersects 18.16 g/t Gold over 2.1 Metres and 6.91 g/t Gold over 2.5 Metres at the Goldboro Open Pit Gold Project", "url": "https://financialpost.com/globe-newswire/nexgold-intersects-18-16-g-t-gold-over-2-1-metres-and-6-91-g-t-gold-over-2-5-metres-at-the-goldboro-open-pit-gold-project", "id_key": "3beb2c3161974f779e79ed219cc5a239b1cb8938c415e8a5d9f7c323fd307f06", "summary": "TORONTO, Aug. 20, 2025 (GLOBE NEWSWIRE) — NexGold Mining Corp. (TSXV: NEXG; OTCQX: NXGCF) (“NexGold” or the “Company”) is pleased to provide final drill results from a recently-completed 26,854-metre diamond drill program initially announced on January 22, 2025 at the Company’s Goldboro Open Pit Gold Project (“Goldboro”) in Nova Scotia. The drill program was primarily […]", "ingested_utc": "2025-08-20T11:31:29Z"}
