{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:48:06Z", "source": "Guardian_World", "title": "A timeline of Erik and Lyle Menendez’s case over the last three decades", "url": "https://www.theguardian.com/us-news/2025/aug/22/erik-lyle-menendez-timeline", "id_key": "256ef76f2afe759dd2011eaa332eac4e0bcc58d03d19001a2cc68434f98e6909", "summary": "Lyle Menendez will face parole board a day after brother Erik was denied release. Follow every key event from arrest to parole hearings 35 years later Erik Menendez was denied parole on Thursday after serving decades in prison for killing his parents. Lyle Menendez, his brother, will be next to get a chance to plead his case in front of a panel of California state parole board commissioners. Erik and Lyle Menendez were sentenced in 1996 to life in prison for killing their father, José Menendez, and mother, Kitty Menendez, in their Beverly Hills mansion in 1989. They were 18 and 21 at the time. Defense attorneys argued the brothers acted out of self-defense after years of sexual abuse by their father, while prosecutors said the brothers killed their parents for a multimillion-dollar inheritance. Continue reading...", "ingested_utc": "2025-08-22T11:48:06Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:48:25Z", "source": "CryptoSlate", "title": "Ethereum ETFs draw $287 million in inflows after 4 day outflow streak", "url": "https://cryptoslate.com/insights/ethereum-etfs-draw-287-million-in-inflows-after-4-day-outflow-streak/", "id_key": "e93bb5f0380e5a204503c926b7d4b6cd80877f15722762544984494ef5c6ef8d", "summary": "Ethereum-focused exchange-traded funds saw a notable reversal on Aug. 21 by recording an inflow of $287 million, which ended a four-day streak of investor withdrawals. Farside Investors data showed that the surge was driven primarily by BlackRock’s iShares Ethereum Trust (ETHA), which drew the largest share of inflows at $233.5 million. Fidelity’s FETH followed by […] The post Ethereum ETFs draw $287 million in inflows after 4 day outflow streak appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T11:48:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:50:18Z", "source": "NYTimes_Business", "title": "Jay Powell Takes Center Stage with Friday’s Jackson Hole Address", "url": "https://www.nytimes.com/2025/08/22/business/dealbook/powell-trump-jackson-hole.html", "id_key": "9e396f8e43c160515165bc8bdb8ec1c9a0977cb03469505b2b808a4e4474261f", "summary": "The Fed chief is expected to address inflation, interest rates and the economy in his speech on Friday. Will he also confront President Trump’s attacks on central bank independence?", "ingested_utc": "2025-08-22T11:50:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T11:50:21Z", "source": "NYTimes_Technology", "title": "Did You Recently Buy a Used E.V.? We Want to Hear From You.", "url": "https://www.nytimes.com/2025/08/18/business/used-electric-vehicles-callout.html", "id_key": "a92b562685952886a7c6765d101f1903b30b767b76a3f6914afbaacbc393593e", "summary": "The prices of used electric cars have fallen sharply in recent months, making them a more attractive option.", "ingested_utc": "2025-08-22T11:50:21Z"}
