{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:45:47Z", "source": "Guardian_World", "title": "New Zealand woman and six-year-old son released from US detention", "url": "https://www.theguardian.com/world/2025/aug/16/new-zealand-woman-and-six-year-old-son-released-from-us-detention", "id_key": "53a05e9b028969f500cb739f1bf155cd9325f563ed636ed63058c24c318738c2", "summary": "Sarah Shaw was detained by Ice owing to a problem with her ‘combo card’ visa as she tried to re-enter the US from Canada New Zealand woman and son detained by Ice enduring ‘terrifying’ ordeal A New Zealand woman and her six-year-old son, who were held for more than three weeks at a US immigration centre after being detained crossing the Canada-US border, have been released. In a short update on Saturday, the woman’s friend Victoria Besancon said Sarah Shaw and her son were safely home. The family would be taking some time to settle in before speaking about their experience, she added. Continue reading...", "ingested_utc": "2025-08-16T13:45:47Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:45:47Z", "source": "Guardian_World", "title": "Bob Simpson, former Australia cricket captain and coach, dies aged 89", "url": "https://www.theguardian.com/sport/2025/aug/16/bob-simpson-australia-cricket-captain-coach-dies-aged-89", "id_key": "eed985064dea064b437753fd2f0bb0be3c673e8d4d08cbbdeab8efbaf91e315c", "summary": "Simpson played 62 Tests over more than two decades Australia’s first full-time coach helped guide team’s re-emergence The former Australia cricket captain and coach Bob Simpson has died in Sydney aged 89. He was an influential figure in Australian cricket for more than four decades as a player, captain and coach. He also made his mark on the game as a law-maker, referee and commentator. Simpson first pulled on the baggy green cap of the Australian Test cricket team in 1957, and made a comeback to captain Australia aged 41 after the game was thrown into crisis by World Series Cricket in 1977. Continue reading...", "ingested_utc": "2025-08-16T13:45:47Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:45:47Z", "source": "Guardian_World", "title": "Putin-Trump summit: Zelenskyy to fly to US as Trump shifts in favour of peace deal rather than ceasefire – live", "url": "https://www.theguardian.com/world/live/2025/aug/15/trump-putin-alaska-meeting-summit-news-updates", "id_key": "3cdc0b7142fe84cddba23a848269189434b10429776322631b48c73902ade804", "summary": "Macron, Merz and Starmer will lead talks with Europe’s ‘coalition of the willing’ on Sunday before Zelenskyy meets US president on Monday No deal after brief Trump-Putin talks on Ukraine in Alaska The president has yet to deplane, but is currently greeting Alaska governor Muke Dunleavy and senators Lisa Murkowski and Dan Sullivan , all Republicans, aboard Air Force One, per the White House. White House press secretary Karoline Leavitt also says that for the expanded bilateral meeting and lunch, Trump, Rubio, and Witkoff will be joined by treasury secretary Scott Bessent , commerce secretary Howard Lutnick , defense secretary Pete Hegseth , and White House chief of staff Susie Wiles . Continue reading...", "ingested_utc": "2025-08-16T13:45:47Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:45:47Z", "source": "Guardian_World", "title": "Zelenskyy to meet Trump on Monday after Putin summit briefing", "url": "https://www.theguardian.com/world/2025/aug/16/zelenskyy-to-meet-trump-on-monday-putin-alaska-summit-briefing", "id_key": "263257d85f6bf1aecc0aae108e850728d49794213716d3de262c5b500f95cd93", "summary": "Ukrainian president to make first return to White House since infamous row with Trump in February Putin-Trump summit – latest updates Ukraine’s president has said he will fly to Washington on Monday to meet Donald Trump after an hour long call with the US president in which he was briefed on the key points of the Alaska summit with Vladimir Putin. Next week’s meeting will mark the first return to the White House for Volodymyr Zelenskyy since his infamous row with Trump and the vice-president, JD Vance, in the Oval Office in February. Continue reading...", "ingested_utc": "2025-08-16T13:45:47Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:45:47Z", "source": "Guardian_World", "title": "Call to ban ‘intolerant’ child-free resorts and hotels in France", "url": "https://www.theguardian.com/society/2025/aug/16/call-to-ban-intolerant-child-free-resorts-and-hotels-in-france", "id_key": "37061dad646138fd4a5e951531ab68c321e01060b44284ec00fdfd0b3e5ba7d0", "summary": "Debate grows as Senator Laurence Rossignol says ‘we can’t organise society by separating children off’ Child-free resorts and adult-only hotels are discriminatory, risk creating a society of intolerance and should be banned, a French senator has said, amid a growing debate in France on whether it is inhumane to exclude children from holidays. “We can’t organise society by separating children off from ourselves in the same way some establishments don’t take dogs,” said Socialist senator and former French families minister Laurence Rossignol. “Children aren’t troublesome pets.” Continue reading...", "ingested_utc": "2025-08-16T13:45:47Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:46:10Z", "source": "CryptoNews", "title": "BitMine and Mystery Whale Buy $882M in Ethereum While Retail Panic Sell", "url": "https://cryptonews.com/news/bitmine-and-mystery-whale-buy-882m-in-ethereum-while-retail-panic-sell/", "id_key": "9b0c83d6178fd6463272f84603a6103ed0192d16d2e16d2be6205cb03cf47bbd", "summary": "BitMine purchases 106,485 ETH worth $470.51M bringing total holdings to 1.297M ETH while mystery whale withdraws $412M from Kraken as retail traders panic sell during pullbacks. The post BitMine and Mystery Whale Buy $882M in Ethereum While Retail Panic Sell appeared first on Cryptonews .", "ingested_utc": "2025-08-16T13:46:10Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:15Z", "source": "NYTimes_Business", "title": "Elon Musk’s SpaceX Most Likely Doesn’t Pay Taxes", "url": "https://www.nytimes.com/2025/08/15/technology/spacex-musk-government-contracts-taxes.html", "id_key": "b03ec964c3e7442b3ca5b107e459a41eaba969c1f3293b036a83931edf390d96", "summary": "Elon Musk’s rocket company relies on federal contracts, but years of losses have most likely let it avoid paying federal income taxes, according to internal company documents.", "ingested_utc": "2025-08-16T13:48:15Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:15Z", "source": "NYTimes_World", "title": "Why Is the U.S. Offering a $5 Million Reward for a Haitian Gang Leader?", "url": "https://www.nytimes.com/2025/08/16/us/haiti-gang-barbeque-bounty.html", "id_key": "cd8d1ca75bddc9901231ab37cb611524fa495b74ecf875d0e990aa32542b3011", "summary": "A major bounty has been offered for help apprehending Jimmy Cherizier, a gang leader known as “Barbecue.” Experts have doubts about whether it will make any difference.", "ingested_utc": "2025-08-16T13:48:15Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:35Z", "source": "NPR_Top", "title": "Video shows prominent Palestinian prisoner for the first time in years", "url": "https://www.npr.org/2025/08/16/g-s1-83121/marwan-barghouti-video-famous-palestinian-prisoner", "id_key": "b3e471a2403004d2eab688e60d3774b84b5c7b0e9b73dc99beb95fc1f8b65514", "summary": "The world got a glimpse of Marwan Barghouti for the first time in years in a video of a far-right Israeli minister berating him.", "ingested_utc": "2025-08-16T13:48:35Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:35Z", "source": "NPR_Top", "title": "As arms race in Asia intensifies, a-bomb survivors make final plea for peace", "url": "https://www.npr.org/2025/08/16/nx-s1-5500218/as-arms-race-in-asia-intensifies-a-bomb-survivors-make-final-plea-for-peace", "id_key": "495cfea0c1e5bf7239213688b1691c15fd6325b8beb53912d663dd6960502864", "summary": "While atomic bomb survivors warn the catastrophic risks, leaders of nuclear-armed states and self-proclaimed 'realists' argue that the deterrence of nuclear weapons is what keeps them from being deployed.", "ingested_utc": "2025-08-16T13:48:35Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:35Z", "source": "NPR_Business", "title": "Electricity prices are climbing more than twice as fast as inflation", "url": "https://www.npr.org/2025/08/16/nx-s1-5502671/electricity-bill-high-inflation-ai", "id_key": "9ed787dc859b4a1be44e48792de3205b7af2c23f23111ec0e0ead24c598f20d6", "summary": "Electricity prices are rising more than twice as fast as overall inflation. That's especially costly during the dog days of summer when air conditioners are working hardest. In addition to hot weather, a variety of factors are causing power bills to climb, including the high cost of natural gas used to generate electricity and soaring demand from data centers.", "ingested_utc": "2025-08-16T13:48:35Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:36Z", "source": "NPR_Economy", "title": "The nepo baby premium, frothing markets, and Apple vs. Apples", "url": "https://www.npr.org/2025/08/15/nx-s1-5502731/the-nepo-baby-premium-frothing-markets-and-apple-vs-apples", "id_key": "bedd86310482d1f0b782f8974317b89622824d241acc70a2990c5cb103d3742d", "summary": "It’s … Indicators of the Week! Our rapid run through the numbers you need to know. On today’s episode: John Legend croons; CPI inflation soothes; Same job as mom? You’ll earn more, dude; Apple vs. Apple, a courtroom feud. Related episodes: Why every A-lister also has a side hustle The DOJ's case against Apple The Intergenerational Transmission of Employers and the Earnings of Young Workers Generational Wealth: How High Earners Help Their Children’s Careers For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Fact-checking by Sierra Juarez . Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter .", "ingested_utc": "2025-08-16T13:48:36Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:39Z", "source": "FT_Home", "title": "Putin demands Ukraine withdrawal from eastern Donetsk as price of ending war", "url": "https://www.ft.com/content/6b0b4912-9438-4de0-aebe-2a8dd804cbab", "id_key": "6f36051c5070bc36b174596f4ce51b55c71e9e2ab0ffd28089cbaf422a25020d", "summary": "Trump urges European leaders to drop efforts for ceasefire after failing to win over Russian president in Alaska", "ingested_utc": "2025-08-16T13:48:39Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:55Z", "source": "TheVerge_All", "title": "Dead Take’s best scares come from real-life performances", "url": "https://www.theverge.com/games/760213/dead-take-review-fmv-horror-game-ben-starr", "id_key": "3e548898b845ce57516f92ecd64ee0c18239b6e96a0fe6d5293034af0dd66f13", "summary": "Dead Take, the second game from Tales of Kenzera: Zau developer Surgent Studios, is a quiet horror game where the monster is ambition and the lengths a person will go for stardom. Like a lot of horror games, Dead Take relies on jumpscares to get the heart pumping. But playing this game, my deepest, most […]", "ingested_utc": "2025-08-16T13:48:55Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:55Z", "source": "TheVerge_All", "title": "A brazen attack on air safety is underway — here’s what’s at stake", "url": "https://www.theverge.com/planes/758913/air-safety-regulation-faa-trump-bedford-sully", "id_key": "bc79611a5756285268f39d0dce2aa302ad43a4df8473a5904e92869c44faa8d9", "summary": "At the end of July, the National Transportation Safety Board (NTSB) convened a three-day public hearing to investigate January's mid-air collision over Washington, DC that killed 67 people. After the hearing, two conclusions were inescapable. First, the disaster should have been prevented by existing safety rules. And second, the government regulators responsible for air safety […]", "ingested_utc": "2025-08-16T13:48:55Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:57Z", "source": "WIRED_All", "title": "11 Best Android Phones of 2025, Tested and Reviewed", "url": "https://www.wired.com/gallery/best-android-phones/", "id_key": "65eafb3255bf11d077501034eb26fff8555700f3b060ff9be16ded9c29ebc5a9", "summary": "Shopping for a phone can be an ordeal. That’s why we’ve tested almost every Android phone, from the smartest to the cheapest—even phones that fold—to find those worth your money.", "ingested_utc": "2025-08-16T13:48:57Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:57Z", "source": "WIRED_All", "title": "DJI Osmo 360 Review: A Strong Start", "url": "https://www.wired.com/review/dji-osmo-360/", "id_key": "0362c5b3bd2c68551e887c9c563c4015f985ed4c1ae3fb12a74b3a4cf0090ca5", "summary": "DJI’s debut 360 camera is a strong challenger to the Insta360 X5. Too bad it’s not officially available in the US.", "ingested_utc": "2025-08-16T13:48:57Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:48:59Z", "source": "Engadget_All", "title": "Engadget review recap: Dell 14 Premium, Framework Desktop, Sony Theater Bar 6 and more", "url": "https://www.engadget.com/engadget-review-recap-dell-14-premium-framework-desktop-sony-theater-bar-6-and-more-130008670.html?src=rss", "id_key": "4c1f6901259b07039766a3df76d99b2a6c068781b7ce8c317df10ccf4286c7c8", "summary": "With a barrage of new Apple and Google devices around the corner, our reviews team is clearing their desks of new products before the pre-fall deluge begins. There's a well-rounded mix of in-depth testing this time around, including a detailed preview of watchOS 26 and more VPN trials. Kick off the weekend by catching up on all of the reviews you might've missed over the last few weeks from Engadget. Dell 14 Premium While we're still trying to wrap our heads around Dell's naming scheme decision, the company continues to churn out new devices. The latest to cross senior reviews writer Sam Rutherford's desk was the Dell 14 Premium. You might remember this model as the XPS 14, and according to Sam, Dell retained \"the DNA\" that made previous versions some of the best notebook PCs you could buy. \"Even with a new and rather uninspired name, it probably shouldn't come as a surprise that the Dell 14 Premium remains one of the best Windows laptops on the market,\" he said . \"It has the same sleek design from back when it was still called the XPS 14 but with some refreshed specs and components for 2025.\" Framework Desktop (2025) Framework is known for its modular, repairable laptops, but the company has now tried its hand at bringing the same formula to a desktop. Unfortunately, the first attempt isn't nearly as modular or repairable as a regular PC, according to senior editor Daniel Cooper. \"Framework was open about the fact this was something akin to a side project, outside its regular remit to build modular laptops, based on a particularly exciting chip,\" he explained . \"So while I think the all-in-one approach is a backward step compared to regular PCs, I get the rationale for doing so here.\" Sony Bravia Theater Bar 6 This year's crop of soundbars finally arrived over the summer, so I've been spending lots of time with home theater speakers recently. The latest was the Sony Bravia Theater Bar 6, a soundbar/subwoofer combo that sits in the middle of the company's current lineup. Despite great sound and dialogue performance, the caveats here are real dealbreakers. \"The lack of Wi-Fi on a $650 soundbar is absurd, mostly because it strips users of the convenience of AirPlay, Chromecast and other wireless connection options,\" I wrote . \"I also can’t get over the need to use a thumb drive for updates when OTA downloads for new firmware have been the norm on soundbars for years.\" Lenovo ThinkPad X9-14 Aura Edition Lenovo's ThinkPads are popular office laptops, and the X9-14 is the latest in a long line of business machines. Contributing writer Rami Tabari explains that this model offers a lot of the qualities that make ThinkPads great, but the price, low-power CPU and subpar keyboard leave something to be desired. \"I can’t justify the average consumer paying $1,283 for the ThinkPad X9-14 with specs you’d find in laptops that cost hundreds of dollars less (minus the RAM, of course),\" he noted . \"For small business owners, I recommend waiting for a sale or consider a business laptop marketed more toward you (again, the ASUS ExpertBook P5 (P5405) is a great choice).\" watchOS 26 preview and Norton VPN review We're quickly approaching the arrival of a new set of Apple Watches, so senior buying advice reporter Amy Skorheim spent two weeks with the upcoming version of watchOS. Her favorite new features are the AI workout partner and added gesture, but she explained that it's the little things that make this annual overhaul worthwhile. Meanwhile, senior writer Sam Chapman returned to the land of VPNs to test Norton's version as a standalone app. While this service isn't necessarily bad, it also doesn't offer enough to rise above the heap that includes ExpressVPN, Surfshark and others. \"After a week of working with Norton VPN, I have to conclude that the only way it distinguishes itself is the Norton name,\" he said . \"For everything else it does, a competitor does it better.\" This article originally appeared on Engadget at https://www.engadget.com/engadget-review-recap-dell-14-premium-framework-desktop-sony-theater-bar-6-and-more-130008670.html?src=rss", "ingested_utc": "2025-08-16T13:48:59Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:49:13Z", "source": "AlJazeera_All", "title": "Arab, Islamic countries condemn Netanyahu’s ‘Greater Israel’ remark", "url": "https://www.aljazeera.com/news/2025/8/16/arab-islamic-countries-condemn-netanyahus-greater-israel-remark?traffic_source=rss", "id_key": "1825993a4e0e3486ff708378e6aca31da14e5868f4697fe4c7a1fcabb50b2029", "summary": "A statement issued by the countries says the Israeli PM's remarks constitutes a direct threat to Arab national security.", "ingested_utc": "2025-08-16T13:49:13Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:49:19Z", "source": "FinancialPost_Business", "title": "Health of US Consumer Is the Focus as Retailers Prepare Earnings", "url": "https://financialpost.com/pmn/business-pmn/health-of-us-consumer-is-the-focus-as-retailers-prepare-earnings", "id_key": "47a6d3fed58da492cb41310adea33253a958adf28d2a6823b1105106f4553059", "summary": "Wall Street will get a close look at how American consumers are faring in the early days of President Donald Trump’s tariff regime when the biggest US retailers like Walmart Inc. and Target Corp. report earnings next week.", "ingested_utc": "2025-08-16T13:49:19Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:49:34Z", "source": "HackerNews_Top", "title": "Blue-collar jobs are gaining popularity as AI threatens office work", "url": "https://www.nbcnews.com/business/business-news/ai-which-jobs-are-skilled-trades-protected-what-to-know-rcna223249", "id_key": "6137b20fb991eb1e409312f95d75848f26143f88021831eac15b8003ecd7393d", "summary": "Comments", "ingested_utc": "2025-08-16T13:49:34Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:49:34Z", "source": "HackerNews_Top", "title": "Forget Netflix, Volkswagen locks horsepower behind paid subscription", "url": "https://www.autoexpress.co.uk/volkswagen/367566/forget-netflix-volkswagen-locks-horsepower-behind-paid-subscription", "id_key": "15d09970c355b24d35673e3c8bf6d3b7caee07d651a9a372c8f381a361eb2561", "summary": "Comments", "ingested_utc": "2025-08-16T13:49:34Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-16", "retrieved_utc": "2025-08-16T13:49:34Z", "source": "HackerNews_Top", "title": "Open Office Is Giving You Secondhand ADHD", "url": "https://floustate.com/blog/open-office-secondhand-adhd", "id_key": "2fad7ecb6a32c4c7394e6987e7359d16eb3bd45e69a2c5cd7ce0af7b1948ba41", "summary": "Comments", "ingested_utc": "2025-08-16T13:49:34Z"}
