{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T15:52:05Z", "source": "BitcoinMagazine", "title": "Online Privacy Is Under Threat in the UK and US. Policy Expert Freddie New Advises How To Protect Yourself", "url": "https://bitcoinmagazine.com/news/online-privacy-is-under-threat-in-the-uk-and-us-policy-expert-freddie-new-advises-how-to-protect-yourself", "id_key": "4d0e05da2e244bbc83258ef9f686c1ba4cb5708837151806eca2485cf8353fbd", "summary": "Bitcoin Magazine Online Privacy Is Under Threat in the UK and US. Policy Expert Freddie New Advises How To Protect Yourself Freddie New, head of policy at Bitcoin Policy UK, a UK-based Bitcoin think tank and advocacy group, speaks to what’s in our immediate power when it comes to preserving our privacy online, including when transacting with Bitcoin. This post Online Privacy Is Under Threat in the UK and US. Policy Expert Freddie New Advises How To Protect Yourself first appeared on Bitcoin Magazine and is written by Frank Corva .", "ingested_utc": "2025-08-15T15:52:05Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T15:52:08Z", "source": "CryptoBriefing", "title": "Brevan Howard now largest investor in BlackRock Bitcoin ETF", "url": "https://cryptobriefing.com/bitcoin-etf-investment-brevan-howard/", "id_key": "d5a05303942b89c9f0a4d6520790fdb6d28a7d8d5b2daf25dd70d3ad8d127994", "summary": "Brevan Howard's increased stake in BlackRock's Bitcoin ETF signals growing institutional confidence in digital assets, potentially boosting market legitimacy. The post Brevan Howard now largest investor in BlackRock Bitcoin ETF appeared first on Crypto Briefing .", "ingested_utc": "2025-08-15T15:52:08Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T15:54:40Z", "source": "Engadget_All", "title": "Why on Earth would NASA build a nuclear reactor on the Moon?", "url": "https://www.engadget.com/science/space/why-on-earth-would-nasa-build-a-nuclear-reactor-on-the-moon-153741891.html?src=rss", "id_key": "a23137b59dbbbd5a2b79d5aa63f7829c1f791791cfb86b26de08e96ac355180e", "summary": "\" Duffy to announce nuclear reactor on the moon \" is not a headline I imagined reading before last week. Sure, as a sci-fi loving nerd, I could see a future where nuclear power played a role in permanent Moon settlements. But the idea of NASA building a 100 kilowatt microreactor there in the next five years seemed ridiculous. Not so, according to scientists. \"I have no idea why this is getting so much play,\" Professor Bhavya Lal tells me over the phone, with a hint of exasperation in her voice. Lal's response makes sense once you understand the arc of her career; she has spent much of her professional life thinking about how the US should use nuclear power to explore space. At NASA, she served as the acting chief technologist, and was awarded the agency's Distinguished Service Medal. Among her other qualifications, she also testified before Congress on the subject of nuclear propulsion, and even helped rewrite the rules governing launches involving radioactive materials. Most recently, she wrote a paper titled Weighing the Future: Strategic Options for US Space Nuclear Leadership where she and her co-author, Dr. Roger Myers, examine the past failures of US policy as it relates to nuclear power in space and argue the country should test a small nuclear system on the Moon by 2030. The way Casey Dreier, chief of space policy at The Planetary Society — a nonprofit that advocates for the exploration and study of space — tells it, many aspects of Secretary Duffy's plan are \"pretty much straight out\" of that report. Lal is more modest and describes the directive Duffy issued as \"accelerating ongoing work\" at NASA. According to her, the agency has been \"funding [space] fission power for years,\" adding that the only new thing here is that there's a date. \"We've done this for more than 60 years,\" she tells me, and if NASA ends up delivering on Duffy's plan, it wouldn't even be the first nuclear reactor the US has sent into space. That distinction goes to SNAP-10A in 1965. The reason the US has spent decades exploring space-capable nuclear reactors is simple. \"You can get massive amounts of power from very little mass,\" explains Nick Touran, reactor physicist, nuclear advocate and the founder of What is Nuclear . And for launches to space, keeping payload amounts low is critical. Just how much power are we talking about? \"When fully fissioned, a softball-sized chunk of Uranium-235 offers as much energy as a freight train full of coal,\" says Dr. Lal. Combined with the limitations of solar power, particularly the farther a spacecraft travels away from the sun, nuclear is a game changer. NASA Dr. Lal points to the New Horizons probe as an example. In 2015, the spacecraft flew past Pluto, in the process capturing stunning photos of the dwarf planet . If you followed the mission closely, you may remember New Horizons didn't make a stop at Pluto. The reason for that is it didn't have enough power to enter orbit. \"We had about 200 watts on New Horizons. That's basically two light bulbs worth of power,\" said Dr. Lal. It subsequently took New Horizons 16 months to send all of the 50-plus gigabytes of data it captured back to Earth. Had the probe had a 20-kilowatt microreactor, Dr. Lal says it could have streamed that data in real-time, on top of entering orbit and operating all of its instruments continuously. When it comes to the Moon, nuclear would be transformational. On our only natural satellite, nights last 14 Earth days, and there are craters that never see any sunlight. Solar energy could power a permanent NASA outpost on the Moon, but not without a \"huge\" number of batteries to bridge the two-week gap in power generation, and those batteries would need to be ferried from Earth. \"At some point, we will want to do industrial-scale work on the Moon. Even if we want to do 3D printing, it requires hundreds of kilowatts of power – if not more,\" said Dr. Lal. \"If you're going to do any kind of commercial activity on the Moon, we need more than solar can provide.\" On Mars, meanwhile, nuclear power would be absolutely essential. The Red Planet is home to dust storms that can last weeks or months, and cover entire continents. In those conditions, solar power is unreliable. In fact, when NASA finally ended Opportunity's nearly 15-year mission on Mars, it was a planet-wide dust storm that left the rover inoperable. As such, if the US wants to establish a permanent presence on Mars, Dr. Lal argues it would make the most sense to perfect the necessary reactor technology on the Moon. \"We don't want our first-ever nuclear reactor operating on Mars. We want to try it out on the Moon first. And that is what I think NASA is trying to do.\" Of course, there are many technical hurdles NASA will need to overcome before any of this is anywhere close to reality. Surprisingly, the most straightforward problem might be finding a 100-kilowatt microreactor. Right now, there's no company in the US producing microreactors. Atomics International and North American Aviation, the companies that built SNAP-10A, went defunct decades ago. Los Alamos National Laboratory \"There are many that are in development, but almost none that are even in the prototype stage,\" said Touran. As he explains, that's an important detail; most nuclear reactors don't work at all when they're first turned on. \"It takes a few iterations to get a reactor up to a level where it's operable, reliable and cost effective,\" he said. The good news is Touran believes there's more than enough time for either NASA or a private company to build a working reactor for the project. \"I think we're in a great spot to take a good swing at this by 2030,\" said Touran. In 2018, NASA and the Department of Energy demoed KRUSTY , a lightweight, 10-kilowatt fission system. \"That was one of the only newish reactors we've turned on in many decades, and it was done on a shoestring budget,\" he said. In the end, deploying a reactor on the Moon may prove more difficult than building one. Based on some rough math done by Dr. Myers, a 100-kilowatt reactor would weigh between 10 to 15 metric tons, meaning no current commercial rocket could carry it to space. NASA will also need to find a way to fit the reactor's radiator inside a rocket. Unfolded, the component will be about the size of a basketball court. According to Dr. Lal, the 2030 timeline for the project is likely based on the assumption Starship will be ready to fly by then. But Elon Musk's super heavy-lift rocket has had a bad 2025. Of the three test flights SpaceX has attempted this year, two ended in the spacecraft exploding. One of those saw Starship go up in flames during what should have been a routine ground test . Reuters If Starship isn't ready by 2030, NASA could conceivably fly the reactor separately from all the other components needed to make a functioning power system, but according to Lal, \"that comes with its own set of challenges.\" Primarily, the agency doesn't have a great way of assembling such a complex system autonomously. In any case, Starship is at least a tangible work in progress. The same can't be said for the lander that would be needed to bring the reactor to the surface of the Moon. In 2021, NASA contracted SpaceX to build a lander for the Artemis missions, but the latest update the two shared on the spacecraft was a pair of 3D renderings . Similarly, Blue Origin's Blue Moon lander has yet to fly, despite promises it could make its first trip to the Moon as early as this spring or summer . Another question mark hangs over the entire project. As of the end of July, NASA is on track to lose approximately 4,000 employees who have agreed to leave the agency through either early retirement, a voluntary separation or a deferred resignation — all as part of the Trump administration's broader efforts to trim the number of workers across the entire federal government. All told, NASA is on track to lose about a fifth of its workforce, and morale at the agency is at an all-time low . Even with the Department of Energy and private industry providing support, there's good reason to believe the reductions will affect NASA's ability to deliver the project on time. \"The contradiction inherent in this proposal is that the White House is directing NASA to do the two most ambitious and difficult projects any space program can do, which is to send humans to the Moon and Mars, but to do so with a resource level and workforce equivalent to what the agency had before the first humans went to space in 1961,\" said Dreier. A NASA spokesperson declined to share specifics on the reductions — including the number of employees set to leave the Glenn Research Center , the facility that built the KRUSTY reactor, and where much of the agency's nuclear engineering talent is concentrated. \"As more official information becomes available, we anticipate answering more of your questions,\" the spokesperson said. \"I wish there was some inventory of the 4,000 people who left. What gaps are left? We have no idea if the departures were systematic,\" said Dr. Lal. \"NASA has not been open or transparent about what types of employees have taken the deferred resignation program, where those skills are and where they're departing from,\" Drier added. \"Nuclear engineering is not a common field for most people. [The reductions] certainly can't help.\" Still, both Lal and Touran believe the involvement of the Department of Energy is likely to swing things in NASA's favor. In a statement NASA shared with Engadget, Secretary Duffy downplayed the workforce concerns. “NASA remains committed to our mission, even as we work within a more prioritized budget and changes with our workforce. NASA retains a strong bench of talent. I am confident that our exceptional team remains capable of executing upon my directives safely and in a timely manner and will continue to carry our work forward,\" he said. \"We will continue to ensure America continues to lead in space exploration, advancing progress on key goals including returning Americans to the Moon and planting the Stars and Stripes on Mars, as we usher in the Golden Age of American innovation.” In their report, Lal and Myers estimate it would cost about $800 million annually for five years to build and deploy a nuclear reactor on the Moon. Even if DoE support can prevent NASA's staffing cuts from kneecapping the project, its feasibility will hinge on if the Trump administration ponies up the cash to execute on its own bold claims. Have a tip for Igor? You can reach him by email , on Bluesky or send a message to @Kodachrome.72 to chat confidentially on Signal. This article originally appeared on Engadget at https://www.engadget.com/science/space/why-on-earth-would-nasa-build-a-nuclear-reactor-on-the-moon-153741891.html?src=rss", "ingested_utc": "2025-08-15T15:54:40Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T15:54:58Z", "source": "FinancialPost_Business", "title": "Harden welcomes Food Basics to Phase III of Plaza Hawkesbury", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/harden-welcomes-food-basics-to-phase-iii-of-plaza-hawkesbury", "id_key": "f7c5a496fabc91f563a1fde37178f7b7c10f1d63e40f636ae5f029b062baf8a7", "summary": "HAWKESBURY, Ontario — Harden announces the grand opening of Food Basics, the first tenant of Plaza Hawkesbury – Phase III. This ± 32,000 sq. ft. supermarket, renowned for its competitive prices, opened its doors yesterday, offering the community of Hawkesbury and the surrounding area, a new and affordable quality shopping experience. The expansion of Plaza […]", "ingested_utc": "2025-08-15T15:54:58Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T15:54:58Z", "source": "FinancialPost_Business", "title": "Australian lawyer apologizes for AI-generated errors in murder case", "url": "https://financialpost.com/pmn/australian-lawyer-apologizes-for-ai-generated-errors-in-murder-case-2", "id_key": "7623c8e33b781d05f467e003c7948b76ef064ef4e48551ed01ba1b34ffbf9831", "summary": "MELBOURNE, Australia (AP) — A senior lawyer in Australia has apologized to a judge for filing submissions in a murder case that included fake quotes and nonexistent case judgments generated by artificial intelligence. The blunder in the Supreme Court of Victoria state is another in a litany of mishaps AI has caused in justice systems […]", "ingested_utc": "2025-08-15T15:54:58Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T15:55:13Z", "source": "HackerNews_Top", "title": "Letting inmates run the asylum: Using AI to secure AI", "url": "https://mattsayar.com/letting-inmates-run-the-asylum-using-ai-to-secure-ai/", "id_key": "ff75ed507f6089bdaca3a4ffc549cc47b0cf34529245935ba77f54c4fb3db2dc", "summary": "Comments", "ingested_utc": "2025-08-15T15:55:13Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T15:55:13Z", "source": "HackerNews_Top", "title": "Have you ever noticed that people dressed better in the past?", "url": "https://twitter.com/dieworkwear/status/1955756224030630264", "id_key": "a12a9051c0b9ff7a55e41a3b48871c411479a52abc3decdd2d6ae6b98882015b", "summary": "Comments", "ingested_utc": "2025-08-15T15:55:13Z"}
