{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:04Z", "source": "BBC_Business", "title": "What are Rachel Reeves' options on property tax?", "url": "https://www.bbc.com/news/articles/cm2k1m56xgjo?at_medium=RSS&at_campaign=rss", "id_key": "487e09a8efff2f9452fb4f1c0dfb0926750ddbdfd229d9e676ff1fd044d80abc", "summary": "Reports suggest the government is considering shaking up the property tax system to raise revenue.", "ingested_utc": "2025-08-20T15:50:04Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:07Z", "source": "Guardian_World", "title": "Polish army believes drone that exploded in eastern Poland was launched from Russia – Europe", "url": "https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news", "id_key": "3f50887c52793a49f98dd7069d99732ff9a050cb272a6c86af17d2b9f5646f4b", "summary": "Not clear if it was a deliberate violation of Poland’s airspace or a malfunction of a drone targeting Ukraine, Poland said An object which fell and exploded in a cornfield in eastern Poland may have been a component of an old propeller engine, the Polish army said on Wednesday, adding that there had been no violation of Poland’s airspace from Ukraine or Belarus. Police had earlier announced that an unidentified object had fallen in a field in the village of Osiny in eastern Poland’s Lublin province, which borders Ukraine. “...after conducting preliminary analyses of radar system records, no violation of Polish airspace was recorded last night from either Ukraine or Belarus,” the Operational Command of the Polish Armed Forces said on X. Continue reading...", "ingested_utc": "2025-08-20T15:50:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:07Z", "source": "Guardian_World", "title": "England to sell eight times the council homes it built last year, report finds", "url": "https://www.theguardian.com/society/2025/aug/20/england-to-sell-eight-times-the-council-homes-it-built-last-year-report-finds", "id_key": "fe6e3ef68daa2bc1d217326ba35076550e70a2406cd65349984a5ff594bf6e09", "summary": "Depletion of social housing stock spurs calls for councils to have first refusal to buy ex-council homes entering market UK politics live – latest updates England will sell off more than eight times as many council homes in 2025-26 as were constructed the previous year, research has found. Right to buy is depleting council housing stock more quickly than public housing can be replaced, forcing people to spend more money on private market rents and obtain less secure tenancies, finds a report from the thinktank Common Wealth. Continue reading...", "ingested_utc": "2025-08-20T15:50:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:07Z", "source": "Guardian_World", "title": "Gordon Brown calls for apologies over forced adoptions in England and Wales", "url": "https://www.theguardian.com/society/2025/aug/20/gordon-brown-calls-for-apologies-over-historic-forced-adoptions", "id_key": "3ec22108f2881467f5564f81b689ca8943f97c4a3a4036f1880721abdfb3f5e7", "summary": "Campaigners say time running out to issue formal apology to women who had babies taken away in 1950s, 60s and 70s Gordon Brown has called on the UK government to issue a formal apology to women whose babies were forcibly adopted in the 1950s, 60s and 70s. The former Labour prime minister said the state should apologise for its role in the “terrible tragedy” of forced adoptions involving about 200,000 women in England and Wales. Continue reading...", "ingested_utc": "2025-08-20T15:50:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:07Z", "source": "Guardian_World", "title": "Man jailed for stabbing neighbour and shooting officer with crossbow in High Wycombe", "url": "https://www.theguardian.com/uk-news/2025/aug/20/man-jailed-stabbing-neighbour-shooting-officer-with-crossbow-high-wycombe", "id_key": "222472ab6b66d2d3e05c2f5ad81a152787da486ecf3a5b8112a716d1897f7828", "summary": "Jason King knifed Alistair Mahwuto before ‘hunting’ responding police officers with weapon, court heard A man has been jailed for stabbing a neighbour and “hunting” and shooting a police officer with a crossbow. Jason King stabbed neighbour Alistair Mahwuto with a small knife during an altercation resulting from a longstanding dispute, Aylesbury crown court heard on Wednesday. Continue reading...", "ingested_utc": "2025-08-20T15:50:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:07Z", "source": "Guardian_World", "title": "Texas house convenes as Republicans set to approve Trump-backed congressional map – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates", "id_key": "8624639a7e7e649770da145793da08d00bb87c15b6dc8cfd1925f147beb6c463", "summary": "State house to hold vote on map intended to flip five Democrat-held seats; US attorney general releases latest arrest numbers The White House launched an official TikTok account on Tuesday, as Donald Trump continues to permit the Chinese-owned platform to operate in the US despite a law requiring its sale. “America we are BACK! What’s up TikTok ?” read a caption on the account’s first post, a 27-second clip, on the popular video-sharing app. Continue reading...", "ingested_utc": "2025-08-20T15:50:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:46Z", "source": "CryptoSlate", "title": "Bitcoin leads $2.8 billion profit wave amid market contraction concerns, Glassnode data shows", "url": "https://cryptoslate.com/bitcoin-leads-2-8-billion-profit-wave-amid-market-contraction-concerns-glassnode-data-shows/", "id_key": "1442d146a236c0b8dd125cf58fdc94a9645b38b54aecedf9e4389076c5bd1e2f", "summary": "Crypto investors holding the top five digital assets by market capitalization for more than 1 month have realized nearly $2.8 billion in profits over the past month, according to data from Glassnode. According to the blockchain analytics firm, the crypto market is beginning to show signs of contractions due to the significant profit-taking across Bitcoin, […] The post Bitcoin leads $2.8 billion profit wave amid market contraction concerns, Glassnode data shows appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T15:50:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:50:47Z", "source": "CryptoBriefing", "title": "Fed is studying tokenization, smart contracts, and AI in payments, says Governor Waller", "url": "https://cryptobriefing.com/fed-payment-system-innovation/", "id_key": "0cc11df22488551fa7a28141d7c237aadaae83a9cba0dd8b0dd5ca1b837d6a8d", "summary": "The Fed is researching tokenization, smart contracts, and AI to support payment system innovation and industry collaboration. The post Fed is studying tokenization, smart contracts, and AI in payments, says Governor Waller appeared first on Crypto Briefing .", "ingested_utc": "2025-08-20T15:50:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:52:54Z", "source": "FT_Home", "title": "Russia says it must be included in any Ukraine security guarantees", "url": "https://www.ft.com/content/3851eefa-48f7-4bd0-8ac1-6ef241c38714", "id_key": "a8142c599302629fd6c025c83acd440bbccffb57474fce45055a7350cae55edf", "summary": "Demand from foreign minister Sergei Lavrov would give Moscow an effective veto over efforts to defend Kyiv", "ingested_utc": "2025-08-20T15:52:54Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:53:13Z", "source": "Engadget_All", "title": "How to watch Made by Google Pixel 10 launch event live today", "url": "https://www.engadget.com/mobile/smartphones/how-to-watch-made-by-google-pixel-10-launch-event-live-today-163933575.html?src=rss", "id_key": "2553dd0e0fe032ced978058239d5dd262ee9ef7f5837c71eae0a065411f9f066", "summary": "Yes, September is all about iPhone, but Google is taking center stage today with its hotly anticipated Pixel hardware event. Thanks to a parade of leaks, we think we know mostly what to expect today — Pixel 10 phones, along with new watches and earbuds — but we'll know for sure later today. That's because the event kicks off at 1PM ET. If you want to be the first to hear the official scoop, you can tune into the Made by Google YouTube channel (or right here!) to catch Google's event, which will be hosted by Jimmy Fallon and also include other celebrities like Stephen Curry , Lando Norris and the Jonas Brothers — get ready for some potentially awkward cue card readings! And open a second window to follow our Pixel event liveblog for real-time analysis. Sam Rutherford for Engadget What's on tap? You can expect a more power-efficient Tensor G5 processor in all the new Pixel 10 phones. (That could help power new Gemini AI features , too.) The base-level Pixel 10 should get a big camera upgrade: a 5x telephoto lens. Before this generation, you had to splurge on a Pro or Fold model to get optical zoom. Cameras will be higher-res across the board, too. In other areas, Qi2 magnetic charging is expected to come to the new Pixels. Expect a new accessory ecosystem, a la Apple's MagSafe , dubbed \"Pixelsnap.\" We'll also likely see the Pixel Watch 4 with a larger battery and smaller bezels . And the Pixel Buds 2a could bring refinements to the company's budget earbuds . Engadget's Pixel 10 leak roundup will give you a much more detailed dive into the rumors. You can head back here on August 20 at 1PM ET to watch live. Live from NYC, it's #MadeByGoogle '25! Tune in on August 20th at 1pm ET to catch our latest products and celebrate 10 generations of Pixel with all these special guests & more 👀 Are you ready to get outside your comfort phone? https://t.co/3qmNQCXzzo pic.twitter.com/9IA1pO9G6F — Made by Google (@madebygoogle) August 15, 2025 This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-watch-made-by-google-pixel-10-launch-event-live-today-163933575.html?src=rss", "ingested_utc": "2025-08-20T15:53:13Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:53:23Z", "source": "AlJazeera_All", "title": "China FM in Afghanistan, offers to deepen cooperation with Taliban rulers", "url": "https://www.aljazeera.com/news/2025/8/20/china-afghanistan-hold-talks-on-mining-belt-and-road-participation?traffic_source=rss", "id_key": "8ccfb0d4007bf080838c54e25329e0e6e7f88fde8a3b2d7d8607c7fba8a8b460", "summary": "Mining, Belt and Road participation feature in trilateral meetings between China, Afghanistan and Pakistan in Kabul.", "ingested_utc": "2025-08-20T15:53:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T15:53:37Z", "source": "Nikkei_Asia_Top", "title": "Japan automakers start to pass on Trump tariff costs to US consumers", "url": "https://asia.nikkei.com/business/automobiles/japan-automakers-start-to-pass-on-trump-tariff-costs-to-us-consumers", "id_key": "31b8cb38c36edc17eb18370936e1cb05f136027e8affb5b26a76257dd4cdd376", "summary": "", "ingested_utc": "2025-08-20T15:53:37Z"}
