{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T22:48:04Z", "source": "Guardian_World", "title": "Australia politics live: Bragg says Labor underwriting ‘extremely wealthy’ as date set for help for first home buyers", "url": "https://www.theguardian.com/australia-news/live/2025/aug/25/australia-politics-live-labor-housing-first-home-buyers-anthony-albanese-sussan-ley-question-time-ntwnfb", "id_key": "e376d171a42430fbb368bc7c483704fcc7fdb852065e9623ce46f43ea38f3899", "summary": "There will be expanded access to 5% deposits for first home buyers from 1 October. Follow today’s news live Get our breaking news email , free app or daily news podcast PM to seek meeting with Trump as ‘summit season’ approaches Anthony Albanese and Clare O’Neil have taken a venture out to the Canberra ‘burbs this morning, to spruik the 5% deposit scheme. [There are] a number of events over the coming months, we’re about to enter summit season, and I look forward to discussions continuing face to face, as they have been constructive when I’ve had discussions with President Trump up to now. This is an uncapped scheme which is available to billionaires or the children of billionaires if they want to use a government program. I think we’re getting to a point where Australia is becoming a ridiculous nation where the taxpayer is underwriting mortgage insurance schemes for extremely wealthy people. Just because a bird flew over a housing lot in 1971 shouldn’t mean we can’t have houses built today. And that’s frankly what’s happening now. Continue reading...", "ingested_utc": "2025-08-24T22:48:04Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T22:48:04Z", "source": "Guardian_World", "title": "Trump ‘manufactured crisis’ to justify plan to send national guard to Chicago, leading Democrat says", "url": "https://www.theguardian.com/us-news/2025/aug/24/trump-national-guard-chicago-hakeem-jeffries", "id_key": "7fbbd3c57c1d4805e3add3a8d2d1679171f87b502a52d4238fe83e11e9f948e9", "summary": "Pentagon official confirms plan as House minority leader Jeffries says president is ‘playing’ with Americans’ lives Planning is underway to send national guard troops to Chicago, an official at the Pentagon confirmed to ABC News on Sunday. “We won’t speculate on further operations. The Department is a planning organization and is continuously working with other agency partners on plans to protect federal assets and personnel,” a Department of Defense official said, according to ABC. Continue reading...", "ingested_utc": "2025-08-24T22:48:04Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T22:51:29Z", "source": "HackerNews_Top", "title": "2.5B Gmail users endangered after Google database hack", "url": "https://www.pcworld.com/article/2880822/2-5-billion-gmail-users-endangered-after-google-database-hack.html", "id_key": "19dd32dfec1f423f044256e2b29127684e2dbc080aea28bbe7add3c2217a0c02", "summary": "Comments", "ingested_utc": "2025-08-24T22:51:29Z"}
