{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:08Z", "source": "BBC_Business", "title": "Elon Musk and X reach settlement with axed Twitter workers", "url": "https://www.bbc.com/news/articles/c1ejq154nqzo?at_medium=RSS&at_campaign=rss", "id_key": "9fb5b3dcbac2599b653c2db111521b1e675acb429ec9ed1e82273e0cacc6c765", "summary": "Ex-Twitter staff sued the platform after some 6,000 employees were sacked in 2022.", "ingested_utc": "2025-08-22T08:47:08Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:11Z", "source": "Guardian_World", "title": "Guzman y Gomez keeps expansion on the menu despite increased US losses rattling investors", "url": "https://www.theguardian.com/australia-news/2025/aug/22/guzman-y-gomez-keeps-expansion-on-the-menu-despite-increased-us-losses-rattling-investors", "id_key": "41780d5643757be2163ba6c3bec2a24815fb2c415fd2e6ebd732e358bfe68b58", "summary": "Shares in Sydney-based restaurant chain plummet by more than 20% despite global sales passing $1bn, as co-CEOs say ‘we are seeing momentum’ in American market Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Mexican-themed chain Guzman y Gomez plans to open at least 15 restaurants in the US despite doubling its losses on its “relentless” bid to expand into the competitive American market. Despite its struggles in the US, the company recorded more than $1bn in sales across its network for the first time and more than doubled its net profit to $14.5m in the 12 months to July – its first year on the Australian Stock Exchange (ASX). Continue reading...", "ingested_utc": "2025-08-22T08:47:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:11Z", "source": "Guardian_World", "title": "Famine set to be officially declared in Gaza for first time by UN-backed group – Israel-Gaza war latest updates", "url": "https://www.theguardian.com/world/live/2025/aug/22/famine-benjamin-netanyahu-palestine-gaza-israel-war-latest-updates", "id_key": "0f9033eef7916d76229358e9a8a378f992bd4bfba73bf544e92beef662df3dd1", "summary": "The system for classifying food insecurity has been used to declare just four famines since it was established in 2004 Israeli Defence Minister Israel Katz has vowed to destroy Gaza City if Hamas did not agree to disarm, release all remaining hostages in the territory and end the war on Israel’s terms, reports AFP. He wrote on social media: Soon, the gates of hell will open upon the heads of Hamas’s murderers and rapists in Gaza - until they agree to Israel’s conditions for ending the war, primarily the release of all hostages and their disarmament,” the minister posted on social media. If they do not agree, Gaza, the capital of Hamas, will become Rafah and Beit Hanoun,” he added, referring to two cities in Gaza largely razed during previous Israeli operations. Continue reading...", "ingested_utc": "2025-08-22T08:47:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:11Z", "source": "Guardian_World", "title": "Dozens of protests planned outside asylum hotels as Labour defends record on immigration – UK politics live", "url": "https://www.theguardian.com/uk-news/live/2025/aug/22/asylum-hotels-labour-immigration-protests-conservatives-kemi-badenoch-keir-starmer-uk-politics-live", "id_key": "dcbb22a9195eacd8f198158a69a1f69b192005cb271820bd84048bd53bd2b06f", "summary": "Labour has pledged to end the use of hotels to house asylum seekers by the end of this parliament in 2029 GMB has urged the government to “take a stake” in the future of Liberty Steel after assuming control of its Speciality Steels UK (SSUK) division. The PA news agency reports that Charlotte Brumpton-Childs , GMB national officer, told BBC Breakfast that recent developments show why public ownership or greater government control is needed. She said: What has happened at Liberty Steel is again another example of when the government does not have a stake in these important national assets, they are at the whim of often international owners that have profit above people and don’t have a stake in the UK national infrastructure. GMB would like to see government take a stake in the ownership of Liberty Steel and ultimately have a say in its future. It’s been a yo-yo, where we’ve never been really sure what the court decision was going to be. We’ve sort of expected this insolvency decision several times over the last couple of months and I think it’s been really hard for everyone because you can’t predict what a judge is going to say. We’ve got a team that we’ve stood up in my office, we’ve been working with the government’s steel team to make sure that we know exactly what’s going on here in terms of the assets that are on the table. We’ve had interest from companies who we know who want to take on these sites. Continue reading...", "ingested_utc": "2025-08-22T08:47:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:11Z", "source": "Guardian_World", "title": "Fears grow over impact of ONS data reliability on Rachel Reeves’s budget", "url": "https://www.theguardian.com/uk-news/2025/aug/22/fears-grow-over-impact-of-ons-data-reliability-on-rachel-reeves-budget", "id_key": "b22e7ad8a18e61bc712603503db86f19a80f9bf1177ac6f9f4a95b8c1d9e4a7d", "summary": "Troubles at UK statistics body are muddying economic picture for Treasury and spending watchdog, sources warn Deep problems at the UK’s statistics agency with the quality of its data are piling pressure on officials in the run-up to the autumn budget, sources have told the Guardian. Staff at the Treasury and its independent spending watchdog are struggling to get a clear picture of the economy because of troubles at the Office for National Statistics (ONS) with producing reliable numbers. Continue reading...", "ingested_utc": "2025-08-22T08:47:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:11Z", "source": "Guardian_World", "title": "OnlyFans owner paid $701m in dividends as platform readies for potential sale", "url": "https://www.theguardian.com/business/2025/aug/22/onlyfans-owner-dividends-revenue-potential-sale", "id_key": "453e5f59c7012bc5c6ad16f01aba4e81babefe9245a5c0f57f819155818627a6", "summary": "Streaming platform known for subscription-based adult content reports $1.4bn revenue and rising usage The owner of OnlyFans was paid $701m (£523m) in dividends last year as the streaming platform best known for offering adult content readies for a potential multibillion-dollar sale. The UK-based company, which offers a range of subscription-based content from sex workers and celebrities, reported revenue of $1.4bn in its 2024 financial year, up 9% compared with the year before, accounts filed at Companies House on Friday show. Pre-tax profit rose 4% to $683.6m. Continue reading...", "ingested_utc": "2025-08-22T08:47:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:11Z", "source": "Guardian_World", "title": "Protests expected at asylum hotels across UK as tensions mount", "url": "https://www.theguardian.com/uk-news/2025/aug/22/protests-asylum-hotels-england-tensions-mount", "id_key": "9f164acbace775e473bdcf2650dc300ea2b1d219cf1b10a36f22f2acf1edf43e", "summary": "Anti-migrant demonstrations expected on Friday and Saturday, while councils investigate legal challenges against hotels Dozens of protests outside hotels used as temporary accommodation for asylum seekers are expected over the weekend across Britain amid mounting tensions over the issue. Figures released on Thursday showed there were more than 32,000 asylum seekers in hotels, marking a rise of 8% during Labour’s first year in office. Continue reading...", "ingested_utc": "2025-08-22T08:47:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:11Z", "source": "Guardian_World", "title": "Protesters against ban on Palestine Action intend to make mass arrests ‘impossible’", "url": "https://www.theguardian.com/uk-news/2025/aug/22/palestine-action-ban-protesters-defend-our-juries-plan-street-bail-police", "id_key": "109dcc0883ad4b3e1c9e4c29d52334c90b38ad97ab7c51a4c8d7323134826376", "summary": "Defend Our Juries says ‘trick of using street bail’ will not work if participants insist on being taken to a police station Protesters at the next mass demonstration against the ban on Palestine Action will withhold their details from officers to force en-masse processing at police stations in an effort to make it “practically impossible” to arrest everyone. On Friday, Defend Our Juries, the pressure group behind the protests, will open sign-ups for its next demonstration to be held in London on 6 September. The group said it would only go ahead if 1,000 people agreed to take part , making it the largest protest opposing the proscription of Palestine Action since it was banned in June. More than 2,500 people have already expressed interest in taking part. Continue reading...", "ingested_utc": "2025-08-22T08:47:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:33Z", "source": "CryptoNews", "title": "Binance Faces Mandatory Audit in Australia Over ‘Serious’ AML and Terror Financing Concerns", "url": "https://cryptonews.com/news/binance-faces-mandatory-audit-in-australia-over-serious-aml-and-terror-financing-concerns/", "id_key": "3830761a7d61ba2ed6770355dc080c55d666bbfb5a73c5ae7adbdccdfee23b95", "summary": "AUSTRAC directs Binance Australia to appoint external auditor after identifying serious concerns with the world's largest crypto exchange's anti-money laundering and counter-terrorism financing controls, giving Investbybit Pty Ltd 28 days to nominate auditors as part of broader enforcement campaign targeting 13 crypto providers with compliance issues. The post Binance Faces Mandatory Audit in Australia Over ‘Serious’ AML and Terror Financing Concerns appeared first on Cryptonews .", "ingested_utc": "2025-08-22T08:47:33Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:47:34Z", "source": "CoinJournal", "title": "Ripple partners with SBI Holdings to distribute RLUSD stablecoin in Japan", "url": "https://coinjournal.net/news/ripple-partners-with-sbi-holdings-to-distribute-rlusd-stablecoin-in-japan/", "id_key": "394639845713b180be15899d36bdf7429ea2183d0873871e26b83fb45cc8a7a7", "summary": "They have signed an MOU to distribute the stablecoin in Japan via SBI VC Trade. RLUSD is a licensed asset, backed by US dollar deposits, reliable reserves, and government bonds. The stablecoin is set to debut in Japan in early 2026. Blockchain firm Ripple has revealed a key development with its long-standing partner SBI Holdings, […] The post Ripple partners with SBI Holdings to distribute RLUSD stablecoin in Japan appeared first on CoinJournal .", "ingested_utc": "2025-08-22T08:47:34Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:49:36Z", "source": "FT_Home", "title": "Germany falls back into ‘recessionary territory’ as second-quarter GDP revised down", "url": "https://www.ft.com/content/a4d2660f-311f-4281-895c-c95274234a7f", "id_key": "8b5b872ca9882864ce1001c4dd0944b8e617645548f6a95e67efa350f650a9e8", "summary": "Europe’s largest economy contracted 0.3% as exports and investment dropped", "ingested_utc": "2025-08-22T08:49:36Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:49:52Z", "source": "TheVerge_All", "title": "Florida man orders beautification of America after gold-plating the White House", "url": "https://www.theverge.com/news/764142/trump-executive-order-national-design-studio", "id_key": "0d596d7bea6909024f1e7a4f8118645de53e53110aa816c97de524375c8d6ca9", "summary": "President Donald Trump signed a new executive order on Thursday to improve the “usability and aesthetics” of US government services by creating “first-class online and offline experiences for Americans.” “It is time to update the Government’s design language to be both usable and beautiful,” Trump said in the order, which establishes an America by Design […]", "ingested_utc": "2025-08-22T08:49:52Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:50:11Z", "source": "FinancialPost_Business", "title": "Gold Fields First-Half Profit Tops $1 Billion as Prices Soar", "url": "https://financialpost.com/pmn/business-pmn/gold-fields-first-half-profit-tops-1-billion-as-prices-soar", "id_key": "c63d1f564f7d8eb0c0e2efa4ff415353d1fef5ec48dd655fcaa15708ae953303", "summary": "Gold Fields Ltd., a miner of the precious metal in Africa, Australia and South America, said first-half profit more than doubled after bullion prices soared and production rose.", "ingested_utc": "2025-08-22T08:50:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:50:11Z", "source": "FinancialPost_Business", "title": "BRP head says trade agreement compliance softening tariff impact amid demand changes", "url": "https://financialpost.com/pmn/brp-head-says-trade-agreement-compliance-softening-tariff-impact-amid-demand-changes", "id_key": "c8838d8b6a9283cf7723175ba8ef545074ca5527837a55fa3b8f3b8caea8e6c0", "summary": "Ski-Doo maker BRP Inc. has dealt with trade disputes before, but its chief executive says there’s one aspect this time around that sets the current Trump administration’s tariff regime apart. “What is particular since the beginning of the year is the fact that tariffs are imposed and they are enforced the day after, which is […]", "ingested_utc": "2025-08-22T08:50:11Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:50:18Z", "source": "Nikkei_Asia_Top", "title": "India-China ties on upswing amid Trump's tariff war: 4 things to know", "url": "https://asia.nikkei.com/politics/international-relations/india-china-ties-on-upswing-amid-trump-s-tariff-war-4-things-to-know", "id_key": "ce7b65e43259c9b1a7cb4d94c641ef9c9a248e95d4525fe09297d0d55cf5e3bd", "summary": "", "ingested_utc": "2025-08-22T08:50:18Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T08:50:18Z", "source": "Nikkei_Asia_Top", "title": "Japan cannot be complacent about rise of novice right-wing party", "url": "https://asia.nikkei.com/opinion/japan-cannot-be-complacent-about-rise-of-novice-right-wing-party", "id_key": "a7249f5054984a384f89f96dfdbdda6695aac89257f5138c41d547b9c3114499", "summary": "", "ingested_utc": "2025-08-22T08:50:18Z"}
