{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:17Z", "source": "BBC_Business", "title": "Trump calls on Federal Reserve governor to resign 'now'", "url": "https://www.bbc.com/news/articles/cx276gg2gwro?at_medium=RSS&at_campaign=rss", "id_key": "7f947c9f03727f3e0ea9786040ada9ccfb7c4081b48a12804b68aa5c3da3a32e", "summary": "He said Lisa Cook, one of the officials who sets interest rates at the Federal Reserve, should step down over unproven fraud allegations.", "ingested_utc": "2025-08-20T22:35:17Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:19Z", "source": "Guardian_Business", "title": "Fed governor urged by Trump to resign will not be ‘bullied’ into stepping down", "url": "https://www.theguardian.com/business/2025/aug/20/lisa-cook-trump-resign-fed-reserve-governor", "id_key": "6df6ac00a3840e6523a412376cc79ae26f4b35ba9d7114d7d2bb87358825e680", "summary": "Lisa Cook, first Black woman to sit on Fed board, responds after allegation by ally of president of mortgage fraud US politics live – latest updates Donald Trump has called on a Federal Reserve governor to immediately resign, renewing his extraordinary attack on the central bank’s independence as officials mull next steps on interest rates. A close Trump ally accused Lisa Cook, an appointee of Joe Biden , of “potentially committing mortgage fraud” and urged the US Department of Justice to investigate. Continue reading...", "ingested_utc": "2025-08-20T22:35:19Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:20Z", "source": "Guardian_World", "title": "Australia news live: outlook more rosy for power grid as renewables replace coal; two missing after car goes into NSW river", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "4e119c49fd9e757d037604b4a94d3a66a419dad1c42c05578e1b7d7743d1b8f7", "summary": "Aemo says demand for large-scale energy generation to grow by 21% over next decade. Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-20T22:35:20Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:20Z", "source": "Guardian_World", "title": "UK to evacuate nine Gaza students with university scholarships", "url": "https://www.theguardian.com/education/2025/aug/20/nine-students-trapped-in-gaza-will-get-help-to-take-up-places-at-uk-universities", "id_key": "11446f33c739ee455b7e68ad816404688bdc7456bddc3c67e971b9f5677cf525", "summary": "Move follows months of pressure from MPs, academics and campaigners, with dozens of other students still stranded Nine students in Gaza with full scholarships to study at British universities have been told the UK government is working to facilitate their evacuation. The students – who have all been awarded Chevening scholarships, funded by the Foreign Office in recognition of their potential as future leaders – welcomed the development on Wednesday, but dozens more Palestinians in Gaza with university places are still awaiting news. Continue reading...", "ingested_utc": "2025-08-20T22:35:20Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:20Z", "source": "Guardian_World", "title": "Federal Reserve governor responds to Trump’s attack: ‘no intention of being bullied to step down’ – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates", "id_key": "4c04b121b875d57e3afe35d2da78ef7298a2a0622576edb2fb1a65abc2468b46", "summary": "Trump attacked Lisa Cook over an unfound accusation that she committed mortgage fraud Trump calls on Federal Reserve governor Lisa Cook to resign The White House launched an official TikTok account on Tuesday, as Donald Trump continues to permit the Chinese-owned platform to operate in the US despite a law requiring its sale. “America we are BACK! What’s up TikTok ?” read a caption on the account’s first post, a 27-second clip, on the popular video-sharing app. Continue reading...", "ingested_utc": "2025-08-20T22:35:20Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:39Z", "source": "CryptoSlate", "title": "Hyperliquid achieves record revenue per employee globally at $106M", "url": "https://cryptoslate.com/hyperliquid-achieves-record-revenue-per-employee-globally-at-106m/", "id_key": "f116e943b725ab221d20aaff8c3b7f527a0199f5e7d284576c90ed4ac66ea7e4", "summary": "Hyperliquid has achieved the highest revenue per employee globally, at $106 million, surpassing traditional technology giants and the previous record holder, Tether Limited. The revenue-per-employee metric places Hyperliquid significantly ahead of established technology companies. Data gathered by Hyperliquid France puts Tether in second with $93 million per employee, while OnlyFans ranks third at $37.6 million. […] The post Hyperliquid achieves record revenue per employee globally at $106M appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T22:35:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:42Z", "source": "CryptoNews", "title": "Leading AI Claude Predicts the Price of XRP, ETH, and SOL for the End of Summer 2025", "url": "https://cryptonews.com/news/leading-ai-claude-predicts-the-price-of-xrp-eth-and-sol-for-the-end-of-summer-2025/", "id_key": "3c6c355e5e9b6d591ae6914d687fdc05668dafa17002917be258a6258ab99ad6", "summary": "Claude Predicts XRP, Ethereum, and Solana could see notable gains by the close of summer. While Bitcoin has faced volatility from inflation data, U.S. crypto rules under the GENIUS Act and SEC’s Project Crypto may set the stage for altcoins to lead the next rally, with XRP, ETH, and SOL in focus. The post Leading AI Claude Predicts the Price of XRP, ETH, and SOL for the End of Summer 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-20T22:35:42Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:35:42Z", "source": "CryptoNews", "title": "Goldman Sachs Bombshell: ‘Trillions’ to Flood the Stablecoin Market – Is USDC Set to Explode?", "url": "https://cryptonews.com/news/goldman-sachs-bombshell-trillions-to-flood-the-stablecoin-market-is-usdc-set-to-explode/", "id_key": "d66ac8dcc685b63794a4fab0d303c9c3c4df6a864c3064c6122c19546957678f", "summary": "Goldman Sachs has outlined a stablecoin outlook in which USDC has grown on legislation and partnerships, projecting another $77B by 2027. As the GENIUS Act has set reserve standards, officials have said stablecoins could lift Treasury demand while USDT’s lead faces compliance pressures. The post Goldman Sachs Bombshell: ‘Trillions’ to Flood the Stablecoin Market – Is USDC Set to Explode? appeared first on Cryptonews .", "ingested_utc": "2025-08-20T22:35:42Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:37:38Z", "source": "NYTimes_Business", "title": "Bruce Slovin, Who Unified Jewish Archives in New York, Dies at 89", "url": "https://www.nytimes.com/2025/08/20/nyregion/bruce-slovin-dead.html", "id_key": "f3bb08caa0ff89bec1b5404890e7695af79189c2a0b2a77ea4fb94ab9366f1a6", "summary": "A corporate executive who specialized in mergers, he brought together five Jewish institutions and their collections at the Center for Jewish History in Manhattan.", "ingested_utc": "2025-08-20T22:37:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:37:49Z", "source": "NPR_World", "title": "Israel will call up 60,000 reservists as it plans a new phase of war in Gaza", "url": "https://www.npr.org/2025/08/20/nx-s1-5507976/israel-palestinians-reservists-war-gaza", "id_key": "7857224a9080e2d144987bfd4712022c350277d8fb30a01aeb952d5293efcd7c", "summary": "An Israeli official said that the military will be operating in parts of Gaza City where the Israeli military has not yet operated and where Hamas is still active.", "ingested_utc": "2025-08-20T22:37:49Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:38:06Z", "source": "TheVerge_All", "title": "Today is your last chance to grab a PS5 before Sony’s price hikes go into effect", "url": "https://www.theverge.com/tech/763043/sony-playstation-5-ps5-tariff-price-increase-deal-sale", "id_key": "901b429c571900c49a215a1797b986a04d328c3bf145ade60b7f691f5c0ffccc", "summary": "Sony announced a $50 price increase on all PlayStation 5 “slim” models in the US starting tomorrow, August 21st. The upcoming prices for a PS5 Digital Edition, the standard PS5, and the PS5 Pro are $499.99, $549.99, and $749.99, respectively; however, you can avoid paying the higher prices by picking up a PS5 at Amazon, […]", "ingested_utc": "2025-08-20T22:38:06Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:38:06Z", "source": "TheVerge_All", "title": "Ricoh’s GR IV launches in September for a much steeper price than its predecessor", "url": "https://www.theverge.com/news/762848/ricoh-gr-iv-camera-gf2-flash-launch-price-specs", "id_key": "699f8906beb2a69f2263cfc71505c51073720825d88ccdb8b10b80f4e8d40a88", "summary": "Ricoh is launching its GR IV compact camera in mid-September for $1,499.95, accompanied by a tiny new GF-2 add-on flash for $119.95. As initially announced in May, the GR IV will feature a 26-megapixel APS-C sensor, slightly redesigned 28mm-equivalent f/2.8 lens, new autofocus and stabilization systems, and 53GB of built-in storage to supplement its microSD […]", "ingested_utc": "2025-08-20T22:38:06Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:38:11Z", "source": "Engadget_All", "title": "Video Games Weekly: Silksong and Gamescom", "url": "https://www.engadget.com/gaming/video-games-weekly-silksong-and-gamescom-221635822.html?src=rss", "id_key": "41612dbefb1967b4222e9cc384649ad73258cccd1536978dcb554591e17f558d", "summary": "Welcome to Video Games Weekly on Engadget. Expect a new story every Monday or Tuesday (or Wednesday, whatever), broken into two parts. The first is a space for short essays and ramblings about video game trends and related topics from me, Jess Conditt, a reporter who's covered the industry for more than 13 years. The second contains the video game stories from the past week that you need to know about, including some headlines from outside of Engadget. Please enjoy — and I'll see you next week. On a planet shrouded in myth, in a land surrounded by lore, on a mountain draped in mystery, in a cave suffocated by secrets, the legend sleeps. For six years, the legend has slumbered while wild stories spiral around it, twisting and expanding and entwining. New words have been born and old words infused with evolved meanings: Believer. Doubter. Silkpost. The lies have grown so thick they’ve become corporeal, spreading trickery with a name and a dead smile. For six years, the legend has slept while the masses roiled, all of them waiting for the signal to awaken and know truth. All of them waiting for a bell that will ring, finally and clearly, on Thursday, August 21, 2025. Skong . Skong . Skong . It’s a special time in the Silksong subreddit . After years of silence around its sequel, Hollow Knight: Silksong , Team Cherry has scheduled a livestream with a “special announcement” about the game for August 21 at 10:30AM ET. Not only is this exciting for Metroidvania fans everywhere, but it’s also possible that this announcement marks the final moments of the Silksong subreddit as we know it. A strange cocktail of game delays, inconsistent updates and hyper-focused cult fandom has cultivated a fascinating little universe in r/Silksong, complete with its own rules, villains and heroes. It’s a place where clown wigs are commonplace and contributors have turned trolling into a role-playing artform. A LARPform, if you will. It’s a place that’s consistently made me laugh every time it’s appeared in my feed over the past year or so. Ahead of Thursday’s special announcement, this sub is experiencing the last gasps of desperate myth-making and hopeless anticipation before it transforms into something else entirely, armed with actual information about the sequel, gameplay videos and maybe even a firm release date. Or, dare I say it, a surprise launch. For just a moment longer in r/Silksong, anything is possible. And then it’ll be over. No matter what happens during Thursday’s livestream, the day will come when Silksong comes out and the drip-feed of silkposts dries up completely. But for now, our face paint is ready. Sometimes it’s just nice to recognize the madness and the beauty of the moment, before it slips away for good. The news News from ONL 2025 Gamescom 2025 kicked off on Tuesday with Opening Night Live, a showcase hosted by Geoff Keighley and the folks behind The Game Awards, and there were plenty of delightful morsels on display. Engadget UK Bureau Chief Mat Smith is on the ground at Gamescom in Cologne, Germany, to play upcoming titles and talk to developers, but for now, here are our headlines straight out of ONL 2025: Denshattack! is a blend of Tony Hawk, trains and shonen anime Battlestar Galactica might finally get the video game adaption it deserves Absolum is awesome and I can't wait to play it on October 9 Call of Duty: Black Ops 7 arrives on November 14 FromSoft's Sekiro: Shadows Die Twice is becoming an anime Fallout season two has a teaser trailer and a December 17 release date Black Myth: Zhong Kui is the next title from Game Science Studio Cult of the Lamb's next DLC is Woolhaven, out in early 2026 Indiana Jones and the Great Circle is coming to the Switch 2 And our headlines from Gamescom 2025 so far: Onimusha: Way of the Sword might be a more forgiving kind of samurai epic Resident Evil Requiem feels very familiar, but it's so well made that I respect the hell out of it Engadget's Gamescom Opening Night Live 2025 liveblog How to watch Gamescom 2025 and what to expect Gamescom 2025 runs through August 24. ROG Xbox Ally lands in October Microsoft is slowly establishing its handheld era with news that the ROG Xbox Ally and ROG Xbox Ally X will be available on October 16. There’s still no official word on how much they’ll cost, but there are hints: As spotted by Wario64 , Best Buy recently listed the Xbox Ally at $550 and the Xbox Ally X at $900, and these fall in line with our predictions, which were based on the prices of existing ROG Ally handhelds. Alongside the release date, Microsoft announced the Handheld Compatibility Program , an initiative aimed at optimizing games for portable devices and informing players about how well they perform. It’s essentially Steam Deck Verified, but for Xbox handhelds, and it’s yet another sign that Microsoft’s portable gaming ambitions stretch beyond just one hardware manufacturer. The PS5 will cost more tomorrow than it does today First Nintendo and Microsoft raised the prices of their latest consoles, and now it’s Sony’s turn. Sony on Wednesday announced the following price increases for the PS5 family: Standard PS5 with a disc drive: $550, up from $500 PS5 digital edition: $500, up from $450 PS5 Pro: $750, up from $700 Sony blames the increases on a “challenging economic environment,” echoing sentiments from its contemporaries. The price hikes come at a time in the hardware generation when we’re used to seeing consoles get cheaper, which just makes this whole thing more frustrating. Rod Fergusson is in charge of BioShock again and already making big changes There have been signs of turmoil at BioShock 4 studio Cloud Chamber for a while now, including news earlier this month that the game failed a review with 2K executives and was due for a complete narrative revamp. Now, we’re seeing even more fallout. Former Gears of War and Diablo head Rod Fergusson has left Blizzard to lead development of BioShock 4 at Cloud Chamber, and his appointment comes alongside news that 80 people at the studio are being laid off. This is actually the second time Fergusson has joined the development of a BioShock game at the last second — he similarly swooped in and cut aspects of BioShock: Infinite at Irrational Games in 2012. The race through development hell between Judas and BioShock 4 continues. Blizzard’s cinematic and narrative team is unionizing Microsoft is the home of another video game union. Workers with Blizzard Entertainment’s Story and Franchise Development team, which handles in-game cinematics and lore for titles including Overwatch and World of Warcraft , voted this week to unionize under the Communications Workers of America. This covers about 169 developers and it marks the fourth unionization effort from Microsoft’s gaming teams, joining QA workers at Activision , ZeniMax and Raven Software . Steam censorship is breaking PayPal PayPal isn’t a valid way to buy games on Steam in certain countries any longer. Steam in July removed hundreds of games with adult and NSFW themes from its storefront, and updated its policies to ban \"content that may violate the rules and standards” of its payment processors. This was incredibly vague and raised immediate concerns around financial censorship, especially when combined with a related culling of thousands of games from Itch.io . Now, it’s confirmed that PayPal has terminated its partnership with Steam in multiple countries, affecting any denomination “ other than EUR, CAD, GBP, JPY, AUD and USD.” Valve says it’s being pressured by payment processors including Visa, MasterCard and PayPal to remove certain games and implement puritanical censorship policies, and this has already resulted in at least one game being unjustly removed from the platform. That game, VILE: Exhumed , is now available as shareware . Roblox is changing its rules after so, so many child-safety lawsuits Roblox is locking down its system for sharing and viewing user-generated games following a wave of lawsuits accusing developers of failing to protect their young userbase. All unrated experiences, or user-created games, will be restricted to the developer and anyone actively working on them, rather than being available to anyone over the age of 13, as is currently the case. This change and others, including a new system that automatically detects and tracks \"violative scenes\" on individual servers, will roll out over the coming months. Analogue delayed its N64 remake again It’s now due out in Q4 2025. :( Additional reading Kris Holt’s indie game roundup More action than RPG, Vampire: The Masquerade - Bloodlines 2 struggles to convince after a few hours' play by Robert Purchese at Eurogamer This article originally appeared on Engadget at https://www.engadget.com/gaming/video-games-weekly-silksong-and-gamescom-221635822.html?src=rss", "ingested_utc": "2025-08-20T22:38:11Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:38:11Z", "source": "Engadget_All", "title": "AI browsers may be the best thing that ever happened to scammers", "url": "https://www.engadget.com/ai/ai-browsers-may-be-the-best-thing-that-ever-happened-to-scammers-220315936.html?src=rss", "id_key": "7a5e59a996a2cef9f948b2ecf81929722026315d0c8f3f0ca7a6774d2624dca0", "summary": "We've heard a lot this year about AI enabling new scams, from celebrity deepfakes on Facebook to hackers impersonating government officials . However, a new report suggests that AI also poses a fraud risk from the other direction — easily falling for scams that human users are much more likely to catch. The report, titled \"Scamlexity,\" comes from a cybersecurity startup called Guardio, which produces a browser extension designed to catch scams in real time. Its findings are concerned with so-called \"agentic AI\" browsers like Opera Neon , which browse the internet for you and come back with results. Agentic AI claims to be able to work on complex tasks, like building a website or planning a trip, while users kick back. There's a huge problem here from a security perspective: while humans are not always great at sorting fraud from reality, AI is even worse. A seemingly simple task like summarizing your emails or buying you something online comes with myriad opportunities to slip up. Lacking common sense, agentic AI may be prone to bumbling into obvious traps. The researchers at Guardio tested this hypothesis using Perplexity's Comet AI browser , currently the only widely available agentic browser. Using a different AI, they spun up a fake website pretending to be Walmart, then navigated to it and told Comet to buy them an Apple Watch. Ignoring several clues that the site wasn't legit, including an obviously wonky logo and URL, Comet completed the purchase, handing over financial details in the process. In another test, the study authors sent themselves an email pretending to be from Wells Fargo, containing a real phishing URL. Comet opened the link without raising any alarms and blithely dumped a bank username and password into the phishing site. A third test proved Comet susceptible to a prompt injection scam, in which a text box concealed in a phishing page ordered the AI to download a file. It's just one set of tests, but the implications are sobering. Not only are agentic AI browsers susceptible to new types of scam, they may also be uniquely vulnerable to the oldest scams in the book. AI is built to do whatever its prompter wants, so if a human user doesn't notice the signs of a scam the first time they look, the AI won't serve as a guardrail. This warning comes as every leader in the field bets big on agentic AI. Microsoft is adding Copilot to Edge , OpenAI debuted its Operator tool in January , and Google's Project Mariner has been in the works since last year. If developers don't start building better scam detection into their browsers, agentic AI risks becoming a massive blind spot at best — and a new attack vector at worst. This article originally appeared on Engadget at https://www.engadget.com/ai/ai-browsers-may-be-the-best-thing-that-ever-happened-to-scammers-220315936.html?src=rss", "ingested_utc": "2025-08-20T22:38:11Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:38:19Z", "source": "TheStreet_Top", "title": "White House bullies Federal Reserve governor in bold political attack", "url": "https://www.thestreet.com/fed/white-house-bullies-federal-reserve-governor-in-bold-political-attack-", "id_key": "a7935b8eadb64ee8ba0598031ce3b1fbfac347e14d4299eb7fe0f06bf6ba7da8", "summary": "Unsubstantiated claims of mortgage fraud target Fed official, prompting President Trump's demand for resignation.", "ingested_utc": "2025-08-20T22:38:19Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:38:19Z", "source": "TheStreet_Top", "title": "Home Depot, Lowe's quietly raising prices due to tariffs", "url": "https://www.thestreet.com/retail/home-depot-lowes-quietly-raising-prices-due-to-tariffs", "id_key": "048b3dfed19a9048332337d34d66e64fc97a333cbc58c48434ae99aa780cb04b", "summary": "Both home improvement companies have been reluctant to admit that some prices have already increased, and others will go up.", "ingested_utc": "2025-08-20T22:38:19Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T22:38:27Z", "source": "FinancialPost_Business", "title": "Aegis Resources Ltd. Announces an Increase in its Non-brokered Private Placement", "url": "https://financialpost.com/globe-newswire/aegis-resources-ltd-announces-an-increase-in-its-non-brokered-private-placement", "id_key": "19cad6c23204965d289a07d408718036c4042f527a4cc0eee2c026a4ca30f65b", "summary": "This news release is not for distribution to United States newswire service or for dissemination in the United States Vancouver, B.C., Aug. 20, 2025 (GLOBE NEWSWIRE) — Aegis Resources Ltd. (“Aegis” or the “Company”) announces that due to subscriber demand, its board of directors has approved an increase to its private placement (the “Placement”). The […]", "ingested_utc": "2025-08-20T22:38:27Z"}
