{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:27:43Z", "source": "Guardian_World", "title": "Department of Justice to begin handing over Epstein files to Capitol Hill – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/19/texas-congressional-maps-democrats-republicans-donald-trump-us-politics-updates-news", "id_key": "5527c99419a0d1995bad99f7d1f94991a93010af7d393aa2f13c9decbb53f296", "summary": "DoJ agrees to provide Congress documents from the Epstein sex trafficking investigation, says House lawmaker on Monday SoftBank has agreed to invest $2bn (£1.5bn) in Intel , amid reports that Donald Trump’s administration is also considering a stake in the struggling US chip maker. The Japanese technology investor announced the multibillion-dollar deal on Tuesday, in a move expected to give it a 2% stake in the business. Continue reading...", "ingested_utc": "2025-08-19T11:27:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:27:43Z", "source": "Guardian_World", "title": "‘We’re all going backwards’: dismay as Trump undoes Biden student-debt plan", "url": "https://www.theguardian.com/us-news/2025/aug/19/trump-student-debt", "id_key": "cbffa63726e04f2a2e9f2496cd0bdb2df2f222c1f4ac59c23c6902c184490471", "summary": "Borrowers say higher repayments under changed Save plan means placing life on hold and creating further anxiety When Faith, a 33-year-old in Burlington, North Carolina, went back to get her master’s degree in higher education administration in 2020-21, she hoped it would accelerate her career growth and maybe even help her get on the housing ladder. Now, Faith has federal student loan debts of $38,113, and a repayment schedule that is much more demanding than she realized so she feels like the program stalled her progress. Continue reading...", "ingested_utc": "2025-08-19T11:27:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:27:43Z", "source": "Guardian_World", "title": "Democrat warns US progressives against moving toward the center: ‘It lost me the election’", "url": "https://www.theguardian.com/us-news/2025/aug/19/india-walton-interview-progressives-democrats", "id_key": "10b3d28365c9a56a61ee7846fe4bdd3980938c798894b4d1f1a525328dea8657", "summary": "India Walton, who defeated incumbent mayor only to lose general election, says ‘moderating is what got us here’ India Walton has a warning message for progressive Democrats during Donald Trump’s second presidency: don’t water down your politics to win over the establishment. The Democratic socialist who stunned the Democratic establishment by defeating a four-term incumbent mayor in Buffalo, New York’s 2021 primary believes moderating her leftwing message cost her the general election. It’s a lesson that carries new weight now that Zohran Mamdani secured his own victory in New York City’s Democratic mayoral primary earlier in the summer and inspired thousands of other progressive candidates to also run for office. Continue reading...", "ingested_utc": "2025-08-19T11:27:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:28:03Z", "source": "CryptoSlate", "title": "High betas, low correlations: miners break from Bitcoin patterns", "url": "https://cryptoslate.com/high-betas-low-correlations-miners-break-from-bitcoin-patterns/", "id_key": "95ebe7d01b1837d325f84fd1fb70aa72f2639d23088b0835642d8913e49eacd9", "summary": "Despite its weekend downturn, Bitcoin is up over 22% year-to-date, but public mining companies listed on NASDAQ have struggled to keep pace. The equal-weighted basket of mining stocks has gained just over 12% between Jan. 1 and Aug. 18. However, that underperformance masks a reversal in the past two months, when miners surged more than […] The post High betas, low correlations: miners break from Bitcoin patterns appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T11:28:03Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:28:07Z", "source": "CryptoNews", "title": "Why Is Crypto Down Today? – August 19, 2025", "url": "https://cryptonews.com/news/why-is-crypto-down-today-august-19-2025/", "id_key": "f4b303b6234952ac5f3951ebe361152ac5806fa9bf21473303eeb378017da5d4", "summary": "The crypto market is down today, with BTC and ETH falling by less than 1%. Continued US Fed hawkish stance could lead to a rapid correction in digital assets. All eyes are on Fed Chair’s Friday speech. The post Why Is Crypto Down Today? – August 19, 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-19T11:28:07Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:28:08Z", "source": "CoinJournal", "title": "Is BNB heading to a new ATH as market recovery begins? Check forecast", "url": "https://coinjournal.net/news/is-bnb-heading-to-a-new-ath-as-market-recovery-begins-check-forecast/", "id_key": "6f8ccf3c21da368d05e6fd378649fc9c44b7bd39bb0061445b4f91d223620364", "summary": "Key takeaways Binance’s BNB is trading at $845 after adding 1.5% to its value. The coin could surge to a new all-time high as the broader crypto market shows signs of a recovery. BNB tops $845 The cryptocurrency market has had a bearish start to the week, with Bitcoin hitting the $115k level while Ether […] The post Is BNB heading to a new ATH as market recovery begins? Check forecast appeared first on CoinJournal .", "ingested_utc": "2025-08-19T11:28:08Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:28:08Z", "source": "CoinJournal", "title": "Chainlink price forecast as key metrics point to increased onchain activity", "url": "https://coinjournal.net/news/chainlink-price-forecast-as-key-metrics-point-to-increased-onchain-activity/", "id_key": "ace0d012874355402a7def50ea4397c9b035e4249f7904bcc03ea3fe4258e474", "summary": "Chainlink price broke to highs $26 before correcting slightly. LINK is surging amid a spike in onchain activity. Partnerships and adoption trends remain bullish for Chainlink. Chainlink (LINK) broke above $26 for the first time in months on Monday, surging amid a notable spike in onchain activity. As LINK pares gains amid broader profit taking, […] The post Chainlink price forecast as key metrics point to increased onchain activity appeared first on CoinJournal .", "ingested_utc": "2025-08-19T11:28:08Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:28:08Z", "source": "CoinJournal", "title": "XRP climbs above $3 after ETF delay; Check forecast", "url": "https://coinjournal.net/news/xrp-climbs-above-3-after-etf-delay-check-forecast/", "id_key": "38fdfabac666d244a70015ed99ada0c95db4afcb54ca99b945a0a696b6b5064f", "summary": "Key takeaways XRP is up nearly 2% in the last 24 hours and has climbed above $3. The positive performance comes despite the SEC’s ETF delay. SEC delays spot XRP ETF applications XRP, the native coin of the Ripple network, is up nearly 2% in the last 24 hours as it bounces back from its […] The post XRP climbs above $3 after ETF delay; Check forecast appeared first on CoinJournal .", "ingested_utc": "2025-08-19T11:28:08Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:28:08Z", "source": "CoinJournal", "title": "Bio Protocol hits 6-month high as harmonic pattern signals further upside", "url": "https://coinjournal.net/news/bio-protocol-hits-6-month-high-as-harmonic-pattern-signals-further-upside/", "id_key": "8ebc42b67d5d020c6c29237fe495d8d732d5c44681c948273395b17319c6757e", "summary": "Bio Protocol funds $80K brain health trial, earning CLAW royalty tokens. Staked BIO tokens rise to 125M, tightening supply and boosting demand. Harmonic chart pattern signals a possible BIO price rally toward $0.1787. The Bio Protocol (BIO) token has regained strong momentum after a sharp pullback earlier this month, climbing to a six-month high of […] The post Bio Protocol hits 6-month high as harmonic pattern signals further upside appeared first on CoinJournal .", "ingested_utc": "2025-08-19T11:28:08Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:29:56Z", "source": "NYTimes_Business", "title": "MSNBC’s Rebrand Invites Bemusement and Ridicule", "url": "https://www.nytimes.com/2025/08/19/business/msnbc-ms-now-rebranding.html", "id_key": "00607047f17cb6fff33369dc68fb2f23754597b75ad12aa049732086512a284e", "summary": "The cable TV network’s new name, MS NOW, became the subject of mockery soon after it was announced on Monday.", "ingested_utc": "2025-08-19T11:29:56Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:29:57Z", "source": "NYTimes_World", "title": "Netanyahu Faces Pressure From Far Right Over Cease-Fire Proposal", "url": "https://www.nytimes.com/2025/08/19/world/middleeast/netanyahu-israel-hamas-gaza-cease-fire-talks.html", "id_key": "830f1908165d85381decfb054c23aef57bf1436675560e30b8970c9ef18c0469", "summary": "Some members of Israel’s coalition have ruled out a proposed hostage deal with Hamas, but the prime minister has yet to state his position.", "ingested_utc": "2025-08-19T11:29:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:05Z", "source": "NPR_Top", "title": "Putin and Zelenskyy could meet. And, Trump wants to stop voting by mail", "url": "https://www.npr.org/2025/08/19/g-s1-83374/up-first-briefing-putin-zelenskyy-may-meet-mail-in-votings-future", "id_key": "b6a728ab8827cc04bd54b12e79b82c694b035d21347277ac29b7b98345dc0e84", "summary": "Trump says there are plans underway for Putin and Zelenskyy to meet to discuss an end to the war between Russia and Ukraine. And, Trump wants to stop states from voting by mail.", "ingested_utc": "2025-08-19T11:30:05Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:05Z", "source": "NPR_Top", "title": "Here, together: Images of community from NPR station photographers", "url": "https://www.npr.org/sections/the-picture-show/2025/08/19/g-s1-82504/npr-station-photographer-images-world-photography-day", "id_key": "b965ecc9c31b77dc979f0d91f5b4e558afcd465100188f9151e3b001c11abbe5", "summary": "NPR marks World Photography Day with images of everyday moments of gathering from communities across the U.S. taken by photographers from the network's member stations.", "ingested_utc": "2025-08-19T11:30:05Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:09Z", "source": "FT_Markets", "title": "BHP posts lowest profit since start of pandemic", "url": "https://www.ft.com/content/671bb9d2-f87d-42e1-943d-1cfa5d085faf", "id_key": "daf268b7c995d51fc04d7c831d0e6ab5eb69de1dc6cea50a046790f7ab3e4441", "summary": "Miner’s poor performance driven by falling iron ore and coal prices", "ingested_utc": "2025-08-19T11:30:09Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:23Z", "source": "TechCrunch_All", "title": "Figure’s IPO filing marks Mike Cagney’s return to public markets", "url": "https://techcrunch.com/2025/08/19/figures-ipo-filing-marks-mike-cagneys-return-to-public-markets/", "id_key": "5a46085646a6c675d9329247fa395169be2dc23e242eed1b45aa84b83fe35813", "summary": "Figure Technology, a seven-year-old blockchain-based lending company, has filed a registration statement with the SEC for an IPO of its Class A common stock. The filing offers a chance at vindication for Figure co-founder Mike Cagney.", "ingested_utc": "2025-08-19T11:30:23Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:24Z", "source": "ArsTechnica_All", "title": "An extinct volcano in Arkansas hosts the only public diamond mine on Earth", "url": "https://arstechnica.com/science/2025/08/for-15-anyone-can-dig-up-diamonds-in-this-arkansas-state-park/", "id_key": "7f6bd81cc0a613aa182ef5b28be9796ccb904e05d7046b7752ce890c261969c5", "summary": "Visitors have unearthed over 35,000 diamonds at Crater of Diamonds State Park since 1972.", "ingested_utc": "2025-08-19T11:30:24Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:25Z", "source": "WIRED_All", "title": "People Are Trying to ‘Deprogram’ Their MAGA Parents Through Book Clubs", "url": "https://www.wired.com/story/people-are-trying-to-deprogram-their-maga-parents-through-book-clubs/", "id_key": "ddaaa9bbc269f3adab67a6ea4f5606e80a656553d3b9bb006fc28bc72bc4ff1a", "summary": "Divisive politics have led people to go “no contact” with their right-wing parents. Some hope reading together could help bridge the gap.", "ingested_utc": "2025-08-19T11:30:25Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:26Z", "source": "Engadget_All", "title": "The Morning After: What to expect at Google’s Pixel 10 event tomorrow", "url": "https://www.engadget.com/general/the-morning-after-engadget-newsletter-111518622.html?src=rss", "id_key": "3d8465d697c555d0f70f91a369a18b0139905e1d6e19e8addf8eccac5ce7c772", "summary": "After focusing its big Google I/O 2025 on AI tech and Gemini’s latest features, Google has new hardware. The next Made by Google event kicks off tomorrow, and Google has already confirmed how at least one of its new phones will look . Google Expect a little more fanfare than usual. The company dropped a video on X, teasing “special guests,” including Jimmy Fallon, Stephen Curry, Lando Norris and the Jonas Brothers. Surely, they’ll make you buy a Pixel! Leaks suggest Google is giving all of its Pixel 10 phones telephoto cameras in 2025, though it’s still possible the phone teased earlier is a Pixel 10 Pro. We’re expecting to see four phones in total: Pixel 10, 10 Pro, 10 Pro XL and 10 Pro Fold. Then, if you can maintain focus, there’s likely to be a new Pixel Watch with smaller bezels and a brighter screen, and maybe even new entry-level Pixel buds. The Pixel 10 launch event kicks off on August 20, tomorrow, at 1PM ET / 10AM PT. We’ll be reporting live from the event. Here's a full breakdown of what we're expecting to see . — Mat Smith Get Engadget's newsletter delivered direct to your inbox. Subscribe right here! The news you might have missed Trump’s administration may look to buy a stake in Intel China’s inaugural Robot Olympics delivers impressive feats and disastrous falls Pixel 9 Pro Fold one year later: How Google caught up to Samsung in just two generations Why on earth would NASA build a nuclear reactor on the Moon? It’s not as crazy as it sounds. REUTERS / Reuters NASA is considering a small nuclear reactor for the Moon, to power a possibly permanent lunar presence. Other power sources have their drawbacks: Solar power is limited by the long two-week lunar nights and sunless craters, making nuclear energy a more reliable and constant power source. A nuclear reactor would also provide a significant amount of energy from a small mass, which is crucial for space travel. Challenges remain, including the system’s weight, recent cuts at NASA and the lack of a US company to produce the microreactor itself. Continue reading. Can-Am’s first electric ATV can haul more than its gas models It offers 50 miles of range, 47 hp and ‘whisper-quiet operation.’ Can-Am Can-Am, part of the motorsports group BRP that recently introduced electric snowmobiles , has just launched its first electric all-terrain vehicle (ATV). The Outlander Electric is designed to be “whisper quiet” for tasks like herding or hunting, but it can still tow more than its gas-powered counterparts, thanks to the high level of torque. The 8.9 kWh battery will offer around 50 miles (80km) of range, which is half that of a gasoline ATV, depending on the model. The Can-Am Outlander Electric ATV is now available from dealers and Can-Am’s website, starting at $12,999. Continue reading. How to use (or turn off) your Instagram Map The new feature shares your location with friends on a searchable map. Instagram Map, a new Instagram feature copying Snapchat's Snap Map, makes it simple to share your location with friends. So simple you might not even realize who you’re sharing it with, unless you dig into your settings. We lay out how it works — and how to stop sharing your location. Continue reading. This article originally appeared on Engadget at https://www.engadget.com/general/the-morning-after-engadget-newsletter-111518622.html?src=rss", "ingested_utc": "2025-08-19T11:30:26Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:26Z", "source": "Engadget_All", "title": "The UK will no longer require Apple to create backdoor access to users' data", "url": "https://www.engadget.com/big-tech/the-uk-will-no-longer-require-apple-to-create-backdoor-access-to-users-data-110014398.html?src=rss", "id_key": "20a4579932c2799ecee8f679b4595161192b071a8b73fc83cd4dccd3724438f4", "summary": "UK officials will no longer compel Apple to create backdoor access to its users' data, according to US Director of National Intelligence Tulsi Gabbard. She wrote on X that she, President Trump and Vice President Vance worked closely with their \"partners in the UK\" over the past months. \"As a result,\" she continued, \"the UK has agreed to drop its mandate for Apple to provide a 'back door' that would have enabled access to the protected encrypted data of American citizens and encroached on our civil liberties.\" Over the past few months, I’ve been working closely with our partners in the UK, alongside @POTUS and @VP , to ensure Americans' private data remains private and our Constitutional rights and civil liberties are protected. As a result, the UK has agreed to drop its mandate for… — DNI Tulsi Gabbard (@DNIGabbard) August 19, 2025 As The New York Times notes, the UK government issued the secret order earlier this year after amending the Investigatory Powers Act of 2016. The law gives the UK government the right to compel companies to turn over data to law enforcement and intelligence agencies. Reports about the mandate started to come out in February, however, and Apple pretty much confirmed it when it disabled iCloud's Advanced Data Protection feature in the UK. ADP gives users the power to to add optional end-to-end encryption to a variety of iCloud data, which means the information can't be accessed by authorities unless they have the user's device in their hands. \"As we have said many times before, we have never built a backdoor or master key to any of our products or services and we never will,\" Apple said at the time. A bipartisan group of US lawmakers asked Gabbard to take measures to prevent what they called \"a foreign cyberattack waged through political means\" after the information about the mandate went public. Meanwhile, Apple filed a complained with the Investigatory Powers Tribunal (IPT), which \"investigates complaints about the alleged conduct of public bodies in relation to members of the public,\" to get the order reversed. The company has yet to issue an official statement about the reversal of the UK mandate. This article originally appeared on Engadget at https://www.engadget.com/big-tech/the-uk-will-no-longer-require-apple-to-create-backdoor-access-to-users-data-110014398.html?src=rss", "ingested_utc": "2025-08-19T11:30:26Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:35Z", "source": "TheStreet_Top", "title": "Michael Kors Outlet is selling a $228 crossbody bag for $65, and it's 'perfect for all occasions'", "url": "https://www.thestreet.com/deals/mercer-extra-small-pebbled-leather-crossbody-bag-michael-kors-outlet-sale", "id_key": "162a6c78e02595c4b3706e06e78074533c5babac048e5a98b3706cf34e8a5ed4", "summary": "\"This is a beautiful little bag. It's so well-made and stylish.\"", "ingested_utc": "2025-08-19T11:30:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:42Z", "source": "FinancialPost_Business", "title": "Intel’s CEO Draws Support for Revival From SoftBank, Trump", "url": "https://financialpost.com/pmn/business-pmn/intels-ceo-draws-support-for-revival-from-softbank-trump", "id_key": "1f01729f61edfc8faae81a1a762e7aa74414449e9cc0c737c47dd5b575a6d75f", "summary": "Less than two weeks after President Donald Trump called for the ouster of Intel Corp.’s Lip-Bu Tan, the company’s chief executive officer has a shot at securing billions of dollars in fresh capital that could help him turn around the troubled US chipmaker.", "ingested_utc": "2025-08-19T11:30:42Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:42Z", "source": "FinancialPost_Business", "title": "Trigon Defines Key Exploration Targets on Its Kalahari Copper Project, Namibia", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/trigon-defines-key-exploration-targets-on-its-kalahari-copper-project-namibia", "id_key": "87205e10b387c1f0762d0633776f62e57203ff5b8a938e5fec6290795892ad1b", "summary": "TORONTO — Trigon Metals Inc. (TSX-V: TM, OTCPK: PNTZF) (“Trigon” or the “Company”) is pleased to announce the successful completion of a drone-based aeromagnetic survey over a key area of its Kalahari Copper Project. The Company has also finalized the data processing and 3D inversion, enabling interpretation and the definition of highly prospective exploration targets […]", "ingested_utc": "2025-08-19T11:30:42Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:42Z", "source": "FinancialPost_Business", "title": "Strategic Storage Growth Trust III, Inc. Reports Second Quarter 2025 Highlights", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/strategic-storage-growth-trust-iii-inc-reports-second-quarter-2025-highlights", "id_key": "63515c42d2006a8383a6dbe495afa738c8e816b591da1c7ee113b3330680f76c", "summary": "LADERA RANCH, Calif. — Strategic Storage Growth Trust III, Inc. (“SSGT III”) announced highlights for the three months ended June 30, 2025. “The second quarter was highlighted by continued lease up of our non-stabilized portfolio and the acquisition of two premier self-storage facilities,” commented H. Michael Schwartz, President, Chief Executive Officer and Chairman of the […]", "ingested_utc": "2025-08-19T11:30:42Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:42Z", "source": "FinancialPost_Business", "title": "World’s Largest Bitcoin Domain Portfolio Up for Grabs", "url": "https://financialpost.com/globe-newswire/worlds-largest-bitcoin-domain-portfolio-up-for-grabs", "id_key": "93840773dc1730c9a08e0ee2a98dedec97e37766f143764090e61fe145483a08", "summary": "XBT.com sells for $3M, now Lloyds brings 280+ bitcoin domains to market in one of the most significant domain auctions in crypto history with buyers already lining up. LAS VEGAS, Aug. 19, 2025 (GLOBE NEWSWIRE) — Lloyds Auctions, the auction house behind the recent record-breaking sale of the ultra-premium domain XBT.com, has now launched what […]", "ingested_utc": "2025-08-19T11:30:42Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:42Z", "source": "FinancialPost_Business", "title": "Apollo Silver Congratulates Equinox Gold on FAST-41 Permitting", "url": "https://financialpost.com/globe-newswire/apollo-silver-congratulates-equinox-gold-on-fast-41-permitting", "id_key": "4bea611f352e7eed91774f439d1c32f468ddf3086cb17a7931fe9119f7992758", "summary": "VANCOUVER, British Columbia, Aug. 19, 2025 (GLOBE NEWSWIRE) — Apollo Silver Corp. (“Apollo” or the “Company”) (TSX.V:APGO, OTCQB:APGOF, Frankfurt:6ZF0) congratulates Equinox Gold Corp. (TSX: EQX) (NYSE American: EQX) on the recent acceptance of its Castle Mountain Project into the United States’ FAST-41 program, which is designed to streamline and derisk the permitting process. Castle Mountain […]", "ingested_utc": "2025-08-19T11:30:42Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T11:30:42Z", "source": "FinancialPost_Business", "title": "OTC Markets Group Welcomes Southern Cross Gold Consolidated Ltd. to OTCQX", "url": "https://financialpost.com/globe-newswire/otc-markets-group-welcomes-southern-cross-gold-consolidated-ltd-to-otcqx", "id_key": "ccd4325cdc189faf309e12d90eb39bea18bf99a359a255a80726e4800eb1a2e6", "summary": "NEW YORK, Aug. 19, 2025 (GLOBE NEWSWIRE) — OTC Markets Group Inc. (OTCQX: OTCM), operator of regulated markets for trading 12,000 U.S. and international securities, today announced Southern Cross Gold Consolidated Ltd. (TSX: SXGC; ASX: SX2; OTCQX: SXGCF), a company engaged in the acquisition and exploration of mineral properties in Australia, has qualified to trade […]", "ingested_utc": "2025-08-19T11:30:42Z"}
