{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:43Z", "source": "BBC_World", "title": "If a Putin-Zelensky summit takes place, where could it be?", "url": "https://www.bbc.com/news/articles/cedvexq7z8zo?at_medium=RSS&at_campaign=rss", "id_key": "c032afaae7ec1021525f3690ff1c0ede78e518484c46c452bfadc0b9cdd26195", "summary": "Geneva, Istanbul and Budapest have been put forward as potential locations - but bilateral talks still remain a long way off.", "ingested_utc": "2025-08-21T17:52:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:45Z", "source": "BBC_Technology", "title": "French streamer's death 'not due to trauma', autopsy finds", "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss", "id_key": "df2a0f3f9407481f1d525cde5ba738ffc6884329c50fee7ac51c66ad10e8c70c", "summary": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.", "ingested_utc": "2025-08-21T17:52:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_Business", "title": "Trump officials urge Fed to remove governor after she refuses to quit", "url": "https://www.theguardian.com/business/2025/aug/21/trump-federal-reserve-governor-lisa-cook", "id_key": "d2e9803d4a7dd3018cbfb48948dea1fabe4a2e42b478a80bf77b6253b4ee7644", "summary": "Federal Reserve governor Lisa Cook is latest figure targeted by Trump administration over claims of mortgage fraud The Trump administration is ratcheting up pressure on the Federal Reserve to remove governor Lisa Cook, after the economist declared she had “ no intention of being bullied ” into stepping down. Cook, who was appointed to the US central bank’s powerful board of governors by Joe Biden, has been accused by Donald Trump’s officials of committing mortgage fraud. The allegations are unconfirmed. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_Business", "title": "Passengers sue Delta and United over window seats that have no windows", "url": "https://www.theguardian.com/us-news/2025/aug/21/delta-united-lawsuit-windowless-seats", "id_key": "e05801a8bbadf0dfdf8c0f083723b22fb515227cadad2aa1d9034a88ac6d6e27", "summary": "Lawsuit claims that plaintiffs bought tickets for plane seats next to windows that instead were next to windowless walls Delta Air Lines and United Airlines are being sued by a group of passengers who claim they paid extra money to sit in “window” seats which were not actually next to windows. Proposed class actions were filed against United in San Francisco federal court and against Delta in Brooklyn , New York, federal court, seeking millions of dollars in damages for more than 1 million passengers at each airline. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "Russia orders state-backed Max messenger app to be pre-installed on new phones", "url": "https://www.theguardian.com/technology/2025/aug/21/russia-max-app-phones", "id_key": "f6ebead49d026ab38a0b54f8d1dd5270bff6c083e8038691895f01a28f855254", "summary": "Critics say Max, a WhatsApp rival, could be used to track users, though state media says it is not a spying app A Russian state-backed messenger application called Max, a rival to WhatsApp that critics say could be used to track users, must be pre-installed on all mobile phones and tablets bought in the country starting next month, the Russian government said on Thursday. The decision to promote Max comes as Moscow, locked in a standoff with the west over Ukraine, is seeking greater control over the internet. The Kremlin said in a statement that Max, which will be integrated with government services, would be on a list of mandatory pre-installed apps on all “gadgets”, including mobile phones and tablets, sold in Russia from 1 September. The firm behind Max said this week that 18 million users had downloaded its app, parts of which are still in a testing phase. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "German contest to live in depopulated Soviet-era city proves global hit", "url": "https://www.theguardian.com/world/2025/aug/21/german-contest-to-live-in-depopulated-soviet-era-city-proves-global-hit", "id_key": "072c1d42649679f83ee7fa98777f6b29790a0a633909d4dd5c0d6d4a225d440e", "summary": "Eisenhüttenstadt offered spacious central flats rent-free for two weeks in effort to attract valuable professionals An innovative contest by a city in formerly communist east Germany to curb depopulation by offering a fortnight of free housing has stunned local officials with its success. The competition drew more than 1,700 applications from around the world to try living in Eisenhüttenstadt , a Soviet-style planned city on the Polish border, near Berlin, which was built around a steel plant in the aftermath of the second world war. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "Nato leaders must ‘not be naive’ about any potential Ukraine deployment, says head of German soldiers’ union – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/21/us-minimal-security-guarantees-ukraine-russia-diplomacy-europe-latest-updates-news", "id_key": "7e7c8b478c51d852286c15078d602b53cc7ecc3d5bb69633b591925ccb0441d4", "summary": "This live blog is now closed, you can read more on this story here We have just heard from the European Commission, confirming that the EU and the US have now agreed on the much-awaited “joint statement” advancing the political commitments on trade agreed by Ursula von der Leyen and Donald Trump in Scotland last month. The commission’s press release says the statement “lays out in detail the new US tariff regime towards the EU, with a clear maximum, all-inclusive, tariff rate of 15% for the vast majority of EU exports , including strategic sectors such as cars , pharmaceuticals , semiconductors and lumber .” Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "UN and Red Cross warn of catastrophe if Israel launches Gaza City offensive", "url": "https://www.theguardian.com/world/2025/aug/21/gaza-city-offensive-would-be-death-sentence-for-israeli-hostages-say-relatives", "id_key": "4786b465433e8ce6b86df5169d410a6754c4cf101dfa67d2a93fc8b88c934d73", "summary": "Israeli military tell aid groups to prepare for forced displacement as hostages’ relatives criticise the plan The International Red Cross and UN have warned of an impending catastrophe in the Gaza Strip if Israel launches an offensive to take over Gaza City, as the Israeli military told medical and aid groups in the Palestinian territory to prepare for imminent forced displacement. As a concerted campaign of international opposition to Israel’s defiance of ceasefire calls and over its approval of a huge new illegal settlement construction in the occupied West Bank gathered pace, the UK summoned Israel’s ambassador and joined 20 other countries in condemning the settlement plan as a “violation of international law”. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "Remnants of 2,000-year-old sunken city lifted out of the sea off Alexandria", "url": "https://www.theguardian.com/world/2025/aug/21/egypt-retrieves-parts-of-2000-year-old-sunken-city-canopus-off-coast-of-alexandria", "id_key": "78e3bb117b2acfb11c0c43fb2d2e07a8172e61fc64d3634812982c6a64b18427", "summary": "Cranes hoisted statues from depths of submerged site that authorities say may be extension of ancient city of Canopus Egypt has unveiled parts of a sunken city submerged beneath waters off the coast of Alexandria, including buildings, artefacts and an ancient dock that date back more than 2,000 years. Egyptian authorities said the site, located in the waters of Abu Qir bay, may be an extension of the ancient city of Canopus, a prominent centre during the Ptolemaic dynasty, which ruled Egypt for nearly 300 years, and the Roman empire, which governed for about 600 years. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "Israel keeps up military pressure on Gaza City ahead of planned offensive – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/21/israel-gaza-city-middle-east-palestinians-latest-live-news-updates", "id_key": "18826a99d4d31fb3e6b1f305161ac56290a26b41383ef66f76ba0e36be992b9a", "summary": "This blog is now closed, you can read more on this story here Iran was seeking to reassert an image of strength on Thursday after suffering heavy losses, when Israel largely destroyed Iran’s air defences during the war and much of its stockpile of ballistic weapons is believed to have been damaged by Israeli strikes. The Iranian Defence Ministry said in a statement on Thursday: “Any new adventure by the enemy will be faced with a strong slap.” Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "C of E offers ‘unreserved’ apology as ex-priest found guilty of indecent assault", "url": "https://www.theguardian.com/uk-news/2025/aug/21/church-of-england-apology-priest-christopher-brain", "id_key": "9054e6994c8012e2c95ee4322dd21e306b9e268a95650e4d3e39aab96fd6e2df", "summary": "Chris Brain was found guilty on 17 charges of assault against women who attended Nine O’Clock Service in Sheffield The Church of England has apologised unreservedly for its failings over a former priest who has been convicted of indecently assaulting young women who attended a groundbreaking evangelical church featuring rock music and rave culture. Christopher Brain was found guilty on 17 charges of indecent assault against women who attended the Nine O’Clock Service in Sheffield between 1986 and 1995 after a trial that lasted more than seven weeks. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "Diane Abbott: I advised Jeremy Corbyn not to start new party", "url": "https://www.theguardian.com/politics/2025/aug/21/diane-abbott-jeremy-corbyn-new-party", "id_key": "06146855e713937d537e66f67dbc844172862d0084c3e9a3d013f73d4d90b623", "summary": "MP predicts struggle under first past the post but understands why her longtime friend established party Diane Abbott has said she advised her longtime friend Jeremy Corbyn not to launch a new political party because she believed it would struggle to make inroads under the first-past-the-post system. Abbott, the MP for Hackney North and Stoke Newington, said last month she would not be leaving Labour in favour of Corbyn’s as yet unnamed party, despite the pair having worked closely together in the past. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "Pentagon asks civilian employees to join ‘volunteer force’ to aid Ice deportations", "url": "https://www.theguardian.com/us-news/2025/aug/21/trump-hegseth-pentagon-ice", "id_key": "912337e72d21ac34a819f14abefc1eefd5d311944f7d7b9292452bfa05607d1b", "summary": "Selected employees will join Trump’s mass deportation campaign and ‘offer critical support’ to Ice operations The Pentagon is recruiting civilian employees to join Donald Trump’s mass deportation campaign and asking staff to sign up for deployments to immigration enforcement facilities across the United States. The defense department has posted a job listing requesting volunteers for civilian federal employees apply to join a “volunteer force” supporting Immigration and Customs Enforcement (Ice) and Customs and Border Protection (CBP) operations. On Wednesday, the department reportedly emailed civilian employees asking them to take up this opportunity. Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:52:46Z", "source": "Guardian_World", "title": "Majority of college students say they will be affected by Trump’s new tax bill: ‘Honestly, I’m cooked’", "url": "https://www.theguardian.com/us-news/2025/aug/21/college-students-trump-bill", "id_key": "d5da8046651cfbc0f7073910329d8c36e583576a585a5defad8af25cbcba6b49", "summary": "Survey shows 60% of students say they would personally feel impact of bill that sets new caps on borrowing With Donald Trump ’s “big, beautiful bill” set to alter how families and students finance higher education starting in July 2026, a new survey suggests the majority of college students expect to be affected by the bill. A US News & World Report surveyed nearly 1,200 college students, with most responders saying the changes will affect them. When asked about the law’s broader effects, 61% of students said they would personally feel its impact, while 20% said they would not and 19% responded “I don’t know.” Continue reading...", "ingested_utc": "2025-08-21T17:52:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:53:02Z", "source": "Blockworks", "title": "Kraken completes full DVT integration for Ethereum staking using SSV", "url": "https://blockworks.co/news/kraken-full-dvt-integration-ethereum-staking", "id_key": "29a9b68728ce1ae5464df7fda6424f3a44923983821bd579f6fd7c5601cfb698", "summary": "Exchange says “essentially all” validators now run in distributed clusters, boosting decentralization and fault tolerance", "ingested_utc": "2025-08-21T17:53:02Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:53:04Z", "source": "BitcoinMagazine", "title": "Bitcoin Price Falls — And As Usual, Nobody Knows Why", "url": "https://bitcoinmagazine.com/markets/bitcoin-price-falls-nobody-knows-why", "id_key": "c369b141661417b29cec52eb64b94ac1e564ff1fdfb5b1643f854bdb5c58a584", "summary": "Bitcoin Magazine Bitcoin Price Falls — And As Usual, Nobody Knows Why The weekly bitcoin price overview from your glorified price therapist, I’m here to remind you again that market prices move for reasons nobody can point to. Whatever bitcoin's price does means absolutely nothing for the broader reasons why we’re here. This post Bitcoin Price Falls — And As Usual, Nobody Knows Why first appeared on Bitcoin Magazine and is written by Joakim Book .", "ingested_utc": "2025-08-21T17:53:04Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:53:11Z", "source": "CoinJournal", "title": "Coinbase to list World Liberty’s USD1 stablecoin", "url": "https://coinjournal.net/news/coinbase-to-list-world-libertys-usd1-stablecoin/", "id_key": "4b0d48dcd7686e56d808019de2af2edff7dbe6d61d8e3c6b5944c9393a07be6d", "summary": "World Liberty Financial (WLFI) minted $205M USD1, lifting supply to $2.4B after Waller’s speech. Coinbase has added USD1 to its roadmap, signalling a possible full listing. USD1 adoption is growing steadily, with Abu Dhabi backing and Binance settlements. World Liberty Financial has minted $205 million worth of its USD1 stablecoin shortly after a speech by […] The post Coinbase to list World Liberty’s USD1 stablecoin appeared first on CoinJournal .", "ingested_utc": "2025-08-21T17:53:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:53:27Z", "source": "CoinMetrics_Blog", "title": "SOTM August 14-20, 2025", "url": "https://coinmetrics.io/state-of-the-market/sotm-august-14-20-2025/", "id_key": "224111ee07bdf8e7ab298807c5dde7f7f28f042eac0a922861ca396347c6c39f", "summary": "Bitcoin and Altcoins Retreat | Bullish Completes $1.15B IPO | MetaMask Introduces mUSD | China Considers Launch of Yuan-Backed Stablecoins | Dinari Launches Dinari Financial Network The post SOTM August 14-20, 2025 appeared first on Coin Metrics .", "ingested_utc": "2025-08-21T17:53:27Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:06Z", "source": "NYTimes_World", "title": "Sonallah Ibrahim, Egyptian Novelist of Irony and Dissent, Dies at 88", "url": "https://www.nytimes.com/2025/08/21/world/africa/sonallah-ibrahim-dead.html", "id_key": "904705d5d2062ad1f549c9a3f150a4d0879a3c99b4c73b88b39fb1a93fe5fb22", "summary": "Starting with “That Smell” in 1966, he wrote with stark power about themes of repression in the Egyptian police state.", "ingested_utc": "2025-08-21T17:55:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:14Z", "source": "NPR_Top", "title": "An appeals court throws out a massive civil fraud penalty against President Trump", "url": "https://www.npr.org/2025/08/21/g-s1-84246/civil-fraud-penalty-president-trump-appeal", "id_key": "7a81e59f400bc718e32ac22f4a6b69165587d370f11bdb2df599bb134e28cde4", "summary": "Trump, in a social media post, claimed \"total victory\" after the ruling, which spares him from a potential half-billion-dollar fine for decades of exaggerating his wealth.", "ingested_utc": "2025-08-21T17:55:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:14Z", "source": "NPR_Top", "title": "Hurricane Erin brings flooding to parts of Outer Banks as it pivots from East Coast", "url": "https://www.npr.org/2025/08/21/nx-s1-5509661/hurricane-erin-outer-banks-north-carolina-east-coast", "id_key": "6f3abe2e951557e03621d4aa7680489f9d4885f9eb20e64b9a46ce974af55dfb", "summary": "The storm flooded parts of North Carolina's Outer Banks, including a section of the main highway. It's now turning away from the East Coast, but dangerous surf and rip currents are likely from Florida to Maine.", "ingested_utc": "2025-08-21T17:55:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:14Z", "source": "NPR_Top", "title": "Walmart says tariff costs are rising 'each week' and will continue", "url": "https://www.npr.org/2025/08/21/nx-s1-5509592/walmart-tariff-costs-rising-earnings", "id_key": "3b54263eaad7f7930043efdf6e1adfe6a483642ecfaa451e3d963d594e6cd667", "summary": "The world's largest retailer — like many others — has been absorbing most of the increased costs, but raising prices of some goods.", "ingested_utc": "2025-08-21T17:55:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:14Z", "source": "NPR_Top", "title": "Russian airstrikes hit a U.S. factory in western Ukraine", "url": "https://www.npr.org/2025/08/21/g-s1-84146/russia-ukraine-american-factory", "id_key": "f74c670b0556c5ba4ee69cf79a1cb6fb71223cb3dfe43ed32a6c745645eeee23", "summary": "Two Russian cruise missiles hit a U.S. electronics plant in the far west of Ukraine. The strike was part of an overnight barrage of more than 600 drones and missiles.", "ingested_utc": "2025-08-21T17:55:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:18Z", "source": "FT_Home", "title": "Can a council revolt over UK asylum hotels succeed?", "url": "https://www.ft.com/content/11c96718-3ec5-4a27-bdcf-5c8b64ec01b1", "id_key": "33d5e70c899686607a239cb19323e31b8af938ea1108c14902cc36a36dc96b38", "summary": "Lawyers have diverging views on what bearing the Epping ruling will have on authorities considering similar actions", "ingested_utc": "2025-08-21T17:55:18Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:18Z", "source": "FT_Home", "title": "Wes Streeting issues private ultimatum to pharma groups in NHS pricing talks", "url": "https://www.ft.com/content/85d15efe-e802-497a-a995-87ca7fdcbe7b", "id_key": "0b931af5ad13e45d929544227e4d0e3b461db4f9f41a7d48acc7821b59994769", "summary": "UK health secretary has warned sector he will publicly walk away from negotiations if his offer is not accepted", "ingested_utc": "2025-08-21T17:55:18Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:34Z", "source": "TheVerge_All", "title": "Microsoft’s Xbox handheld is a good first step towards a Windows gaming OS", "url": "https://www.theverge.com/notepad-microsoft-newsletter/763357/microsoft-asus-xbox-ally-handheld-hands-on-notepad", "id_key": "c23120e5d7b348256ec85708eeb4c5052b5e7c4ab16e53b45ccc5ebecb5d1658", "summary": "The first thing I did when I got my hands on the Xbox Ally was reboot it. I wanted to see exactly how Microsoft manages to hide Windows beneath the Xbox interface that's debuting on these handheld devices. After a short startup, I was met with the standard Windows login prompt. But I could use […]", "ingested_utc": "2025-08-21T17:55:34Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:34Z", "source": "TheVerge_All", "title": "YouTube Music turns 10 and adds new &#8216;taste match&#8217; playlists", "url": "https://www.theverge.com/news/763611/youtube-music-taste-match-10-anniversary", "id_key": "e4c1e57adb8df557333b72e62a794f87aed819c499d4b370f364fc6715d1dcbf", "summary": "YouTube Music is launching shared playlists that evolve based on the listening habits of the people who join them. The platform announced the new “taste match” playlists as part of its 10th anniversary on Thursday, and says it will refresh them with new music every day. It sounds similar to Spotify Blend, which lets you […]", "ingested_utc": "2025-08-21T17:55:34Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:34Z", "source": "TheVerge_All", "title": "LG’s massive 77-inch C5 OLED TV is more than $1,000 off", "url": "https://www.theverge.com/tech/763418/lg-c5-oled-tv-sony-wh-1000xm5-deal-sale", "id_key": "507eb473cabe497a7d2cd6d0429e956bef32063a18938e24863b92d3a1dd98da", "summary": "If you want to spend the rest of the year catching up on the movies, TV shows, and video games you missed over the summer, you should enjoy them on a really nice screen. Thankfully, you can get a 77-inch LG C5 OLED TV for around $2,496.99 ($1,203 off), its lowest price ever at Amazon, […]", "ingested_utc": "2025-08-21T17:55:34Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:34Z", "source": "TheVerge_All", "title": "Tesla is dragging its feet in reporting FSD and Autopilot crashes to the government", "url": "https://www.theverge.com/tesla/763603/tesla-autopilot-fsd-crash-report-delay-nhtsa", "id_key": "84eefaa368c251668b6d001b9469ebd8cff8b2f9a801dcd601ec8cd5d984f269", "summary": "Tesla is under investigation for failing to report crashes involving its partially autonomous driving technology in a timely manner. The National Highway Traffic Safety Administration requires automakers to report crashes involving advanced driver assist features “within one or five days” of the incident, but Tesla was reporting crashes “several months or more” after they occurred, […]", "ingested_utc": "2025-08-21T17:55:34Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:35Z", "source": "TechCrunch_All", "title": "Apple TV+ price jumps 30% to $12.99 monthly", "url": "https://techcrunch.com/2025/08/21/apple-tv-price-jumps-30-to-12-99-monthly/", "id_key": "2577d0093d86a36853a55ca6c01613fe8c16e1083de4be3e39d0290b3887929d", "summary": "The updated price is effective for new customers starting Thursday and will affect current subscribers 30 days after their next renewal date.", "ingested_utc": "2025-08-21T17:55:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:35Z", "source": "TechCrunch_All", "title": "Instagram now lets creators link multiple reels in a series", "url": "https://techcrunch.com/2025/08/21/instagram-now-lets-creators-link-multiple-reels-in-a-series/", "id_key": "27f835c7d9882bee0086c9f78342c2b6c6a1fa25d9dd2d43c3c309bb4cb4bfc2", "summary": "Now if a creator is telling a story in a series of videos and follow-ups, they can now link them all together so that viewers don't have to scroll or search for different parts.", "ingested_utc": "2025-08-21T17:55:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:35Z", "source": "ArsTechnica_All", "title": "Explaining the Internet’s obsession with Silksong, which (finally) comes out Sept. 4", "url": "https://arstechnica.com/gaming/2025/08/explaining-the-internets-obsession-with-silksong-which-finally-comes-out-sept-4/", "id_key": "a70a8d5da00bb5978a5998babaca19db76b94c792e6ca62ece4e21dafd157597", "summary": "Hollow Knight fans found strange ways to cope with impatience and anticipation.", "ingested_utc": "2025-08-21T17:55:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:35Z", "source": "ArsTechnica_All", "title": "Starlink wants billions in grants, but state governments aren’t cooperating", "url": "https://arstechnica.com/tech-policy/2025/08/starlink-wants-billions-in-grants-but-state-governments-arent-cooperating/", "id_key": "139aca93f575b4b20b8b7dd0ac70bda2f36a209f7f39e3c3d070a109a9c09327", "summary": "Despite Trump's backing, states aren't giving Starlink the money it demanded.", "ingested_utc": "2025-08-21T17:55:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:38Z", "source": "Engadget_All", "title": "Stalker 2: Heart of Chornobyl is coming to PS5 on November 20", "url": "https://www.engadget.com/gaming/playstation/stalker-2-heart-of-chornobyl-is-coming-to-ps5-on-november-20-162656051.html?src=rss", "id_key": "2ae669b99b3b7c8e8aaab3bbc5a0bb143adaf218132bbc057559f6c2556acaa0", "summary": "We learned in July that Stalker 2: Heart of Chornobyl would come to PlayStation later this year. On Thursday, developer GSC Gameworld gave us a specific release date: November 20. That's exactly a year after its PC and Xbox launch . The PS5 version will support adaptive triggers, haptic feedback, gyro aiming and more. Meanwhile, PS5 Pro users will see upgraded resolution, shadows and reflections (among other enhancements). The game will be available in a $60 standard edition, an $80 deluxe one and a $110 ultimate edition. GSC Gameworld The game had quite a development process: It lasted 14 years . (Amusingly, \" Stalker 2 sneaking up on a 2012 launch\" was our first headline about the game.) GSC Gameworld was plagued by funding issues, a near shutdown and a transition to a new game engine. Then, Russia threw another wrench in the Ukrainian studio's plans, with its 2022 invasion. Sadly, the company even lost a team member in the war. When the game finally launched in 2024, it still had plenty of bugs. However, the team has worked hard to patch those ever since. Hopefully, the PlayStation version will benefit from the extra clean-up time and offer a polished experience from day one. You can pre-order Stalker 2: Heart of Chornobyl today from the PlayStation Store . This article originally appeared on Engadget at https://www.engadget.com/gaming/playstation/stalker-2-heart-of-chornobyl-is-coming-to-ps5-on-november-20-162656051.html?src=rss", "ingested_utc": "2025-08-21T17:55:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:38Z", "source": "Engadget_All", "title": "Google AI Mode is expanding to 180 countries and adding an agentic restaurant finder", "url": "https://www.engadget.com/ai/google-ai-mode-is-expanding-to-180-countries-and-adding-an-agentic-restaurant-finder-154833417.html?src=rss", "id_key": "870afaa6ee9cb35674e991c8a80f639ec64d675e3f74b784a9b4f8407a9c6c90", "summary": "Google’s seemingly unrelenting quest to infuse AI into every aspect of your online life just got a lot more global in scope, with the company expanding its AI Mode in Search to over 180 new countries . AI Mode has previously only been available in the US, India and the UK, and while English remains the only supported language right now, Google says it’ll add more soon. Google is also expanding its AI Mode’s agentic capabilities, so you can now use natural language to find restaurant reservations. Google says you can ask about getting a dinner reservation with conditions such as group size, date, location and your preference of cuisine, all of which be taken into consideration when AI Mode pulls in its results from across the web. Suggestions will be presented in list form with the available reservation slots. It’ll also provide a link to the booking page you need. Google also plans to add local service appointments and event ticketing capabilities soon, with Ticketmaster and StubHub among its partners. AI Mode leverages Google’s web-browsing AI agent Project Mariner' its direct partners on Search and resources like Knowledge Graph and Google Maps when prompted to find you somewhere to eat. It has partnered with the likes of OpenTable, Resy and Tock to incorporate as many restaurants as possible and streamline the booking process. Right now, this feature is exclusive to those subscribed to the wildly expensive Google AI Ultra plan in the US, and can be accessed through its Labs platform. If you opt into the AI Mode experiment it can also remember your previous conversations and searches to give you results that more closely match your preferences. Finally, if your AI-powered conversations are simply too interesting to keep to yourself, Google will now let you bring others in when you tap the \"Share\" button on a response. This allows your chosen contact to join the conversation at that point and ask their own follow-up questions. Google uses planning trips or parties as examples of when you might want to collaborate with someone else on an AI-assisted task. The original sender can delete shared links whenever they like. This article originally appeared on Engadget at https://www.engadget.com/ai/google-ai-mode-is-expanding-to-180-countries-and-adding-an-agentic-restaurant-finder-154833417.html?src=rss", "ingested_utc": "2025-08-21T17:55:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:46Z", "source": "TheStreet_Top", "title": "Amazon is selling wireless earbuds for just $22, and shoppers say 'the battery life is incredible'", "url": "https://www.thestreet.com/deals/jgug-t12-wireless-earbuds-amazon-sale", "id_key": "7b2443bbc212f9ab001d594d756b273b95f12c965b0b3dc76790026a4b5794bf", "summary": "\"These are great earbuds at a great price.\"", "ingested_utc": "2025-08-21T17:55:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:46Z", "source": "TheStreet_Top", "title": "Home Depot and Lowe’s sound the alarm for homeowners", "url": "https://www.thestreet.com/retail/home-depot-lowes-quietly-raising-prices-due-to-tariffs", "id_key": "149e3613c9e5bb4fd914b3a44602e38798f4e13a38403f9ee7f9fb56775ab1c4", "summary": "Both home improvement companies have been reluctant to admit that some prices have already increased, and others will go up.", "ingested_utc": "2025-08-21T17:55:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:47Z", "source": "AlJazeera_All", "title": "What’s behind Israel’s ground push into Gaza City?", "url": "https://www.aljazeera.com/video/the-take-2/2025/8/21/whats-behind-israels-ground-push-into-gaza-city?traffic_source=rss", "id_key": "6ef1c38697f37c004b3159c45e5fbc803fcb5fdc8d5a55c86ad8cf419b1a7145", "summary": "Israel pushes into Gaza City as Hamas accepts a ceasefire. What does this reveal about Israel’s broader Gaza plan?", "ingested_utc": "2025-08-21T17:55:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:47Z", "source": "AlJazeera_All", "title": "What does Russia’s war in Ukraine look like today?", "url": "https://www.aljazeera.com/video/by-the-numbers-3/2025/8/21/what-does-russias-war-in-ukraine-look-like-today?traffic_source=rss", "id_key": "99247c25aa5745409bef40ff10bf33450c660030be183a05d121f6a8fa50f7da", "summary": "Three years into the invasion, Russia holds nearly a fifth of Ukraine. Could peace come at the cost of territory?", "ingested_utc": "2025-08-21T17:55:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:47Z", "source": "AlJazeera_All", "title": "What happens in Gaza is “an issue for every business, everywhere”", "url": "https://www.aljazeera.com/video/quotable/2025/8/21/what-happens-in-gaza-is-an-issue-for-every-business?traffic_source=rss", "id_key": "a642f9425a345a9da0fd80949b435e7b967522bee0ab601fa1671fbbfde48e10", "summary": "Adam Garfunkel on why businesses in the UK should cut ties with Israel-linked companies and uphold international law.", "ingested_utc": "2025-08-21T17:55:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:47Z", "source": "AlJazeera_All", "title": "Analysis: Israel E1 settlement plan makes Palestinian state further away", "url": "https://www.aljazeera.com/news/2025/8/21/israel-settlement-plan-threatens-viability-of-future-palestinian-state?traffic_source=rss", "id_key": "83f83d3cf29c3bbd53d76a5971e96f9602c816daea05bd944c9d7361c3fd9b26", "summary": "Analysts warn E1 plan will fragment Palestinian lands, undermining the viability of a future Palestinian state.", "ingested_utc": "2025-08-21T17:55:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:47Z", "source": "AlJazeera_All", "title": "Russia says Ukraine ‘not interested’ in long-term peace", "url": "https://www.aljazeera.com/news/2025/8/21/russia-says-ukraine-not-interested-in-long-term-peace?traffic_source=rss", "id_key": "891dfe52d2176689c8f4689199e0df1b74571f80101d2d8c97d7331e9b3e569f", "summary": "Comments by Russia's FM come as Ukraine's Zelenskyy says security guarantees needed before Putin meeting.", "ingested_utc": "2025-08-21T17:55:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "International Paper to close 2 Georgia mills, cut 1,100 jobs", "url": "https://financialpost.com/pmn/international-paper-to-close-2-georgia-mills-cut-1100-jobs", "id_key": "7e174f92e6a8b56f7a01a27d9750f021d4cc5c3986f4feca4225c6b7f6177287", "summary": "SAVANNAH, Ga. (AP) — International Paper Co. said Thursday that it would close two Georgia paper mills, including one that has been a cornerstone of Savannah’s economy for 90 years. The company, based in Memphis, Tennessee, said it would stop making cardboard in Savannah and Riceboro by the end of September. The company will lay […]", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "NYSE’s Newest Venue Gets Jump on Upstart Texas Stock Exchange", "url": "https://financialpost.com/pmn/business-pmn/nyses-newest-venue-gets-jump-on-upstart-texas-stock-exchange", "id_key": "90d8195a3a7020c4deca6b52344d02de3900004a1de84532169a638a73c8f46d", "summary": "The New York Stock Exchange has already convinced a significant chunk of Texas public companies to dual-list their shares on its new outpost in their home state, shoring up its competitive position ahead of next year’s planned launch of the rival Texas Stock Exchange.", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "European Stocks Steady as Traders Weigh PMIs, Fed; Aegon Rises", "url": "https://financialpost.com/pmn/business-pmn/european-stocks-steady-as-traders-weigh-pmis-fed-aegon-rises", "id_key": "a2e3ba8a92b67e4c04044497fe7161a6628a70d5884f4c5bf0e35ee1d619c0d4", "summary": "European stocks wavered after three days of gains as investors weighed data on euro area business activity, with focus also turning to the Federal Reserve’s Jackson Hole economic symposium.", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "Ontario sheds manufacturing jobs as tariff impacts felt, report says", "url": "https://financialpost.com/pmn/ontario-sheds-manufacturing-jobs-as-tariff-impacts-felt-report-says", "id_key": "24edc8fc6abc8ad4922dfe934574d831f6af375893c5dbc188b58cc12f26c18c", "summary": "TORONTO — Ontario’s economy has recently started to feel the impact of American tariffs, shedding 38,000 jobs in the second quarter of 2025, the province’s financial watchdog said Thursday in a report. Financial accountability officer Jeffrey Novak said hits to employment in that timeframe include the early impacts of the tariffs, as well as broad […]", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "Techmer PM Introduces HiFill® GF-PET Material System to Bridge Gap Between Low and High Temperature Tooling Requirements, Filling a Critical Need", "url": "https://financialpost.com/globe-newswire/techmer-pm-introduces-hifill-gf-pet-material-system-to-bridge-gap-between-low-and-high-temperature-tooling-requirements-filling-a-critical-need", "id_key": "827226002d7828fbf5166f97b2f9147adf028f3c5d30ec6d0f4d9370dcc165c9", "summary": "Innovative GF-PET compound delivers dimensional accuracy, thermal stability, and accessible shape compensation data for high-performance tooling applications CLINTON, Tenn., Aug. 21, 2025 (GLOBE NEWSWIRE) — Techmer PM, a materials innovation company delivering advanced composites for additive manufacturing, has announced the commercial release of HiFill® GF-PET, a glass-filled polyethylene terephthalate material system engineered for 3D printing […]", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "Rising concerns over U.S. move to broaden products subject to metal tariffs", "url": "https://financialpost.com/pmn/rising-concerns-over-u-s-move-to-broaden-products-subject-to-metal-tariffs", "id_key": "01031143741b752430060a81e493e6b4d6434cb1011c09cb67a475bffdb1d284", "summary": "TORONTO — There’s growing concern about a move by the United States to make hundreds more product categories subject to the country’s 50 per cent tariffs on steel and aluminum content. The addition of 407 categories of products, ranging from bulldozers to furniture to wind turbines, came into effect earlier this week to add pressure […]", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "CRA penalizes taxpayer for failure to report the sale of his principal residence", "url": "https://financialpost.com/personal-finance/taxes/cra-penalizes-taxpayer-failure-report-sale-principal-residence", "id_key": "09eab9d569e29e84d5cb26fa65a857c7f78bd2bac9a8cffa9ebc853df0617e76", "summary": "Jamie Golombek: Taxpayer failed to report capital gain of $159,282 and the CRA also hit him with a $21,000 gross negligence penalty", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:55:58Z", "source": "FinancialPost_Business", "title": "Israel Signs Off on Disputed West Bank Settlement Expansion", "url": "https://financialpost.com/pmn/business-pmn/israel-signs-off-on-disputed-west-bank-settlement-expansion", "id_key": "2962600d0d78365eeb0393ad060e2b0af35177a4390db2f794a9cde0c1fe3276", "summary": "Israel approved a controversial project to expand Jewish settlements in the West Bank, billed as dashing hopes of Palestinian statehood, a move condemned by several international governments.", "ingested_utc": "2025-08-21T17:55:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:56:05Z", "source": "Nikkei_Asia_Top", "title": "Asahi Kasei to double chip material production, tapping into AI boom", "url": "https://asia.nikkei.com/business/materials/asahi-kasei-to-double-chip-material-production-tapping-into-ai-boom", "id_key": "5204dad84ffd1e943f0903f519d09535c5300f29323613dc8e727416d68101b5", "summary": "", "ingested_utc": "2025-08-21T17:56:05Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:56:05Z", "source": "Nikkei_Asia_Top", "title": "Japan-based fentanyl smuggler led network across Russia, Australia and more", "url": "https://asia.nikkei.com/economy/trade-war/fentanyl-s-hidden-routes/japan-based-fentanyl-smuggler-led-network-across-russia-australia-and-more", "id_key": "3452e889305184e2686e4a7dd47ea72e40ab24b380b9539fc2abc6b6759dcbea", "summary": "", "ingested_utc": "2025-08-21T17:56:05Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:56:14Z", "source": "HackerNews_Top", "title": "Unity reintroduces the Runtime Fee through its Industry license", "url": "https://unity.com/products/unity-industry", "id_key": "31d453b8bd0e6536e7c749ab338953caa0add9b8eb0700d1f9303089099c9292", "summary": "Comments", "ingested_utc": "2025-08-21T17:56:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T17:56:14Z", "source": "HackerNews_Top", "title": "Unmasking the Privacy Risks of Apple Intelligence", "url": "https://www.lumia.security/blog/applestorm", "id_key": "5a312343e69209635914b3b73909edd5b15ca9f74699215d0ad318980f27c3ba", "summary": "Comments", "ingested_utc": "2025-08-21T17:56:14Z"}
