{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:33:36Z", "source": "BBC_Business", "title": "Target appoints new boss as it seeks to revive sales", "url": "https://www.bbc.com/news/articles/c93dw3w09z6o?at_medium=RSS&at_campaign=rss", "id_key": "0bfa55419fa0ea7c76c3faf85cab70f46eda1a3a4ecc410dc152cf416a5cc9ee", "summary": "Shares in Target dropped nearly 11% before recovering slightly after the announcement.", "ingested_utc": "2025-08-20T17:33:36Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:33:38Z", "source": "Guardian_World", "title": "South African minister investigated for historical racial slurs on social media", "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media", "id_key": "dd4fc10ad8609ab325159d1cf4902b3dc358dfd5c9693e2d192ca43e940c662b", "summary": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts South Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid. McKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts , which were still online at the time of publication. Continue reading...", "ingested_utc": "2025-08-20T17:33:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:33:38Z", "source": "Guardian_World", "title": "Macron hits out at ‘abject’ Netanyahu claim of rise in antisemitism in France", "url": "https://www.theguardian.com/world/2025/aug/20/france-israel-emmanuel-macron-decries-abject-benjamin-netanyahu-claim-of-antisemitic-surge", "id_key": "0ce28f9ccfac3ae6f807737b5ff425e1fe7bad22246d4aa3da59b087ec438200", "summary": "French president responds to Israeli PM’s ‘erroneous’ allegations in relation to decision to recognise state of Palestine Emmanuel Macron has hit out at Benjamin Netanyahu for his “abject” and “erroneous” remarks after Israel’s prime minister claimed that antisemitism had “surged” in France after the country’s decision to recognise a Palestinian state in September. In a statement released late on Tuesday, the office of the French president pushed back against Netanyahu’s claim. “The analysis suggesting that France’s decision to recognise the state of Palestine in September is behind the rise in antisemitic violence in France is erroneous, abject, and will not go unanswered,” it said. “The current period calls for seriousness and responsibility, not generalisation and manipulation.” Continue reading...", "ingested_utc": "2025-08-20T17:33:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:33:38Z", "source": "Guardian_World", "title": "Non-binary park ranger fired for hanging trans pride flag in Yosemite", "url": "https://www.theguardian.com/us-news/2025/aug/20/yosemite-ranger-fired-trans-pride-flag", "id_key": "1e998e33001e8f00e479139b76b99046d5a76b2a21ea8cbd444292af0d9a13bf", "summary": "Shannon ‘SJ’ Joslin among group who hung 66ft flag on El Capitan as others could face prosecution under protest laws A Yosemite national park ranger was fired after hanging a pride flag from El Capitan, while some park visitors could face prosecution under protest restrictions that have been tightened under Donald Trump. Shannon “SJ” Joslin, a ranger and biologist who studies bats, said they hung a 66ft-wide transgender pride flag on the famous climbing wall that looms over the California park’s main thoroughfare for about two hours on 20 May before taking it down voluntarily. A termination letter they received last week accused Joslin of “failing to demonstrate acceptable conduct” in their capacity as a biologist and cited the May incident. Continue reading...", "ingested_utc": "2025-08-20T17:33:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:33:38Z", "source": "Guardian_World", "title": "US health agency workers accuse RFK Jr of fueling violence against them", "url": "https://www.theguardian.com/us-news/2025/aug/20/hhs-workers-rfk-jr-violence-cdc", "id_key": "fca5800eb0e4c5ab16f96cf7bf4381523cc05f98222ca93beb00db4f052f3d0b", "summary": "More than 750 workers in letter say HHS secretary’s rhetoric played a role in recent attack at CDC’s Atlanta headquarters More than 750 current and former federal health employees on Wednesday accused health and human services (HHS) secretary, Robert F Kennedy Jr, of fueling harassment and violence directed at government healthcare staff. In a letter sent to Kennedy and members of Congress, the group accuses RFK Jr of contributing to “the harassment and violence experienced by Centers for Disease Control and Prevention (CDC) staff”, citing decisions such as removing members from a CDC vaccine advisory panel, questioning the safety of the measles vaccine, and firing key CDC staff as actions that sow distrust in federal medical professionals. Continue reading...", "ingested_utc": "2025-08-20T17:33:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:34:01Z", "source": "Protos", "title": "Lazarus hackers have become excellent ETH traders", "url": "https://protos.com/lazarus-hackers-have-become-excellent-eth-traders/", "id_key": "c15b57af1768375ba28e50eb7825d9aa6f6e973f6cc13d7eb6abd5c18148f541", "summary": "North Korean hacker group Lazarus Group is up over $40M on the proceeds from last year’s Radiant Capital hack, and is trading ETH like a pro. The post Lazarus hackers have become excellent ETH traders appeared first on Protos .", "ingested_utc": "2025-08-20T17:34:01Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:35:55Z", "source": "NYTimes_World", "title": "Canada and Mexico Look to Team Up as Trump’s Tariff Threats Loom", "url": "https://www.nytimes.com/2025/08/20/world/americas/canada-mexico-tariffs-trump.html", "id_key": "45edfdaaf79753c2ae5b58c3e1e6a4b14724b2790ff33d573980220e4e2b769c", "summary": "Mexico and Canada have long viewed each other with indifference or even distrust. They’re now talking about teaming up.", "ingested_utc": "2025-08-20T17:35:55Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:02Z", "source": "NPR_Top", "title": "Trump calls for resignation of Fed governor in latest line of attack", "url": "https://www.npr.org/2025/08/20/nx-s1-5508276/trump-calls-for-resignation-of-fed-governor-in-latest-line-of-attack", "id_key": "62f1a62d8cd8734f63c67b1f79cf2f72a7747cdbc654b3dcb5a82b99f9f690ab", "summary": "President Trump is calling for the resignation of Federal Reserve governor Lisa Cook after a Trump ally accused her of making false statements on mortgage applications.", "ingested_utc": "2025-08-20T17:36:02Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:05Z", "source": "NPR_Technology", "title": "These brain implants speak your mind — even when you don't want to", "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5506334/brain-computer-implant-speak-inner-speech-mind", "id_key": "4687967972b5b9dccc90a69a77669da58be7d81f9ce00ac73495865fc322a8c1", "summary": "Brain-implanted devices that allow paralyzed people to speak can also decode words they imagine, but don't intend to share.", "ingested_utc": "2025-08-20T17:36:05Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:06Z", "source": "FT_Home", "title": "US tech slide extends into second day as concerns over AI rally rise", "url": "https://www.ft.com/content/b6c96fc7-ab27-42f1-a8f3-aae7937dc939", "id_key": "29b5b29cfe7a8bf860aa9116c4e9571dada426ccc3559b5cf01687a20f7e94bb", "summary": "Nasdaq set for worst week since spring market tumult as investors question ‘durability of the uptrend’", "ingested_utc": "2025-08-20T17:36:06Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:22Z", "source": "TheVerge_All", "title": "How Google’s new Pixel 10 phones compare to one another on paper", "url": "https://www.theverge.com/tech/761983/google-pixel-10-pro-xl-fold-comparison-specs-price-features", "id_key": "df4095acb2d08fcae910d23aa7870409486a5a1da62b9cdddea3d93d273314c4", "summary": "At its latest Made by Google event, the search giant officially revealed four new phones: the Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and Pixel 10 Pro Fold. That's a lot of devices, especially when you consider the different colors and storage configurations. And we can't forget about the Pixel 9A from April, […]", "ingested_utc": "2025-08-20T17:36:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:22Z", "source": "TheVerge_All", "title": "Gemini for Home is Google’s biggest smart home play in years", "url": "https://www.theverge.com/news/762370/google-announces-gemini-for-home-nest-smart-speakers-voice-assistant", "id_key": "ce035a625704e1518ac034aeb2b5878952ad6a13d45d9da4b4d7ba33a7ce4df6", "summary": "It’s finally happening: Google Assistant in the home is getting its Gemini glow-up. “Gemini for Home” is an all-new voice assistant for Google Home, set to arrive later this year, the company announced today. This new voice assistant, powered by Google’s Gemini artificial intelligence, will eventually replace Google Assistant on Google’s Nest smart speakers and […]", "ingested_utc": "2025-08-20T17:36:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:24Z", "source": "ArsTechnica_All", "title": "Mammals that chose ants and termites as food almost never go back", "url": "https://arstechnica.com/science/2025/08/mammals-that-chose-ants-and-termites-as-food-almost-never-go-back/", "id_key": "9c69f56fc5a7fa8039c5a97dd3807b12d42ff6067d40b431c684b64cbc51fa39", "summary": "Ant eating is widely distributed across mammalian lineages.", "ingested_utc": "2025-08-20T17:36:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:24Z", "source": "ArsTechnica_All", "title": "China’s Guowang megaconstellation is more than another version of Starlink", "url": "https://arstechnica.com/space/2025/08/china-may-have-taken-an-early-lead-in-the-race-for-a-military-megaconstellation/", "id_key": "bb94df45672f028cee386b21f00fc924b06b3499e00015fe8c014419cc1c2a82", "summary": "\"This is a strategy to keep the US from intervening... that's what their space architecture is designed to do.\"", "ingested_utc": "2025-08-20T17:36:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:25Z", "source": "WIRED_All", "title": "Nothing Beats Our Editors' Favorite Office Chair, and It’s on Sale Now", "url": "https://www.wired.com/story/branch-deals-labor-day/", "id_key": "98e032a6bfdafca892c02ad331837e0d3f86e068bf71e0fd4eac02adf4571845", "summary": "Looking for a new office chair? Branch is offering 10 percent off the base price of its chairs and accessories.", "ingested_utc": "2025-08-20T17:36:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:25Z", "source": "WIRED_All", "title": "The PlayStation 5 Is About to Get More Expensive", "url": "https://www.wired.com/story/the-playstation-5-is-about-to-get-more-expensive/", "id_key": "74c24178e4752ae9fab8e241815977dd1a6d84d974759b4c6f6349f17b9f9afb", "summary": "Starting August 21 in the US, every edition will cost $50 more than it did the day before, thanks to Trump’s tariffs.", "ingested_utc": "2025-08-20T17:36:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:26Z", "source": "Engadget_All", "title": "How to watch Made by Google Pixel 10 launch event live today", "url": "https://www.engadget.com/mobile/smartphones/how-to-watch-made-by-google-pixel-10-launch-event-live-today-163933575.html?src=rss", "id_key": "f3550dba694efe2f317acd64a36b282535436f3cd855454ab513a79ddcec1bf9", "summary": "Yes, September is all about iPhone, but Google is taking center stage today with its hotly anticipated Pixel hardware event. Thanks to a parade of leaks, we think we know mostly what to expect today — Pixel 10 phones, along with new watches and earbuds — but we'll know for sure later today. That's because the event kicks off at 1PM ET. If you want to be the first to hear the official scoop, you can tune into the Made by Google YouTube channel (or right here!) to catch Google's event, which will be hosted by Jimmy Fallon and also include other celebrities like Stephen Curry , Lando Norris and the Jonas Brothers — get ready for some potentially awkward cue card readings! And open a second window to follow our Pixel event liveblog for real-time analysis. What's on tap? You can expect a more power-efficient Tensor G5 processor in all the new Pixel 10 phones. (That could help power new Gemini AI features , too.) The base-level Pixel 10 should get a big camera upgrade: a 5x telephoto lens. Before this generation, you had to splurge on a Pro or Fold model to get optical zoom. Cameras will be higher-res across the board, too. In other areas, Qi2 magnetic charging is expected to come to the new Pixels. Expect a new accessory ecosystem, a la Apple's MagSafe , dubbed \"Pixelsnap.\" We'll also likely see the Pixel Watch 4 with a larger battery and smaller bezels . And the Pixel Buds 2a could bring refinements to the company's budget earbuds . Sam Rutherford for Engadget Engadget's Pixel 10 leak roundup will give you a much more detailed dive into the rumors. You can head back here on August 20 at 1PM ET to watch live. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-watch-made-by-google-pixel-10-launch-event-live-today-163933575.html?src=rss", "ingested_utc": "2025-08-20T17:36:26Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:26Z", "source": "Engadget_All", "title": "Google Pixel 10 Pro Fold vs. Samsung Galaxy Z Fold 7: How the newest foldable phones stack up", "url": "https://www.engadget.com/mobile/smartphones/google-pixel-10-pro-fold-vs-samsung-galaxy-z-fold-7-how-the-newest-foldable-phones-stack-up-165018793.html?src=rss", "id_key": "17c888558e00698ad67d92c3f776025169b468164a8755bf9c8ff802f34cc7c8", "summary": "The latest and greatest of the foldable phone world. (Google, Sam Rutherford/Engadget) Last month, the Samsung Galaxy Z Fold 7 was released and immediately became the de facto king of the foldable phone hill. But today a new challenger has arrived: The Pixel 10 Pro Fold . Initial details are now available, and Google is having a splashy launch event to introduce it (and the full new Pixel 10 line ) to the world. These two smartphones are vying for the title of best foldable — both with very similar designs, but each bringing something unique to the table. Samsung launched its first foldable phone in 2019, so it's had quite a bit of time to refine the Galaxy Fold over the years. Google on the other hand just released its first Pixel Fold a couple years ago — but has already largely evened the match . And, of course, with enhanced Gemini AI software integration front and center, you'll have access to Google's impressive artificial intelligence features at nearly every turn. We'll break down how the Pixel 10 Pro Fold and Galaxy Z Fold 7 stack up to one another. You can also check out our comparison of the Pixel 9 Pro Fold and the Galaxy Fold 6 to see how much has changed in a year. For more, see everything else that was announced at the Made by Google Pixel event today, including the Pixel Watch 4 . Price First things first, how much will one of these high-tech folding phones cost you? That is the make-or-break question, after all. The newest Pixel foldable is still less expensive than this year's Z Fold: it starts at $1,799 while the Galaxy smartphone starts at $2,000. You don't have any other real choices for \"book-style\" foldables in the US market. The OnePlus Open can be had for $1,499, but it's almost two years old. And Apple's most expensive phone is currently the $1,599 1TB iPhone 16 Pro Max — but as a non-foldable model with just a single screen, it's hardly a straight comparison. If the rumor mill is to be believed, Apple may finally bow a foldable iPhone in 2026 . Dimensions and display It's a race for the largest display and Samsung won this time — but not by much. The Galaxy Z Fold is just a hair bigger than the Pixel Pro Fold. Both phones' inner displays are 8 inches across when fully opened, while Samsung comes out ahead on the outer display with 6.5 inches (the Pixel is 6.4 inches). As for height, the new foldable Pixel phone is 6.1 inches and the Galaxy Z is 6.2 inches — not a huge difference there. When unfolded, the Samsung wins on size efficiency, packing the identically sized 8-inch internal display into an area that's 0.3 inches smaller — 5.6 inches versus the Pixel's 5.9. This year, the Pixel 10 Pro Fold’s displays have been upgraded to a Super Actua Flex OLED display with ultra-thin glass. Both the front screen and back cover come equipped with Corning Gorilla Glass Victus 2. As for the Galaxy Z Fold 7, it has a Dynamic AMOLED display (inner and outer) and comes with the Corning Gorilla Glass Ceramic 2 on the front and the Gorilla Glass Victus 2 on the backside. The glass is ultra-thin, yet it's 50 percent thicker than before. While slightly bigger, the Galaxy Z Fold 7 is still lighter than the Pixel 10 Pro Fold. The Samsung model weighs only 7.6 ounces — down nearly an ounce from its 2024 model — while its Google competition comes in at 9.1 ounces (the same as last year's model). The Samsung Galaxy Z Fold 7 (left) compared to the new Pixel 10 Pro Fold (right). (Sam Rutherford/Engadget) Processor, RAM, storage and battery The Pixel 10 Fold Pro runs the Tensor G5 chip — Google says its CPU features 34 percent better performance compared to the Tensor G4 chip. The Z Fold 7 is powered by Qualcomm's Snapdragon 8 Elite for Galaxy. \"Everything feels fast and snappy,\" Engadget's Sam Rutherford said of the Snapdragon 8 Elite performance on the Z Fold 7. (Sam also has first impressions of the Pixel 10 Pro Fold , but speed tests will happen a bit later.) Both phones offer the choice of 256GB, 512GB or 1TB storage. On the RAM front, the Pixel Fold delivers 16GB across the line, while the Samsung model reserves that level for the top 1TB storage tier; the small models get 12GB instead. The Galaxy phone will cost you $2,419 if you decide you need the maximum amount of storage, whereas the Pixel Fold tops out at $2,149. When it comes to battery life, Samsung's foldable lasts up to 24 hours with a 4,400mAh battery. The Pixel lasts up to 30 hours thanks to a more capacious 5,015mAh battery rating. Furthermore, the Pixel Fold is certified for Qi2 wireless charging, which Google is branding as \" Pixelsnap \" across its 2025 Pixel line for the first time.. Color options If you like having multiple colors to choose from, the Galaxy Z Fold 7 is winning in this category. It comes in Mint, Jetblack, Blue Shadow and Silver Shadow. Mint is only available if you buy your phone online — you won't be seeing that one in stores. As for the Pixel 10 Fold Pro, your options are Moonstone and Jade. Full specs comparison Google Pixel 10 Pro Fold Samsung Galaxy Z Fold 7 Starting price $1,799 $2,000 Dimensions Folded: 6.1 x 3.0 x 0.4 inches (155.2 x 76.3 x 10.8mm) Unfolded: 6.1 x 5.9 x 0.2 inches (155.2 x 150.4 x 5.2mm) Folded: 6.2 x 2.9 x 0.4 inches (158.4 x 72.8 x 8.9mm) Unfolded: 6.2 x 5.6 x 0.2 inches (158.4 x 143.2 x 4.2mm) Weight 9.1 oz (258g) 7.6 oz (215g) Processor Tensor G5 Snapdragon 8 Elite for Galaxy (3nm) Display Inner: 8-inch Super Actua Outer: 6.4-inch Actua Inner: 8-inch Dynamic AMOLED Outer: 6.5-inch Dynamic AMOLED Storage 256GB / 512GB / 1TB 256GB / 512GB / 1TB RAM 16GB 12GB (for 256GB, 512GB configs) | 16GB (for 1TB config) Battery 5,015mAh | \"Up to 30 hours\" 4,400mAh | \"Up to 24 hours\" Camera Main: 48 MP wide | 5x telephoto lens with Super Res Zoom up to 20x Front: 10 (ƒ/2.2) Inner: 10 MP (ƒ/2.2) Main: 200 MP Wide (F1.7) | 12 MP Ultrawide (F2.2) | 10 MP (F2.4) / Telephoto (F2.4) w/3x zoom Front: 10 (F2.2) Inner: 10 MP (F2.2) Stylus support No No Colors Moonstone, Jade Mint (online only), Jetblack, Blue Shadow, Silver Shadow This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/google-pixel-10-pro-fold-vs-samsung-galaxy-z-fold-7-how-the-newest-foldable-phones-stack-up-165018793.html?src=rss", "ingested_utc": "2025-08-20T17:36:26Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:34Z", "source": "TheStreet_Top", "title": "Walmart is selling a 'cute' dining set for only $53 that's the 'perfect size for a smaller kitchen'", "url": "https://www.thestreet.com/deals/mainstays-3-piece-dining-set-walmart-sale", "id_key": "be1f1e76ca7f32703395311e884e5084f46784b522c0618acf0be2d84b2836e4", "summary": "\"It's very sturdy and easy to put together.", "ingested_utc": "2025-08-20T17:36:34Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:42Z", "source": "FinancialPost_Business", "title": "DP World Earns Great Place To Work® Certification at Eight Locations Across the Americas", "url": "https://financialpost.com/globe-newswire/dp-world-earns-great-place-to-work-certification-at-eight-locations-across-the-americas", "id_key": "883775481f90cee24ef800f51c5be35d1cbab9d45fb29f4db6bff0b31ec18acf", "summary": "84% of employees rate DP World as a Great Place to Work. Six locations earn consecutive recognition, while Chile and Paraguay join certification program for first time. CHARLOTTE, N.C., Aug. 20, 2025 (GLOBE NEWSWIRE) — DP World has earned Great Place To Work® Certification™ across eight countries in the Americas: Argentina, Brazil, Canada, Chile, Dominican […]", "ingested_utc": "2025-08-20T17:36:42Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:57Z", "source": "HackerNews_Top", "title": "Launch HN: Channel3 (YC S25) – A database of every product on the internet", "url": "https://news.ycombinator.com/item?id=44962881", "id_key": "a241001ebb8605d15f67baa07cd2af28e46f454ce7408cf45e28ce22ff81890a", "summary": "Comments", "ingested_utc": "2025-08-20T17:36:57Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:36:57Z", "source": "HackerNews_Top", "title": "Best Options for Using AI in Chip Design", "url": "https://semiengineering.com/best-options-for-using-ai-in-chip-design/", "id_key": "1703c1c3587e460fed09103d6f9a30c7688fd3220a47daf6a676a0224e55fde7", "summary": "Comments", "ingested_utc": "2025-08-20T17:36:57Z"}
