{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:43Z", "source": "BBC_World", "title": "Bolsonaro planned to flee to Argentina, Brazil police say", "url": "https://www.bbc.com/news/articles/c05ede3j24zo?at_medium=RSS&at_campaign=rss", "id_key": "50c8ed9b753617d61bc3650c24752af9a50ce54aa50b8b91c37f100548c03961", "summary": "Police say they found a letter on the former Brazilian president's phone requesting asylum in Argentina.", "ingested_utc": "2025-08-21T13:38:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:46Z", "source": "Guardian_Business", "title": "CEO-to-worker pay gap surges to 632 to 1 at US’s lowest-paying large firms, study shows", "url": "https://www.theguardian.com/us-news/2025/aug/21/ceo-worker-salaries", "id_key": "c7adca4b576ac02ed7a6a51722b623cc7cbc35132c892bc914a8b77d34542b7b", "summary": "At 100 firms in S&P 500 with lowest median pay, executives’ comp increased by average of nearly 35% over five years Some of the US’s lowest-paying large firms increased their CEOs’ compensation by an average of almost 35% over five years, according to new research . Their workers’ salaries did not keep up. As executive remuneration ballooned, the average CEO-to-worker pay gap across the 100 companies in the S&P 500 with lowest median worker pay – dubbed the Low-Wage 100 by the Institute for Policy Studies – widened by 12.9% between 2019 and 2024, from 560 to 1 to 632 to 1. Continue reading...", "ingested_utc": "2025-08-21T13:38:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "Uganda reaches agreement with US to take in some failed asylum seekers", "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers", "id_key": "fc153de340f1b3c2c24a151a7a4355d8bf123362cb3d9ff590f657cad5413b82", "summary": "African country’s foreign ministry says the two states are working on the details of a deal over deportees Uganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry. The country will not accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​the Ugandan foreign ministry’s permanent secretary said in a statement . He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "Moscow demands veto over support for Ukraine under any peace deal and questions Zelenskyy’s legitimacy – Ukraine war live", "url": "https://www.theguardian.com/world/live/2025/aug/21/us-minimal-security-guarantees-ukraine-russia-diplomacy-europe-latest-updates-news", "id_key": "63bb5fb7d556eab3e49f4bed28e50ca8cf7ff5c18ac5b07ab0172d1edbdd6177", "summary": "Sergei Lavrov, Russia’s foreign minister, says European proposals to deploy troops in Ukraine after a settlement would amount to ‘foreign intervention’ We have just heard from the European Commission, confirming that the EU and the US have now agreed on the much-awaited “joint statement” advancing the political commitments on trade agreed by Ursula von der Leyen and Donald Trump in Scotland last month. The commission’s press release says the statement “lays out in detail the new US tariff regime towards the EU, with a clear maximum, all-inclusive, tariff rate of 15% for the vast majority of EU exports , including strategic sectors such as cars , pharmaceuticals , semiconductors and lumber .” Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "Gaza City offensive would be ‘death sentence’ for Israeli hostages, say relatives", "url": "https://www.theguardian.com/world/2025/aug/21/gaza-city-offensive-would-be-death-sentence-for-israeli-hostages-say-relatives", "id_key": "188bd9f246b9be47f0b5afc066141dbf9b5c4b08a2c026121caafa7cd9b8cf9e", "summary": "UN warns of ‘massive death and destruction’ if Netanyahu proceeds with plan for expanded military operation Middle East crisis – latest updates An Israeli operation to conquer Gaza City would be a “death sentence” for the remaining living Israeli hostages held in Gaza, relatives of the hostages have said, as the Red Cross and UN warned of a looming catastrophe. Opposition to a new operation – repeatedly “approved” by Israeli figures in recent days – is growing inside Israel and internationally. Calling for an immediate ceasefire, the UN secretary general, António Guterres, warned of the “massive death and destruction that a military operation against Gaza would inevitably cause”. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "Teenager who planned mosque attack in Scotland detained for 10 years", "url": "https://www.theguardian.com/uk-news/2025/aug/21/teenager-who-planned-mosque-attack-scotland-detained", "id_key": "127922d1cafd23fde21fcbff9fe97fd2f1e5febb189b10140f9217a4f315b59d", "summary": "Boy, 17, had intended to set fire to Islamic centre in Greenock, Inverclyde, after befriending imam A teenager who listed Hitler, Mussolini and the Norwegian mass murderer Anders Breivik as his inspirations and who planned a terrorist attack on a mosque has been sentenced to 10 years in custody. The 17-year-old, who cannot be named because of his age, had intended to set fire to an Islamic centre in Greenock, Inverclyde, after befriending the imam and mapping out the building’s interior on his phone. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "UK health firms ‘misleading’ parents with claims over milk teeth ‘treatments’", "url": "https://www.theguardian.com/science/2025/aug/21/healthcare-firms-misleading-milk-teeth-treatments-autism-diabetes-stem-cells", "id_key": "fccbc2a09fe390daa4527c5f53c6f47f8bb28eeb5dc93a549ba716cd69f9cd98", "summary": "Companies collect stem cells from children’s teeth and claim they can treat conditions including autism and diabetes Companies are making thousands of pounds by misleading parents with claims that collecting stem cells from their children’s teeth can be a treatment for diabetes and autism, an investigation has found. Tooth stem cell banking, also known as dental pulp cell banking, involves parents collecting and sending lost milk teeth to a laboratory where stem cells are harvested from the dental pulp. Firms that advertise tooth banking services claim these stem cells can be used in treatments for conditions such as diabetes and autism. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "Ethel Caterham, world’s oldest person, marks 116th birthday", "url": "https://www.theguardian.com/uk-news/2025/aug/21/ethel-caterham-worlds-oldest-person-116th-birthday", "id_key": "2ce945cd216f67339cb15777d9d4ba4990597afde036d4183cb2b4c274451f59", "summary": "Caterham was born in Hampshire in August 1909, when Edward VII reigned, and now lives in care home in Surrey Ethel Caterham, the last surviving Edwardian and the world’s oldest living person, celebrated her 116th birthday on Thursday. She was born on 21 August 1909 in Shipton Bellinger, Hampshire, when Herbert Asquith was prime minister, Beatrix Potter had just published The Tale of the Flopsy Bunnies and one of the bestselling songs was Shine on Harvest Moon. Herbert Henry Asquith was the UK’s Liberal prime minister and Edward VII was king. The first state pensions were being paid after the introduction of the Old Age Pensions Act. Claude Monet’s Water Lilies series had just gone on show for the first time at an exhibition in Paris. General Electric patented the electric toaster invented by Frank Shailor. Bulgaria was about to declare independence from the Ottoman empire. Manchester United had won the first of their FA Cup victories by beating Bristol City. Arthur Gore was the reigning men’s Wimbledon champion aged 41 – he remains the men’s singles tournament’s oldest winner. The future matinee idol Errol Flynn was two months old. The first international flying show occurred in Reims, France. Selfridges had just opened on Oxford Street in London. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "US to hold high tariffs on European cars until Brussels moves to cut tariffs on US goods", "url": "https://www.theguardian.com/us-news/2025/aug/21/tariffs-eu-cars-brussels", "id_key": "e4f9505ea00a401da68ca39227924cc252107bba3050dd130f275bf2114921b5", "summary": "Framework deal pledges to cut 27.5% tariff once EU tables legislation, and both sides say they want swift action Washington will not lower steep tariffs on European cars until Brussels has introduced legislation to reduce its own tariffs on US exports, maintaining pressure on the EU’s automotive industry. While the Trump administration has agreed to lower the current 27.5% US tariffs on European cars and car parts to 15%, details of a framework trade deal published on Thursday revealed the terms and conditions. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "Marriott does not deny a hotel in its portfolio was used to detain families for Ice", "url": "https://www.theguardian.com/us-news/2025/aug/21/marriott-ice-detainees-louisiana", "id_key": "6d70978242f1f418f686d1d70d6113650d8ef29aa2c36614138e59d920f7d61d", "summary": "Hospitality giant responded to Guardian story about Ice’s use of Sheraton hotel to hold families prior to deportation Marriott, the hospitality giant, has not disputed recent revelations that a Louisiana hotel in its portfolio was used to detain migrant families before deportation, which contradicts a 2019 policy that it would not cooperate with Immigration and Customs Enforcement (Ice). In a new statement to the Guardian, the company suggested that its “acceptance of business” did not mean it supported the Trump administration’s immigration policies. The Guardian reported on Tuesday that a Sheraton hotel in the city of Alexandria, situated close to a major Ice deportation hub, has been used to hold family groups before they are removed from the US. The Sheraton brand is owned by Marriott International. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "Immigration raid in New Jersey results in dozens of warehouse workers detained", "url": "https://www.theguardian.com/us-news/2025/aug/21/ice-raid-new-jersey-warehouse-workers-detained", "id_key": "d8fc992cca2b55785b5c3e68f3916111f36c605c61629efb00eea16348639077", "summary": "Workers were led away in zip ties after CBP officials raided a workplace in Edison, New Jersey Dozens of immigrant workers were detained at a warehouse in New Jersey on Wednesday, in the latest federal raid as part of Donald Trump ’s immigration crackdown. Agents from Customs and Border Protection (CBP) descended on the warehouse, in Edison, New Jersey, at 9am on Wednesday, the New York Times reported . Officers led some workers away in zip ties, employees told the Times, while people they deemed to have legal status in the US were given yellow wristbands. Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:38:47Z", "source": "Guardian_World", "title": "LA Ice protests spurred US military to identify ‘hotels to avoid’ due to ‘harassment’", "url": "https://www.theguardian.com/us-news/2025/aug/21/la-ice-protests-hotels-to-avoid-list", "id_key": "3079165a63c4bda2dce5eb102e48c8831cf8b6cf968206bbe4523d8349256077", "summary": "Exclusive: Organizers disrupted Trump’s immigration crackdown by targeting hotels where officers were staying, documents show When Donald Trump ’s administration escalated immigration raids in Los Angeles earlier this summer, protest organizers responded with actions staged in an unusual setting: the hotels where immigration officers were staying. Protests took place at several southern California hotels where Immigration and Customs Enforcement (Ice) and Customs and Border Protection (CBP) agents had been spotted. Some activists launched “No sleep for Ice” rallies , with chants and music blaring through the night, in hopes of pressuring the hotels to kick agents out . Continue reading...", "ingested_utc": "2025-08-21T13:38:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:05Z", "source": "BitcoinMagazine", "title": "9 Ways Bitcoin Treasury Companies Can Differentiate in a Crowded Market", "url": "https://bitcoinmagazine.com/bitcoin-for-corporations/bitcoin-treasury-companies-differentiate", "id_key": "16a2cb6f61df5902008fa9fee1658eef3ec725bbceaa9eab71421bc2e14074ac", "summary": "Bitcoin Magazine 9 Ways Bitcoin Treasury Companies Can Differentiate in a Crowded Market Bitcoin treasury companies can no longer rely on holdings alone to stand out. Jurisdiction, capital strategy, and leadership now define shareholder trust and mNAV. This post 9 Ways Bitcoin Treasury Companies Can Differentiate in a Crowded Market first appeared on Bitcoin Magazine and is written by Nick Ward .", "ingested_utc": "2025-08-21T13:39:05Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:07Z", "source": "CryptoSlate", "title": "Trump’s World Liberty Financial mints 10% of USD1 supply for treasury", "url": "https://cryptoslate.com/trumps-world-liberty-financial-mints-10-of-usd1-supply-for-treasury/", "id_key": "479738384cf7eb07e1b4b6c98c104fa123b2036e6d3ec8b3c2abfb8fc5aecb72", "summary": "World Liberty Financial (WLFI), the crypto project affiliated with US President Donald Trump, has minted approximately 10% of its USD1 stablecoin supply, totaling $205 million, for its Treasury. In an April 20 statement on X, WLFI pointed out that the stablecoin is one of the fastest-growing in the market, noting that the asset is “backed […] The post Trump’s World Liberty Financial mints 10% of USD1 supply for treasury appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T13:39:07Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:08Z", "source": "CryptoBriefing", "title": "MetaMask to debut wallet-native stablecoin mUSD on Ethereum and Linea", "url": "https://cryptobriefing.com/metamask-usd-stablecoin-launch/", "id_key": "6495771e34c0c5e37d51cd2b8760becae09b5ad290c3243470c4268ffc4a8fee", "summary": "MetaMask's stablecoin launch could accelerate web3 adoption by simplifying transactions, reducing costs, and enhancing digital currency usability. The post MetaMask to debut wallet-native stablecoin mUSD on Ethereum and Linea appeared first on Crypto Briefing .", "ingested_utc": "2025-08-21T13:39:08Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:08Z", "source": "CryptoBriefing", "title": "Singapore’s largest bank DBS to debut tokenized structured notes on Ethereum", "url": "https://cryptobriefing.com/tokenized-structured-notes-ethereum/", "id_key": "ca8bb417f4a662a6b15b7ec5aa2b072f3416568d8d49ebf720154df57f441d49", "summary": "DBS's move to tokenize structured notes on Ethereum could democratize access to complex financial instruments, enhancing market efficiency. The post Singapore’s largest bank DBS to debut tokenized structured notes on Ethereum appeared first on Crypto Briefing .", "ingested_utc": "2025-08-21T13:39:08Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:11Z", "source": "CryptoNews", "title": "AI Coins Defy The Odds: NEAR Price Up 3% Despite Meta AI Hiring Freeze And Market Downturn, What’s Next?", "url": "https://cryptonews.com/news/ai-coins-defy-the-odds-near-price-up-3-despite-meta-ai-hiring-freeze-and-market-downturn-whats-next/", "id_key": "a0fce8ac8409d463e2ff92cf54a402ddf1d2133733e90856aa90b2402c4ec24d", "summary": "Near managed to stay in positive territory even though the market has plummeted lately. This AI token seems to be resilient to the latest bad news from the tech industry and could deliver sizable gains in the future according to one popular trader.Just a few hours ago, Meta Platforms announced that it will temporarily stop […] The post AI Coins Defy The Odds: NEAR Price Up 3% Despite Meta AI Hiring Freeze And Market Downturn, What’s Next? appeared first on Cryptonews .", "ingested_utc": "2025-08-21T13:39:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:11Z", "source": "CryptoNews", "title": "Scammer Poses as UK Police Chief to Steal $2.8M Bitcoin Through Phishing Attack", "url": "https://cryptonews.com/news/scammer-poses-as-uk-police-chief-to-steal-2-8m-bitcoin-through-phishing-attack/", "id_key": "d2322f7525910fd0650cf6c2853e1d10b7c2b69f12e483420bdc7db9ab8ea8f4", "summary": "North Wales Police investigate sophisticated phishing scam where criminals posing as senior UK law enforcement officers stole £2.1M ($2.8M) in Bitcoin from a cold storage holder through an elaborate social engineering scheme claiming a security breach, while the crypto crime wave escalates with corrupt officials and 32 violent physical attacks reported globally. The post Scammer Poses as UK Police Chief to Steal $2.8M Bitcoin Through Phishing Attack appeared first on Cryptonews .", "ingested_utc": "2025-08-21T13:39:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:11Z", "source": "CryptoNews", "title": "Bitget Wallet Integrates Aerodrome DEX on Base – Unlocking cbETH and cbBTC Liquidity", "url": "https://cryptonews.com/news/bitget-wallet-partners-with-base-to-integrate-aerodrome-dex/", "id_key": "d8656badb6b74b1b031a7208fb877ea0bbca1863b3a0c2e59073fedbb19622d2", "summary": "Bitget Wallet has integrated Aerodrome, the key liquidity hub on Base, into its app. The move has given users seamless access to Base-native assets like cbETH and cbBTC, in-app token swaps, liquidity pools, GetGas support for transactions, and a dedicated discovery zone showcasing Base DApps and tools. The post Bitget Wallet Integrates Aerodrome DEX on Base – Unlocking cbETH and cbBTC Liquidity appeared first on Cryptonews .", "ingested_utc": "2025-08-21T13:39:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:11Z", "source": "CryptoNews", "title": "Trump-Linked Stablecoin Surges to $2.4B After $205M Mint — Fueled by Fed Speech?", "url": "https://cryptonews.com/news/trump-linked-stablecoin-surges-to-2-4b-after-205m-mint-fueled-by-fed-speech/", "id_key": "9b1bf43925e9ed95edd686fe992b634cc37457dd5334b2a24fa1ac751dc163d3", "summary": "Leveraging a supportive signal from the Federal Reserve, the Trump family's World Liberty Financial minted $205 million in its USD1 stablecoin, expanding its private digital treasury to $2.4 billion. The post Trump-Linked Stablecoin Surges to $2.4B After $205M Mint — Fueled by Fed Speech? appeared first on Cryptonews .", "ingested_utc": "2025-08-21T13:39:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:11Z", "source": "CryptoNews", "title": "Ethereum Wallet MetaMask to Launch Native Stablecoin “mUSD”", "url": "https://cryptonews.com/news/ethereum-wallet-metamask-to-launch-native-stablecoin-musd/", "id_key": "fa4d9e358f42689eefba1a1a083840ba72804cc0cf2b6a42586970027572348f", "summary": "MetaMask, the popular self-custodial crypto wallet developed by Consensys, is set to launch its own native stablecoin, MetaMask USD (mUSD). The post Ethereum Wallet MetaMask to Launch Native Stablecoin “mUSD” appeared first on Cryptonews .", "ingested_utc": "2025-08-21T13:39:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:11Z", "source": "CryptoNews", "title": "Corporate Crypto Treasuries: Bitcoin Reserves Could Heighten Credit Risk, Analysts Warn", "url": "https://cryptonews.com/news/corporate-crypto-treasuries-bitcoin-reserves-could-heighten-credit-risk-analysts-warn/", "id_key": "2808cf6487d0109bd01c4fc580e598e9ba838a3b429c1967d63ffddf227ead02", "summary": "The growing practice of companies holding bitcoin and other cryptocurrencies in their treasuries may heighten credit risks, according to analysts at Morningstar DBRS. The post Corporate Crypto Treasuries: Bitcoin Reserves Could Heighten Credit Risk, Analysts Warn appeared first on Cryptonews .", "ingested_utc": "2025-08-21T13:39:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:11Z", "source": "CryptoNews", "title": "Are Presidential Meme Coins About to Pump as Eric Trump Claims $1M BTC is Inevitable?", "url": "https://cryptonews.com/news/are-presidential-meme-coins-about-to-pump-as-eric-trump-claims-1m-btc-is-inevitable/", "id_key": "e3badcda58ad4443a39fe0d24adaabf0d5863059cce3e16e31dcc1f0127f5e64", "summary": "Presidential meme coins including TRUMP and MELANIA tokens may be preparing for another rally as Eric Trump claims Bitcoin will hit $1M and dedicates over 50% of his time to cryptocurrency ventures while predicting BTC will reach $175,000 by 2025 close. The post Are Presidential Meme Coins About to Pump as Eric Trump Claims $1M BTC is Inevitable? appeared first on Cryptonews .", "ingested_utc": "2025-08-21T13:39:11Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:39:13Z", "source": "Unchained", "title": "Kanye West’s YZY Token Launches With ‘Class Action Waiver’", "url": "https://unchainedcrypto.com/kanye-wests-yzy-token-launches-with-class-action-waiver/", "id_key": "1fb046c41fcdfdfb4873e511b1edb3865ac3221e5211d7f4d584f6c0e57ddf12", "summary": "Controversial personality Kanye West is the latest celebrity to launch a crypto token. West’s YZY token debuted on Solana late on Wednesday, and surged 881% in just 10 minutes. YZY briefly hit a market cap of $3 billion before falling to $1.1 billion shortly after midnight. Onchain wallet tracker Lookonchain ... The post Kanye West’s YZY Token Launches With ‘Class Action Waiver’ appeared first on Unchained .", "ingested_utc": "2025-08-21T13:39:13Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:40:20Z", "source": "Optimism_Releases", "title": "op-batcher v1.15.0", "url": "https://github.com/ethereum-optimism/optimism/releases/tag/op-batcher%2Fv1.15.0", "id_key": "d2a6335a12946ba119e156fb236249617d0fa799d543ffd60ab2d35600b784d4", "summary": "Important All chain operators are strongly encouraged to upgrade their batchers to improve throttling behavior and mitigate worst-case spam attack scenarios. Overview This release includes a major reworking of the batcher-sequencer DA throttling feature (allowing for smoother control of transaction and block size limits), a new admin RPC method to flush the batcher (causing it to submit a transaction as soon as possible) as well as several performance enhancements and bugfixes. Sequencer throttling changes Warning This release changes the default throttling behavior. Chain operators should examine the new throttling documentation closely to ensure their batchers are configured appropriately for their chain. We deem the new defaults well suited for average OP Stack chains that use the default block gas limits and EIP1559 elasticity. Especially if you operate a high-throughput chain, you may want to change the throttling parameters, like the block-size-upper-limit and block-size-lower-limit . The old batcher supported only a very simple form of throttling: once a threshold of DA backlog was reached, it would fully throttle the sequencer and other block builders. This would often lead to a clunky user experience, as throttling kicks in fully at once, and then eases fully once the backlog dips below the threshold. This release introduces three new throttling controllers to allow for more smooth throttling behavior than this step controller . The three new controllers are linear , quadratic , and a PID-like controller (experimental, not recommended). The new default throttling controller is quadratic . Instead of throttling getting activated at a single threshold, like the old step controller, there is now a lower and upper threshold at which throttling starts and then continually increases in intensity as the backlog grows. The intensity curve is determined by the throttling controller (linear, quadratic, step (old behavior), PID (experimental)). Throttling at the lower threshold is weak and at the higher threshold strong. Please review the defaults by running ./op-batcher --help . Another important change is that the throttling threshold now takes all pending data into account, that is, all channels that are currently being submitted, the pending open channel that is currently being built, and the pending blocks that still need to be added to the pending channel. Before, throttling only took into account the pending blocks, which means that it may have triggered much too late if a high --max-pending-tx value was set (default: 1), which is common among high-throughput chain operators. Please read the new throttling documentation carefully to understand the new behavior and how to tweak it, if necessary. What's Changed op-batcher: improve default throttle parameters by @sebastianst in #17148 op-batcher: overhaul throttling flags by @geoknee in #17032 op-batcher: set throttling defaults by @geoknee in #16957 fix(op-batcher): introduce unsafe_da_bytes metric for driving the throttling controller by @geoknee in #16950 op-batcher: decrement pending bytes metrics when pruning pending blocks by @geoknee in #16940 feat(op-batcher): add admin rpc to flush the batcher by @geoknee in #16837 op-batcher: more consistent use of throttle multiplier and max threshold in logging by @geoknee in #16820 feat(op-batcher): make max throttle threshold more visible in logs and API by @geoknee in #16804 op-batcher: always use blobs while throttling by @joshklop in #16773 feat(op-batcher): Enhanced DA Throttling with multiple control mechanisms by @tobidae-cb in #16588 perf(op-batcher): start publishing and throttling sooner when loading a backlog of blocks by @geoknee in #16648 perf(op-batcher): discard channel compressor after frames generated by @geoknee in #16597 fix(op-batcher): remove duplicate check by @chuwt in #16696 New Contributors @tobidae-cb made their first contribution in #16588 @chuwt made their first contribution in #16696 Full Changelog : op-batcher/v1.14.0...op-batcher/v1.15.0 🚢 Docker Image https://us-docker.pkg.dev/oplabs-tools-artifacts/images/op-batcher:v1.15.0", "ingested_utc": "2025-08-21T13:40:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:02Z", "source": "NYTimes_Business", "title": "What Will Powell Do Now?", "url": "https://www.nytimes.com/2025/08/21/business/dealbook/powell-trump-cook-fed-independence.html", "id_key": "4b4349f8fc7225af3cd05bb2029fa9e40cce6b08fb848b5b73e90ba1e2e5db8f", "summary": "President Trump’s attack on a Federal Reserve governor comes as the White House seeks more control over the central bank. Will the Fed’s leader push back?", "ingested_utc": "2025-08-21T13:41:02Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:03Z", "source": "NYTimes_World", "title": "Analysis: What Progress Has Trump Really Made in Ukraine Peace Talks?", "url": "https://www.nytimes.com/2025/08/21/world/europe/russia-ukraine-peace-talks-trump.html", "id_key": "67d9d72a89ab0de6d552ac8bb35a3b18f7d0ef450aa6a943746b4b09841d20e3", "summary": "Nearly a week after President Trump’s Alaska summit, his suggestions of imminent breakthroughs have not come to pass.", "ingested_utc": "2025-08-21T13:41:03Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:03Z", "source": "NYTimes_World", "title": "Israel’s Operation to Take Control of Gaza City Looms. Where Does It Stand?", "url": "https://www.nytimes.com/2025/08/08/world/middleeast/israel-gaza-city-offensive.html", "id_key": "001e8a56362c553990e0f206b2120d896aee1e1603f8c1ec3d7b20796e243588", "summary": "The Israeli government is expanding its operation in Gaza, despite its generals’ advice and as it deliberates on a new cease-fire proposal.", "ingested_utc": "2025-08-21T13:41:03Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:03Z", "source": "NYTimes_World", "title": "Zelensky Says U.S. Talks Brought ‘Very Important’ Advance", "url": "https://www.nytimes.com/2025/08/21/world/europe/zelensky-ukraine-russia-trump-peace-talks.html", "id_key": "cc26ae108643ae9414b9fcbaab816791a29fb99d215ad8abf061c88dfbf34e16", "summary": "The Ukrainian leader returned with a U.S. commitment to participate in security guarantees for Kyiv in a postwar settlement.", "ingested_utc": "2025-08-21T13:41:03Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:03Z", "source": "NYTimes_World", "title": "A Miles-Long Cave in Kentucky Was a Smelly Disaster. Now It’s Spectacular.", "url": "https://www.nytimes.com/2025/08/20/climate/horse-hidden-river-cave-pollution-cleanup.html", "id_key": "9de37906e33b68b9a38477877c2927d831ada8f6931303faf88017e04c440156", "summary": "Hidden River Cave was once filled with heavy metals and sewage that made the surrounding town smell awful. After a cleanup, it became a tourist draw.", "ingested_utc": "2025-08-21T13:41:03Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:03Z", "source": "NYTimes_World", "title": "African Union Endorses Call to Abandon the Mercator Map", "url": "https://www.nytimes.com/2025/08/19/world/africa/africa-map-mercator.html", "id_key": "9541f1c53e7702e1763dbc99fb9904d7444f83d6e13055962fd4d2d976f1fb76", "summary": "A campaign is underway to replace the world’s most popular map, which the effort’s supporters say promotes a false view of the continent and its size.", "ingested_utc": "2025-08-21T13:41:03Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:10Z", "source": "NPR_Top", "title": "A Russian airstrike hits a U.S. factory in western Ukraine", "url": "https://www.npr.org/2025/08/21/g-s1-84146/russia-ukraine-american-factory", "id_key": "7e4d95c3883fd64c8edee25de5003b093d04bcf75ee19f6ff40647b3a486c4a7", "summary": "President Volodymyr Zelenskyy says a Russian cruise missile hit a U.S. electronics plant in the far west of Ukraine. The strike was part of an overnight barrage of more than 600 drones and missiles.", "ingested_utc": "2025-08-21T13:41:10Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:14Z", "source": "FT_Home", "title": "The illegal gold rush sweeping the world", "url": "https://www.ft.com/content/cc4f6203-4d78-4b1d-a431-82d0e10e7c47", "id_key": "d7d7735fdec201083a7bd188e2ca78725eedc6ef9d7e1a1f96d48342a29db495", "summary": "Historic price rally lures criminals and paramilitaries into illicit mining from the Amazon to Sudan", "ingested_utc": "2025-08-21T13:41:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:33Z", "source": "TheVerge_All", "title": "You can fine tune the resistance of the joysticks on GuliKit’s new controllers", "url": "https://www.theverge.com/news/763341/gulikit-tt-pro-max-wireless-switch-2-wake-controllers-adjustable-tension", "id_key": "5fc1979bf4ec66b3374dc09694b0fd66c4f25c0ebd2a443cbd4d948c49799467", "summary": "GuliKit was the first company to address the original Switch’s drifting issues with a Hall effect Joy-Con upgrade kit, and it released one of the first controllers that can remotely wake the Nintendo Switch 2. Its latest first, announced at Gamescom 2025 in Germany, is a pair of controllers with the ability to infinitely adjust […]", "ingested_utc": "2025-08-21T13:41:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:33Z", "source": "TheVerge_All", "title": "Google says a typical AI text prompt only uses 5 drops of water — experts say that&#8217;s misleading", "url": "https://www.theverge.com/report/763080/google-ai-gemini-water-energy-emissions-study", "id_key": "834c7f9b2d4dfdda3a044e0f3ad98dd8500a751166fbb076bbc0710e6ec9e43a", "summary": "Amid a fierce debate about the environmental toll of artificial intelligence, Google released a new study that says its Gemini AI assistant only uses a minimal amount of water and energy for each text prompt. But experts say that the tech giant's claims are misleading. Google estimates that a median Gemini text prompt uses up […]", "ingested_utc": "2025-08-21T13:41:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:33Z", "source": "TheVerge_All", "title": "Honor’s new flip phone will go with your Jimmy Choos", "url": "https://www.theverge.com/news/763298/honors-new-flip-phone-will-go-with-your-jimmy-choos", "id_key": "593442c880a02f373ecf1ae240c82d12b5abb725af70d1b67fca3c86111d7de1", "summary": "Honor has launched a new flip phone today, the Magic V Flip 2, and it arrives with a sparkly special edition in partnership with fashion designer Jimmy Choo. The former Huawei subsidiary has partnered with Choo before, for last year’s V Flip, and has kept to a similar formula this year, swapping glittery green for […]", "ingested_utc": "2025-08-21T13:41:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:33Z", "source": "TheVerge_All", "title": "Now Masimo is suing US Customs over Apple Watch imports", "url": "https://www.theverge.com/news/763291/apple-masimo-blood-oxygen-patent-customs-lawsuit", "id_key": "2ca9fe5b27391911d036f1487a3558f435eeb8457d24fc0d4fdf0466cba81556", "summary": "Medical tech company Masimo is suing US Customs and Border Protection (CBP) in an attempt to overturn the agency’s decision to allow Apple to restore the blood oxygen tracking feature on Apple Watches. Masimo said it only learned that the ban had been reversed after Apple announced a “redesigned” pulse oximetry feature last week, which […]", "ingested_utc": "2025-08-21T13:41:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:33Z", "source": "TechCrunch_All", "title": "Report: Meta is hitting pause on AI hiring after its poaching spree", "url": "https://techcrunch.com/2025/08/21/report-meta-is-hitting-pause-on-ai-hiring-after-its-poaching-spree/", "id_key": "e761e0b096908a7cdfd34da53cb7fbe74774af822c69758c2a7d3484ce58c907", "summary": "The freeze went into effect last week, and it’s not clear how long it will last, The Journal’s sources say. Meta is still likely working through its reorg, which split its AI unit, Meta Superintelligence Labs, into four new groups: TBD Labs, run by former Scale AI founder Alexandr Wang, and three groups focused on research, product integration, and infrastructure, respectively.", "ingested_utc": "2025-08-21T13:41:33Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:35Z", "source": "WIRED_All", "title": "7 Best Sunrise Alarm Clocks to Snag Before the Fall 2025 Time Change", "url": "https://www.wired.com/gallery/best-sunrise-alarm-clocks/", "id_key": "a4173677fd34051acb67d71e501eb14f9c9e006ef7dfea9d17a6df100c6b9f21", "summary": "If you want to wake up with the sun but aren’t a morning person, these bedside devices can simulate a sunrise whenever you want to rouse for the day (and a sunset too).", "ingested_utc": "2025-08-21T13:41:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:35Z", "source": "WIRED_All", "title": "The Best Gaming Headsets for Xbox, PS5, and PC (2025)", "url": "https://www.wired.com/gallery/best-gaming-headsets/", "id_key": "97c38e17d7978cb6d163c35274021d8c7aff18f0f8ab562896109580c635902c", "summary": "Lend depth and drama to your gameplay with the right gaming headset for any console or device.", "ingested_utc": "2025-08-21T13:41:35Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "Pick up the HORI Piranha Plant camera for Switch 2 while it's on sale for $40", "url": "https://www.engadget.com/deals/pick-up-the-hori-piranha-plant-camera-for-switch-2-while-its-on-sale-for-40-145031803.html?src=rss", "id_key": "bb1095ad21aba4db4634f390047128c2d807d92a7007c877fd9943bbe7a3cf57", "summary": "The HORI Piranha Plant camera for the Nintendo Switch 2 is on sale for just $40 , which is a discount of $20 and a record-low price. This is a great deal for those who own a Switch 2 and want to take advantage of the camera functionality in games like Mario Kart World and that recently-released campfire sim . This was designed specifically for Nintendo's new console, so it's a plug-and-play affair. It's actually cheaper than the official Switch 2 camera with this sale and it looks a whole lot cooler. It's a Piranha Plant from the Mario franchise. We called it a \"work of art\" upon encountering the device and that holds true today. This thing is not only stylish, resembling an Amiibo more than a camera, but it's downright useful. The pot the Piranha Plant sits in functions as both a stand and USB extension for the device. The plant itself detaches from the pot, so the camera can be used in portable mode by popping it into the USB port at the top of the console. There's also a built-in privacy shutter. Just close the plant's mouth to obscure the lens. The actual camera specs here aren't going to win any awards, with a frame rate of 30FPS and a resolution of 640 x 480p. However, that's more than enough to capture footage of your floating head to accompany your kart as it races through the Mushroom Kingdom. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/pick-up-the-hori-piranha-plant-camera-for-switch-2-while-its-on-sale-for-40-145031803.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "Masimo files lawsuit over Apple's 'redesigned' blood oxygen monitoring feature", "url": "https://www.engadget.com/wearables/masimo-files-lawsuit-over-apples-redesigned-blood-oxygen-monitoring-feature-130054895.html?src=rss", "id_key": "bdf94eb83d4f47af7c5571fcbfbe7ad8d21f1609bfd44fea640fece8ed882f79", "summary": "Masimo, the medical technology company whose lawsuit led to the temporary sales pause of the Apple Watch Series 9 and Ultra 2, has sued the US Customs and Border Protection days after Apple released its redesigned blood oxygen monitoring feature. This is just the latest update in the lengthy legal saga between Masimo and Apple, which started when the former sued the iPhonemaker in 2021, accusing it of infringing on several of its light-based blood oxygen monitoring patents. After a court sided with Masimo in 2023, Apple was forced to stop selling the Watch Series 9 and the Ultra 2 in the US for a few weeks. In order to circumvent the import ban for the devices, Apple removed the Blood Oxygen app for the watch models sold in the US. Just a few days ago, however, the company introduced a \"redesigned Blood Oxygen feature\" for the Watch Series 9, Series 10 and Watch Ultra 2 models. The feature works by measuring and calculating data from the watches' sensors on their paired iPhones instead. Users will then be able to view their blood oxygen data in the Respiratory section of the Health app. Apple said the update was \"enabled by a recent US Customs ruling.\" But Masimo said in its complaint (via Bloomberg Law ) that it only heard about the ruling, which was handed down on August 1, when Apple made the announcement. It argued that the agency typically requires both sides to be heard before making such decisions and that Customs \"exceeded its authority.\" Masimo is now asking the court to put an injunction on UCBP's decision and, ultimately, to only allow imports of the devices if their blood oxygen-tracking function is disabled. \"Each passing day that this unlawful ruling remains in effect irreparably deprives Masimo of its right to be free from unfair trade practices and to preserve its competitive standing in the US marketplace,\" Masimo said. This article originally appeared on Engadget at https://www.engadget.com/wearables/masimo-files-lawsuit-over-apples-redesigned-blood-oxygen-monitoring-feature-130054895.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "Insta360 launches new action camera with removable storage", "url": "https://www.engadget.com/cameras/insta360-launches-new-action-camera-with-removable-storage-130019177.html?src=rss", "id_key": "8acbda1fd1d2e53bad46688db4a69244b9e27df99d405f85d84aaf11618523ff", "summary": "Chinese action camera (and now drone ) company Insta360 has unveiled a premium addition to its lineup of compact cameras. The Insta360 GO Ultra is being billed as a new, more powerful product line in the GO series, instead of a replacement for the GO 3S . This next generation represents a substantial step up in performance, powered by a new 5nm AI chip, which is a big jump from the 14nm chip found on the GO 3S. It also benefits from a larger 1/1.28-inch sensor, roughly twice the size of the one in the 3S. All of this unlocks better image quality with support for HDR, 4K capture at 60 fps and double the frame rate of the 3S. The Ultra also offers PureVideo, an enhancement that uses AI-powered algorithms to reduce noise and increase brightness in low-light captures. The form factor for the Ultra is largely the same as the 3S, with a compact camera body that can be optionally housed in an Action Pod that offers additional battery life and a 2.5-inch flip touchscreen for live camera view. The Ultra weighs 53 grams (around 1.9 ounces), 14 grams more than the 3S, and sports a square body, as opposed to the pill-like shape of the 3S. The slightly larger body means a 70-minute standalone battery life, which is just over 80 percent more than the 38 minutes on the 3S. The Action Pod extends this to 200 minutes. The Ultra also offers removable storage, expandable up to 2TB. Like most Insta360 cameras , much of the design is geared toward action shots for the more adventurous among us. The GO Ultra's IPX8 rating means it's waterproof down to 33 feet underwater. A magnetic clip system makes it easy to attach the GO Ultra to a piece of clothing or equipment and start capturing your adventure in 4K. The Insta360 GO Ultra is available now worldwide for $450. This article originally appeared on Engadget at https://www.engadget.com/cameras/insta360-launches-new-action-camera-with-removable-storage-130019177.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "This Anker 5K magnetic power bank is 30 percent off right now", "url": "https://www.engadget.com/deals/this-anker-5k-magnetic-power-bank-is-30-percent-off-right-now-161505381.html?src=rss", "id_key": "368e52c70d14ada29dbeddf6160028330e0a2e1004ab3a339e2406925e3259a3", "summary": "The last thing anyone wants at the end of a long day is to look down at their phone and see its battery almost dead. One way to avoid that is to keep a compact power bank on you at all times, and it's arguably easiest to do that with one like Anker's 621 MagGo portable battery . This sleek, 5K magnetic brick attaches to the back of your iPhone to power it up, even while you're still using it. Now, it's on sale for 30 percent off — you can pick up any of five coloways for only $28 a pop. This is a thin and light device, so it's perfect for pockets, purses, backpacks and just about anywhere else. It charges up via an included USB-C cable. As a warning, the Anker 621 MagGo requires a magnetic connection via the smartphone itself or a magnetic case. It won't work with non-magnetic cases. It also runs a bit hot, reaching internal temperatures of up to 118 F, which could be something to keep an eye on during use. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/this-anker-5k-magnetic-power-bank-is-30-percent-off-right-now-161505381.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "China reportedly discouraged purchase of NVIDIA AI chips due to 'insulting' Lutnick statements", "url": "https://www.engadget.com/ai/china-reportedly-discouraged-purchase-of-nvidia-ai-chips-due-to-insulting-lutnick-statements-123055120.html?src=rss", "id_key": "cd3f5524df1078c1d58378d11eceb75c6f77097c2905f058a8aff5d3f6c6408e", "summary": "Chinese regulators reportedly dissuaded local companies from purchasing NVIDIA's H20 chips, because they found certain statements by US commerce secretary Howard Lutnick \"insulting.\" According to the Financial Times , the Cyberspace Administration of China (CAC), the National Development and Reform Commission (NDRC) and the Ministry of Industry and Information Technology (MIIT) teamed up to intensify their efforts to push the use of homegrown chips following Lutnick's remarks in an interview with CNBC . The US, if you'll recall, blocked NVIDIA from selling its H20 chips to China back in April out of concern that the Chinese military would use them to develop AI technology. When the US government reversed its decision in July and allowed the company to start shipping its chips to China, Lutnick told CNBC : \"We don't sell them our best stuff, not our second best stuff, not even our third best. The fourth one down, we want to keep China using it... The idea is the Chinese are more than capable of building their own. You want to keep one step ahead of what they can build, so they keep buying our chips. You want to sell the Chinese enough that their developers get addicted to the American technology stack. That's the thinking.\" To note, a previous Times report stated that the government allowed NVIDIA to ship its products to China again after agreeing to hand over 15 percent of its profits. As a response to Lutnick's remarks, the Times says Chinese authorities sought ways to prevent local companies from buying H20 chips. CAC issued an informal notice instructing China's biggest tech firms, such as ByteDance and Alibaba, to stop new orders for H20 chips until the government is done conducting a national security review. The companies are compelled to comply, because they could face substantial fines from the CAC if they don't. Meanwhile, NDRC also issued an informal notice, asking local tech companies not to purchase any NVIDIA chip. Reuters recently reported that NVIDIA is developing a new chip for the Chinese market that's more powerful than the H20, perhaps driven in part by China's move to discourage its purchase. It will be based on the company's Blackwell architecture, but will only be capable of half the computing power of NVIDIA's Blackwell Ultra GPUs. Their regulatory and export approval aren't guaranteed, but the president previously implied that he was aware of the project and said he expects NVIDIA CEO Jensen Huang to talk to him about it. This article originally appeared on Engadget at https://www.engadget.com/ai/china-reportedly-discouraged-purchase-of-nvidia-ai-chips-due-to-insulting-lutnick-statements-123055120.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "Get up to 77 percent off NordVPN two-year subscriptions", "url": "https://www.engadget.com/deals/get-up-to-77-percent-off-nordvpn-two-year-subscriptions-151807452.html?src=rss", "id_key": "40372130a01e4f7b7aa484a2e26b75e0903e982c1b423be542425b8e7a39898c", "summary": "There are dozens of VPNs to choose from, but to think they're all created equally would be a mistake. Some are better than others, and NordVPN sits squarely in the better category. Now, you can save up to 77 percent on most of NordVPN's plans. Arguably the best plan for most people is the NordVPN Plus plan , which you can get two years of access for only $108 right now. That's 73 percent off the usual rate, and NordVPN throws in an addition three months for free, so you're actually getting a 27-month subscription for the sale price. As well as Nord’s VPN service, a Plus plan also includes the Threat Protection Pro anti-malware tool, password management and an ad- and tracker-blocker. A Prime plan additionally comes with encrypted cloud storage or NordProtect, which insures you against identity theft and monitors dark web activity. That's also on sale — down to $189 on the same two-year commitment with those three additional months thrown in, which works out to a 77 percent savings on the regular price. When Engadget’s Sam Chapman reviewed NordVPN earlier this year, he praised its excellent download speeds, exclusive features and extensive server network. Less impressive is its clunky interface and inconsistent design when jumping between different platforms running a NordVPN app. While it doesn't quite make the cut in our guide to the best VPNs available right now, it generally performed well in speed tests and Threat Protection Pro is really worth having. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/get-up-to-77-percent-off-nordvpn-two-year-subscriptions-151807452.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "The best streaming deals: Save on YouTube TV, Disney+, Spotify and others", "url": "https://www.engadget.com/deals/best-streaming-service-deals-133028980.html?src=rss", "id_key": "af8382ba34efda9b9ecbaa274350f9ee5e71adc2ef26812cf8fa3c4250bae324", "summary": "If you’ve been shocked by how much you spend on streaming services lately, you’re not alone. Companies like Netflix, Disney, Max and others have been consistently raising prices to the point where you may question if streaming is even worth it anymore . We at Engadget still think it is, but we also think you should be smart with your money — and that’s where streaming deals come in. Yes, it is possible to get discounts on services like Peacock and Paramount+, even if those deals aren’t as common as a sale on AirPods. If you’re looking to save money and still stream all of the content you want, Engadget can help by laying out the best streaming deals you can get right now, how you can save with bundles and everything you should know before paying for yet another streaming service. Best streaming deals True streaming deals can be hard to come by. Most often, they’ll pop up during the Black Friday shopping period. On occasion, we’ll see them sparingly throughout the year and they usually take the form of a discounted monthly or annual rate for a limited period of time. Also, true streaming deals are typically on the ad-supported versions of a service, but once in a while you’ll find a unicorn of a deal on a tier that has ad-free viewing. If you’re able to wait for a deal before subscribing to a streaming service, we recommend doing so. You’ll save money upfront and in the long run, and you also have the option to cancel your subscription before the price goes back up to the normal rate. Maybe you find you like the service so much that you’re fine paying full price for it — that’s the ideal situation. But if you’re not compelled to keep that app on rotation in your smart TV, most streaming services make it easy for you to cancel at any time. With that said, these are the best streaming deals you can snag right now. DirecTV starting at $50/month for one month ($35 off): All of DirecTV's signature packages are $35 off right now for your first month when you sign up. If you opt for the base \"Entertainment\" package, you'll spend $50 for the first month and get access to over 90 channels, including many local stations as well as ESPN, ESPN 2 and Fox Sports 1. You'll also be able to watch on the go with the DirecTV mobile app. DashPass Annual + HBO Max (with ads) for $96/year ($144 off): This offer includes access to HBO Max with ads for no extra cost when you sign up for a DashPass Annual plan. You can then decide to upgrade to Max Standard, which removes ads, for a discounted rate of $11 monthly if you want. Aside from the obvious streaming benefits, this deal gives you $0 deliver fees and lower service fees on some restaurant DoorDash orders, five percent DoorDash credits on pickup orders, on-demand grocery delivery and other members-only exclusives. Spotify Premium Individual (3 month) for $0 ($36 off): This is our favorite music streaming service for podcasts and social features. Right now, users who have not signed up for Spotify's Premium service before are eligible to get three months for free. The Premium Individual plan lets you listen ad-free and skip songs at will. You can also organize your listening queue and download content for offline listening. Just be aware, your subscription will auto-renew at the end of the trial period. So if you don't want to be on the hook for the $12 monthly fee, set a reminder to cancel and go back to the free version. Fubo Pro for $55/month for the first month ($30 off): Fubo has introductory discounts on most of its packages, and the Pro package is the least expensive plan currently listed. It offers access to 224 channels, unlimited cloud DVR and up to 10 simultaneous streams. It even includes regional sports content from the NHL, MLB and NBA. YouTube TV (three months) for $150 ($99 off) : You can get three months of our favorite live TV streaming service for $50 per month. That should give you a decent chunk of time to see if the service is right for you while saving some cash. The discount and trial are only open to new subscribers to YouTube TV’s base plan, which includes access to over 100 channels, unlimited DVR space and six household accounts with the ability to stream on three devices at once. Sling Orange for $23/month for the first month (50 percent off): New customers can get Sling Orange or Sling Blue for half off the usual price for the first month, bringing the final prices to $23/month and $25.50/month, respectively. Orange is likely best for sports fans, with eight exclusive sports and family channels, while Blue includes 19 exclusive news and entertainment channels. You can get both Orange and Blue access also for half off for one month, or $33 total. Peacock first responders discount — one year for $48 (50 percent off) : Medical professionals and first responders can save 50 percent each year of Peacock. The deal requires annual verification and is open to those who work for either private or public institutions. Peacock has some great stuff to watch, including Poker Face and Killing It and more . Student discounts on streaming services HBO Max student discount — subscribe for $5/month (50 percent off): HBO Max offers their ad-supported tier to students for half off the usual rate. You’ll just have to verify that you’re a student through Unidays , and make note that this offer is only good for up to 12 months of service. Hulu student discount — subscribe for $2/month (75 percent off): Those with a valid student ID can get Hulu’s ad-supported tier for 75 percent off the typical rate. They’ll keep the same sale price for as long as they’re a student as well. Spotify student discount — Premium + Hulu with ads for $6/month (72 percent off): Spotify’s student offer continues to be one of the best around, giving you access to the Premium tier of the music streamer and Hulu’s ad-supported plan for only $6 monthly. Purchased separately, you’d pay $22 per month for both of the services. Plus, the first month is free when you sign up. NBA League Pass student discount — one year for $120 (40 percent off) : Students can get one year of League Pass for only $10 per month, which includes access to NBA TV and the ability to watch classic and archive games on-demand. On the NBA League Pass website, look for the student discount banner at the top and follow the instructions to verify your student status. Streaming bundle discounts There’s more consolidation happening now than ever before in the streaming space, and that means there are more streaming bundle options. These bundles offer you access to more content with one subscription price, but those prices are typically higher than paying for a single service by itself (obviously). It may be tempting to just get the bundle, but if only one of those services in the bundle speaks to you, you’ll spend less overall by just paying for the single service. Speaking of a deep love for a single streaming service: if all of your favorite shows are on Peacock or the latest releases on HBO Max consistently bring you joy, consider paying for one year upfront. Subscribing with an annual plan usually saves you money in the long term over paying on a monthly basis. Unfortunately, not all streaming services (looking at you, Netflix) have an annual subscription option. Here are some of the best streaming bundles you can get right now. Disney+, Hulu, HBO Max bundle with ads for $17/month : Ad-supported HBO Max is included here, along with full, ad-supported access to Disney+ and Hulu. You’ll save 43 percent with this bundle, as opposed to paying for all three services individually. Disney+ and Hulu Bundle Premium for $20/month : Disney and Hulu offer a few different bundles, which you can view in the drop-down lists under Choose Your Plan. This bundle removes the ads from both Disney+ and Hulu (with the exception of select live and linear content) and allows you to download content for offline viewing. You’ll save 42 percent with this bundle, as opposed to paying for both ad-free tiers individually. Hulu + Live TV with Disney+ and ESPN+ for $96/month: This streaming bundle amalgamation is a bit confusing but it does offer a lot: you get live TV streaming via Hulu’s service plus access to the following VOD services: Hulu, Disney+ and ESPN+. Out of those three, only ESPN+ will have ads. Disney+, Hulu, ESPN+ Bundle Basic for $17/month : You get full access to Disney+, Hulu and ESPN+ content with this package, albeit with ads across the board. This bundle price is 46 percent off the total price of all three separate subscriptions. Disney+, Hulu, ESPN+ Bundle Premium for $27/month : Similarly to the Duo bundles, the Premium version of the Trio removes ads from most content in Disney+, Hulu and ESPN+, and you can download content for offline viewing. This price represents a 43-percent savings when compared to paying for all three ad-free tiers separately. Sling TV + HBO Max starting at $53/month: Sling TV and HBO Max have partnered on a discount that gives new subscribers 50 percent off their first month of Sling TV, plus $5 off monthly when you subscribe to the Sling TV + HBO Max bundle. The standard price for the Sling Blue + HBO Max duo is roughly $58/month, so you'll get a monthly discount of $5 off that. In addition, for the first month only, you'll get half off the price of the bundle. The promotion also applies to the Sling Orange & Blue + HBO Max package, which has a standard price of $73/month. Paramount+ with Showtime for $13/month or $120/year : This includes everything in Paramount+’s Essential plan, except the ads, and also provides access to Showtime content, live CBS streams and download features. Read more streaming coverage The best live TV streaming services to cut cable The best streaming services: Netflix, Hulu, HBO Max and more The best streaming devices Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/best-streaming-service-deals-133028980.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "Alaska Air will offer Starlink in-flight internet starting next year", "url": "https://www.engadget.com/transportation/alaska-air-will-offer-starlink-in-flight-internet-starting-next-year-120023852.html?src=rss", "id_key": "3dcab3209b884a913539b6c32ad46485b713be05a9f97769487ddd49d9a8d449", "summary": "In-flight internet is crappy, but more and more airlines think that Starlink is the solution. The latest company to sign with the SpaceX affiliate is Alaska Air Group, which announced that it will start offering Starlink Wi-Fi next year and expand the service to its entire fleet by 2027. \"With Starlink already live on [Alaska Air Group subsidiary] Hawaiian Airlines, we're proud that we'll offer... gate-to-gate connectivity on nearly every aircraft across both airlines,\" CEO Ben Minicucci said in a statement. The company noted in a separate announcement that it will offer the perk for free to members of its new loyalty program called Atmos Rewards . T-Mobile, a partner with Alaska, will also offer a \"seamless, ad-free Wi-Fi log-on\" to the in-flight Starlink service, with more details to be announced later this year. Alaska Air touted the benefits of \"ultra-fast speeds... up to 7x faster than the geostationary satellite-based Wi-Fi systems that most airlines use today.\" Other airlines may jump on board soon, too. British Airways is also on the verge of announcing a Starlink deal, Bloomberg reported, and SpaceX has also reportedly been in conversation with Dubai's Emirates. Both of those are flagship carriers in their respective nations, so winning the business would be a large coup for Starlink against legacy operators like Viasat and Echostar. Switching to Starlink isn't necessarily cheap, though. It reportedly costs around $300,000 to equip a 737 and around half a million to install the system on a 787 Dreamliner. On top of that, airlines pay around $120 monthly per seat, plus another $120 for live TV, according to Bloomberg 's sources. (None of the airlines in negotiations have confirmed any details.) Despite those costs, carriers see reliable in-flight internet as a potential game-changer, as it would allow customers to work, communicate and stream videos or live TV. If the latter can be done reliably, it might even allow airlines to get rid of heavy and expensive on-demand entertainment systems. The main downside for potential customers is SpaceX's owner, Elon Musk. Some may view his fractured relationship with US president Donald Trump as a negative, while end-users may be turned off by his political affiliations — something that has seemingly affected sales of his Tesla EVs of late. This article originally appeared on Engadget at https://www.engadget.com/transportation/alaska-air-will-offer-starlink-in-flight-internet-starting-next-year-120023852.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:36Z", "source": "Engadget_All", "title": "MasterClass subscriptions are 50 percent off in this Labor Day sale", "url": "https://www.engadget.com/deals/masterclass-subscriptions-are-50-percent-off-in-this-labor-day-sale-133223847.html?src=rss", "id_key": "7543ec42fd268b37ad22a6fe09665508296c9fd329d2670eb93dc60308c9a9fd", "summary": "MasterClass promises online learning with instructors who are the very best in their fields, and an annual subscription is currently 50 percent off across all tiers. Subscribers to MasterClass will have access to over 200 classes taught by iconic authors, chefs, athletes and leaders representing a diverse collection of skill sets and backgrounds. With a subscription, you could watch a class on writing taught by James Patterson, or learn cooking techniques from Thomas Keller. If you're trying to impress at your next pickup basketball game you could learn about shooting, ball-handling and scoring from Steph Curry. Each class includes around 20 video lessons that run about 10 minutes long on average, as well as an in-depth workbook. MasterClass has also begun producing some original series for its platform. The series Business Rebels features different CEOs walking viewers through the strategies that helped them disrupt their industries. One entitled Skin Health features top dermatologists and a cosmetic chemist walking viewers through keeping their skin healthy through cleansing routines and specific beauty products. The wide range of skills or life lessons you could learn through these classes is why MasterClass is on our list of best subscriptions you can give as gifts . Maybe your loved one who loves to host dinner parties could use some tips from Gordon Ramsay. There are three subscription tiers for MasterClass that each differ only in how many devices they allow at one time, and whether offline videos are supported. The Standard subscription only supports one device, whereas the Plus subscription allows two. These are normally $10 and $15 per month, respectively, and neither offers offline mode. The Premium tier, which carries a regular price of $20 per month, allows up to six devices and features offline mode for downloaded classes. All three tiers are part of the 50 percent off sale, which marks them down to $5, $8 and $10 respectively. MasterClass bills annually, so be sure to calculate the total from the \"monthly\" price before deciding. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/masterclass-subscriptions-are-50-percent-off-in-this-labor-day-sale-133223847.html?src=rss", "ingested_utc": "2025-08-21T13:41:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:45Z", "source": "TheStreet_Top", "title": "Immigration and Customs Enforcement is looking to buy a lot of planes to deport people", "url": "https://www.thestreet.com/travel/ice-buying-planes-for-deportations-kristi-noem", "id_key": "ecde24721490ec3a0460bcae9453b730d05c3d49fb9d00774e1536cc0e69a61f", "summary": "Homeland Security Secretary Kristi Noem is leading the efforts to buy more planes to conduct deportation campaigns.", "ingested_utc": "2025-08-21T13:41:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:45Z", "source": "TheStreet_Top", "title": "Top analyst resets Nvidia price target for one surprising reason before earnings", "url": "https://www.thestreet.com/technology/top-analyst-resets-nvidia-price-target-for-one-surprising-reason-before-earnings-", "id_key": "96a67d3ca52aa11525725b38de920f166a8bad8bf845ab3df8ae465df8645644", "summary": "The Nvidia call rests on a factor Wall Street hasn’t fully priced in yet.", "ingested_utc": "2025-08-21T13:41:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:45Z", "source": "TheStreet_Top", "title": "Home Depot and Lowe’s share a warning for homeowners", "url": "https://www.thestreet.com/retail/home-depot-lowes-quietly-raising-prices-due-to-tariffs", "id_key": "aea7fdcded081f9284b5c46e3e28d39928ea7f786972c1a308c1f45e81c1288f", "summary": "Both home improvement companies have been reluctant to admit that some prices have already increased, and others will go up.", "ingested_utc": "2025-08-21T13:41:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:45Z", "source": "TheStreet_Top", "title": "Fed official sends strong message on digital payments", "url": "https://www.thestreet.com/fed/fed-governor-hails-new-revolution-in-banking", "id_key": "a7b01a267acd18ae650ad15e9bc9375208821cca332b32c38b88e4ff4d2e5b02", "summary": "Private-sector innovation and Fed collaboration in modernizing U.S. payment systems are key to rising stablecoin adoption.", "ingested_utc": "2025-08-21T13:41:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:46Z", "source": "AlJazeera_All", "title": "Displacement again? Families divided in Gaza over whether to stay or leave", "url": "https://www.aljazeera.com/news/2025/8/21/displacement-again-families-divided-in-gaza-over-whether-to-stay-or-leave?traffic_source=rss", "id_key": "401c9086cc34938ed8a06ddeb058dceaf687f507f1de44341af2c9553373982a", "summary": "Israel plans to seize Gaza City, forcing Palestinians there to decide whether to evacuate once again, or risk staying.", "ingested_utc": "2025-08-21T13:41:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:46Z", "source": "AlJazeera_All", "title": "What to know as Israel begins its planned offensive to seize Gaza City", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/21/what-to-know-as-israel-begins-its-planned-offensive-to-seize-gaza-city?traffic_source=rss", "id_key": "74e6a1bebd8e490251fbfd32cc078d03d2303c98f631d912a72f7f3814b61efd", "summary": "Israeli troops have begun advancing on Gaza City as part of the military's plan to besiege and occupy the area.", "ingested_utc": "2025-08-21T13:41:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:46Z", "source": "AlJazeera_All", "title": "Trump’s occupation of DC is a rehearsal for autocracy", "url": "https://www.aljazeera.com/opinions/2025/8/21/trumps-occupation-of-dc-is-a-rehearsal-for-autocracy?traffic_source=rss", "id_key": "40b59a8f814023e92c4fe0981fa2fea6598137321d55b7714fad50069d293912", "summary": "By federalising the capital’s police and stifling protests, Trump is testing how far he can go to remake the US.", "ingested_utc": "2025-08-21T13:41:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:46Z", "source": "AlJazeera_All", "title": "Ukrainian man arrested in Italy over Nord Stream pipeline blasts", "url": "https://www.aljazeera.com/news/2025/8/21/ukrainian-suspected-in-nord-stream-pipeline-blasts-arrested-in-italy?traffic_source=rss", "id_key": "29a79cba38a61efea78f87c4b88f5cc8adaff4b68ffeb25d62ccb2c5c5066de5", "summary": "Serhii K was part of crew who planted devices on the pipelines, the German prosecutor's office said.", "ingested_utc": "2025-08-21T13:41:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:46Z", "source": "AlJazeera_All", "title": "LIVE: Israel starves two Palestinians to death; Gaza City attacks intensify", "url": "https://www.aljazeera.com/news/liveblog/2025/8/21/live-israel-intensifies-gaza-city-attacks-west-bank-settlement-condemned?traffic_source=rss", "id_key": "9f2f1c61c14d1aea0c5adae41a1da3c233df870336686ffd7dc7d6f9d400d3e9", "summary": "Israel is intensifying attacks on Gaza City, which it plans to seize, as world leaders condemn E1 settlement project.", "ingested_utc": "2025-08-21T13:41:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "Andersen Consulting Expands Presence Through Collaboration with Ignis", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/andersen-consulting-expands-presence-through-collaboration-with-ignis", "id_key": "2a56dd520d0171ccaea4859189bb1b0e15521fec99ab41db535c48142c584f9c", "summary": "SAN FRANCISCO — Andersen Consulting adds depth to its strategy capabilities with collaborating firm Ignis, a leading media agency, reinforcing the organization’s commitment to delivering seamless solutions to clients globally. Founded in Buenos Aires, Ignis has earned a reputation for helping organizations build and achieve their brand objectives. With expertise in marketing communications strategy, market […]", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "EnWave Corporation Announces Closing of Fully Subscribed $3 Million LIFE Offering", "url": "https://financialpost.com/globe-newswire/enwave-corporation-announces-closing-of-fully-subscribed-3-million-life-offering", "id_key": "bc5061610608fc9ec277a1068af31d943e6afd8aadbae352db50efd392f796c0", "summary": "Not for distribution to United States newswire services or for dissemination in the United States VANCOUVER, British Columbia, Aug. 21, 2025 (GLOBE NEWSWIRE) — EnWave Corporation (TSX-V:ENW | FSE:E4U) (“EnWave”, or the “Company”) is pleased to announce that it has closed its fully subscribed private placement offering (the “Offering”) of common shares of the Company […]", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "Blackstone Makes Fresh $1.6 Billion Bet in Electrification Play", "url": "https://financialpost.com/pmn/business-pmn/blackstone-makes-fresh-1-6-billion-bet-in-electrification-play", "id_key": "b617a25ce327f89071c0bb13f842c15fb8d59a1070a8f2a0e1fe18de85eded6a", "summary": "Blackstone Inc. has struck a deal to acquire electrical equipment services provider Shermco in its latest bet on the increasingly critical role of electrification.", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "KFSHRC Saves Saudi 7-Year-Old Through Cross-Border Heart Transplant with UAE Donor Organ", "url": "https://financialpost.com/globe-newswire/kfshrc-saves-saudi-7-year-old-through-cross-border-heart-transplant-with-uae-donor-organ", "id_key": "4a12423263c230e33734608ee8863beb8e129296a2d057c6c6e99682fe3c0495", "summary": "RIYADH, Saudi Arabia, Aug. 21, 2025 (GLOBE NEWSWIRE) — King Faisal Specialist Hospital and Research Centre (KFSHRC) in Riyadh has successfully performed a life-saving heart transplant on a 7-year-old Saudi child using an organ donated by a brain-dead donor in Abu Dhabi, United Arab Emirates. The complex procedure was made possible through seamless cross-border cooperation […]", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "Altus Group Releases Q2 2025 U.S. Investment & Transactions Quarterly Report", "url": "https://financialpost.com/globe-newswire/altus-group-releases-q2-2025-u-s-investment-transactions-quarterly-report", "id_key": "310490a700e575be5cdb0a488567f77f0b13d743a3086ca7c4eb785df32d15f5", "summary": "Multifamily and office transactions saw strong gains in Q2 2025 NEW YORK, Aug. 21, 2025 (GLOBE NEWSWIRE) — Altus Group Limited (“Altus Group”) (TSX: AIF), a leading provider of commercial real estate (“CRE”) intelligence, today released its CRE Investment & Transactions Quarterly Report, covering U.S. transaction activity for Q2 2025. In Q2 2025, the U.S. […]", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "Montrose Environmental Group Secures 5-Year Partnership with Global Energy Leader to Restore Land, Water and Wildlife Across Western Canada", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/montrose-environmental-group-secures-5-year-partnership-with-global-energy-leader-to-restore-land-water-and-wildlife-across-western-canada", "id_key": "50ad75168fe30c500cbbb67884e25c7716dca4e758fd4e17806c41b3bf898e98", "summary": "Contract helps support local jobs, protect food and water supplies, and restore native habitats CALGARY, Alberta — Montrose Environmental Group, Inc. (NYSE: MEG), is on a mission to help protect the air we breathe, the water we drink, and the soil that feeds us to enhance environmental stewardship while supporting economic development. Today, the company […]", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "Real Chemistry Launches Healthcare-First AI Search Solution", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/real-chemistry-launches-healthcare-first-ai-search-solution", "id_key": "189f7f84b78acbd58cfd602e2ec5fa1e0f84b113dba6c4d799854e93e5a7a739", "summary": "NEW YORK — Real Chemistry, a leader in AI-driven insights and marketing communications for the healthcare sector, today announced the launch of HealthGEO – an AI search solution purpose-built for life sciences communicators and marketers, helping teams monitor, manage, and shape how AI search frames their science, story, and reputation. As AI search increasingly influences […]", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "Scott Moe, agriculture minister to discuss Chinese canola tariffs", "url": "https://financialpost.com/commodities/agriculture/scott-moe-agriculture-minister-to-discuss-chinese-canola-tariffs", "id_key": "70e8db3aac39464a52ae9e822f1afeb74623a9467a03da2947cd5382e806723c", "summary": "China imposed a canola tariff of nearly 76% last week", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:52Z", "source": "FinancialPost_Business", "title": "Cintas Corporation Recognized as One of Selling Power’s 60 Best Companies to Sell For in 2025", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/cintas-corporation-recognized-as-one-of-selling-powers-60-best-companies-to-sell-for-in-2025", "id_key": "8007e47da30e9afb1f87884a8c9284781e491e661525707c5c989b6bd6ddb457", "summary": "This marks the 20th consecutive year that Cintas has been recognized on this prestigious list. CINCINNATI — Selling Power has recognized Cintas Corporation (Nasdaq: CTAS) as one of the country’s 60 Best Companies to Sell For in 2025. This marks the 20th straight year Cintas has made the industry publication’s list and places it among […]", "ingested_utc": "2025-08-21T13:41:52Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:41:59Z", "source": "Nikkei_Asia_Top", "title": "Tencent to bring more AI services to Japan, Southeast Asia: executive", "url": "https://asia.nikkei.com/business/technology/artificial-intelligence/tencent-to-bring-more-ai-services-to-japan-southeast-asia-executive", "id_key": "6de2cae1100730dd3b9468f258ed2685f6ef4e03c81dcf5950d7fbec354bf58b", "summary": "", "ingested_utc": "2025-08-21T13:41:59Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:42:06Z", "source": "MIT_TechReview", "title": "The Download: Ukraine’s Starlink repair shop, and predicting solar storms", "url": "https://www.technologyreview.com/2025/08/21/1122298/the-download-ukraines-starlink-repair-shop-and-predicting-solar-storms/", "id_key": "b2558cfa9835557d0dbbf8dbf09d20a154ea845b22204837e26c8924ac63f190", "summary": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. On the ground in Ukraine’s largest Starlink repair shop Starlink is absolutely critical to Ukraine’s ability to continue in the fight against Russia. It’s how troops in battle zones stay connected with faraway…", "ingested_utc": "2025-08-21T13:42:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:42:06Z", "source": "MIT_TechReview", "title": "In a first, Google has released data on how much energy an AI prompt uses", "url": "https://www.technologyreview.com/2025/08/21/1122288/google-gemini-ai-energy/", "id_key": "0276c98a358c72811c57c627699e13b37cc75b36eb0d417dfc4e46bd245f799d", "summary": "Google has just released a technical report detailing how much energy its Gemini apps use for each query. In total, the median prompt—one that falls in the middle of the range of energy demand—consumes 0.24 watt-hours of electricity, the equivalent of running a standard microwave for about one second. The company also provided average estimates…", "ingested_utc": "2025-08-21T13:42:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:42:07Z", "source": "HackerNews_Top", "title": "Show HN: ChartDB Cloud – Visualize and Share Database Diagrams", "url": "https://app.chartdb.io", "id_key": "0b0eaca5cd4053141a938a4b72b734b47b2c795d4aa06b9a67a6cfe8c46e135d", "summary": "Comments", "ingested_utc": "2025-08-21T13:42:07Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T13:42:07Z", "source": "HackerNews_Top", "title": "The Open-Office Trap (2014)", "url": "https://www.newyorker.com/business/currency/the-open-office-trap", "id_key": "f8826d37235a41e6eae631d37e043686f7e9516772d28667451b4edbe6c79b2a", "summary": "Comments", "ingested_utc": "2025-08-21T13:42:07Z"}
