{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:23:57Z", "source": "BBC_World", "title": "Man who alleged hundreds were raped and buried in Indian temple town arrested", "url": "https://www.bbc.com/news/articles/cgm2z9zjgx7o?at_medium=RSS&at_campaign=rss", "id_key": "c68ba2aec668955bf60f69db07e2496695dbce00242c0116129e1d7197437e89", "summary": "The former temple cleaner's startling claims threw the town of Dharmasthala in Karnataka into turmoil.", "ingested_utc": "2025-08-23T11:23:57Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:24:01Z", "source": "Guardian_World", "title": "More than 200,000 UK workers switch to four-day week since 2019", "url": "https://www.theguardian.com/business/2025/aug/23/uk-workers-four-day-week", "id_key": "2f6d18eeeba0088d5729cf51d185792d97ffe6a2570902544f92564749caf9d3", "summary": "Nearly 11% of the workforce now report doing four days across full- and part-time work, analysis finds More than 100,000 workers in the UK have switched to a full-time four-day week since the pandemic, in a further sign of the revolution in the world of work inspired by Covid, according to an analysis. Nearly 1.4 million people said they worked full-time on four days of the week between October and December 2024, an increase of more than 100,000 compared with the same period in 2019, when 1.29 million reported this work schedule, according to figures from the Office for National Statistics (ONS). Continue reading...", "ingested_utc": "2025-08-23T11:24:01Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:24:01Z", "source": "Guardian_World", "title": "‘Shameful’: Democrats join call for closure of Texas immigration jail", "url": "https://www.theguardian.com/us-news/2025/aug/23/democrats-texas-immigration-jail", "id_key": "57f3781d9987e7875d87eaca139307952bf2109607e1e64b5ae980a443d905b0", "summary": "Camp at Fort Bliss base on US-Mexico border described as ‘dangerous misuse of military land and resources’ Prominent Democratic lawmakers and legal advocates have called for the new immigration detention camp at Fort Bliss military base to be shut down amid accusations of lack of external oversight and concerns over access to legal services. Camp East Montana began full operation last weekend as a sprawling tent facility across acres of military land in the eastern part of El Paso, on the US-Mexico border in west Texas , amid rapid expansion plans and much controversy. Continue reading...", "ingested_utc": "2025-08-23T11:24:01Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:24:01Z", "source": "Guardian_World", "title": "Survivor of abuse at Florida all-boys school finally gets diploma at 75", "url": "https://www.theguardian.com/us-news/2025/aug/23/dozier-school-florida-diploma", "id_key": "eefacb520125e821860b028be276ea7da2ce30d14b4b5e0e7648f4034db3a847", "summary": "Eddie Horne attended Dozier School for Boys in 1960s, a state-run institution known for molestation and beatings A 75-year-old Florida man has just received his high school diploma decades after his education was derailed by severe abuse that he endured as a teenager while attending a notoriously brutal reform school. As he recounted to the local news outlets WTVT and WTSP , Eddie Horne’s stroll across the graduation stage at a ceremony Thursday at St Petersburg high school in Pinellas county, Florida, fulfilled a goal that he set for himself after fighting to overcome the trauma inflicted on him beginning at age 14 at the state-run Dozier School for Boys. Continue reading...", "ingested_utc": "2025-08-23T11:24:01Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:26:22Z", "source": "NPR_Top", "title": "Tinted sunscreen does something regular sun protection can't", "url": "https://www.npr.org/2025/08/23/nx-s1-5507260/hyperpigmentation-tinted-sunscreen-protection", "id_key": "dcc1543147a497d4894648c287b565dc1cadaffa2055f6ee33379bfd1a663e0e", "summary": "Most sunscreens protect skin from UV light but the tinted variety also block visible light. And that can be important for people with hyperpigmentation or melasma, especially those with darker skin.", "ingested_utc": "2025-08-23T11:26:22Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:26:22Z", "source": "NPR_Top", "title": "Photos: The perilous lives of 'artisanal coal miners'", "url": "https://www.npr.org/sections/goats-and-soda/2025/08/23/g-s1-82257/photos-the-perilous-lives-of-artisanal-coal-miners", "id_key": "0107cad1c362bb4757fad24ed61ac21f916437e2b8669945841c7532ee3bdb23", "summary": "'Artisanal miners' is the phrase used for South Africans who salvage coal from abandoned mines. It's a grueling and risky life. \"Bit by bit it's killing something inside me,\" says one such miner.", "ingested_utc": "2025-08-23T11:26:22Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:26:27Z", "source": "FT_Markets", "title": "Investors look to S&P’s ‘forgotten 493’ stocks as megacap tech wobbles", "url": "https://www.ft.com/content/9312c8f0-f7ab-4961-b008-5a7885edce7d", "id_key": "63fa11dcb7535a06acc0c30a29d6e80765f6bc81fb2a743ecd34adb95953dc0f", "summary": "Equal-weighted portfolio has outperformed main index in recent days after long period lagging behind", "ingested_utc": "2025-08-23T11:26:27Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:26:43Z", "source": "ArsTechnica_All", "title": "Why wind farms attract so much misinformation and conspiracy theory", "url": "https://arstechnica.com/science/2025/08/why-wind-farms-attract-so-much-misinformation-and-conspiracy-theory/", "id_key": "4836a4dbb0fcd9c728c41e88396b42d9c0ea599704235c134e349311ef00e454", "summary": "If you think climate change is a hoax, you might believe wind turbines poison groundwater.", "ingested_utc": "2025-08-23T11:26:43Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:26:44Z", "source": "WIRED_All", "title": "Climate Change Is Bringing Legionnaire’s Disease to a Town Near You", "url": "https://www.wired.com/story/this-deadly-bacteria-was-once-an-only-in-new-york-problem-not-anymore/", "id_key": "ff80d5295b7dc643278bae7db993095e0b4958fcf6e7abbc0326bc91c202cdae", "summary": "This deadly bacteria, which hits low-income people the hardest, was once an “only in New York” problem. Extreme heat is now increasing its prevalence.", "ingested_utc": "2025-08-23T11:26:44Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:26:45Z", "source": "Engadget_All", "title": "Surfing sand and sea, herding beasts and other new indie games worth checking out", "url": "https://www.engadget.com/gaming/surfing-sand-and-sea-herding-beasts-and-other-new-indie-games-worth-checking-out-110053175.html?src=rss", "id_key": "00f4fbddc9d2d810a05a90c07a16f4a08b817a8d1dda34c371b2aa72d4a8aad4", "summary": "Welcome to our latest recap of what's going on in the indie game space. It's been a very busy week in that realm, thanks to Gamescom. Before we jam through a few of this week's new releases and some of the many, many Gamescom reveals, there's one game that has risen high above the din to the point where it's drowning out many of the smaller announcements. Yes, Hollow Knight: Silksong has a release date , and it's very, very soon. September 4, in fact. I feel for all the developers who have games coming out around the same time, such as Cronos: The New Dawn , Hell is Us, Baby Steps and even NBA 2K26 . Sure, Silksong may primarily be for a different audience than the latest edition of a massive basketball franchise, but it's going to take up much of the oxygen in the gaming space for a while. As such, some developers are delaying their games to give Silksong a wide berth. CloverPit was scheduled to drop on September 3, but it's getting the hell out of Silksong 's way. The grimy, slot machine-based roguelike is now going to arrive on September 26. \"We like a gamble, but this one is too risky lol,\" developer Panik Arcade said. \"We want to give ourselves and our fans some time to enjoy Silksong , so we’re launching a few weeks later and will use the time to polish CloverPit even further.\" Meanwhile, Talegames is pushing back the 1.0 release of its adventure RPG Faeland and Aeternum Game Studios is delaying a Metroidvania called Aeterna Lucis from September into 2026. There's no doubt that Silksong's arrival is a big deal. It's been the most wishlisted game on Steam for yonks, was a focus of Microsoft's Xbox Ally handheld reveal and is a sequel to an indie blockbuster that has now sold more than 15 million copies . In any case, we'll soon find out if that very, very long wait was worthwhile. Years of Silksong memes sure were. I’m going to need some other long-awaited game to joke about before every showcase now. New releases I have no earthly idea why it took me so long to try this, but I tested my PlayStation Portal by my building's pool for the first time this week and it turned out that the Wi-Fi was, in fact, strong enough there for me to use the handheld. It was a fitting place to check out Sword of the Sea , which hit PS5 (including on PlayStation Plus Extra and Premium) and PC this week. I'm only an hour or so into this $30 game from Giant Squid, but I'm enjoying the relaxed approach to exploration here. As you'd might expect from developers who have worked on The Pathless , Abzu and Journey , the movement in Sword of the Sea is delightful . You'll take off from wavy dunes and pull off tricks like you're in an SSX game as you surf across sand and water on a sword in the aim of restoring life to the barren landscape. Sword of the Sea is a looker, and I'll surely be getting lost in it some more over the coming days. Speaking of games that have an eye-catching aesthetic, Herdling is another exploration and adventure title that dropped this week. This one's from Okomotive ( Far: Changing Tides, Far: Lone Sails ) and publisher Panic. Here, you'll be guiding a ragtag herd of beasts across hilly terrain toward the summit of a mountain. You'll have to solve some \"light\" environmental puzzles and even endure some stampedes along the way. Herdling typically costs $25, but there's a 25 percent launch discount. It's available on Steam , Epic Games Store , PlayStation 5, Xbox Series X, Nintendo Switch and Switch 2. It's on Game Pass Ultimate and PC Game Pass too. With Ball x Pit on the horizon, I figured we were all taken care of for the foreseeable future as far as Breakout -esque roguelites go. Not so fast, said the team behind Vampire Survivors . Poncle has spun up its own publishing arm and the second game it's releasing (after Berserk or Die ) is Kill the Brickman from Doonutsaur. Poncle released the game on Steam and Xbox without prior warning this week, and it costs five bucks. You'll collect and augment various bullets that you use to destroy bricks from outer space. There's a lot going on in the minute-long trailer, but I particularly love how some of the bricks \"cry\" when a bullet smacks into them. Discounty is a life sim about managing a supermarket in a small town. Hopefully, you'll be a more magnanimous proprietor than the operators of the JoJa Mart in Stardew Valley , but you'll still have to deal with some folks who are none too pleased about the effect of the business on their town. Developer Crinkle Cut Games and publisher PQube suggest there are some secrets to discover in Discounty , which is out now on Nintendo Switch, PS4, PS5, Xbox One, Xbox Series X/S, Steam and Epic Games Store . It's coming to GOG as well at a later date. The game typically costs $20, though there's a 20 percent launch discount on PC. Upcoming Engadget senior reporter Igor Bonifacic spent a few hours with Absolum , a fantasy beat-'em-up with a roguelite spin from co-developers Guard Crush Games and Supamonk and publisher Dotemu ( Teenage Mutant Ninja Turtles: Shredder’s Revenge , Streets of Rage 4 ). I highly recommend reading his write up for the full lowdown as Absolum sounds like a real treat. The demo for this slipped through the cracks for me during the early June chaos of Summer Game Fest and Steam Next Fest, but it's still available and I'll absolutely be checking it out to get a taste of Absolum before it arrives on October 4. It's coming to Steam , Nintendo Switch, PS4 and PS5. As I mentioned in our liveblog for Gamescom Opening Night Live this week, any new Ron Gilbert game is worth getting excited about. He's the director of the first two Monkey Island games and Return to Monkey Island , as well as a developer and producer of so many other projects over the years. Death by Scrolling . is something completely different for Gilbert. It's a vertical-scrolling, action-heavy roguelite in which you need to stay alive and earn enough gold to pay a toll to a ferryman to escape from the afterlife. The look is very heavily reminiscent of Stardew , so if plundering the mines in that game was more your jam than farming and fishing, this might be up your alley. There's no release date as yet for Death by Scrolling , which Gilbert started working on back in 2019, but it's said to be coming this year. In the meantime, you can read updates about the game's development on Gilbert's terrific blog . It's fun that we had mentions of two John Carpenter-related projects at Gamescom this week. Not only was there another look at John Carpenter's Toxic Commando during Opening Night Live , there was the reveal of Halloween the Game from IllFonic and co-publisher Gun Interactive. Set to arrive in 2026, Halloween the Game follows the likes of Friday the 13th: The Game (from the same teams) and the Gun-published The Texas Chain Saw Massacre. It has a 1 vs. 4 asynchronous multiplayer mode in which the quartet will have to use anything at their disposal — from wielding weapons to calling the cops — to survive the threat of the unkillable Michael Myers. There's going to be a single-player aspect to this game as well, as you'll be able to control the legendary mass killer in an adaptation of the original film's story. Halloween the Game is coming to PlayStation , Xbox , Steam and Epic Games Store . A game about a guy with a brown backpack who scours ruined, overgrown suburban homes in search of valuable resources that can help him survive a bunch of zombies in the post-apocalypse? It has to be Long Gone , of course! What other game could you possibly be thinking of? This is a linear pixel-art narrative adventure from Hillfort Games and co-publisher Outersloth ( Among Us studio Innersloth's publishing wing ). The developers seem to have been influenced by a little game you might have heard of called... Gone Home , as you'll look through the belongings of people who used to live in this world and learn the truth about what happened. There's no combat here. Instead, zombie encounters require puzzle solving. There's no release window as yet for this point-and-click game, which is coming to Steam . Fittingly enough, I've had my eye on Militsoner for some time, so I was delighted to hear that there's a two-week playtest on Steam that's open to everyone. This is an immersive sim in which you'll try to escape a town, but that may not be too easy as there's an enormous policeman watching your every move. The playtest is limited to a slice of the town, but I'm really looking forward to getting in there and finding out what this is all about. I have to hold my hands up here and admit I'm not familiar with puzzle game maker Rusty Lake. But when the trailer for their next game popped up this week, it had me utterly captivated, because Servant of the Lake looks very, very pretty. This is a point-and-click puzzle adventure that will see you carrying out tasks as seemingly innocuous as straightening picture frames to helping with experiments and cleaning up afterward. You'll play as a housekeeper of an estate, but it's not entirely clear whether you'll be able to survive the weekend... Servant of the Lake is coming to Steam , Itch.io, iOS and Android in Spring 2026. BPM: Bullets Per Minute developer Awe Interactive is back with another rhythm-based shooter, albeit one that has a top-down perspective instead of a first-person one. BPM Bitcrushed (which is being published by Kwalee) is a roguelite, pixel art dungeon crawler that syncs shooting, jumping and dodging to the beat. The dungeons are procedurally generated and there's a \"wide variety of powerful weapons, unique items and rhythm-based abilities\" to discover. What's most interesting to me here though is that, along with the game's own soundtrack, you can load in your own tunes via the custom music feature. Perhaps setting the action to some slow-tempo sludge metal will make things a bit easier. Couch Planes is an arcade plane racer from Skylab Interactive that's coming to Steam , Epic Games Store and consoles next year. There are a few different modes, 15 maps with environmental hazards and collectable power ups including homing rockets, mines and speed boosts. There's support for four-person local multiplayer and 12-player online action. From Starfox and Grand Theft Auto V to The Falconeer and Microsoft Flight Simulator 2024 , I've never been much good at flying in games. But hey, Couch Planes looks like it could be a fun time with friends. Let's close out this bumper post-Gamescom edition of our indie games roundup with something that might not be for me, but could be for you. Canvas City is the first project from Disc 2 Games, which is self-publishing the game with help from Dredge studio Black Salt Games. Turn-based tactics games aren't typically my jam, but I'm always going to have at least some interest in one that's about a group of upstarts rebelling against an oppressive force. In this case, you'll take charge of skaters and street artists who are fighting back in a \"vibrant yet suppressed urban world\" (which sounds a little similar to Unbeatable , which this week got a November 6 release date). What caught my attention here is that fluid movement is a key part of the game. When it's your turn, you can use rails, ramps and other parts of the environment to pull off combinations of tricks and attacks. These chained actions can also earn you Style Points that can enhance your abilities. Disc 2 hasn't revealed a release window for Canvas City as yet. It's in development for Steam and Nintendo Switch. This article originally appeared on Engadget at https://www.engadget.com/gaming/surfing-sand-and-sea-herding-beasts-and-other-new-indie-games-worth-checking-out-110053175.html?src=rss", "ingested_utc": "2025-08-23T11:26:45Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T11:27:01Z", "source": "FinancialPost_Business", "title": "US, India Trade Talks Are Moving Forward, Minister Says", "url": "https://financialpost.com/pmn/business-pmn/us-india-trade-talks-are-moving-forward-minister-says", "id_key": "2cec264ceac58c7fb297bc3a15148e7bf28e6662257cecec0022a6654a559826", "summary": "The US and India continue to talk despite strained relations after US President Donald Trump imposed tariffs on imports from the South Asian nation and threatened to slap penalties for buying Russian crude, a sign that the two nations are seeking to end a deadlock.", "ingested_utc": "2025-08-23T11:27:01Z"}
