{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:51:36Z", "source": "Guardian_World", "title": "JD Vance booed during hamburger handout to national guard troops in DC", "url": "https://www.theguardian.com/us-news/2025/aug/20/jd-vance-heckled-washington-dc", "id_key": "ce8f63e69cb4bf94985616408f939f857d2b71063d98446f0f6bf7e4646c9d11", "summary": "US vice-president, at Washington’s Union Station with Stephen Miller and Pete Hegseth, defends use of troops in area with less crime JD Vance was booed and heckled with chants of “Free DC!” during a photo op with national guard troops at Union Station in Washington on Wednesday afternoon. Handing out burgers to troops deployed last week by Donald Trump , at the station’s Shake Shack alongside the defense secretary, Pete Hegseth , and White House deputy chief of staff, Stephen Miller, Vance told soldiers “we appreciate everything you’re doing” and asserted: “We brought some law and order back.” Meanwhile, a crowd of demonstrators protested outside. Continue reading...", "ingested_utc": "2025-08-20T20:51:36Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:51:36Z", "source": "Guardian_World", "title": "Trump administration’s anti-woke campaign targets seven flagship museums", "url": "https://www.theguardian.com/us-news/2025/aug/20/trump-administration-smithsonian-museum-review", "id_key": "0d590ed010ffba98dfa08080e3a0853e473fdcaaa6219d37eb749e02ab726875", "summary": "Exclusive: White House flagged institutions including those for Latino, African and Asian art for review, document shows Amid the Donald Trump administration’s heavy-handed review of Smithsonian museums, the Guardian has seen a document compiled by the White House that argues the widely visited cultural institutions have overly negative portrayals of US history, from a Benjamin Franklin exhibit that links his scientific achievements to his ownership of enslaved people and a film about George Floyd ’s murder that it says mischaracterizes the police. The document, based on public submissions shared with the administration, shows that seven museums have so far been flagged for review: the National Museum of American History, National Museum of the American Latino, National Museum of Natural History, National Museum of African Art, National Portrait Gallery, Smithsonian American Art Museum and National Museum of Asian Art. Continue reading...", "ingested_utc": "2025-08-20T20:51:36Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:51:51Z", "source": "Blockworks", "title": "Why a market structure bill is ‘far more complicated’ than the GENIUS Act", "url": "https://blockworks.co/news/market-structure-bill-complicated", "id_key": "933778d10225f473847323c3c53fc78d0d514f7c2c23485a1e99b5d1febdc430", "summary": "A market structure bill and bipartisan support are no easy tasks, Sen. Tim Scott and SEC Chair Paul Atkins say", "ingested_utc": "2025-08-20T20:51:51Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:51:55Z", "source": "CryptoBriefing", "title": "Bitcoin is consolidating from all-time highs — but will there be an altseason?", "url": "https://cryptobriefing.com/altseason-crypto-outlook-market-trends/", "id_key": "62340e2ce9ac50b279ac1fc32ed995b9a3199ea3488a9b62a913521cfe9afde7", "summary": "The evolving crypto landscape, driven by institutional focus and macroeconomic factors, challenges the traditional altseason dynamics. The post Bitcoin is consolidating from all-time highs — but will there be an altseason? appeared first on Crypto Briefing .", "ingested_utc": "2025-08-20T20:51:55Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:51:55Z", "source": "CryptoBriefing", "title": "Bitcoin holds near $114K as Fed minutes highlight inflation risks over jobs", "url": "https://cryptobriefing.com/bitcoin-fed-minutes-inflation-stablecoins/", "id_key": "6e04edcef334965ae3148f6e8a8d936ac6d9d4750af63d8840afc44cbba62029", "summary": "Bitcoin stays near $114K as Fed minutes highlight inflation risks, tariff pass-through, stablecoin growth, and policy dissent. The post Bitcoin holds near $114K as Fed minutes highlight inflation risks over jobs appeared first on Crypto Briefing .", "ingested_utc": "2025-08-20T20:51:55Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:51:57Z", "source": "CryptoNews", "title": "ChatGPT’s SOL Analysis: 100K Transactions-Per-Second Validates Bullish Case – Is $200 Next?", "url": "https://cryptonews.com/news/chatgpts-sol-analysis-100k-tps-validates-sol-bull-case/", "id_key": "1f9d18a563e4ec4c36b05e16ad5c9d72b280aaedf9a1c5639223c79931372213", "summary": "ChatGPT's SOL analysis reveals Solana maintaining bullish structure at $183.75 despite -4.27% pullback as the network achieves historic 100,000 transactions per second stress test milestone while recovering from recent liquidation waves that triggered broader crypto market instability. The post ChatGPT’s SOL Analysis: 100K Transactions-Per-Second Validates Bullish Case – Is $200 Next? appeared first on Cryptonews .", "ingested_utc": "2025-08-20T20:51:57Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:53:54Z", "source": "NYTimes_Business", "title": "Delta and United Passengers Sue Airlines Over Fees for Windowless Window Seats", "url": "https://www.nytimes.com/2025/08/20/travel/delta-united-airlines-window-seat-lawsuits.html", "id_key": "58a3dc24c377fe641b79d70e46b923bb985ed201da019f189679d3331b233e1d", "summary": "Two suits filed this week accuse the airlines of unfairly charging passengers extra fees for window seats that the carriers knew were adjacent to aircraft walls.", "ingested_utc": "2025-08-20T20:53:54Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:54:26Z", "source": "Engadget_All", "title": "Here are all the Android phones that support Qi2", "url": "https://www.engadget.com/mobile/smartphones/here-are-all-the-android-phones-that-support-qi2-150052702.html?src=rss", "id_key": "166248a553f38d9b7276fc38025d8b62f0fe7e1f93e80c382fcbf23caafd9b38", "summary": "The Qi2 wireless charging spec was originally announced back in early 2023 . However, Android phone makers haven’t exactly been rushing to add Qi2 support to their latest devices since then. That’s made finding a compatible handset rather difficult, which is a bummer for anyone who has seen the wealth of accessories and power banks that iPhone owners have had access to for several generations. On top of faster charging speeds (up to 25 watts or higher in later revisions), Qi2 dictates the inclusion of embedded magnets designed to make aligning and attaching peripherals a cinch. But what makes the slow rollout a bit more frustrating is that Apple is a member of the Wireless Power Consortium (the governing body in charge of Qi2) and its MagSafe tech was used to help define the spec and ensure that compliant add-ons work seamlessly with Qi2, so it’s not like there’s a lack of compatible peripherals. Regardless, to help you figure out which Android phones officially come with Qi2, we’ve compiled a list of supported devices. (Note: Due to the complexities of the Chinese market, this list is primarily focused on gadgets available in North America and the EU.) Android phones with Qi2: The HMD Skyline . The Google Pixel 10 family . That’s it, seriously. Though now this list does include one of the biggest Android phone makers in Google. That said, there is one wrinkle with the Pixel 10 line. While Google's Pixelsnap standard is Qi2 compatible, wireless charging speeds for the base Pixel 10 and Pixel 10 Pro are staying the same at 15 watts. However, only the Pixel 10 Pro XL comes with support for the more powerful Qi2.2 spec which allows for wireless charging at up to 25 watts. So if you want the convenience of cable-free magnetic charging and want to do it as fast as possible, you're going to have to pay extra for the most premium version of the Pixel 10. The status of other Android phone manufacturers But what about the Galaxy S25? Unfortunately, despite Samsung saying that it will release multiple “Android devices supporting Qi2” this year, its latest batch of flagship phones (including S25 Edge, Galaxy Z Flip 7 and Galaxy Z Fold 7 ) are merely \"Qi2 ready.\" But what does that mean? Like previous models, the Galaxy S25 family can charge wirelessly at up to 15 watts. However, because the phones don't have magnets on their back, Qi2 accessories slide off when you try to attach them. This can be addressed by purchasing a compatible case with a built-in magnetic mounting system or a magnetic ring mount, but at least out of the box, the Galaxy S25 line requires additional assistance in order to work with the growing market of Qi2 peripherals. OnePlus also claims the OnePlus 13 supports Qi2. However, in our testing, the magnets inside the phone are so weak that it didn't latch on securely to any of the Qi2 accessories we tested. However, similar to the Galaxy S25, if you pair the OnePlus 13 with one of the company's magnetic cases, you can attach Qi2 peripherals as normal. Finally, when asked if it had plans to release Qi2-compatible phones, Motorola would only say that it is \"committed to bringing the latest technology across our devices.\" As new phones with Qi2 hit the market, we will try to keep this list as up-to-date as possible. Or at least until the spec becomes a much more mainstream standard. Update, August 20 2025, 4:45PM ET: This story has been updated with info about Qi2 support on the Pixel 10 family. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/here-are-all-the-android-phones-that-support-qi2-150052702.html?src=rss", "ingested_utc": "2025-08-20T20:54:26Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T20:54:35Z", "source": "AlJazeera_All", "title": "UN criticises new US sanctions on the ICC", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/20/un-criticises-new-us-sanctions-on-the-icc?traffic_source=rss", "id_key": "34254e1f663b303041de7369a7dfda31c2f22f287b55a5b68da2f8cd749b1ff9", "summary": "The United Nations says new US sanctions against members of the International Criminal Court will undermine justice.", "ingested_utc": "2025-08-20T20:54:35Z"}
