{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_World", "title": "Palestinians flee Gaza City districts as Israel says first stages of assault have begun", "url": "https://www.bbc.com/news/articles/clyr7l0z9edo?at_medium=RSS&at_campaign=rss", "id_key": "90ed7cd51f22503d9075466d63c04ca8b962717d19f687a347f09f213c2cdeb5", "summary": "An Israeli military spokesman says troops will deepen the damage to the \"terror infrastructure\" held by Hamas.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_World", "title": "ICC 'deplores' new US sanctions on judges and prosecutors", "url": "https://www.bbc.com/news/articles/c620l3y7ydro?at_medium=RSS&at_campaign=rss", "id_key": "1cc7c3bea03902f818c46649268db829481b251da12f89e3f043dbc36498ffa2", "summary": "Secretary of State Marco Rubio denounces the court as \"an instrument of lawfare\" against the US and Israel.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_World", "title": "Frank Caprio: 'Nicest judge in the world' dies aged 88", "url": "https://www.bbc.com/news/articles/c87ewp437e2o?at_medium=RSS&at_campaign=rss", "id_key": "23505778f4df83ff5f878e5db09b13b0a6b879b806c3729b9b385abe44d3953c", "summary": "The US celebrity judge and social media star has been remembered for his \"unique brand of compassion\".", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_Business", "title": "Government borrowing lower than expected in July", "url": "https://www.bbc.com/news/articles/cj6ydlk4e1no?at_medium=RSS&at_campaign=rss", "id_key": "2c0eb2192e097245274a56ce0fbc7d7efb7f10167da07a9a0241a3d333e72f64", "summary": "Borrowing last month was the lowest July figure for three years, following rises in tax and National Insurance receipts.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:53Z", "source": "BBC_Business", "title": "Sony raises PlayStation 5 prices in US as tariff fears persist", "url": "https://www.bbc.com/news/articles/cy081prg9jjo?at_medium=RSS&at_campaign=rss", "id_key": "132415b752184da4da2e0fa5097b72d4cf9f5ed08eeb288ef5b7361fc4d6daa0", "summary": "The Japanese technology giant cited economic challenges as it raised prices for the consoles by around $50.", "ingested_utc": "2025-08-21T07:00:53Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Australia news live: Lehrmann’s lawyer argues Network Ten mischaracterised attack on Higgins as a violent assault; Queensland court bans pro-Palestine bridge rally", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "2f2b8ff49a5cef7c60f6d63b770d0e300cb595c513f2b1ebd359b5282b2f47c9", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Bruce Lehrmann’s lawyer asks defamation appeal for more time to prepare but justices tell her ‘start now’", "url": "https://www.theguardian.com/australia-news/2025/aug/21/bruce-lehrmann-defamation-appeal-lawyer-ntwnfb", "id_key": "9fbfff347c5f2bdabd2af28ef068443c7662e921ebf8a6dabc9a68371e805248", "summary": "Zali Burrows told she has had ‘plenty’ of opportunity to consider issue in case despite repeated requests to adjourn early Bruce Lehrmann’s defamation appeal lawyer has repeatedly asked the federal court to adjourn early to give her more time to prepare, but the justices refused, telling the solicitor she has had “plenty” of time. Sydney criminal solicitor Zali Burrows is representing Lehrmann, who is appealing Justice Michael Lee’s April 2024 judgment, which found the former Liberal staffer was not defamed by Lisa Wilkinson and Network 10 when The Project broadcast an interview with Brittany Higgins in 2021 in which she alleged she was raped in Parliament House. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "European leaders scrambled to shield Ukraine in high-stakes Trump talks – but did they?", "url": "https://www.theguardian.com/world/2025/aug/20/european-leaders-scramble-to-shield-ukraine-in-high-stakes-trump-talks-but-did-they", "id_key": "08d5fcf5dac94dc001bd5d490ca5d10f59aa9d8a358a77616d6d66a5d01a4bf2", "summary": "The shifting loyalties of the White House have inadvertently bound Europe closer together – how long can that unity last? It was dubbed the “Great European Charm Offensive”. Hours before Volodymyr Zelenskyy headed to Washington for a Monday meeting with Donald Trump, announcements came pouring in from across Europe, making it clear that the president of Ukraine would not be going alone. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Israel to call up 60,000 reservists as it launches ‘first stages’ of attack on Gaza City – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/21/israel-gaza-city-middle-east-palestinians-latest-live-news-updates", "id_key": "0843d54dd381a9744d08ff5e5540dc298770893b991e80cce20142c7d621163e", "summary": "Troops already holding outskirts of territory’s capital, military says, while Israel approves huge new illegal settlement splitting West Bank Israel expands Gaza City offensive A group of 17 US Senators sent a letter to Secretary of State Marco Rubio on Wednesday calling for the United States to press Israel to grant access and protection to journalists in Gaza. The letter comes one week after an Israeli strike killed a group of Palestinian journalists in the besieged territory. Israeli defence minister Israel Katz’s order to send more troops into Gaza City came despite international criticism of the offensive , with fears of significant casualties and more mass displacement amid widening conditions of starvation in the territory. The situation in Gaza City was “catastrophic” and “large numbers” were fleeing eastern neighbourhoods , according to the Gaza municipality’s emergency committee chief, Mustafa Qazzaat. Resident Anis Daloul, 64, told the AFP news agency the Israeli military had “destroyed most of the buildings in Zeitoun and displaced thousands of people”. The additional Israeli reserve soldiers would not report for duty until September, a military official said on Wednesday, giving mediators time to bridge gaps between Hamas and Israel over the terms of any ceasefire and hostage deal. Hamas said Israel’s plans to conquer Gaza City showed its “blatant disregard” for efforts to broker a truce . The Israeli talk of a large-scale operation could primarily be intended to put pressure on the militant group in ceasefire talks, reports Peter Beaumont . More than 62,000 Palestinians have been killed in the Israeli war in Gaza since Hamas’s deadly attacks in October 2023, according to Gaza health officials. British UK foreign secretary David Lammy condemned Israel’s approval of the new settlement block in the West Bank as a “flagrant breach of international law”. The plan would split the West Bank into two with the intention – Israeli far-right minister Bezalel Smotrich has said – of ending any prospect of a Palestinian state. The Israeli military said on Thursday it has received a report about a security incident near the settlement of Malachei HaShalom in the West Bank , adding that details were under review. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "UK government borrowed less than expected in July in lift for Rachel Reeves", "url": "https://www.theguardian.com/business/2025/aug/21/government-borrowed-less-than-expected-in-july-in-lift-for-rachel-reeves", "id_key": "231045b8d8c22ebec10866c2ecbc1ec66d9ff7ce859c8b91639f10c96968b7f7", "summary": "Public sector net borrowing falls to £1.1bn as chancellor explores tax-raising options in autumn budget Business live – latest updates The UK government borrowed less than expected in July, official figures show, in a boost to the chancellor, Rachel Reeves, as she faces pressure ahead of her autumn budget. Figures from the Office for National Statistics (ONS) showed public sector net borrowing – the difference between public spending and income – fell to £1.1bn, down by £2.3bn from the same month a year earlier. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:00:56Z", "source": "Guardian_World", "title": "Stella Creasy and Richard Tice call for scrutiny over which EU laws UK ditches", "url": "https://www.theguardian.com/politics/2025/aug/21/stella-creasy-richard-tice-eu-laws-committee-brexit-labour-reform", "id_key": "0b214693601394cace0f8deb02d1ed643353bdc86bc169e9c3b813d05d800c88", "summary": "Labour MP says she and Reform MP want a committee set up, after news of UK’s post-Brexit environmental rollbacks Stella Creasy and Richard Tice are pushing for Labour to allow a Brexit scrutiny committee to be formed in parliament, after the Guardian revealed environmental protections had been eroded since the UK left the EU. The Labour and Reform UK MPs argue that there is no scrutiny or accountability over how Brexit is being implemented. Creasy, the MP for Walthamstow and chair of the Labour Movement for Europe, said the UK needed a “salvage operation” to clear up the environmental and regulatory havoc caused by Brexit. Continue reading...", "ingested_utc": "2025-08-21T07:00:56Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:01:29Z", "source": "CryptoNews", "title": "BNB Treasury Firm Windtree Plunges 77% as Nasdaq Moves to Delist Over Compliance Failure", "url": "https://cryptonews.com/news/windtree-plunges-77-as-nasdaq-moves-to-delist-biotech-over-compliance-failure/", "id_key": "38a115a224fb6da1a685efa95177c4f838db85cd4bbf0f353d3a5f7cc2f3fd79", "summary": "Windtree Therapeutics saw its shares collapse on Wednesday after Nasdaq said it would delist the biotech for failing to comply with listing standards. The post BNB Treasury Firm Windtree Plunges 77% as Nasdaq Moves to Delist Over Compliance Failure appeared first on Cryptonews .", "ingested_utc": "2025-08-21T07:01:29Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:01:30Z", "source": "CoinJournal", "title": "BNB price forecast: BNB sets a new ATH, targets $1k", "url": "https://coinjournal.net/news/bnb-price-forecast-bnb-sets-a-new-ath-targets-1k/", "id_key": "9a34269a1d5a09f84b6c98437709dcf1713fcce7be97c729c6b59e97dcc63dd1", "summary": "Key takeaways BNB surged by over 4% in the last 24 hours to hit a new all-time high of $882. Binance’s native coin could rally to the $1k psychological level in the medium term. Binance’s BNB hits a new all-time high The cryptocurrency market performed positively on Wednesday following two days of steady decline. Bitcoin […] The post BNB price forecast: BNB sets a new ATH, targets $1k appeared first on CoinJournal .", "ingested_utc": "2025-08-21T07:01:30Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:03:25Z", "source": "NYTimes_World", "title": "With Moves on West Bank and Gaza City, Israel Defies Global Outcry", "url": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-hamas-gaza-city.html", "id_key": "c6d54a7fae4faa7d7fb580e28736d69ebdf9ff960fe01e7abd0afd6a7fc01dfc", "summary": "Israel approved new settlements in the occupied West Bank, while its troops have reached the outskirts of Gaza City. The developments raise questions about the viability of a cease-fire proposal.", "ingested_utc": "2025-08-21T07:03:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:03:37Z", "source": "FT_Home", "title": "China turns against Nvidia’s AI chip after Lutnick’s ‘insulting’ remarks", "url": "https://www.ft.com/content/b8e30c54-b71c-4113-8b3e-8f54bc36587d", "id_key": "a146d78c8de494dde2a6587b16fa61c9f2eaf428c9cfe3a34f42bcb5c39981e0", "summary": "Comments by US commerce secretary trigger Chinese regulatory effort to stop tech groups buying H20 processors", "ingested_utc": "2025-08-21T07:03:37Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:14Z", "source": "FinancialPost_Business", "title": "Norway Economic Growth Tops Forecasts, Denting Rate Cut Bets", "url": "https://financialpost.com/pmn/business-pmn/norway-economy-grows-more-than-forecast-denting-rate-cut-bets", "id_key": "817ef76596a96f5e29fab281685adbee09fa1acce04fabbaee9ccec80101b9ab", "summary": "Norway’s economy surprised with faster-than-expected growth for a second quarter in a row, adding pressure on the nation’s central bank to reconsider its plans for more easing.", "ingested_utc": "2025-08-21T07:04:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:14Z", "source": "FinancialPost_Business", "title": "A Ukrainian startup develops long-range drones and missiles to take the battle to Russia", "url": "https://financialpost.com/pmn/this-ukrainian-startup-makes-drones-and-soon-cruise-missiles-to-strike-deep-inside-russia", "id_key": "3ff838a6c36e951c794bf0461e3e59acb77080fe8383693d1d58716dd0c53838", "summary": "When a Ukrainian-made drone attacked an ammunition depot in Russia last September, it showcased Kyiv’s determination to strike deep behind enemy lines and the prowess of its defense industry. The moment was especially gratifying for the woman in charge of manufacturing the drones that flew more than 1,000 kilometers (620 miles) to carry out this […]", "ingested_utc": "2025-08-21T07:04:14Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:21Z", "source": "Nikkei_Asia_Top", "title": "Taiwan to hike 2026 defense budget above 3% of GDP amid US pressure", "url": "https://asia.nikkei.com/politics/international-relations/taiwan-tensions/taiwan-to-hike-2026-defense-budget-above-3-of-gdp-amid-us-pressure", "id_key": "023e09bd7032a4212295b0b8a056b6d58534e68a0e717d66fc1ee12793377fbb", "summary": "", "ingested_utc": "2025-08-21T07:04:21Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T07:04:29Z", "source": "HackerNews_Top", "title": "Show HN: I replaced vector databases with Git for AI memory (PoC)", "url": "https://github.com/Growth-Kinetics/DiffMem", "id_key": "9225b6ebc272b92a7ef698145c5d98021c038230e6031e7c24e1cb421c4cbd7a", "summary": "Comments", "ingested_utc": "2025-08-21T07:04:29Z"}
