{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:25:43Z", "source": "CryptoSlate", "title": "Coinbase sees stablecoin market growing 5x to $1.2T by 2028", "url": "https://cryptoslate.com/coinbase-sees-stablecoin-market-growing-5x-to-1-2t-by-2028/", "id_key": "a4c5a5be7a8a36ea3cc615ad67239f4cac6a7161764ed2c478661c4dd6197ebd", "summary": "Stablecoins could swell to a $1.2 trillion market by 2028 and begin exerting pressure on U.S. debt markets, according to an Aug. 21 Coinbase report. The projection, based on thousands of growth simulations, outlines a path for the market to expand nearly 5x from its current size of $270 billion. The report comes as the […] The post Coinbase sees stablecoin market growing 5x to $1.2T by 2028 appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T19:25:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:25:44Z", "source": "CryptoBriefing", "title": "US DOJ says ‘writing code’ is not a crime, signaling shift in crypto enforcement", "url": "https://cryptobriefing.com/doj-shipping-code-not-a-crime-crypto-open-source/", "id_key": "4b49ecbc44aca3711e6ac725544c9b0149bde2637990014baf4a1d5ed11ddb54", "summary": "US DOJ says code itself isnt a crime, shifting crypto enforcement focus to intent and control after Tornado Cash ruling. The post US DOJ says ‘writing code’ is not a crime, signaling shift in crypto enforcement appeared first on Crypto Briefing .", "ingested_utc": "2025-08-21T19:25:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:25:47Z", "source": "CryptoNews", "title": "NFT Market Heats Up As AI Companion Tokens Bring Interactive Experiences", "url": "https://cryptonews.com/news/nft-market-heats-up-as-ai-companion-tokens-bring-interactive-experiences/", "id_key": "a000359bfc7fe23fbdb9848bfd2ce141f3560ced1b99b38270e911f6fa3d2447", "summary": "Markets for NFTs connected to AI have grown, with July metaverse trades up 83% and ETH prices improving. Projects including FURO, Pudgy Penguins, Treasure DAO and The Sandbox show interactive use cases, though rights, costs and authenticity remain ongoing concerns. The post NFT Market Heats Up As AI Companion Tokens Bring Interactive Experiences appeared first on Cryptonews .", "ingested_utc": "2025-08-21T19:25:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:26:31Z", "source": "Sui_Blog", "title": "Tokenized Gold Now Live on Sui Amid Institutional Surge", "url": "https://blog.sui.io/matrixdock-tokenized-gold/", "id_key": "f7015c20b6e90af00068c09672810f1cc590f8edaa1a263acf7b2c1cb9731f32", "summary": "Matrixdock’s flagship XAUm asset natively launches on Sui as RWA use cases continue to expand.", "ingested_utc": "2025-08-21T19:26:31Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:13Z", "source": "TechCrunch_All", "title": "Elon Musk’s X may finally settle $500M severance lawsuit", "url": "https://techcrunch.com/2025/08/21/elon-musks-x-may-finally-settle-500m-severance-lawsuit/", "id_key": "d3fedec80db67b89bc38664e635460e22c7cb54b38efffd046cc6d1b3fcf595f", "summary": "Elon Musk's X is settling a severance lawsuit with former Twitter employees.", "ingested_utc": "2025-08-21T19:28:13Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:15Z", "source": "WIRED_All", "title": "Take $15 Off 'Tony Hawk's Pro Skater 3+4' Remasters Right Now", "url": "https://www.wired.com/story/tony-hawks-pro-skater-remasters-deal/", "id_key": "23c99f203804d4667e0c83b34c0b1ce26475a03f3a4fbadbc0f0aea50f672be5", "summary": "Darkslide your way to gaming nostalgia for just $35.", "ingested_utc": "2025-08-21T19:28:15Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:16Z", "source": "Engadget_All", "title": "Apple's new iOS 26 public beta 4 is here, but is your iPhone compatible? Check this list", "url": "https://www.engadget.com/mobile/apples-new-ios-26-public-beta-4-is-here-but-is-your-iphone-compatible-check-this-list-191854764.html?src=rss", "id_key": "9467a44fc466dd56139a5bd009c0a7497c4d97a7e702ac1f139fec77378082e8", "summary": "The Apple iPhone event is nearly here, which means we'll soon get to download iOS 26 and iPadOS 26. The OS 26es are coming with huge upgrades to your iPhone and iPad's operating systems. You've heard of Liquid Glass , right? It's like the better-executed version of Windows Vista and definitely one of the cooler features coming this fall. We spent two weeks test-driving it — you can check out our detailed hands-on iOS 26 preview , or you can try it out yourself by downloading and installing the public beta 4 . That software is a more stable iteration of the separate developer version, which recently hit the beta 7 waypoint, and offers a few more flashy features not yet available in the public version. (While the public beta is open to everyone and quite stable, always remember there's a degree of risk involved with beta software.) Additionally, there are credible reports that iOS 26 could bring a new live translation feature to AirPods , too. Not sure if you want to upgrade your smartphone or tablet this year? No worries, we'll help you find out if your devices will be able to run iOS 26. While Apple didn't nix any iPhones from its eligibility list last year, that's not the case for 2025 — a few models are getting cut this time. All iPhone 8 models and the iPhone X were the last to get the boot in 2023, and this year the 2018 models are getting left behind. If you have an ineligible device, you won't be able to download iOS 26 when it becomes available this fall. We'll get to the bottom of which iPhones and iPads will support iOS 26 and iPadOS 26 this year. To see what's coming with the latest OSes, check out everything announced at Apple's WWDC June 9 event . One thing you shouldn't immediately expect is Apple's updated version of Siri , though the company is reportedly working on a 'stripped-down' AI chatbot to compete with ChatGPT. These three iPhones won't be compatible with iOS 26 Unlike last year, several iPhone models won't be eligible to download the newest iOS when it makes its debut this fall. This trio of models first released in 2018 won't be coming to the iOS 26 party: iPhone XR iPhone XS iPhone XS Max iPhones compatible with iOS 26 While we don't yet know the new iPhones Apple will be dropping this fall — though there are iPhone 17 rumors — we do know, per Apple's site , that the phones listed below will be compatible with iOS 26. Basically, if you have an iPhone that was announced in 2019 or later, you're in the clear: iPhone SE (second generation or later) iPhone 11 iPhone 11 Pro iPhone 11 Pro Max iPhone 12 iPhone 12 mini iPhone 12 Pro iPhone 12 Pro Max iPhone 13 iPhone 13 mini iPhone 13 Pro iPhone 13 Pro Max iPhone 14 iPhone 14 Plus iPhone 14 Pro iPhone 14 Pro Max iPhone 15 iPhone 15 Plus iPhone 15 Pro iPhone 15 Pro Max iPhone 16 iPhone 16 Plus iPhone 16 Pro iPhone 16 Pro Max iPhone 16e iPads compatible with iPadOS 26 The iPads listed below, and any iPads released later this year, are eligible to download iPadOS 26 . iPad Pro (M4) iPad Pro 12.9‑inch (3rd generation and later) iPad Pro 11‑inch (1st generation and later) iPad Air (3rd generation and later, including M2 and M3) iPad (8th generation and later, including A16) iPad mini (5th generation and later, including A17 Pro) What if I don't want to buy a new iPhone? If you want to continue using your older iPhone that isn't supported by iOS 26, that's fine. However, you'll miss out on security updates which could potentially put your phone at risk for malware and other threats. Additionally, some apps may stop working if they require a certain version of iOS or later. And of course, you won't be able to access the latest features iOS 26 offers. When will iOS 26 become available? Apple usually rolls out its latest iOS in mid-September, just a few days before the new iPhones hit store shelves. Last year, it released iOS 18 on Monday, Sept. 16. Expect a confirmation of the release date at the iPhone 17 event, expected in early September. iOS 26 features we're excited about Liquid Glass design : Your home screen is getting revamped with new app icons, including dark mode and all-clear options. You'll also notice buttons with a new floating design. Liquid Glass was designed to make all of Apple's OSes more cohesive. Phone app redesign: You'll finally be able to scroll through contacts, recent calls and voicemail messages all on one screen. It also comes with a new feature called Hold Assist that'll notify you when an agent comes to the phone so you can avoid the elevator music. Live Translate: iOS 26 is bringing the ability to have a conversation via phone call or text message with someone who speaks another language. Live Translate will translate your conversation in real time. Polls feature: Coming to group messages in the Messages app, chat members will be able to create polls. This can help prevent the unwanted 30+ messages when it comes to deciding which restaurant you're meeting at this weekend. This article originally appeared on Engadget at https://www.engadget.com/mobile/apples-new-ios-26-public-beta-4-is-here-but-is-your-iphone-compatible-check-this-list-191854764.html?src=rss", "ingested_utc": "2025-08-21T19:28:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:16Z", "source": "Engadget_All", "title": "Apple fitness exec accused of creating toxic workplace environment", "url": "https://www.engadget.com/big-tech/apple-fitness-exec-accused-of-creating-toxic-workplace-environment-185556474.html?src=rss", "id_key": "8d36dbf922aecdde4b58d086f0e66f8ebcacd1f1da40bbef1f73a0aa0fb7407b", "summary": "Jay Blahnik is Apple's vice president of fitness technologies and responsible for leading a team of about 100 people. After a lengthy period consulting for Nike, he joined the company in 2013 to help with the launch of the Apple Watch and programs such as Apple Fitness+. Today, The New York Times reported on allegations that Blahnik created a toxic workplace environment, with his behaviors described as \"verbally abusive, manipulative and inappropriate.\" He and Apple are currently being sued by one former employee, and the company has already settled a separate complaint against Blahnik that accused him of sexual harassment. In addition, sources told the Times that about a tenth of Blahnik's reports have sought extended health or medical leave since 2022. Apple reportedly conducted an internal investigation into Blahnik but found no evidence of wrongdoing. Employees told the publication that they felt the company was more committed to protecting a notable executive than addressing workers' concerns. \"We strongly disagree with the premise of this story, and there are many inaccurate claims and mischaracterizations,\" Lance Lin, a spokesperson from Apple, told the Times in response to the paper's report. He declined to provide specifics on those inaccuracies and said the company did not discuss matters involving individual employees for privacy concerns. \"We will continue to share the facts through the legal process.\" This article originally appeared on Engadget at https://www.engadget.com/big-tech/apple-fitness-exec-accused-of-creating-toxic-workplace-environment-185556474.html?src=rss", "ingested_utc": "2025-08-21T19:28:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:25Z", "source": "AlJazeera_All", "title": "US issues sanctions against Greek shipper of Iranian oil", "url": "https://www.aljazeera.com/news/2025/8/21/us-issues-sanctions-against-greek-shipper-of-iranian-oil?traffic_source=rss", "id_key": "2aa8ca94994fd83ad0b9545554a6d61320ca5f387fef7707c6412c9dac7a84d0", "summary": "Sanctions are the latest aimed at penalising Tehran's energy sector following a Washington-brokered ceasefire.", "ingested_utc": "2025-08-21T19:28:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:32Z", "source": "FinancialPost_Business", "title": "Trump and Carney Talk About Trade, Agree to Speak Again Soon", "url": "https://financialpost.com/pmn/business-pmn/trump-and-carney-talk-about-trade-agree-to-speak-again-soon", "id_key": "5ec833c81fb6a468af4ff13fac05a2d6716687f2b924076414dd561f8a7a90a9", "summary": "US President Donald Trump and Canadian Prime Minister Mark Carney had a “wide-ranging conversation” Thursday that included trade and the war in Ukraine, according to Carney’s office.", "ingested_utc": "2025-08-21T19:28:32Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:32Z", "source": "FinancialPost_Business", "title": "Nova Scotia firefighters wary of potential wind shifts as hurricane to pass Friday", "url": "https://financialpost.com/pmn/nova-scotia-firefighters-wary-of-potential-wind-shifts-as-hurricane-to-pass-friday", "id_key": "fa9fcf57fa9a3a50d0b44009f9328114821251c8f4d981c258021b9e2b331a37", "summary": "WEST DALHOUSIE — Firefighting officials in Nova Scotia are keeping a wary eye on Hurricane Erin, which is expected to pass well offshore but bring strong wind gusts to parts of the province on Friday. In a briefing on Thursday, officials said there were three wildfires burning in the province, one of which remained out […]", "ingested_utc": "2025-08-21T19:28:32Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T19:28:32Z", "source": "FinancialPost_Business", "title": "Samsung Electronics Canada Expands Service Capabilities with Launch of Independent Service Provider Program", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/samsung-electronics-canada-expands-service-capabilities-with-launch-of-independent-service-provider-program", "id_key": "11765c053a61fbb299324fe9408ef52d645f58ae540580c98d4fc0e54dab4268", "summary": "New program broadens nationwide access to Samsung-authorized parts and industry certified technicians MISSISSAUGA, Ontario — Samsung Electronics Canada is expanding their mobile device repair network with the launch of the Independent Service Provider (ISP) Program. This new initiative aims to enhance customer service and out-of-warranty repair experiences for customers of Samsung mobile products by growing […]", "ingested_utc": "2025-08-21T19:28:32Z"}
