{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:54:40Z", "source": "BBC_World", "title": "'No-one was expecting this': European leaders rush to US to help Ukraine avoid 'capitulation'", "url": "https://www.bbc.com/news/articles/c9d0v8ljw3no?at_medium=RSS&at_campaign=rss", "id_key": "6708090af93422a6f40b68e54568259df9047fb42d24b3b80c2d6f5fdfdfdeac", "summary": "The heads of state hope to stop Trump from threatening long-term European security, writes James Landale.", "ingested_utc": "2025-08-18T16:54:40Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:54:40Z", "source": "BBC_World", "title": "BBC at Rafah crossing as queues of aid trucks wait to enter Gaza", "url": "https://www.bbc.com/news/videos/cev2nmwxe1po?at_medium=RSS&at_campaign=rss", "id_key": "a485ff3c104ee0e4ed4377d4a52610ea77261f4c10c12c4efe67b1caa4382864", "summary": "The BBC's Chief International Correspondent Lyse Doucet is travelling with Palestinian Prime Minister Mohammad Mustafa and Egypt’s Foreign Minister Badr Abdelatty.", "ingested_utc": "2025-08-18T16:54:40Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:02Z", "source": "BitcoinMagazine", "title": "An Excerpt from Bitcoin Circular Economies: Prologue", "url": "https://bitcoinmagazine.com/bitcoin-books/maria-bitcoin-circular-economies", "id_key": "6dfe34cbc3242719e567ea402924fc1efd7d2731c097a23af8eb0d2ae183ba18", "summary": "Bitcoin Magazine An Excerpt from Bitcoin Circular Economies: Prologue The Prologue from Bitcoin Circular Economies explores how Bitcoin empowers local communities to connect with global value chains in the digital age. This post An Excerpt from Bitcoin Circular Economies: Prologue first appeared on Bitcoin Magazine and is written by Alvaro D. Maria .", "ingested_utc": "2025-08-18T16:55:02Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:02Z", "source": "BitcoinMagazine", "title": "Bitcoin Tipping Is Now Live on X, Powered by BitBit and Spark", "url": "https://bitcoinmagazine.com/press-releases/bitcoin-tipping-is-now-live-on-x-powered-by-bitbit-and-spark", "id_key": "bd8b006229dfb7b111394e971ae13ffd589a9953d2d2b7e5778d6aefacdb6397", "summary": "Bitcoin Magazine Bitcoin Tipping Is Now Live on X, Powered by BitBit and Spark LOS ANGELES (CA), 8/18/2025 – BitBit, the self-custodial social wallet that lets users instantly send and receive bitcoin directly in their browser, today announced the launch of its X (formerly Twitter) integration, enabling users worldwide to exchange bitcoin tips on the platform seamlessly. The payments will be associated with X usernames, allowing anyone to receive […] This post Bitcoin Tipping Is Now Live on X, Powered by BitBit and Spark first appeared on Bitcoin Magazine and is written by Spark .", "ingested_utc": "2025-08-18T16:55:02Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:05Z", "source": "CryptoSlate", "title": "Bullish market momentum fails to sway global fund managers toward crypto, survey shows", "url": "https://cryptoslate.com/bullish-market-momentum-fails-to-sway-global-fund-managers-toward-crypto-survey-shows/", "id_key": "667fc75e7a9c7fce52ce69cccbf4da77817b6cce4dbe1e4666ff4838fce037a8", "summary": "A recent Bank of America survey shows that most global fund managers are still hesitant to invest in crypto despite the recent bullish momentum observed in the sector. The study, which included 211 fund managers overseeing $504 billion in assets, found that about three-quarters of respondents have no crypto holdings at all. Meanwhile, crypto allocations […] The post Bullish market momentum fails to sway global fund managers toward crypto, survey shows appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T16:55:05Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:05Z", "source": "CryptoSlate", "title": "Asian powerhouses Japan and South Korea advance stablecoin regulatory efforts", "url": "https://cryptoslate.com/asian-powerhouses-japan-and-south-korea-advance-stablecoin-regulatory-efforts/", "id_key": "99e04134cb0b56dc9d05376563f66e407b51dd8cb24a9a4c75d3e02b65785505", "summary": "Japan and South Korea are moving quickly to create clearer rules for stablecoins as global interest in digital currencies grows. Stablecoins are cryptocurrencies designed to hold steady value by linking to fiat currencies, commodities, or other assets. Their use in payments, trading, and DeFi has expanded rapidly, with forecasts suggesting the market could grow into […] The post Asian powerhouses Japan and South Korea advance stablecoin regulatory efforts appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T16:55:05Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:05Z", "source": "CryptoBriefing", "title": "Are crypto liquidity providers actually good for traders and market?", "url": "https://cryptobriefing.com/crypto-liquidity-providers-markets/", "id_key": "a19af37272c7a72625939ba2f0da11522484bcefc94bcd6da1162b0d70c9e0f3", "summary": "Crypto liquidity providers enhance trading by promoting stability, reducing volatility, and improving efficiency across crypto markets. The post Are crypto liquidity providers actually good for traders and market? appeared first on Crypto Briefing .", "ingested_utc": "2025-08-18T16:55:05Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:05Z", "source": "CryptoBriefing", "title": "Google ups stake in Bitcoin miner TeraWulf to 14%, WULF jumps 13%", "url": "https://cryptobriefing.com/terawulf-google-investment-fluidstack-expansion/", "id_key": "acd3c9371ca967a4c8a33bffdc0e8521e714c8e255fd552e39f1a5b5c27faa87", "summary": "Google's increased stake in TeraWulf highlights growing tech investment in sustainable crypto mining, potentially influencing future energy strategies. The post Google ups stake in Bitcoin miner TeraWulf to 14%, WULF jumps 13% appeared first on Crypto Briefing .", "ingested_utc": "2025-08-18T16:55:05Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:06Z", "source": "Protos", "title": "The great MSTR Ponzi scheme debate", "url": "https://protos.com/the-great-mstr-ponzi-scheme-debate-1/", "id_key": "07361d4e5e350f8caa516af8e805ec3ffead9e436532c0f99f0f7006680f3b16", "summary": "Tensions are escalating in a spirited debate between MicroStrategy (MSTR) investors and skeptics about whether the stock is a Ponzi scheme. The post The great MSTR Ponzi scheme debate appeared first on Protos .", "ingested_utc": "2025-08-18T16:55:06Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:08Z", "source": "CryptoNews", "title": "Altcoin Season Shock: These Three Coins Could Make Portfolios Pop – If Rotation Holds", "url": "https://cryptonews.com/news/altcoin-season-shock-three-coins-could-mint-gains/", "id_key": "c7f4183f535eb4c36c993f0fd44795f58aabcc1e831c9f1894b72d25a4e85dbb", "summary": "Altcoin Season has remained selective, with capital rotating toward tokens showing liquidity, clear narratives, or active use. Chainlink has tracked DeFi demand, Pi has held a tight range, and Solana has shown rising on-chain and developer activity as weekend liquidity approaches. The post Altcoin Season Shock: These Three Coins Could Make Portfolios Pop – If Rotation Holds appeared first on Cryptonews .", "ingested_utc": "2025-08-18T16:55:08Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:08Z", "source": "CryptoNews", "title": "Turn BTC Into Daily Income: ALL4 Mining Launches Bitcoin Cloud Mining Strategy for Cryptocurrency Enthusiasts", "url": "https://cryptonews.com/news/turn-btc-into-daily-income-all4-mining-launches-bitcoin-cloud-mining-strategy-to-help-cryptocurrency-enthusiasts-achieve-financial-growth/", "id_key": "9880de7578a2a1762b2858c6bd70b7046b0e505c19ecf950200b4101727b4d12", "summary": "The well-known cloud mining platform ALL4 Mining announced the launch of new BTC cloud mining contracts, further optimizing its revenue structure and helping users convert Bitcoin into a notable source of daily passive income. The post Turn BTC Into Daily Income: ALL4 Mining Launches Bitcoin Cloud Mining Strategy for Cryptocurrency Enthusiasts appeared first on Cryptonews .", "ingested_utc": "2025-08-18T16:55:08Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:55:08Z", "source": "CryptoNews", "title": "$RAY Buyback Removes 3.45M Tokens, Can Bulls Smash $3.70 Resistance Next?", "url": "https://cryptonews.com/news/ray-buyback-removes-3-45m-tokens-bulls-target-3-70/", "id_key": "023db81aed9ac0e7df1bd0e4a51543443e4d7a9b8354101225fa9329a7da3b56", "summary": "$RAY has pulled back to the $3.30–$3.40 area amid an altcoin shakeout, while Raydium has removed 3.45M tokens via a $200M buyback, integrated real-time Solana Geyser analytics, launched LaunchLab, and has gained an Upbit listing as TVL has hovered near $2B. The post $RAY Buyback Removes 3.45M Tokens, Can Bulls Smash $3.70 Resistance Next? appeared first on Cryptonews .", "ingested_utc": "2025-08-18T16:55:08Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:56:57Z", "source": "NYTimes_Business", "title": "Newsmax Will Pay $67 Million to Settle Dominion Defamation Lawsuit", "url": "https://www.nytimes.com/2025/08/18/business/media/newsmax-dominion-defamation-lawsuit-settlement.html", "id_key": "3f06745755b31eaea15b4c65aa609e303083c4c3abcb02fde273bb1c138d7c30", "summary": "Dominion Voting Systems sued the right-wing cable channel for broadcasting false claims that the voting machine company had rigged votes in the 2020 presidential election.", "ingested_utc": "2025-08-18T16:56:57Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:56:57Z", "source": "NYTimes_World", "title": "Live Updates: European Leaders Arrive at White House to Support Zelensky", "url": "https://www.nytimes.com/live/2025/08/18/us/trump-zelensky-ukraine-putin", "id_key": "96102e16877eee6dfac355a1186f12055f602cb1652f20f37c156e906d2d8fec", "summary": "President Volodymyr Zelensky of Ukraine, whose last Oval Office meeting ended in acrimony, was expected to hear a plan from President Trump to cede land to Russia in exchange for security guarantees. European leaders rushed to join Mr. Zelensky in a show of support.", "ingested_utc": "2025-08-18T16:56:57Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:09Z", "source": "FT_Home", "title": "Zelenskyy calls for ‘joint pressure’ on Russia as European leaders arrive at White House", "url": "https://www.ft.com/content/1ddf31d2-2083-432e-aabc-a2daa562646a", "id_key": "c09f235dd548e2bee60e31de9c2d1d9f9fc8938edd3c4cce31d3a655ec902266", "summary": "US security guarantees in focus as Trump says Kyiv can end war ‘almost immediately’", "ingested_utc": "2025-08-18T16:57:09Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:09Z", "source": "FT_Home", "title": "Reeves looks at UK property tax reforms in bid to boost growth and revenue", "url": "https://www.ft.com/content/86b454bf-c2eb-491b-90e8-5311f1d18d1c", "id_key": "be4ab90141448fd47daedaa443e8f8ee79f1e7337257f19ba4c485a04119ec23", "summary": "Treasury officials examine range of measures as chancellor seeks to address looming gap in public finances", "ingested_utc": "2025-08-18T16:57:09Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:25Z", "source": "TheVerge_All", "title": "Fujifilm is raising the prices of its cameras again", "url": "https://www.theverge.com/news/760707/fujifilm-price-increase-cameras-tariffs", "id_key": "67a47c183c71fd48b0973691da03d44d20ed134b0405b768f7323e2ab5bdaa49", "summary": "Just two weeks after raising the prices of its cameras by up to $800, Fujifilm is warning customers about another increase for US customers. In a statement provided to DPReview, the Japanese company says it will “further adjust prices” as it contends with “volatile market conditions.” The change will go into effect on August 30th, […]", "ingested_utc": "2025-08-18T16:57:25Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:26Z", "source": "TechCrunch_All", "title": "Made by Google 2025: How to watch Google debut the Pixel 10, Pixel Watch 4, and more", "url": "https://techcrunch.com/2025/08/18/made-by-google-2025-how-to-watch-google-debut-the-pixel-10-pixel-watch-4-and-more/", "id_key": "160affcde75f5920f2464df5ae2d955c4ae944969af47d2c32bbc2702f209934", "summary": "Google is hosting its Pixel 10 event next week. Learn how to watch the tech giant reveal its new mobile devices and what else you can expect.", "ingested_utc": "2025-08-18T16:57:26Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:27Z", "source": "ArsTechnica_All", "title": "Ars Technica System Guide: Five sample PC builds, from $500 to $5,000", "url": "https://arstechnica.com/gadgets/2025/08/ars-technica-system-guide-back-to-pc-building-for-back-to-school/", "id_key": "1432c317cba3a079fac2495a6ad867884526e66956c4beb736489754d268bf91", "summary": "Despite everything, it's still possible to build decent PCs for decent prices.", "ingested_utc": "2025-08-18T16:57:27Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:29Z", "source": "Engadget_All", "title": "Google Pixel 10 launch event: Here's how to watch Made by Google on August 20", "url": "https://www.engadget.com/mobile/smartphones/google-pixel-10-launch-event-heres-how-to-watch-made-by-google-on-august-20-163933479.html?src=rss", "id_key": "86cac77c993a4aad8083e93d39aa6193a1e211778169230e2637ceb135e203ae", "summary": "Believe it or not, Big Tech's fall hardware events are already upon us. (Heck, Samsung already got a jump on things in July.) Up next: Google's big Pixel shindig. You can learn all about the new Pixel 10 lineup , along with new watches and earbuds, on August 20. Google's new hardware has leaked far and wide. But that doesn't mean there couldn't be a few surprises. If you want to be the first to hear the official scoop, you can tune into the Made by Google YouTube channel (or right here!). The event kicks off at 1PM ET on August 20. Sam Rutherford for Engadget What's on tap? You can expect a more power-efficient Tensor G5 processor in all the new Pixel 10 phones. (That could help power new Gemini AI features , too.) The base-level Pixel 10 should get a big camera upgrade: a 5x telephoto lens. Before this generation, you had to splurge on a Pro or Fold model to get optical zoom. Cameras will be higher-res across the board, too. In other areas, Qi2 magnetic charging is expected to come to the new Pixels. Expect a new accessory ecosystem, a la Apple's MagSafe , dubbed \"Pixelsnap.\" We'll also likely see the Pixel Watch 4 with a larger battery and smaller bezels . And the Pixel Buds 2a could bring refinements to the company's budget earbuds . Finally, Google teased... a strange number of guests for the upcoming event. Apparently, Jimmy Fallon, Stephen Curry, Lando Norris and the Jonas Brothers are all joining the stream. So get excited for some awkward celebrity endorsements! Engadget's Pixel 10 roundup will give you a much more detailed dive into the leaks . You can head back here on August 20 at 1PM ET to watch live. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/google-pixel-10-launch-event-heres-how-to-watch-made-by-google-on-august-20-163933479.html?src=rss", "ingested_utc": "2025-08-18T16:57:29Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:29Z", "source": "Engadget_All", "title": "Google Pixel 10 launch event: New phones, foldables and watches at the Made by Google event", "url": "https://www.engadget.com/mobile/smartphones/google-pixel-10-launch-event-new-phones-foldables-and-watches-at-the-made-by-google-event-214510252.html?src=rss", "id_key": "e0217e8499460151cf985cf147f47db5a011d063edb896fc7ee1612c1bea4e72", "summary": "After largely focusing Google I/O 2025 on the ways the company wants Gemini to change everything from searching the web to filmmaking , Google is finally ready to launch new hardware. The next Made by Google event is on the books for August 20 , and Google has already confirmed what at least one of its new Pixel 10 phones will look like. Google seems dead-set on making a big splash at this event, too. On the Friday before Made by Google, the company dropped a video on X noting that a number of \"special guests\" were participating, including Jimmy Fallon, Stephen Curry, Lando Norris and the Jonas Brothers. What they all will have to do with a phone launch remains to be seen. Google remains as leak-prone as ever, so nearly all the new hardware the company is expected to announce has all ready been reported on in one form or another. With that in mind and after sifting through what has leaked, here's what Google will show off at the Pixel 10 launch even in New York City on August 20. Pixel 10, 10 Pro, 10 Pro XL and 10 Pro Fold Android Headlines / Onleaks Google's invitation for the event says that the company is sharing \"the latest on our Pixel phones, watches, buds and more,” which more or less confirms the company will introduce a slate of products that's similar to what it launched in 2024. That means a Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL and Pixel 10 Pro Fold are absolutely on the menu. Google's tease of the Pixel 10 confirmed what leaked renders have already signaled: the company isn't abandoning the new design language the Pixel 9 established. The pill-shaped camera bump and flat front display will still be present on the Pixel 10, and the real changes will be in the details, like for example, how the flat sides of the Pixel 10 join with the phone's back. Those subtle changes will apparently also include the thickness of the Pixel 10s. While both the Pixel 10, 10 Pro, 10 Pro XL and 10 Pro Fold will use the same sized OLED screens as their Pixel 9 counterparts, they'll be housed in thicker and heavier bodies, according to Android Headlines . Google's new Pixels are also supposed to come in new colors . The Pixel 10 will come in \"Frost\" (a royal blue), \"Lemongrass\" (a yellow), \"Indigo\" (a light purple) and \"Obsidian\" (a dark gray), while the Pixel 10 Pro / Pro XL will come in Obsidian, \"Porcelain\" (off-white), \"Moonstone\" (a bluish gray) and \"Jade\" (a light green). Less information is known about the Pixel 10 Pro Fold, though recent leaks suggest it'll come in Moonstone and Jade, as well. Android Headlines The most visible external change that'll be introduced on the Pixel 10 is the addition of a new telephoto camera. The new telephoto camera is a 11-megapixel 5x telephoto, Android Authority reports , similar to the one on the Pixel 9 Pro Fold. Meanwhile, the Pixel 10 Pro and 10 Pro XL are expected to feature a 50-megapixel wide, 48-megapixel ultrawide, 48-megapixel telephoto and 48-megapixel selfie cameras. The Pixel 10 Pro Fold could feature a different lineup, with a similar main camera, but 12-megapixel ultrawide and telephoto cameras, and 11-megapixel selfie cameras. Inside the new phones, Google is laying the groundwork for future performance gains with a new Tensor G5 chip. It's likely be much more power-efficient thanks to the company switching to a 3nm design produced by TSMC. Reports suggest the chip might not be all that different in terms of raw power, but the Tensor G5 is likely designed to be extra capable when it comes to using local AI features. As far as timing goes, it's worth noting that the latest rumors indicate that the Pixel 10, 10 Pro and 10 Pro XL will be available about a week after the event, on August 28. But the Pixel 10 Pro Fold (as well as the Pixel Watch 4 and Pixel Buds 2a aren't expected for more than a month after that. Those devices are rumored to be on sale as of October 9. While global tariff turmoil could justify a price increase, Google is reportedly keeping things consistent with the Pixel 10 family. They'll offer similar storage options, come in at the same prices and include the same freebies and incentives. The Pixel 10 will come with six months of Google AI Pro and Fitbit Premium, along with three months of YouTube Premium. Meanwhile the Pixel 10 Pro models will get a year of Google AI Pro, six months of Fitbit Premium and three months of YouTube Premium. The prices and storage options for the phones should breakout down as follows: Pixel 10: 128GB ($799), 256GB ($899) Pixel 10 Pro: 128GB ($999), 256GB ($1,099), 512GB ($1,219), 1TB ($1,449) Pixel 10 Pro XL: 256GB ($1,199), 512GB ($1,319), 1TB ($1,549) Pixel 10 Pro Fold: 256GB ($1,799), 512GB ($1,919), 1TB ($2,149) Pixel Watch 4 91mobiles / Onleaks The third time was the charm for the Pixel Watch 3 , so the main task Google has with the Pixel Watch 4 is to not squander the solid base it already has. Leaks for the company's new smartwatches have been limited so far, but renders of the Pixel Watch 4 shared by 91mobiles do suggest Google has a few changes planned. Namely, much like the company's phones, the new Pixel Watch seems like it'll be a little bit thicker and come with smaller bezels. The Pixel Watch 4 should be available to purchase in the same 41mm and 45mm sizes as before, but in new colors — including a Moonstone option to match the Pixel 10 — and with a brighter display . The thicker frame will also help the smartwatch fit a larger battery and a new wireless charging system, according to Android Headlines . Rather than charge through a puck with pogo pins like the Pixel Watch 3, the Pixel Watch 4 will use a wireless charging stand that could fill it up even faster. Beyond that, Google has already indicated how Wear OS is evolving. The new Wear OS 6 update is debuting on the Samsung Galaxy Watch 8 , and will presumably be available on the Pixel Watch 4 at launch. It includes built-in access to Gemini, among other tweaks. Given Google also manages the Fitbit Premium subscription, it wouldn't be all that surprising if the Pixel Watch 4 gets some exclusive fitness tracking features, too. Pixel Buds 2a Billy Steele for Engadget Google launched the Pixel Buds Pro 2 last year, and it typically doesn't update its premium earbuds on a yearly cadence. So instead, Tom's Guide reports Google might pair the Pixel 10 with the Pixel Buds Pro 2 in a new color, and save its new hardware announcements for a sequel to the Pixel Buds A-series called the Pixel Buds 2a. Unlike the company's premium wireless earbuds, the A-series Pixel Buds have historically skimped on things like active noise cancellation to hit a lower price. There's little reporting on where Google will take the Pixel Buds 2a, but you can expect the new earbuds to come in some of the new colors being introduced on the Pixel 10. Pixelsnap The Qi2 wireless charging standard is available for all phone makers to use, but it hasn't been widely adopted among Android phone makers. Qi2 uses magnets to offer improved charging speeds, just like Apple's MagSafe, and the Pixel 10 could mark Google's adoption of Qi2 through a new feature called \"Pixelsnap.\" A report from Android Authority suggests the Pixel 10 will include the necessary magnets to make Qi2 happen, and will be introduced alongside a lineup of Pixelsnap accessories. New leaked images showing a Pixel 10 charging with a magnetic charging puck that looks a lot like Apple's MagSafe charger adds even more credence to the rumor. If you need even more convincing, the Wireless Power Consortium has announced that its faster Qi2 25W charging is coming to \"major Android phones.\" It would make sense if Google's Pixel 10s were included considering runs Android itself. Gemini and other exclusive software features Gemini is Google's current favorite, and the company is pushing the AI assistant everywhere it makes sense. The last few Pixel Drops — Google's regular Pixel-focused software updates — have primarily included Gemini features. It would make sense for Google to include a few more software exclusives on the Pixel 10. Google is hosting the Pixel 10 launch event on August 20 at 1PM ET / 10AM ET. The company has invited press to attend in person, and you can read coverage of everything Google announces right here on Engadget. Update, August 6, 12:15PM ET: Added information about the timeline for when Google's new hardware is expected to arrive. Update, July 30, 2:30PM ET: Added information on pricing for the Pixel 10 lineup and new details on Qi2 support. Update, July 24, 3:44PM ET: Added details on the Pixel Watch 4's display, new colors and charging stand. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/google-pixel-10-launch-event-new-phones-foldables-and-watches-at-the-made-by-google-event-214510252.html?src=rss", "ingested_utc": "2025-08-18T16:57:29Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:29Z", "source": "Engadget_All", "title": "Google announces first nuclear site to power its data centers", "url": "https://www.engadget.com/big-tech/google-announces-first-nuclear-site-to-power-its-data-centers-162627123.html?src=rss", "id_key": "29f1efbbc8dfbdaf0b4de885ee86282f417d70f6c91e3b73ea619a0cd002d615", "summary": "Big Tech's foray into nuclear power continues as Google announced the site of its first nuclear reactor today, as part of its 2024 deal with startup Kairos Power. Oak Ridge, Tennessee, will be home to the Hermes 2 plant, which will supply Google with 50 megawatts of power under a long-term purchase agreement with the Tennessee Valley Authority (TVA). The Oak Ridge plant is the first in a 500-megawatt deal that comprises multiple small modular reactors (SMRs) to provide power for Google's data centers in Montgomery County, Tennessee, and Jackson County, Alabama. The Hermes 2 is scheduled to begin operations in 2030. In a statement , TVA CEO Don Moul said, \"Nuclear is the bedrock of the future of energy security. Google stepping in and helping shoulder the burden of the cost and risk for first-of-a-kind nuclear projects not only helps Google get to those solutions, but it keeps us from having to burden our customers with development of that technology.\" Google's deal with Kairos Power is expected to reach its full 500 MW potential by 2035 and was the first-ever corporate deal to buy nuclear power from SMRs. The financial specifics of the deal have not been released. This article originally appeared on Engadget at https://www.engadget.com/big-tech/google-announces-first-nuclear-site-to-power-its-data-centers-162627123.html?src=rss", "ingested_utc": "2025-08-18T16:57:29Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:37Z", "source": "TheStreet_Top", "title": "Walmart is selling a $120 rocking chair patio set for $74 that buyers call 'very comfy'", "url": "https://www.thestreet.com/deals/devoko-3-piece-rocking-chair-patio-set-walmart-flash-sale", "id_key": "400a3e3e489831049de99904b13850dc7a8a3541bed3595809a784c5c82ad674", "summary": "Shoppers say it's \"very easy to put together.\"", "ingested_utc": "2025-08-18T16:57:37Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:38Z", "source": "AlJazeera_All", "title": "UK warns Sally Rooney after novelist pledges to fund Palestine Action", "url": "https://www.aljazeera.com/news/2025/8/18/uk-warns-sally-rooney-after-novelist-pledges-to-fund-palestine-action?traffic_source=rss", "id_key": "a0398bd57f64cf3efa233b85db698c1f841bbf3eeb9658daa2d59dc1028006e3", "summary": "PM’s office says it is a crime to fund a banned group after award-winning author promises to back pro-Palestine group.", "ingested_utc": "2025-08-18T16:57:38Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:38Z", "source": "AlJazeera_All", "title": "Qatar, Egypt push efforts to reach Gaza ceasefire; Hamas accepts proposal", "url": "https://www.aljazeera.com/news/2025/8/18/qatari-pm-egyptian-president-back-efforts-to-reach-gaza-ceasefire?traffic_source=rss", "id_key": "85e07401516d48c6610c152d18afd0d16f5035357f372447283b626c1f297659", "summary": "Palestinian group tells mediators it approves latest Gaza ceasefire proposal and is ready to resume talks.", "ingested_utc": "2025-08-18T16:57:38Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:44Z", "source": "FinancialPost_Business", "title": "Carney, Ford shift focus to what ‘we can control’ amid U.S. trade uncertainty", "url": "https://financialpost.com/pmn/carney-ford-shift-focus-to-what-we-can-control-amid-u-s-trade-uncertainty", "id_key": "b9df4416aef9a3b8cbdc0d058042d6095d6b85f53b058fc03be251884205a955", "summary": "OTTAWA — Prime Minister Mark Carney and Ontario Premier Doug Ford put the focus on making Canada globally competitive rather than securing a trade deal with the United States as they met in Ottawa on Monday. Carney and Ford were meeting on Parliament Hill as trade talks with the United States show little signs of […]", "ingested_utc": "2025-08-18T16:57:44Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:44Z", "source": "FinancialPost_Business", "title": "Urbana Corporation Announces the Recent Initial Public Offering of One of Its Investees", "url": "https://financialpost.com/globe-newswire/urbana-corporation-announces-the-recent-initial-public-offering-of-one-of-its-investees", "id_key": "b04d8830b6efa46ea3207a503f823aec0205a59ba4a2c6aa7956be01ba388c4c", "summary": "/NOT FOR DISTRIBUTION TO U.S. WIRE SERVICESOR FOR DISSEMINATION IN THE U.S./ TORONTO, Aug. 18, 2025 (GLOBE NEWSWIRE) — Urbana Corporation (“Urbana”) (TSX and CSE: URB, URB.A), is pleased to announce that one of its investee companies, Miami International Holdings Inc. (“MIH”), has recently completed an initial public offering (“IPO”) on the New York Stock […]", "ingested_utc": "2025-08-18T16:57:44Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:44Z", "source": "FinancialPost_Business", "title": "Maryland’s first-in-the-nation tax on digital ads violated Big Tech’s free speech, judges say", "url": "https://financialpost.com/pmn/marylands-first-in-the-nation-tax-on-digital-ads-violated-big-techs-free-speech-judges-say", "id_key": "b2f5d9fdab0da34cde661f2b1fe5ff0df850e1b6098b4bcce2f392f90a75c453", "summary": "ANNAPOLIS, Md. (AP) — Maryland’s first-in-the-nation tax on digital advertising violated the Constitution, a federal appeals court says, because blocking Big Tech from telling customers about the tax violates the companies’ right to free speech. Supporters say Maryland needed to overhaul its tax methods in response to significant changes in how businesses advertise. The tax […]", "ingested_utc": "2025-08-18T16:57:44Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:44Z", "source": "FinancialPost_Business", "title": "TalkMe Brings a Penguin to Life at Google I/O, Redefining AI Language Learning", "url": "https://financialpost.com/globe-newswire/talkme-brings-a-penguin-to-life-at-google-i-o-redefining-ai-language-learning", "id_key": "57a327ec806728848e2cf9e5c09751e633fd71af390b81ef37e52024280821bd", "summary": "AI-native app showcases storytelling power and user stickiness with 1M+ learners NEW YORK, Aug. 18, 2025 (GLOBE NEWSWIRE) — TalkMe AI, the flagship product of Singapore-based Inspired AI, turned heads at Google I/O with a fully AI-generated brand film built on Google’s Gemini, Veo 3, and Flow models. The short tells the story of a […]", "ingested_utc": "2025-08-18T16:57:44Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:44Z", "source": "FinancialPost_Business", "title": "CUPE to Give Update on Air Canada Negotiations", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/cupe-to-give-update-on-air-canada-negotiations", "id_key": "97927ddab6a9ba3936c83233f8d55b9927ac104da53429fcddc1f3f6b0b9786d", "summary": "TORONTO — Representatives of CUPE will be available to provide an update on negotiations with Air Canada today at 12:30 PM Eastern. WHERE: O’Hare Room, 1st Floor, Sheraton Gateway, Terminal 3, Pearson Airport, Toronto ON WHO: CUPE National President Mark Hancock CUPE National Secretary-Treasurer Candace Rennick WHEN: August 18, 12:30PM Eastern View source version on […]", "ingested_utc": "2025-08-18T16:57:44Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T16:57:59Z", "source": "HackerNews_Top", "title": "Countrywide natural experiment links built environment to physical activity", "url": "https://www.nature.com/articles/s41586-025-09321-3", "id_key": "f4ab207b33b58c19d035ddb13e08cfb73fe52c444a20b659149b75d5d1941774", "summary": "Comments", "ingested_utc": "2025-08-18T16:57:59Z"}
