{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:36Z", "source": "BBC_Business", "title": "TFW you're doing a food shop, but something's not right", "url": "https://www.bbc.com/news/videos/crlz4geld2zo?at_medium=RSS&at_campaign=rss", "id_key": "da03a280f5c5ab7e9eca2a395519fc5dc65fe8e0a59b4242a6299910dfe50188", "summary": "TFW you're doing a food shop, but something's not right", "ingested_utc": "2025-08-25T15:39:36Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_Business", "title": "Dr Pepper buys Peet’s owner in $18bn deal amid coffee industry tariff turmoil", "url": "https://www.theguardian.com/business/2025/aug/25/keurig-dr-pepper-peets-coffee", "id_key": "8268d992636262cf474186783eae728727639b7f5eb40a99e001dab0d51d2a76", "summary": "Deal comes at a time when consumers are pulling back and Trump’s trade wars threaten to send coffee prices soaring Keurig Dr Pepper will buy the owner of Peet’s Coffee, Douwe Egberts and Kenco in an $18bn deal, then break itself in two, with one company selling coffee and the other selling cold beverages like Snapple, Dr Pepper, 7UP and energy drinks. The agreement announced on Monday will essentially unwind the 2018 merger of Keurig and Dr Pepper and it arrives at a time when consumers are pulling back and the trade wars under Donald Trump threaten to send coffee prices soaring. Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_Business", "title": "Back to the office! Why gen Z has had enough of working from home", "url": "https://www.theguardian.com/money/2025/aug/25/back-to-office-gen-z-enough-working-from-home", "id_key": "9797754163ecf0ded3b9edaa8f7f2721eef93a7a18d305d2e8c9ec84fef9d629", "summary": "In a new survey, 45% of this age group were considering looking for jobs with more social interaction – and the loneliest of all were influencers Name: Office work. Age: The first purpose-built offices appeared in the 18th century . Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_World", "title": "Dinner or a shower? Elderly people fear tough choices when Australia’s new aged care changes are rolled out", "url": "https://www.theguardian.com/australia-news/2025/aug/26/dinner-or-a-shower-elderly-people-fear-tough-choices-when-australias-new-aged-care-changes-are-rolled-out", "id_key": "a95b1168ad2e7eec5adb014f8d6a3340126e091b5f890bb1e43fe49f0514b68a", "summary": "Advocates warn increased costs for basic assistance like showers and wound cleaning will push older people into aged care or hospital Margaret Duckett is scared for her friends. The 77-year-old pensioner is the recipient of a home care package – which allows her to get support with cleaning, gardening, transport, physiotherapy and podiatry – and some personal care, so she can continue living independently at her home in Sydney’s Riverview. Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_World", "title": "Victorian couple sue TikTok for blocking account after allegedly competing in live battles against banned users", "url": "https://www.theguardian.com/australia-news/2025/aug/25/victorian-couple-sue-tiktok-for-blocking-account-after-allegedly-competing-in-live-battles-against-banned-users-ntwnfb", "id_key": "4e45d8edcbf19f1f1b9768bb235d320bf4f3058dd27767d06b0e914b7f83c04c", "summary": "Pair allege platform breached failed to provide them with procedural fairness, claiming firm has ‘permanently removed’ their livelihood Get our breaking news email , free app or daily news podcast A Victorian couple is suing TikTok after their account was banned from the social media platform, allegedly for competing in TikTok live battles against banned users. Selim Ozgan and his wife, Inci Guven, have sued TikTok and its Singaporean subsidiary in the federal court of Australia, alleging the ByteDance-owned company had unfair contract terms under Australian Consumer Law. Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_World", "title": "Strictly Come Dancing star arrested on suspicion of rape, Met police say", "url": "https://www.theguardian.com/uk-news/2025/aug/25/strictly-come-dancing-star-arrested-on-suspicion-of-met-police-say", "id_key": "742970552d61885e96bfc317f28a145c4f4cd80b049d7ed31db98f635c751efb", "summary": "Man, who is in his 30s, was also detained over alleged offence of ‘non-consensual intimate image abuse’ A Strictly Come Dancing star has been arrested on suspicion of rape, according to reports. The man in his 30s, who has not been named, was also detained over a separate alleged offence of “non-consensual intimate image abuse”, the Metropolitan police said. Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_World", "title": "Surgeons transplant pig lung into brain dead human recipient for first time", "url": "https://www.theguardian.com/science/2025/aug/25/surgeons-transplant-pig-lung-into-brain-dead-human-recipient-for-first-time", "id_key": "08e1124344a06661812db3a80d9624162c589924a992e91954f132cb40702a5c", "summary": "Genetically modified lung functioned for nine days, in latest development in xenotransplantation aimed at solving organ shortage crisis Surgeons have transplanted a lung from a genetically modified pig into a brain dead human recipient for the first time and found it functioned for nine days, researchers have revealed. The work is the latest development in a technique called xenotransplantation that is aimed at solving the organ shortage crisis: according to the World Health Organization , only up to 10% of the global need for such transplants is being met. Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_World", "title": "Trump signs executive order to eliminate cashless bail in Washington", "url": "https://www.theguardian.com/us-news/2025/aug/25/trump-executive-order-cashless-bail", "id_key": "6d621cdf365d970a5506d90a5ea51b811b7e9fd474ebb9d739008eac187ace5c", "summary": "Move is an escalation in Trump’s efforts to take control of law enforcement in the capital city and beyond Donald Trump on Monday signed two executive orders aimed at eliminating cashless bail for people accused of crimes in Washington DC and other jurisdictions, an escalation in his efforts to take control of law enforcement in the capital city and beyond. The executive orders direct Washington and other localities to end their cashless bail programs, which allow people charged with crimes to leave jail while they await trial without paying what can be large sums of money. The order says that the federal government will reconsider funding decisions, services, or approvals if Washington does not comply. Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:39:38Z", "source": "Guardian_World", "title": "Trump signs order to criminally charge those who burn US flag in protest", "url": "https://www.theguardian.com/us-news/2025/aug/25/trump-flag-burning-executive-order", "id_key": "2947bc49ebd88d94bfdc1bd1b553986b209287fb276fc5851a8fdb84cbc41fbd", "summary": "US president attempts to circumvent 1989 supreme court decision which said flag burning is protected speech Donald Trump signed an executive order on Monday instructing federal prosecutors to pursue criminal charges against individuals who burn American flags during protests. The order tells the US attorney general, Pam Bondi, to look at cases where people burned flags and see if they can be charged with other crimes like disturbing the peace or breaking environmental laws. Continue reading...", "ingested_utc": "2025-08-25T15:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:40:08Z", "source": "CryptoSlate", "title": "Strategy and Metaplanet collectively control 651,448 BTC worth $72.6B after surprise $367M buy", "url": "https://cryptoslate.com/strategy-and-metaplanet-now-control-651448-btc-worth-72-6b-after-surprise-367m-buy/", "id_key": "99f4ea6351ea59671bbbcd2f26fa8041f95cca590e13f3e8ff3a86ad973e6cd5", "summary": "Corporate demand for Bitcoin continues despite its volatile price performance, as Strategy and Metaplanet both expanded their holdings in late August. On Aug. 25, the two companies announced that they acquired more than 3,100 BTC, reflecting how institutional treasuries directly reduce available supply and shape market liquidity. Strategy’s first major purchase in August Strategy, the […] The post Strategy and Metaplanet collectively control 651,448 BTC worth $72.6B after surprise $367M buy appeared first on CryptoSlate .", "ingested_utc": "2025-08-25T15:40:08Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:40:08Z", "source": "CryptoSlate", "title": "XRP ETPs see $25M inflows as Bitcoin and Ethereum drive $1.43B exodus", "url": "https://cryptoslate.com/xrp-sees-25m-inflows-as-bitcoin-and-ethereum-drive-1-43b-exodus/", "id_key": "972524dc3dab04eb5ebd7ac9159063aa701c2fa7f502b2778c828e4ec3c7343f", "summary": "Digital asset investment products recorded their most significant withdrawal in months last week, with outflows totaling $1.43 billion, CoinShares‘ latest weekly report revealed. CoinShares reported that the sell-off marked the third-largest outflow of the year and the biggest since March. According to the firm, trading activity also intensified last week, with exchange-traded products (ETPs) generating $38 […] The post XRP ETPs see $25M inflows as Bitcoin and Ethereum drive $1.43B exodus appeared first on CryptoSlate .", "ingested_utc": "2025-08-25T15:40:08Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:40:13Z", "source": "CryptoNews", "title": "Will $OKB Hold $184 After Token Burn and X Layer Upgrade Despite Regulatory Challenges?", "url": "https://cryptonews.com/news/will-okb-hold-184-after-token-burn-and-x-layer-upgrade-despite-regulatory-challenges/", "id_key": "032ccc223220af786f4b257c83a671236e2b7c7cd7de21c5db2f67df9abb2c39", "summary": "$OKB is trading at $184 after an 11.8% pullback, yet remains dramatically elevated following its historic 177% weekly explosion. While regulatory clouds linger and technicals show consolidation, the fundamental landscape has permanently shifted. With supply now permanently capped and utility expanding through X Layer integration, this pullback may represent a new foundation rather than a […] The post Will $OKB Hold $184 After Token Burn and X Layer Upgrade Despite Regulatory Challenges? appeared first on Cryptonews .", "ingested_utc": "2025-08-25T15:40:13Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:40:13Z", "source": "CryptoNews", "title": "BitMine Adds 190,500 ETH — $2.2B Weekly Haul Makes It No. 1 Ethereum Treasury", "url": "https://cryptonews.com/news/bitmine-adds-190500-eth-2-2b-weekly-haul-makes-it-no-1-ethereum-treasury/", "id_key": "bdd5bf37fa0de9a64cd03cd5a3fdb035bd3df25e9e1a93450b7efb961d9d8cc7", "summary": "Tom Lee’s BitMine, backed by bold institutional capital, now holds 1.71 million ETH—staking its claim as the largest corporate Ethereum treasury The post BitMine Adds 190,500 ETH — $2.2B Weekly Haul Makes It No. 1 Ethereum Treasury appeared first on Cryptonews .", "ingested_utc": "2025-08-25T15:40:13Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:40:13Z", "source": "CryptoNews", "title": "Ethereum Is Digital Fuel Powering the Next Financial Era, Says Crypto Treasury CEO", "url": "https://cryptonews.com/news/ethereum-is-digital-fuel-powering-the-next-financial-era-says-crypto-treasury-ceo/", "id_key": "27fd142e902e9ad96de788c0c49c16bbb6b8a27d12ac8059b350f4bbdf584f6d", "summary": "Ethereum has outperformed major tokens, with its role as infrastructure gaining traction among institutions as frameworks have advanced via the GENIUS Act. CEO Daniel Liu of Republic Technologies has described Ethereum as digital fuel and has pursued validator and derivatives yield. The post Ethereum Is Digital Fuel Powering the Next Financial Era, Says Crypto Treasury CEO appeared first on Cryptonews .", "ingested_utc": "2025-08-25T15:40:13Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:40:14Z", "source": "CoinJournal", "title": "Webull reopens crypto trading for US users following 2023 suspension", "url": "https://coinjournal.net/news/webull-reopens-crypto-trading-for-us-users-following-2023-suspension/", "id_key": "df4b9ab9d45f9d33a74f01393a9923e632198680dc57b4bbe67d499e62274920", "summary": "The platform halted the trading services during its IPO preparations. US traders can start accessing Webull from today, August 25. Customers can trade more than 50 tokens, with plans to add more instruments soon. Webull Corp has reintroduced cryptocurrency trading services to its US customers, starting August 25, 2025. Notably, the platform supported crypto trading […] The post Webull reopens crypto trading for US users following 2023 suspension appeared first on CoinJournal .", "ingested_utc": "2025-08-25T15:40:14Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:06Z", "source": "NYTimes_World", "title": "Five Journalists Among Those Killed in Israeli Strikes on Gaza Hospital", "url": "https://www.nytimes.com/2025/08/25/world/middleeast/gaza-hospital-journalists.html", "id_key": "3784df72c11d5c08fc6f7e7c36ae39640ae7f8a518a64d2f9b8f56c9b5d31a84", "summary": "The five Gaza-based reporters had worked for various international media outlets, their employers said. The Israeli military confirmed its forces had struck the hospital area, without saying why.", "ingested_utc": "2025-08-25T15:42:06Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:34Z", "source": "TechCrunch_All", "title": "Volunteer opportunities still open for TechCrunch Disrupt 2025", "url": "https://techcrunch.com/2025/08/25/want-to-attend-techcrunch-disrupt-2025-for-free-volunteer-but-the-clocks-ticking/", "id_key": "cef1d2748e79e22160aeeaf63f3e6f49178c574879abe3f5c2a37fe1a4de82a2", "summary": "Whether you want to launch your own startup, build your event chops, or get inspired by real traction stories, volunteering at TechCrunch Disrupt 2025 is your backstage pass to see how a world-class tech conference comes to life. Apply before September 30.", "ingested_utc": "2025-08-25T15:42:34Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:37Z", "source": "Engadget_All", "title": "SpaceX plans to launch Starship for its 10th test flight this evening", "url": "https://www.engadget.com/science/space/spacex-is-about-to-launch-starship-for-its-10th-test-flight-215652105.html?src=rss", "id_key": "fee850ecb59818ac4911856dfa8ce4dbc2263bdad170c3386b89bb54b8ed6ba7", "summary": "SpaceX's massive Starship rocket is scheduled to lift off from the company's Texas launch site as soon as this evening for its 10th flight. After scrubbing the launch initially planned for Sunday, August 24, things are apparently back on track for Monday, August 25. The launch window opens at 7:30PM ET (6:30PM CT). As always, the flight test will be livestreamed on the SpaceX website and on X, with a webcast starting 30 minutes before launch. Yesterday, the weather looked iffy for launch; SpaceX said on Saturday that conditions were looking only 45 percent favorable. Ultimately the Sunday launch was cancelled \"to allow time to troubleshoot an issue with ground systems,\" according to a SpaceX post on X. Standing down from today's tenth flight of Starship to allow time to troubleshoot an issue with ground systems — SpaceX (@SpaceX) August 24, 2025 Flight 10 follows a series of failures this year during SpaceX's seventh , eighth and ninth test flights. And in June, a Starship vehicle exploded on the ground during preparations for a static fire test of its six Raptor engines. If all goes according to plan for Flight 10, Starship will deploy eight dummy Starlink satellites and perform \"several experiments focused on enabling Starship’s upper stage to return to the launch site.\" It won't actually be returning to the launch site this time, though. The test is expected to last a little over an hour, and end with a splashdown in the Indian Ocean. Update, August 25, 2025, 11:30AM ET: This story was updated to note that Sunday's launch was scrubbed and that SpaceX will try again tonight. This article originally appeared on Engadget at https://www.engadget.com/science/space/spacex-is-about-to-launch-starship-for-its-10th-test-flight-215652105.html?src=rss", "ingested_utc": "2025-08-25T15:42:37Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:37Z", "source": "Engadget_All", "title": "Netflix sets opening dates for its destination entertainment hubs", "url": "https://www.engadget.com/entertainment/streaming/netflix-sets-opening-dates-for-its-destination-entertainment-hubs-150851082.html?src=rss", "id_key": "5e5e7fe9fe1bbced2311237e90b0a6f30cdf9c5e32b08fd3b5ef2f2191fc07a7", "summary": "We now have the opening dates for Netflix's branded entertainment complexes that we first learned of in 2023. The 100,000-square-foot amusement centers will be centered around all things Netflix and will include a retail component, a restaurant called Netflix Bites and numerous \"immersive story-driven experiences\" based on the company's most successful properties. The Netflix House in Philadelphia will open November 12 at the King of Prussia Mall, and the Dallas location will open December 11 at Galleria Texas. A third location is planned for Las Vegas in 2027. As part of the branded build-out, the Philadelphia location will house large-scale immersive experiences such as Wednesday: Eve of the Outcasts , while Dallas will feature Stranger Things: Escape the Dark and Squid Game: Survive the Trials . These entertainment hubs come after Netflix has already undertaken dozens of live interactive experiences based on its most popular shows. Aside from these experiences and the Netflix Bites restaurant, the locations will also showcase immersive virtual reality games where guests will play as the main characters from some of the company's hit shows. There will also be themed mini-golf, a theater showcasing Netflix shows and movies, themed arcade games and more. Netflix isn't the first tech company to step into the world of brick-and-mortar. Amazon has spun up a few branded stores to varying success . Meta also opened physical stores to showcase its virtual reality headsets, taking a page out of Apple's book. This article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/netflix-sets-opening-dates-for-its-destination-entertainment-hubs-150851082.html?src=rss", "ingested_utc": "2025-08-25T15:42:37Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:57Z", "source": "FinancialPost_Business", "title": "Banks expected to have kept aside less money during their third quarters for bad loans", "url": "https://financialpost.com/fp-finance/banking/banks-less-money-aside-q3-bad-loans", "id_key": "e19a3367cfc6e1252ed1780adb6bac6eb4eecafe95997058ea6c110f882e2734", "summary": "Investors appear to be getting more comfortable with tariff-related risks, analysts say", "ingested_utc": "2025-08-25T15:42:57Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:57Z", "source": "FinancialPost_Business", "title": "Oil Advances After Fed Signals Possible Return to Rate Cuts", "url": "https://financialpost.com/pmn/business-pmn/oil-advances-after-fed-signals-possible-return-to-rate-cuts", "id_key": "f42b47a80f2dde43d86bb5793a963ad8ae7dd34300d1a7bc65dffdce9354eada", "summary": "Oil advanced, solidifying gains from the previous week, as a move above key technical levels helped extend a rally sparked by signs that the Federal Reserve will resume cutting interest rates.", "ingested_utc": "2025-08-25T15:42:57Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:57Z", "source": "FinancialPost_Business", "title": "Democrats ask Trump to resume a major offshore wind project near Rhode Island", "url": "https://financialpost.com/pmn/democrats-ask-trump-to-resume-a-major-offshore-wind-project-near-rhode-island", "id_key": "cd68d48dd318c0c4bd424a981451ea4dba718f751658da893dabf6d12c361d4f", "summary": "A nearly complete wind farm off the coast of Rhode Island and Connecticut faces an uncertain future as the states’ Democratic governors, members of Congress and union workers are calling Monday for the Trump administration to let construction resume. The administration halted construction on the Revolution Wind project last week, saying the federal government needs […]", "ingested_utc": "2025-08-25T15:42:57Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:42:57Z", "source": "FinancialPost_Business", "title": "Developer establishes a $150,000 grant program to help families get into homes with ‘free money’", "url": "https://financialpost.com/globe-newswire/developer-establishes-a-150000-grant-program-to-help-families-get-into-homes-with-free-money", "id_key": "cf737e9c67ed043423e665b2fb29e0fe4558ea10505ae9e49b3d0508d90cfe25", "summary": "NORTH VANCOUVER, British Columbia, Aug. 25, 2025 (GLOBE NEWSWIRE) — Canada West Group, a North Vancouver-based developer and builder with more than 20 years of experience creating quality multi-family homes, is introducing a new cash grant program designed to help families and individuals close the gap to home ownership in the Lower Mainland’s housing market. […]", "ingested_utc": "2025-08-25T15:42:57Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T15:43:12Z", "source": "HackerNews_Top", "title": "Hundreds lose water source in Colorado's poorest county with no notice", "url": "https://coloradosun.com/2025/08/25/costilla-county-water-cutoff/", "id_key": "0799f629b95c8ec8593470e051f03965a130078ebb01042e260b1fd3fde29c3a", "summary": "Comments", "ingested_utc": "2025-08-25T15:43:12Z"}
