{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T22:50:14Z", "source": "Guardian_World", "title": "Politics live: Greens say environment law revamp must include climate trigger; Australia Post suspends parcel deliveries to US", "url": "https://www.theguardian.com/australia-news/live/2025/aug/26/australia-politics-live-labor-coalition-trades-ndis-environment-epa-anthony-albanese-sussan-ley-question-time-ntwnfb", "id_key": "703818f4dca99c85c8046f57e9f4383ea6a00691b588b7204ac88a2b597f5045", "summary": "Larissa Waters welcomes urgency of getting EPBC legislation into parliament this year, but says Greens want to see a climate trigger. Follow today’s news live Get our breaking news email , free app or daily news podcast In the last parliament, the government had just reached a deal with the Greens and members of the crossbench, to get its environmental laws over the line. Now that they’ve had to go back to the drawing board, the Coalition and the Greens will be approached for negotiation (as Murray Watt outlined a bit earlier). We need laws that actually act on the climate crisis, protect nature. And of course, we will always stand for making sure everyone’s got a home, a roof over their heads in this wealthy country. So the offer’s there. We’re looking forward to those discussions with government. Or they can choose to do a deal that will just pave the way for more big business profits, trash nature and leave ordinary people behind with the Libs. It’s very clear that targeting or hitting hospitals, health workers and civilians is a breach of international law. We join with the rest of the international community in condemning this action. Continue reading...", "ingested_utc": "2025-08-25T22:50:14Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T22:50:44Z", "source": "FT_Home", "title": "Norway’s oil fund sells Caterpillar stake over Israeli allegations", "url": "https://www.ft.com/content/31387962-398d-4809-950a-6353f9178728", "id_key": "3d274db5cbf5d6386320a683120f6fbb483e2afd6aaa939ad1c8ddfa7675552f", "summary": "Divestment marks first time fund has sold out of a non-Israeli company because of role in Palestinian territories", "ingested_utc": "2025-08-25T22:50:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T22:51:19Z", "source": "FinancialPost_Business", "title": "Hydreight Achieves 33% YoY H1 Revenue Growth, Records 3rd Consecutive Quarter of Profitability, and Strengthens Performance Across Verticals", "url": "https://financialpost.com/globe-newswire/hydreight-achieves-33-yoy-h1-revenue-growth-records-3rd-consecutive-quarter-of-profitability-and-strengthens-performance-across-verticals", "id_key": "c75b76329bb508300640bc03516c750f2aa75a989870a5747244dba6b1903fde", "summary": "“We had a great first 6 months, with 33% year-over-year growth. We have also exceeded our internal metrics across all verticals in the first seven months of the year, reinforcing the strength of our strategy. A key focus has been our investment in making the VSDHOne platform fully modular, allowing customers to adopt it module […]", "ingested_utc": "2025-08-25T22:51:19Z"}
