{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:34:23Z", "source": "CryptoSlate", "title": "Real estate’s quiet crash: your home is worth less than ever in Bitcoin", "url": "https://cryptoslate.com/real-estates-quiet-crash-your-home-is-worth-less-than-ever-in-bitcoin/", "id_key": "0f3cef6c6f101761872f465be521a3e4653d2c736654ec50a5f0e4045e099a14", "summary": "In April 2023, a Bitcoiner going by the name of Breadman purchased a property for $496,000, which was equivalent to 22.5 BTC at the time. Fast forward to August 2025, and the property is now valued at $570,000, a respectable 15% gain in dollar terms. But here’s the kicker: priced in Bitcoin, his home is […] The post Real estate’s quiet crash: your home is worth less than ever in Bitcoin appeared first on CryptoSlate .", "ingested_utc": "2025-08-23T14:34:23Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:34:26Z", "source": "CryptoNews", "title": "IRS Digital Assets Chief Trish Turner Resigns After Three Months", "url": "https://cryptonews.com/news/irs-digital-assets-chief-trish-turner-resigns-after-three-months/", "id_key": "a41d411b26fd0775428af3a9107010fc5cb0e64e7558bf44eeaff4c1cd2645f8", "summary": "Trish Turner has stepped down as head of the United States Internal Revenue Service’s (IRS) digital assets division, leaving the role after just three months. The post IRS Digital Assets Chief Trish Turner Resigns After Three Months appeared first on Cryptonews .", "ingested_utc": "2025-08-23T14:34:26Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:36:17Z", "source": "NYTimes_World", "title": "Collapse of Bridge Under Construction in China Leaves 12 Dead", "url": "https://www.nytimes.com/2025/08/23/world/asia/china-bridge-collapse.html", "id_key": "3dcd62a229dc5e7bae9bed8e0eec358432c4dd16e1226a9700acec8ab542aab9", "summary": "A section of the railway bridge, under construction in the country’s northwest, plunged into the Yellow River early on Friday.", "ingested_utc": "2025-08-23T14:36:17Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:36:25Z", "source": "NPR_Top", "title": "Photos: The perilous lives of miners in South Africa's abandoned mines", "url": "https://www.npr.org/sections/goats-and-soda/2025/08/23/g-s1-82257/photos-miners-abandoned-mines-south-africa", "id_key": "aa1fb89e338bbbc17ca85603e708b4953d385c3dc7ce18f729afba16df3bdefc", "summary": "'Artisanal miners' is the phrase used for South Africans who salvage coal from abandoned mines. It's a grueling and risky life. \"Bit by bit it's killing something inside me,\" says one such miner.", "ingested_utc": "2025-08-23T14:36:25Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:36:50Z", "source": "Engadget_All", "title": "The best Labor Day sales for 2025: Save on tech from Apple, Sony, Shark and others", "url": "https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-save-on-tech-from-apple-sony-shark-and-others-120049396.html?src=rss", "id_key": "358304d827780c085876fda04cc23d9e61abbd9aa36bd860ef22d85cf30192e7", "summary": "Labor Day may bring about the unofficial end to summer, but on the bright side, it can be a good time to save on tech. While seasonal holidays like Memorial Day and Labor Day aren’t the boon for tech deals as Prime Day or Black Friday can be, you can still find some good deals across the web. That’s particularly true if you’re going back to school soon, or are shopping for someone imminently heading back to campus. Engadget has you covered for all of the best Labor Day sales on tech. Since this time of year does overlap with the back-to-school season, students should be first in line to check out these deals. If you need some new gadgets for college, or refreshed tech to help you out in your first job after graduating, now's the time to see if you can get it for less. Student discounts are handy and exclusive to those who can prove their student status, but the good thing about Labor Day sales is that anyone can take advantage of them — student ID not required. Best Labor Day sales: Engadget's top picks Apple AirPods Pro 2 for $169 (32 percent off): The AirPods Pro 2 are Apple’s best set of wireless earbuds for now, as they offer the full set of Apple-focused features, strong ANC, onboard volume controls, a comfy in-ear design and a warm sound profile that most should find agreeable. They can even work as a hearing aid , though their six-hour battery life still isn’t the best, and you should only get them if you’re all-in on Apple hardware. But if that’s the case, we consider them the best wireless earbuds for iPhone owners. Apple iPad (11-inch, A16) for $299 ($50 off): Apple's entry-level iPad is, unsurprisingly, the best iPad option for those on a budget. It has solid performance thanks to the A16 chipset, 128GB of storage in the base model and good battery life. Apple Mac mini M4 for $499 ($100 off): The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard, two front-facing USB-C ports, an extra Thunderbolt 4 port and the ability to drive three external displays. We gave the M4 Pro model a review score of 90 . Google Pixel 10 smartphone + $100 Amazon gift card for $799 ($100 off): More of a pre-order deal than a Labor Day deal, this bundle includes a free gift card when you order the latest Google Pixel phone in advance. You'll find different gift card deals at Amazon depending on which phone you go with: the Pixel 10 Pro and Pro XL have a $200 gift cards included, while the Pixel 10 Pro Fold comes with a free $300 gift card. Blink Outdoor 4 security cameras (3 camera system) for $100 (47 percent off): Some of our favorite security cameras , Blink Outdoor 4 devices support 1080p video, two-way talk, motion alerts and night vision. The most convenient thing about these is that they're totally wireless and run on AA batteries that can last up to two years before you need to replace them. That combined with their weather-proof design allows you to place them both inside and outside. Eufy 11S Max robot vacuum for $150 (46 percent off): This model is one of our favorite budget robot vacuums thanks to its slim design that lets you get underneath furniture more easily and strong suction power for its size. Note that it does not have Wi-Fi connectivity, but it comes with a remote that lets you control the robot to your liking. Shark AI Ultra robot vacuum for $298 (50 percent off): This Shark robot vacuum is a version of one of our favorites and it comes with a auto-empty base that can hold up to 60 days worth of debris. It has strong suction power and home mapping capabilities, so you can tailor cleaning jobs to your liking in addition to putting the robot on a cleaning schedule. Cosori 9-in-1 air fryer for $90 (25 percent off): One of our picks for the best air fryers , this Cosori model has a spacious six-quart cooking basket and nine prep modes to choose from. In our testing, it consistently crisped up all kinds of foods, from frozen appetizers to raw proteins, and it has a nifty safety feature with its built-in basket release button. HORI Piranha Plant camera for Switch 2 for $40 (33 percent off): If you plan on taking advantage of the Switch 2's video and group chat feature, there's no cuter way to do it than with this Piranha Plant camera. In addition to using it with the pot as a stand, the plant itself detaches from the pot so you can use the camera in portable mode with the USB port on the new console. ESPN Unlimited with Disney+ and Hulu (with ads) for $30/month ($6/month off): ESPN’s new streaming service is officially available now, and new subscribers can get Disney+ and Hulu included for one year when they sign up. The regular price of the new ESPN Unlimited plan is $30 per month, but this bundle offer throws in Disney+ and Hulu (with ads) for one year at no extra cost. If you want to break it down, you’re essentially getting each of the three services for $10 monthly with this offer. NordVPN deal — Get up to 77 percent off two-year plans: Most of NordVPN's two-year plans are on sale right now. You'll get 77 percent off the Prime tier, bringing the price down to $189 for 27 months of service (Nord throws in an extra three months for free). Arguably the best plan for most people is the Plus tier, which is 73 percent off and down to $108 for the 27-month term. MasterClass deal — Get 50 percent off one-year subscriptions: You can sign up for one year of MasterClass access for as low as $5 per month thanks to this sale that runs through September 1. A subscription lets you watch hundreds of online video classes taught by experts in their fields, and subject matter ranges from writing to cooking to sports. Best Labor Day sales on tech Beats Studio Pro headphones for $180 (49 percent off) 8Bitdo Ultimate 2C Wired Controller for $15 (25 percent off) Sony WH-1000XM4 headphones for $198 (43 percent off) Anker 621 5K magnetic power bank for $28 (30 percent off) Amazon Fire Max 11 tablet for $175 (24 percent off) Nothing Headphones (1) for $269 ($30 off) Amazon Labor Day sale: Get up to 40 percent off headphones, earbuds, tech accessories and more Sonos back-to-school sale: Save up to 25 percent on headphones and speakers Ooni Labor Day sale: Get 20 percent off the Koda 2 Max and save on other pizza ovens Solo Stove Labor Day sale: Get 20 percent off fire pits and 15 percent off select accessories Meater Labor Day sale: Get up to 27 percent off smart meat thermometers Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-save-on-tech-from-apple-sony-shark-and-others-120049396.html?src=rss", "ingested_utc": "2025-08-23T14:36:50Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:36:58Z", "source": "TheStreet_Top", "title": "Can the president fire a Federal Reserve governor?", "url": "https://www.thestreet.com/fed/can-the-president-fire-a-federal-reserve-governor-", "id_key": "c2c8affd721cc318f45be6b1d1f8b8b72464b56a7904bb8c8fed42082cb2c0c1", "summary": "Mortgage fraud allegations raise fresh concerns about whether the White House can legally fire a member of the central bank’s board.", "ingested_utc": "2025-08-23T14:36:58Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:36:58Z", "source": "TheStreet_Top", "title": "McDonald’s joins the pumpkin spice war with its fall 2025 menu", "url": "https://www.thestreet.com/restaurants/mcdonalds-joins-the-pumpkin-spice-war-with-its-fall-2025-menu", "id_key": "9d10f749126422042f3f89c60de6e9e026fd6f34437f5b1684867b57db1a9669", "summary": "McDonald's finally unveils its fall 2025 menu, and it is pumpkin spice-filled.", "ingested_utc": "2025-08-23T14:36:58Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:36:58Z", "source": "TheStreet_Top", "title": "Collecting Social Security early has one major effect", "url": "https://www.thestreet.com/retirement/social-security-benefits-claiming-early-can-trigger-major-impact", "id_key": "5064687ab020bc1431d311802ac290c61bdb835aef81002fc6f33319a7a1b50e", "summary": "Finance experts reveal the impact of a key Social Security decision Americans face.", "ingested_utc": "2025-08-23T14:36:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T14:37:29Z", "source": "HackerNews_Top", "title": "450× Faster Joins with Index Condition Pushdown", "url": "https://readyset.io/blog/optimizing-straddled-joins-in-readyset-from-hash-joins-to-index-condition-pushdown", "id_key": "b490519af44fb7837b1a3aa11a934407a5a1be5480e1bab06f68c51a0233f03a", "summary": "Comments", "ingested_utc": "2025-08-23T14:37:29Z"}
