{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:35:10Z", "source": "Guardian_World", "title": "Trump rules out sending US troops to Ukraine as part of security guarantees", "url": "https://www.theguardian.com/world/2025/aug/19/european-leaders-ukraine-russia-trump", "id_key": "2b963d73526bb4c4ccb1e50f1dd783c2c4abae9ab49d88ab1cce7c37d4322b9f", "summary": "US president suggests he may be willing to provide air power to help to enforce potential peace deal with Putin Donald Trump has ruled out sending US troops to Ukraine to enforce a potential peace deal with Vladimir Putin, tempering a promise to provide Kyiv with security guarantees that European allies had called a significant breakthrough towards halting the Kremlin’s invasion of Ukraine. Asked during a phone interview with Fox News whether he could assure listeners – including many members of his Maga base who support an isolationist America-first foreign policy – that the US would not put troops on the ground in Ukraine, he said: “You have my assurance, and I’m president.” Continue reading...", "ingested_utc": "2025-08-19T17:35:10Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:35:11Z", "source": "Guardian_World", "title": "UK to offer troops to defend Ukraine’s skies and ports in Pentagon talks", "url": "https://www.theguardian.com/uk-news/2025/aug/19/uk-to-offer-troops-to-defend-ukraines-skies-and-ports-in-pentagon-talks", "id_key": "80e1f9bec48b6302f4427b461106358f47b34427f4560f270db2823db9a16ac5", "summary": "Officials say UK not prepared to deploy troops to frontline with Russia as head of armed forces prepares to meet US counterparts in Washington The head of the British armed forces will tell his American counterpartsthe UK was prepared to send troops to defend Ukraine’s skies and seas but not to the frontline with Russia, as planning intensifies for a postwar settlement. Tony Radakin, the chief of the defence staff, will on Wednesday attend meetings at the Pentagon designed to finalise what 30 different countries are willing to commit to Ukraine’s national security. Continue reading...", "ingested_utc": "2025-08-19T17:35:11Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:35:11Z", "source": "Guardian_World", "title": "Thames Water creditor compares UK to Puerto Rico over treatment of lenders", "url": "https://www.theguardian.com/business/2025/aug/19/thames-water-creditor-compares-uk-to-puerto-rico-over-treatment-of-lenders", "id_key": "1f34698185ac9aa267cf0cfe42fc11283cc31240101a759a24eeaea3f82b44bd", "summary": "Creditors of US territory’s water utility were protected during municipal default, suggesting Thames’s backers are safe, says Assured Guaranty boss The largest creditor to struggling water company Thames Water has said it is confident that it will not lose money, joking that the UK was comparable to Puerto Rico, which paid lenders to its water company despite a crippling debt crisis. Dominic Frederico, the chief executive of US insurer Assured Guaranty, suggested that the UK government would not impose losses on creditors. The company – which has an exposure of $2.4bn (£1.8bn) to Thames Water’s bonds – was “well protected in terms of the legal structure” from losing money, he told investors on a call on 8 August. Continue reading...", "ingested_utc": "2025-08-19T17:35:11Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:35:11Z", "source": "Guardian_World", "title": "Israeli government official charged with soliciting 15-year-old girl in Las Vegas", "url": "https://www.theguardian.com/us-news/2025/aug/19/israeli-official-soliciting-minor-las-vegas", "id_key": "643a6fcf13b751f1571873f9c8d7be9c2b820e454c07c6e98932a7c86f347488", "summary": "Police say Tom Artiom Alexandrovich brought condom and thought he was meeting teenager for ‘sexual contact’ An Israeli government official charged with soliciting a minor believed he was meeting a 15-year-old girl for “sexual contact”, according to police – and brought a condom to the planned rendezvous in Las Vegas . Tom Artiom Alexandrovich, a division head at the Israel National Cyber Directorate, was arrested in a police sting operation aimed at online users seeking to sexually prey on children. The Las Vegas outlet 8NewsNow reported that Alexandrovich chatted with an officer posing as a teenager online before being arrested. Continue reading...", "ingested_utc": "2025-08-19T17:35:11Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:35:26Z", "source": "Blockworks", "title": "Helium eyes a potential path to deflationary tokenomics", "url": "https://blockworks.co/news/helium-potential-path-deflationary-tokenomics", "id_key": "224afbf6e5dbd2e7fd2f2925e4d835aa9d04c256f24a08a3283a5cb4d7b10133", "summary": "Helium has over a million daily users, and recent mechanics include an emission halving and a circulating supply burn", "ingested_utc": "2025-08-19T17:35:26Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:36:14Z", "source": "CryptoNews", "title": "SharpLink Gaming, Inc. Bets Big on Ethereum With 143K ETH Buy and $537M War Chest", "url": "https://cryptonews.com/news/sharplink-gaming-390m-raise-143k-eth/", "id_key": "26259e62236bb70089731b6edbf8afbb81e9a3091cfceeb5cb4d613065925f02", "summary": "SharpLink Gaming, Inc. has expanded its Ethereum holdings to 740,760 ETH following a $537M capital raise. The company purchased 143,593 ETH at $4,648 and reported 1,388 ETH in staking rewards, introducing a new ETH Concentration metric to track investor exposure and transparency. The post SharpLink Gaming, Inc. Bets Big on Ethereum With 143K ETH Buy and $537M War Chest appeared first on Cryptonews .", "ingested_utc": "2025-08-19T17:36:14Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:15Z", "source": "FT_Markets", "title": "‘On another level’: crypto industry hosts rival gathering in Jackson Hole", "url": "https://www.ft.com/content/cf29f83f-6d26-494c-b367-101f7927aa97", "id_key": "70c3e043f11559c3af343dcddec944285a3114c28d51dfa34da9d2ce05d8b249", "summary": "Fed governors and SEC officials join executives at event ahead of central bankers’ annual gathering", "ingested_utc": "2025-08-19T17:38:15Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:31Z", "source": "TheVerge_All", "title": "Asus has the new world’s fastest OLED monitor at 720Hz, and it’s dripping with style", "url": "https://www.theverge.com/news/761481/asus-720hz-gaming-monitor-rog-swift-oled-pg27aqwp-w", "id_key": "09fa50916ef435ebf778d66161652eaacc19b479a99575e74a0fccd79efec1bc", "summary": "We might have a new king of esports gaming monitors — one with fewer compromises than usual. Asus has just announced the ROG Swift OLED PG27AQWP-W at Gamescom 2025. Not only does it offer a 26.5-inch 2560 x 1440 QHD OLED screen at a blazing-fast 540Hz, it’s also a dual-mode panel that can switch to […]", "ingested_utc": "2025-08-19T17:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:31Z", "source": "TheVerge_All", "title": "How the MAGA goon squad became tech lobbyists", "url": "https://www.theverge.com/regulator-newsletter/761358/how-the-maga-goon-squad-became-tech-lobbyists", "id_key": "d94f33ae9ea1ce99907dce2556cd499c35aadacbbefa430e00b8ee86ed1111ee", "summary": "Hello there, world! Welcome to the second issue of Regulator, a newsletter about the collision between Big Tech and Washington. If you enjoy this, consider subscribing to get this newsletter weekly and everything The Verge has to offer. Lobbying might be a dubious industry, but lobbyists themselves are often some of the best sources in […]", "ingested_utc": "2025-08-19T17:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:31Z", "source": "TheVerge_All", "title": "Ticket reseller sued for illegally buying over 2,000 Taylor Swift tickets", "url": "https://www.theverge.com/news/761476/taylor-swift-eras-tour-ftc-ticket-reseller-bots-lawsuit", "id_key": "e740586a15bb944c42fc37b233a069086183b97750a4f9bcdca2208961b3a404", "summary": "The Federal Trade Commission is suing a ticket broker for allegedly using “illegal means” to buy up hundreds of thousands of live event tickets, including for Taylor Swift’s Eras tour. Key Investment Group, which also does business as Epic Seats, TotalTickets.com, and Totally Tix, is accused of violating the Better Online Ticket Sales (BOTS) Act […]", "ingested_utc": "2025-08-19T17:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:31Z", "source": "TechCrunch_All", "title": "CPG startup Keychain snags $30M to build in India, grow in the US", "url": "https://techcrunch.com/2025/08/19/cpg-startup-keychain-snags-30m-to-build-in-india-grow-in-the-u-s/", "id_key": "d25f911117a6f00297d516bcfdc788208fdbbcdd6552c666e8d898f0ad2363c2", "summary": "Keychain doesn't have a single customer in India — but the team helping it scale across North America and beyond is entirely based in Gurugram, a suburb of New Delhi.", "ingested_utc": "2025-08-19T17:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:33Z", "source": "WIRED_All", "title": "Senate Probe Uncovers Allegations of Widespread Abuse in ICE Custody", "url": "https://www.wired.com/story/senate-probe-uncovers-widespread-abuse-in-ice-custody/", "id_key": "3217233d86420c01499903557bc76959c2a1da28f20ef821311eb284f732da6c", "summary": "Led by US senator Jon Ossoff, the investigation cites hundreds of reports since January, including accounts of miscarriages, child neglect, and sexual abuse at ICE detention centers in dozens of states.", "ingested_utc": "2025-08-19T17:38:33Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:34Z", "source": "Engadget_All", "title": "Anker's Soundcore Sleep A30 earbuds include ANC and a snore-detection algorithm", "url": "https://www.engadget.com/home/smart-home/ankers-soundcore-sleep-a30-earbuds-include-anc-and-a-snore-detection-algorithm-173057404.html?src=rss", "id_key": "a390caea5b0e0ba58ae2d76095508d8bde64bc86f7e0573170a64180f7b1d12c", "summary": "The Anker Soundcore Sleep A30 earbuds are now available to purchase . These are some of the only sleep earbuds with ANC, which could be a boon for light sleepers that live in busy metropolitan areas. The company says they \"effectively block out snoring, pet sounds, appliance hum and outside traffic noise.\" There are other techy additions here, beyond ANC. Anker's proprietary Ear Canal Adaptation algorithm adjusts to unique ear shapes for \"deeper noise reduction.\" The charging case also includes a microphone that monitors and analyzes ambient noise for snoring. Once snores are detected, it optimizes the ANC to mask that specific noise. This could end up saving some relationships. The earbuds can also deliver binaural frequencies to each ear, which the company says helps \"sync your brainwaves with calming patterns to promote relaxation and restful sleep.\" Users can make adjustments to any of these systems via the Soundcore app, which also lets people set alarms, create sleep reminders and more. Not everyone can handle clunky earbuds when trying to fall asleep, so the company tried to increase the comfort with this latest release. The Sleep A30 earbuds include a silicone exterior, short nozzles and a slim profile. The developers created 3D maps of \"thousands of ear canals\" to make sure it would fit most users comfortably. We haven't gotten a chance to try these yet, but the reviews so far are mostly positive . I'm a bit wary of ANC masking all ambient noise during sleep in case of an emergency, but maybe that's just me. In any event, the Soundcore Sleep A30 earbuds are available right now in two colorways. This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/ankers-soundcore-sleep-a30-earbuds-include-anc-and-a-snore-detection-algorithm-173057404.html?src=rss", "ingested_utc": "2025-08-19T17:38:34Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:34Z", "source": "Engadget_All", "title": "Kirby Air Riders launches November 20 exclusively on Switch 2", "url": "https://www.engadget.com/gaming/nintendo/kirby-air-riders-launches-november-20-exclusively-on-switch-2-171054821.html?src=rss", "id_key": "bf39261af6839941e1da90c5b901a2732fa0c0753ccae4dc3f1f0d422a333bf4", "summary": "Nintendo has confirmed that Kirby Air Riders , a modern revival of the 2003 GameCube cult classic Kirby Air Ride , will be released exclusively on Switch 2 on November 20. The announcement came during a marathon 45-minute Nintendo Direct devoted entirely to the new game, hosted by Kirby's creator Masahiro Sakurai. Sakurai said he was asked to create Air Riders while still working on DLC for Super Smash Bros. Ultimate , and drafted a written proposal for the game at the request of Shinya Takahashi, head of software development for Nintendo. The Direct showed a roster of playable characters, including King Dedede, Meta Knight, Bandana Waddle Dee, Knuckle Joe and others. Each rider has distinct traits and special attacks that influence how their machines perform. The ride mechanics will be fairly simple, with players able to boost, drift, glide and rail-grind their way around. Players will be able to customize and upgrade their vehicles throughout the game, which includes two major modes. Air Ride is the straightforward racing mode, with players competing on themed tracks. City Trial lets players explore a floating island called Skyah, where they can find power-ups and encounter random events like Dustup Derby, where they battle opponents to knock them out and earn more power-ups. Once players feel their machine is sufficiently powered up, they can head to the Stadium to complete different challenges against opponents. Local multiplayer supports up to eight players, while online lobbies can hold 16. A demo version of Kirby Air Riders will be playable by reservation for attendees of PAX West 2025 in Seattle at the end of the month. Masahiro Sakurai said a similar demo will be available to play at Gamescom in Cologne this week. Kirby Air Riders will release on November 20 and marks yet another Switch 2 exclusive coming early in the life cycle of the hit console. Nintendo has already found success with Donkey Kong Bananza and Mario Kart World . This article originally appeared on Engadget at https://www.engadget.com/gaming/nintendo/kirby-air-riders-launches-november-20-exclusively-on-switch-2-171054821.html?src=rss", "ingested_utc": "2025-08-19T17:38:34Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:34Z", "source": "Engadget_All", "title": "There's a Hollow Knight: Silksong livestream on August 21 at 10:30AM ET", "url": "https://www.engadget.com/gaming/theres-a-hollow-knight-silksong-livestream-on-august-21-at-1030am-et-153220026.html?src=rss", "id_key": "4540011620decc59d2e609bd700ebed0c96303d44ca1894f1b613c448ecfcfbc", "summary": "Is it finally happening? Team Cherry just announced a livestream for the long-anticipated sequel Hollow Knight: Silksong . It takes place on August 21 at 10:30AM ET. The company says it will be making a \"special announcement\" about the game. We don't exactly know what this announcement will be, but it's starting to feel like a release date or at least a release window. Rumors have been swirling that the title would finally be getting a release date during this week's Gamescom festivities , with Geoff Keighley offering a tease a couple of days ago . This is all happening more than six years after the game was first announced . It's possible that the special announcement won't involve the release date at all, but will instead offer new game modes or a deeper dive into the story. It's worth noting that reports have indicated that the game would finally see the light of day this year , though we've been fooled by that kind of thing before. For the uninitiated, Hollow Knight: Silksong is the followup to Hollow Knight , which was an indie Metroidvania that absolutely took the world by storm. It actually started as DLC for the original game before the developers realized the scope of their ambitions would take nearly seven years to see through. Correction, August 19, 2025, 12:55PM ET : This story originally stated that the livestream was set for April 21. That was a mistake, as the actual date is August 21. This article originally appeared on Engadget at https://www.engadget.com/gaming/theres-a-hollow-knight-silksong-livestream-on-august-21-at-1030am-et-153220026.html?src=rss", "ingested_utc": "2025-08-19T17:38:34Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:34Z", "source": "Engadget_All", "title": "Sony and Microsoft continue to make nice with Halo x Helldivers 2 crossover", "url": "https://www.engadget.com/gaming/sony-and-microsoft-continue-to-make-nice-with-halo-x-helldivers-2-crossover-165024127.html?src=rss", "id_key": "c315b2e4798a7f56836e9676496e1b2629cf1209f0b418c3314bbba34f2a3ec5", "summary": "Helldivers 2 is getting a Halo crossover. On August 26, gear inspired by Halo 3: ODST will be available in the Sony-published Helldivers game. Practically speaking, this is about some new armor, guns and abilities — just another Tuesday in the gaming world. But symbolically, it evokes Sonic the Hedgehog's first appearance on a Nintendo console. The crossover's arrival coincides with Helldivers 2's arrival on Xbox Series X/S . (That's also on August 26.) It also comes amid rumors that Halo: The Master Chief Collection could arrive on PlayStation as soon as this year. The times they are a-changin', as Microsoft adjusts to its new reality as a console hardware also-ran . The gear will be available through the Helldivers 2 x Halo: ODST Legendary Warbond. In Helldivers, a Warbond is essentially a non-expiring equivalent of a battle pass . This one costs 1,500 Super Credits in the game's Acquisitions Center. Here, ODST no longer means Orbital Drop Shock Troopers. Adopting Helldivers' cheeky tone, it now stands for Obedient Democracy Support Troopers. Kind of them to lend a hand to the cause. PlayStation So, what do you get for those Super Credits? The standout is the Halo 3: ODST armor, which has a Master Chief-esque flair. There are two variants: A-9 Helljumper Armor Set modeled after an ODST trooper. Meanwhile, the A-35 Recon Armor Set is a stealth-focused variant. Both include a Feet First passive boost. This makes you quieter, increases your range when finding points of interest and makes you immune to leg injuries. As for the guns, you get the Halo series' classic MA5C Assault Rifle and M6C / SOCOM Pistol. Also available for your arsenal: the M90A Shotgun and M7S SMG. And who doesn't love a cape? There are two of those — one with an ODST logo and an Eye of the Clandestine one for the stealth getup. The Helldivers 2 x Halo: ODST warbond arrives on August 26 at 8AM ET. This article originally appeared on Engadget at https://www.engadget.com/gaming/sony-and-microsoft-continue-to-make-nice-with-halo-x-helldivers-2-crossover-165024127.html?src=rss", "ingested_utc": "2025-08-19T17:38:34Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:43Z", "source": "AlJazeera_All", "title": "Qatar: Hamas gives ‘positive response’ to Gaza ceasefire plan", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/19/qatar-hamas-gives-positive-response-to-gaza-ceasefire-plan?traffic_source=rss", "id_key": "899607cd48fdd089d063e670b29af41a97781626232909d6ac79f1d1fed218dd", "summary": "Hamas has accepted a new Gaza ceasefire proposal, Qatar confirmed. Israel’s response is still pending.", "ingested_utc": "2025-08-19T17:38:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:50Z", "source": "FinancialPost_Business", "title": "Quadravest Preferred Split Share ETF Financial Results to June 30, 2025", "url": "https://financialpost.com/globe-newswire/quadravest-preferred-split-share-etf-financial-results-to-june-30-2025", "id_key": "7244f8f305d54added360b7f4fb37012627a35109fb8b58f3d707d7723e6fff0", "summary": "TORONTO, Aug. 19, 2025 (GLOBE NEWSWIRE) — Quadravest Preferred Split Share ETF (“Preferred ETF”) announces that its semi-annual financial statements and management report of fund performance for the six months ended June 30, 2025 are now available at www.sedarplus.com and Preferred ETF’s website at www.quadravest.com. For further information, please contact Investor Relations at 416-304-4443, toll […]", "ingested_utc": "2025-08-19T17:38:50Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:50Z", "source": "FinancialPost_Business", "title": "Ottawa teams up with startup Cohere to bring AI to the public sector", "url": "https://financialpost.com/technology/canada-cohere-to-bring-ai-public-sector", "id_key": "7e75e33f95925a16048ef6e6451f75447434a7d05a2b9a107edbcd4d93fa2164", "summary": "Memorandum of understanding also aims to bolster commercial capabilities and export of artificial intelligence", "ingested_utc": "2025-08-19T17:38:50Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:38:50Z", "source": "FinancialPost_Business", "title": "Hurricane Erin’s Violent Surf Forces East Coast Beach Closures", "url": "https://financialpost.com/pmn/business-pmn/hurricane-erins-violent-surf-forces-east-coast-beach-closures", "id_key": "ded7fda73a55801096827cc01e71fd725e814cd8f16df55527ce1d352aaa04ec", "summary": "An expanding Hurricane Erin is poised to bring rough surf and life-threatening waves to beaches from Florida from Massachusetts this week, despite spinning hundreds of miles off the US East Coast.", "ingested_utc": "2025-08-19T17:38:50Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:39:05Z", "source": "HackerNews_Top", "title": "The Mysterious Underground City Found in a Man's Basement", "url": "https://www.atlasobscura.com/articles/derinkuyu-turkey-underground-city-strange-maps", "id_key": "0fd7fe406e7b9b188e31ac5d83437b14c4cd0c58475273c28c6e8978fae25cfe", "summary": "Comments", "ingested_utc": "2025-08-19T17:39:05Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T17:39:05Z", "source": "HackerNews_Top", "title": "Show HN: Chroma Cloud – serverless search database for AI", "url": "https://trychroma.com/cloud", "id_key": "b0b7dcb361f2b3acb10a6d228cd5c9d7c48661a1c09592e3d1179260a8894e20", "summary": "Comments", "ingested_utc": "2025-08-19T17:39:05Z"}
