{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T16:53:36Z", "source": "Guardian_World", "title": "Jesuit leaders did nothing to stop a priest from sexually abusing children. The church may canonize one", "url": "https://www.theguardian.com/us-news/2025/aug/24/jesuits-new-orleans-clergy-abuse", "id_key": "ea803173e22d783d8f22e9485c9952c9f9804ccc285aff31f619a07d5885c15a", "summary": "The prominent religious order postponed the ordination of Donald B Dickerson, but ultimately allowed his promotion A version of this story was first reported and published by National Catholic Reporter Numerous officials within the Roman Catholic religious order known as the Jesuits struggled in the 1970s and 1980s over how to deal with a man whom they knew molested children – but nonetheless was ordained a priest, according to a review of internal correspondence concerning his career. The correspondence about the late Donald B Dickerson stems from a pending Louisiana state court lawsuit filed in June 2024 that alleges he raped a 17-year-old student at the order-run Loyola University New Orleans in 1984. It provides a rare, complex, behind-the-scenes look at how local leaders during a much earlier phase of the worldwide Catholic church’s ongoing clergy molestation scandal struggled to contain a predator priest’s repeated abuse of children while encouraging him to seek psychological help. National Catholic Reporter is a national US news outlet that has been reporting on issues within the Catholic church since 1964 Continue reading...", "ingested_utc": "2025-08-24T16:53:36Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T16:56:21Z", "source": "Engadget_All", "title": "You can now download and tweak Grok 2.5 for yourself as it goes open source", "url": "https://www.engadget.com/ai/you-can-now-download-and-tweak-grok-25-for-yourself-as-it-goes-open-source-164734471.html?src=rss", "id_key": "3179615e1803f87a3257937df8497d5e20795ffa8c06bafd6635771a81c9bf42", "summary": "Unhinged as Grok may be, it's now open source. xAI's CEO, Elon Musk, posted on X that the company made the older Grok 2.5 model available to the public and will do the same with the upcoming Grok 3. For now, anyone can download, run and even tweak Grok, whose source code was uploaded to the Hugging Face platform . However, there are restrictions to xAI's open-source license, which doesn't let people use Grok to train, create or improve other AI models. It's not the first time xAI has made its models available to the public. In March 2024, the company released the raw base model of Grok-1 , which isn't finetuned for any specific task. As xAI continues to make Grok more accessible, it's a stark contrast to OpenAI, which has only offered less powerful models of its ChatGPT model to researchers and businesses. Making Grok open source allows independent developers to potentially improve on the AI model, but xAI is still trying to move past an extremely alarming episode of Grok providing antisemitic responses and referencing itself as MechaHitler . The Grok team attributed the incident to \" deprecated code \" that has since been fixed. As for Grok 3, Musk also said on X that it will also go open source in six months, but we may have to take that estimated release with a grain of salt, considering the CEO's other promised timelines . This article originally appeared on Engadget at https://www.engadget.com/ai/you-can-now-download-and-tweak-grok-25-for-yourself-as-it-goes-open-source-164734471.html?src=rss", "ingested_utc": "2025-08-24T16:56:21Z"}
