{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:00Z", "source": "BBC_World", "title": "Far-right Israeli minister taunts prominent Palestinian prisoner", "url": "https://www.bbc.com/news/articles/cqxg3xg8xyyo?at_medium=RSS&at_campaign=rss", "id_key": "807720069eb494ccb35883909e23cef6f50a7c510eae55149735f0800567ac6f", "summary": "Video shows Itamar Ben Gvir telling the most prominent Palestinian prisoner Marwan Barghouti \"you will not win\".", "ingested_utc": "2025-08-15T13:39:00Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:01Z", "source": "BBC_Business", "title": "Shein's UK sales soar by a third to hit £2bn", "url": "https://www.bbc.com/news/articles/c5ylp1812nlo?at_medium=RSS&at_campaign=rss", "id_key": "f4cd22c61b267dee5e1f4f47ec818c4b27c249a409fac454946c1a94855399f3", "summary": "The fast-fashion giant saw profits jump as more Britons bought its low-priced Chinese-made clothes and accessories.", "ingested_utc": "2025-08-15T13:39:01Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:01Z", "source": "BBC_Business", "title": "Gatwick strikes suspended after new pay offer", "url": "https://www.bbc.com/news/articles/cx23lex0rd5o?at_medium=RSS&at_campaign=rss", "id_key": "dba418049d8f5ee4dceb4eea1482dcfe95a41f07ecbd05c81260906930e3bcf9", "summary": "Unite says the second round of strikes, planned for later in August, could still go ahead.", "ingested_utc": "2025-08-15T13:39:01Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:02Z", "source": "BBC_Technology", "title": "Angry, confused and worried about police – behind Instagram bans", "url": "https://www.bbc.com/news/articles/ce8307ge49eo?at_medium=RSS&at_campaign=rss", "id_key": "283a16e12ebfea0941699ac4d372343b55d8f1dee3bdf1070ca405d5c72ce79f", "summary": "Hundreds of people have contacted the BBC to say they have wrongly been shut out of their accounts.", "ingested_utc": "2025-08-15T13:39:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_Business", "title": "Intel shares jump after report says Trump administration looking at stake", "url": "https://www.theguardian.com/technology/2025/aug/15/intel-shares-jump-after-report-says-trump-administration-looking-at-stake", "id_key": "f94b1e5195f3ddf037284df0de7c72586115c19229dc0aa90413928a8fc0ee30", "summary": "Market value passes $104bn despite White House saying claims of talks to invest in factories are ‘speculation’ Shares in Intel have jumped 7.4% after it was reported that the Trump administration is considering taking a stake in the struggling US chipmaker. The potential investment, which would be paid for by the US government, would be used to develop Intel’s factory hub in Ohio, according to Bloomberg. It would also help shore up the chipmaker’s finances at a time when Intel has been slashing jobs as part of a wider cost-cutting drive. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_Business", "title": "Universal deny that head Lucian Grainge was personally involved in Kendrick Lamar attack on Drake", "url": "https://www.theguardian.com/music/2025/aug/15/universal-deny-that-head-lucian-grainge-was-personally-involved-in-kendrick-lamar-attack-on-drake", "id_key": "507d8d17ee93c857e5f8c4d01572bcc099d4a6d2bd77758869f1efb7f550a413", "summary": "UMG have called for Drake’s motion to include Grainge’s communications on the matter to be denied, calling it ‘so strained’ as to ‘defy credulity’ Universal Music Group has denied new allegations made by Drake’s lawyers that its British chair and chief executive Lucian Grainge had a “role in and knowledge of the scheme to defame and harass” the Canadian rapper by peer Kendrick Lamar, and that as such the label should “collect, review and produce” communications by Grainge. Drake is suing UMG – his label Republic’s parent company – over its release of Lamar’s 2024 diss track Not Like Us, which contains the line: “Say, Drake, I hear you like ’em young … Certified Lover Boy? Certified pedophiles.” The artwork for the global hit single features an image of Drake’s home dotted with icons used to identify the homes of registered sex offenders. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "Donald Trump says Vladimir Putin is ‘a smart guy’ as he heads to Alaska for meeting over Ukraine – Europe live", "url": "https://www.theguardian.com/world/live/2025/aug/15/donald-trump-vladimir-putin-meeting-anchorage-alaska-ukraine-war-europe-live-latest-updates-news", "id_key": "15eb0e140fc5f686852936fb3797fbde0a74ac27f5f992e3da829f7116e817e6", "summary": "US president tells reporters ‘something is going to come up’ as he travels to Anchorage, Alaska, for meeting US hopes will be pivotal moment Asked if his conversation with Trump will cover territorial issues, Trump says: “ They’ll be discussed, but I’ve got to let Ukraine make that decision , and I think they’ll make a proper decision, but I’m not here to negotiate for Ukraine. I’m here to get them at a table. “I noticed he’s bringing a lot of business people from Russia, and that’s good. I like that because they want to do business, but they’re not doing business until we get the war stopped. ” Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "Israel appears set to approve illegal 3,400-home West Bank settlement", "url": "https://www.theguardian.com/world/2025/aug/14/israel-appears-set-to-approve-controversial-settlement-of-3400-homes-in-west-bank", "id_key": "e45ca87b965afae3331d24c75ca25fcfa8e3a136024a12a574a37a2aede5a75c", "summary": "Finance minister Bezalel Smotrich has said he believes E1 plan will ‘bury the idea of a Palestinian state’ Israel appears set to give formal planning approval to a highly controversial and illegal project for more than 3,400 new homes that has been frozen for decades and which critics say would split the occupied West Bank in half. Strongly opposed by the international community, the so-called E1 plan would extend the existing Jewish settlement of Ma’ale Adumim towards Jerusalem, further cutting occupied east Jerusalem from the West Bank, and further separating the north and south of the territory. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "Iceland offering £1 reward scheme for customers who report a shoplifter", "url": "https://www.theguardian.com/business/2025/aug/15/iceland-pay-customers-1-report-shoplifter", "id_key": "cdc5e8eaebe79bf82f0178207a041cb5dabc66a09cdbd438b64c7fa59cdaf140", "summary": "Grocery chain employees will verify the incident and the reward will be added to the shopper’s loyalty card The grocery chain Iceland is offering customers who point out a thief a £1 reward on their loyalty card. The frozen food specialist said that anyone who spots a suspected shoplifter in its stores should inform the nearest Iceland employee who will verify the incident before adding the reward to the individual’s loyalty card for immediate use. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "UK rights watchdog warns against ‘heavy-handed’ policing of Gaza protests", "url": "https://www.theguardian.com/world/2025/aug/15/uk-rights-watchdog-warns-heavy-handed-policing-gaza-protests", "id_key": "937e939c9eaaceb466771dc06fff12b52cf11cda90397fba08231223f699b91b", "summary": "EHRC calls for clearer guidance for officers to avoid creating a ‘chilling effect’ on freedom of expression UK politics live – latest updates The UK’s official human rights watchdog has written to the government and police expressing concern at a potentially “heavy-handed” approach to protests about Gaza and urging clearer guidance for officers in enforcing the law. In the letter to Yvette Cooper, the home secretary, and Mark Rowley, the head of the Metropolitan police, the Equality and Human Rights Commission (EHRC) said the perception that peaceful protest could attract disproportionate police attention “undermines confidence in our human rights protections”. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "DC sues Trump over police takeover as Bondi ends city’s ‘sanctuary policies’ and homeless encampments are cleared – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/15/washington-dc-donald-trump-protests-us-politics-latest-updates-news", "id_key": "bff62de42e27e9ff2c615054aa4f82efe21cdf5741109559482c80ed3699f3b8", "summary": "Washington DC attorney general called Trump administration moves ‘brazenly unlawful’ and ‘infringe on the District’s right to self-governance’ Washington DC’s only Home Depot was busy with contractors and customers on Thursday morning – but the Hispanic day laborers who usually gather and wait for work under the parking lot’s sparse trees were nowhere to be found. Two days earlier, masked federal agents swarmed the area and made several arrests, which were photographed by bystanders and posted on social media. Juwan Brooks, a store employee who witnessed the raid, said the agents grabbed anyone who appeared Hispanic. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "Washington DC sues after Trump officials’ ‘hostile takeover’ of city police", "url": "https://www.theguardian.com/us-news/2025/aug/15/trump-dc-police-chief-dea", "id_key": "ed9e1c8b7a459d399076c2b1ff844d0fdc74ea3d3fb83073224e619febbc978d", "summary": "Pam Bondi says DEA chief Terry Cole in charge of Metropolitan police amid White House crackdown on crime Washington DC was seeking an emergency restraining order on Friday against Donald Trump ’s takeover of its police department, dubbing it a “hostile takeover” of law enforcement in the nation’s capital. The District of Columbia attorney general, Brian Schwalb, filed a lawsuit on Friday morning, hours after US attorney general Pam Bondi late on Thursday issued an order for the federal government to impose a new police chief on the city’s Metropolitan police department (MPD). . Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "Barack Obama praises Texas Democrats as state legislature moves to end special session without passing new electoral maps", "url": "https://www.theguardian.com/us-news/2025/aug/15/greg-abbott-special-session-electoral-maps", "id_key": "3825afa06049342b4dca64fb29e0a03e67987f082cd893e867ce16dfe5160284", "summary": "Governor Greg Abbott said he will immediately call another session as Democratic lawmakers signaled return to state Texas lawmakers will adjourn their first special session without passing new congressional maps on Friday, though Governor Greg Abbott has said he will immediately call another session and Democratic lawmakers signaled they are likely to return to the state. Abbott has pledged he will call consecutive special sessions until Democrats have returned. More than 50 Democrats left the state last month in order to deny a quorum in the legislature after Republicans announced plans to redraw the state’s congressional maps, at the request of Donald Trump, in order to gain five Republican seats. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:03Z", "source": "Guardian_World", "title": "Exposure to some common Pfas changes gene activity, new study finds", "url": "https://www.theguardian.com/environment/2025/aug/15/forever-chemicals-pfas-exposure-gene-activity", "id_key": "949c0b17bfd56a015558d32dda63d8ff8f21c7b284cd5933a6dc00035b8eda34", "summary": "Findings help decipher mechanisms through which ‘forever chemicals’ cause disease, aiding in treating health problems New research suggests exposure to some common Pfas or “forever chemical” compounds causes changes to gene activity, and those changes are linked to health problems including multiple cancers, neurological disorders and autoimmune disease. The findings are a major step toward determining the mechanism by which the chemicals cause disease and could help doctors identify, detect and treat health problems for those exposed to Pfas before the issues advance. The research may also point toward other diseases potentially caused by Pfas that have not yet been identified, the authors said. Continue reading...", "ingested_utc": "2025-08-15T13:39:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:20Z", "source": "BitcoinMagazine", "title": "Is Bitcoin Price Outperforming Gold and NASDAQ This Cycle?", "url": "https://bitcoinmagazine.com/markets/bitcoin-price-gold-and-nasdaq", "id_key": "1ba2ac8ff2be67eb0902d6c231d1aa034ae4103b33a8f0d5e19e41522e99044b", "summary": "Bitcoin Magazine Is Bitcoin Price Outperforming Gold and NASDAQ This Cycle? The bitcoin price is up 600% this cycle, but is it really shining? This deep dive compares BTC to Gold & tech stocks, revealing a surprising truth about its performance. This post Is Bitcoin Price Outperforming Gold and NASDAQ This Cycle? first appeared on Bitcoin Magazine and is written by Matt Crosby .", "ingested_utc": "2025-08-15T13:39:20Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:22Z", "source": "CryptoSlate", "title": "Taiwan’s first Bitcoin treasury investor bets $10 million on Nasdaq’s SORA", "url": "https://cryptoslate.com/taiwans-first-bitcoin-treasury-investor-bets-10-million-on-nasdaqs-sora/", "id_key": "715669401efd1b2d036bd74d21ff86b88a2e917db5941315eaed08c4fe4753f1", "summary": "Top Win International, listed on Nasdaq as SORA, has secured $10 million from a group of investors led by WiseLink. This marks the first time a Taiwanese public company has invested in a Bitcoin treasury-focused firm. According to the companies, the deal was executed through a three-year convertible note and is part of WiseLink’s “Bitcoin […] The post Taiwan’s first Bitcoin treasury investor bets $10 million on Nasdaq’s SORA appeared first on CryptoSlate .", "ingested_utc": "2025-08-15T13:39:22Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:23Z", "source": "CryptoBriefing", "title": "Trump-backed American Bitcoin targets acquisitions in Asia to boost Bitcoin reserves", "url": "https://cryptobriefing.com/american-bitcoin-acquisitions-asia/", "id_key": "c8221dddaee400ecf0fc8559365bd6861b6166329d824884f44381f82e2dce21", "summary": "American Bitcoin's expansion into Asia could enhance global crypto market integration, potentially increasing Bitcoin's mainstream adoption. The post Trump-backed American Bitcoin targets acquisitions in Asia to boost Bitcoin reserves appeared first on Crypto Briefing .", "ingested_utc": "2025-08-15T13:39:23Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:23Z", "source": "CryptoBriefing", "title": "Ethereum treasury SharpLink Gaming holds 728,804 ETH worth $3.4 billion", "url": "https://cryptobriefing.com/ethereum-treasury-strategy-sharplink/", "id_key": "c791db44d2aed103c9d02eb8edab68dca3d42ede9c8c678c3c2143c33a15896e", "summary": "SharpLink's significant Ethereum holdings highlight the growing influence of crypto assets in corporate finance and strategic investment. The post Ethereum treasury SharpLink Gaming holds 728,804 ETH worth $3.4 billion appeared first on Crypto Briefing .", "ingested_utc": "2025-08-15T13:39:23Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:24Z", "source": "Protos", "title": "US re-sanctions Russian crypto exchange before Trump-Putin talks", "url": "https://protos.com/us-re-sanctions-russian-crypto-exchange-before-trump-putin-talks/", "id_key": "d16c81c44804ccba82b48f4f64f2a1618bb0e3492ebda37a5c5177fc5e1743ad", "summary": "As Trump plans to talk peace with Putin, the US sanctioned several Russian crypto firms aiding a billion dollar sanction evading ecosystem. The post US re-sanctions Russian crypto exchange before Trump-Putin talks appeared first on Protos .", "ingested_utc": "2025-08-15T13:39:24Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:26Z", "source": "CryptoNews", "title": "ETH Breakout Watch, August 15: Live News and Price Updates as Ethereum Approaches New ATH", "url": "https://cryptonews.com/news/eth-breakout-watch-live-news-and-price-updates-as-ethereum-approaches-new-ath/", "id_key": "591a424bf417e6e4ff25591eb3298d9b7e115311f830238db8d2d85bc671f96e", "summary": "Ethereum is on the brink of making history again. With the price climbing dangerously close to its previous all-time high of $4,864. The post ETH Breakout Watch, August 15: Live News and Price Updates as Ethereum Approaches New ATH appeared first on Cryptonews .", "ingested_utc": "2025-08-15T13:39:26Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:39:28Z", "source": "Unchained", "title": "Crypto Drops as Hot PPI Data Rattles Markets", "url": "https://unchainedcrypto.com/crypto-drops-as-hot-ppi-data-rattles-markets/", "id_key": "4be2c7bf3ef84da2e09efc4ae15d1f504336baf065dd6274ccdd57f34189f3a7", "summary": "A surprise spike in U.S. wholesale inflation sent crypto prices sharply lower Thursday, one day after bitcoin hit a record high. The Producer Price Index rose 0.9% in July — the largest monthly gain in over three years — far above economist forecasts of 0.2%. The annual rate climbed to ... The post Crypto Drops as Hot PPI Data Rattles Markets appeared first on Unchained .", "ingested_utc": "2025-08-15T13:39:28Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:08Z", "source": "MarketWatch_Bulletins", "title": "Economic calendar: Retail sales, import prices and consumer sentiment cap week", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=33186457-2016-4c32-8353-dcaa703ed19c&mod=mw_rss_bulletins", "id_key": "0b05794351b73417648b8212895ba351ffea31e8113e0f1ec4b28fc146bb2347", "summary": "", "ingested_utc": "2025-08-15T13:41:08Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:14Z", "source": "NYTimes_Business", "title": "What Business Will Be Watching For in the Trump-Putin Talks", "url": "https://www.nytimes.com/2025/08/15/business/dealbook/trump-putin-talks-business.html", "id_key": "24afb575665bfe657bacdc10be9f6ff226b64e7b12afcfe92d2d7861033a59e0", "summary": "Normalized economic ties between Russia and the West may be a long way off, but there’s global interest in what’s said about sanctions and tariffs.", "ingested_utc": "2025-08-15T13:41:14Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:14Z", "source": "NYTimes_Business", "title": "Trump’s Tariffs Set to Hit Ireland, Where Drugmakers Play Tax Games", "url": "https://www.nytimes.com/2025/08/14/health/pharma-tariffs-ireland-taxes.html", "id_key": "f8dc6f2c2c4f536d4c5c0e348a51a51c6f9e69df6b5829d42895026de6572a58", "summary": "Manufacturing in Ireland has long helped many American drug companies pay lower taxes. But that strategy was designed for a world without President Trump’s tariffs.", "ingested_utc": "2025-08-15T13:41:14Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:15Z", "source": "NYTimes_World", "title": "United Nations Plastic Treaty Talks End Without Deal", "url": "https://www.nytimes.com/2025/08/15/climate/plastic-pollution-treaty-talks-collapse.html", "id_key": "28574e2bb39f25881516673c743ca2efff294892d9b08b3f0b7c432aa5b1026a", "summary": "Countries failed to bridge wide gaps on whether the world should limit plastic manufacturing and restrict the use of harmful plastic chemicals.", "ingested_utc": "2025-08-15T13:41:15Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:26Z", "source": "FT_Home", "title": "Pictet bankers’ move to Italy sparks fierce Swiss tax debate", "url": "https://www.ft.com/content/d17e0032-961a-464b-a5e5-bde59d9b5ed0", "id_key": "a7c35716ce60ac7cdc0695fd6496fc09f006499c8150b6bcdb844a9981b6aba5", "summary": "Relocation prompts critics to argue that Geneva’s tough regime deters super-wealthy", "ingested_utc": "2025-08-15T13:41:26Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:27Z", "source": "FT_Markets", "title": "The Treasury market’s sudden remarkable tranquility", "url": "https://www.ft.com/content/982f0eed-3613-4c92-8d3b-58e13bf91bcf", "id_key": "fd849714eb94d9f4476547e7f6fc425305ac8ab15398ab6533a7d770489b066f", "summary": "MOVE ain’t moving — why?", "ingested_utc": "2025-08-15T13:41:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:27Z", "source": "FT_Markets", "title": "European investors switch attention to emerging market ETFs", "url": "https://www.ft.com/content/4b920b8c-fbb1-490e-adc0-17504b12df8c", "id_key": "ef58720966d0131db87f055981d25577d7cb50c335d8221451b19e9efe34066c", "summary": "Developing world stocks outperform US as dollar languishes at three-year lows", "ingested_utc": "2025-08-15T13:41:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:44Z", "source": "TheVerge_All", "title": "Sam Altman says ‘yes,’ AI is in a bubble", "url": "https://www.theverge.com/ai-artificial-intelligence/759965/sam-altman-openai-ai-bubble-interview", "id_key": "e7430a2c0a3fb51f3da0e5359d5b849cbd0c2e6014cf77d0f208b7e203700bc4", "summary": "As economists speculate whether the stock market is in an AI bubble that could soon burst, OpenAI CEO Sam Altman has just admitted to believing we're in one. \"Are we in a phase where investors as a whole are overexcited about AI?\" Altman said during a lengthy interview with The Verge and other reporters last […]", "ingested_utc": "2025-08-15T13:41:44Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:44Z", "source": "TheVerge_All", "title": "Lucid reveals off-road version of Gravity SUV, which it has definitely sold more than 9 of", "url": "https://www.theverge.com/electric-cars/759910/lucid-reveals-off-road-version-of-gravity-suv-which-it-has-definitely-sold-more-than-9-of", "id_key": "5aa1f4f84e1cb9f05a5380fa837da2a5a68255c1e9e5eb6eda1216300a0b2ca1", "summary": "On Friday, Lucid Motors introduced an off-road version of its Gravity SUV, a few hours after shooting down a report that it had only sold 9 of the luxury EV in the first six months. The off-road concept includes redesigned front and rear fascias, improved approach and departure angles, a widened track, lifted ride height, […]", "ingested_utc": "2025-08-15T13:41:44Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:44Z", "source": "TheVerge_All", "title": "GPT-5 failed the hype test", "url": "https://www.theverge.com/openai/759755/gpt-5-failed-the-hype-test-sam-altman-openai", "id_key": "f61d9ce5d37ea8d55ebddae14bad6a0682204cf12941cd79f4d2cef5929707ee", "summary": "Last week, on GPT-5 launch day, AI hype was at an all-time high. In a press briefing beforehand, OpenAI CEO Sam Altman said GPT-5 is \"something that I just don't wanna ever have to go back from,\" a milestone akin to the first iPhone with a Retina display. The night before the announcement livestream, Altman […]", "ingested_utc": "2025-08-15T13:41:44Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:47Z", "source": "Engadget_All", "title": "MasterClass memberships are 40 percent off right now", "url": "https://www.engadget.com/deals/masterclass-memberships-are-40-percent-off-right-now-133223280.html?src=rss", "id_key": "256e7be874f52e62cf721799be833ba34a10802dc2b2557a7c1aed92bb15df4b", "summary": "MasterClass promises online learning with instructors who are the very best in their fields, and an annual subscription is currently 40 percent off across all tiers. Subscribers to MasterClass will have access to over 200 classes taught by iconic authors, chefs, athletes and leaders representing a diverse collection of skill sets and backgrounds. You could watch a class on writing taught by James Patterson, or learn cooking techniques from Thomas Keller. If you're trying to impress at your next pickup basketball game you could learn about shooting, ball-handling and scoring from Steph Curry. Each class includes around 20 video lessons that run about 10 minutes long on average, as well as an in-depth workbook. MasterClass has also begun producing some original series for its platform. The series Business Rebels features different CEOs walking viewers through the strategies that helped them disrupt their industries. One entitled Skin Health features top dermatologists and a cosmetic chemist walking viewers through keeping their skin healthy through cleansing routines and specific beauty products. The wide range of skills or life lessons you could learn through these classes is why MasterClass is on our list of best subscriptions you can give as gifts . Maybe your loved one who loves to host dinner parties could use some tips from Gordon Ramsay. There are three subscription tiers for MasterClass that each differ only in how many devices they allow at one time, and whether offline videos are supported. The Standard subscription only supports one device, whereas the Plus subscription allows two. These are normally $10 and $15 per month, respectively, and neither offers offline mode. The Premium tier, which carries a regular price of $20 per month, allows up to six devices and features offline mode for downloaded classes. All three tiers are part of the 40 percent off sale, which marks them down to $6, $9 and $12 respectively. MasterClass bills annually, so be sure to calculate the total from the \"monthly\" price before deciding. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/masterclass-memberships-are-40-percent-off-right-now-133223280.html?src=rss", "ingested_utc": "2025-08-15T13:41:47Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:47Z", "source": "Engadget_All", "title": "MacBook Air deal: Pick up the M4-powered laptop while it's down to a record-low price", "url": "https://www.engadget.com/deals/macbook-air-deal-pick-up-the-m4-powered-laptop-while-its-down-to-a-record-low-price-123031774.html?src=rss", "id_key": "124623749c5c5684a997119765b736a8fbc8f984f7c4c310cd7151a51b6dad5e", "summary": "Whether you need a new MacBook for the upcoming semester or you've just been itching to upgrade from an older machine, now's a good time to buy. Amazon has a sale on the latest M4 MacBook Air that knocks up to 20 percent off many configurations. The base model is where you'll get the biggest discount. The 16GB RAM/256GB SSD laptop is down to $799 from $999, which is the lowest price we've seen. You can upgrade to 512GB SSD for $999 , down from $1,199, another all-time low price, or 24GB of RAM and a 512GB SSD for $1,199, down from $1,399. Then there's the 15-inch MacBook Air M4 , whose cheapest model is on sale for $999, dropping from $1,199. The 17 percent discount is the best deal we've seen since the pair debuted in March. As with the 13-inch model, the 16GB and 512GB SSD option is also a record-low price, dropping to $1,199 from $1,399. Then there's the 24GB upgrade , which is $1,399, down from $1,599. We're big fans of the MacBook Air M4, giving it a 92 in our review . Part of that comes from an already lower starting price for the MacBooks than their predecessors. The 2025 models also get a speed boost thanks to the M4 chip and are very thin with a 0.44-inch thickness. Neither the 13- or 15-inch will drag you down, weighing 2.7 pounds and 3.2 pounds, respectively. Plus, they both have excellent battery life, lasting over 18 hours while playing an HD video. The big differences in the 15-inch model mostly come down to size. The screen is obviously bigger, as is its trackpad. Other than that, it offers better speakers than its 13-inch sibling. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/macbook-air-deal-pick-up-the-m4-powered-laptop-while-its-down-to-a-record-low-price-123031774.html?src=rss", "ingested_utc": "2025-08-15T13:41:47Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:47Z", "source": "Engadget_All", "title": "HORI's Piranha Plant camera for Switch 2 drops to $40", "url": "https://www.engadget.com/deals/horis-piranha-plant-camera-for-switch-2-drops-to-40-145031405.html?src=rss", "id_key": "38b8d2863eb312d772061ddccc96fbb7d33aee5c423aacde10da91fd7d3b5a51", "summary": "The HORI Piranha Plant camera for the Nintendo Switch 2 is on sale for just $40 , which is a discount of $20 and a record-low price. This is a great deal for those who own a Switch 2 and want to take advantage of the camera functionality in games like Mario Kart World and that recently-released campfire sim . This was designed specifically for Nintendo's new console, so it's a plug-and-play affair. It's actually cheaper than the official Switch 2 camera with this sale and it looks a whole lot cooler. It's a Piranha Plant from the Mario franchise. We called it a \"work of art\" upon encountering the device and that holds true today. This thing is not only stylish, resembling an Amiibo more than a camera, but it's downright useful. The pot the Piranha Plant sits in functions as both a stand and USB extension for the device. The plant itself detaches from the pot, so the camera can be used in portable mode by popping it into the USB port at the top of the console. There's also a built-in privacy shutter. Just close the plant's mouth to obscure the lens. The actual camera specs here aren't going to win any awards, with a frame rate of 30FPS and a resolution of 640 x 480p. However, that's more than enough to capture footage of your floating head to accompany your kart as it races through the Mushroom Kingdom. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/horis-piranha-plant-camera-for-switch-2-drops-to-40-145031405.html?src=rss", "ingested_utc": "2025-08-15T13:41:47Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:47Z", "source": "Engadget_All", "title": "Apple TV+ releases the first 'Peanuts' musical in 37 years", "url": "https://www.engadget.com/entertainment/streaming/apple-tv-releases-the-first-peanuts-musical-in-37-years-130003599.html?src=rss", "id_key": "a773909f0ac3c0a071e93ad929862e1b8b5a7efcd066e36b6a0ae814e4aaa2df", "summary": "Apple is making good on its promise to release new Peanuts content with today's premiere of Snoopy Presents: A Summer Musical. It's the first Peanuts musical in 37 years, with the last one, Snoopy: The Musical , debuting way back 1988. The new cartoon introduces some catchy new songs (and a jazz piano score, of course) as Charlie Brown and friends attempt to save their beloved summer camp Cloverhill from destruction. The 40-minute special directed by Erik Wiese is centered around Charlie Brown's younger sister Sally, who hates summer camp after arriving for the first time. It's up to her brother, in his last year at camp, to help change her attitude. In the other major plot line, the kids discover that Cloverhill is set for destruction, so Charlie Brown comes up with a plan to put on a festival to save it. Snoopy isn't the main character this time, but is the source of much comic relief (pitching a \"pup\" tent and sleeping on top of it like his doghouse). The special uses digital animation to try to capture the style of Charles M. Schultz's original drawings. During one poignant song ( When We Were Light) , the animation reverts to Schultz's 1950s style as Charlie Brown reflects on his early camp days — something that's bound to hit older adult viewers right in the feels. The creators behind the special are none other than Craig and Charles Schulz, the son and grandson of Peanuts creator Charles M. Schultz. \"The thought jumped in my mind, wouldn't it be exciting to see the characters, you know, actually sing and Dance,\" Craig Schultz told The New York Times . He also felt that musical numbers would give the special an extended life. Apple has more Peanuts content in the pipeline, including a new feature-length Snoopy movie. Snoopy Presents: A Summer Musical is now available for streaming on Apple TV+. This article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/apple-tv-releases-the-first-peanuts-musical-in-37-years-130003599.html?src=rss", "ingested_utc": "2025-08-15T13:41:47Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:47Z", "source": "Engadget_All", "title": "Google is testing customizable calling cards for Android that show up when your friends call", "url": "https://www.engadget.com/mobile/smartphones/google-is-testing-customizable-calling-cards-for-android-that-show-up-when-your-friends-call-123038875.html?src=rss", "id_key": "fb1186c8d7454a63fde6a1e5567447fc40b8c3f55f25ffc502ecc0702791856e", "summary": "Google has started rolling out customizable calling cards for the beta versions of its Android Contacts and Phone apps. Android Authority found clues that the company was working on the feature back in July when it did an APK teardown. Now, you can give it a try if you decide to install the beta versions of the apps. As the publication notes , Google's implementation is the direct opposite of Apple's. On iOS, your set your own photo and name that you want to show up on other people's phones when you call them. You cannot alter other people's Contact Posters, as Apple calls the feature. Meanwhile, on Android, you can't make your own calling card. The feature instead gives you a way to set a photo and a name for your contacts that show up on your screen when they call you. If you do have access to the beta Contacts app for Android, you'll now see a note that says \"Try adding a calling card\" when you view a contact's details. From there, you can choose a photo you have of that contact from your gallery or take a new one of them with your camera. You can also adjust the font type and color for their name. Whenever they call, that calling card will take over your phone screen. If this sounds nothing new to you, it may be because Samsung has had a profile card feature for a while now that works just like Google's implementation. It's already widely available and accessible from your contacts' profile pages. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/google-is-testing-customizable-calling-cards-for-android-that-show-up-when-your-friends-call-123038875.html?src=rss", "ingested_utc": "2025-08-15T13:41:47Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:47Z", "source": "Engadget_All", "title": "NordVPN deal: Get up to 77 percent off two-year plans", "url": "https://www.engadget.com/deals/nordvpn-deal-get-up-to-77-percent-off-two-year-plans-151807441.html?src=rss", "id_key": "57f5b396a7e30fcbd974c7d644ca026a35af7a64a6383dd356ec4a8ab99e2b73", "summary": "There are dozens of VPNs to choose from, but to think they're all created equally would be a mistake. Some are better than others, and NordVPN sits squarely in the better category. Now, you can save up to 77 percent on most of NordVPN's plans. Arguably the best plan for most people is the NordVPN Plus plan , which you can get two years of access for only $108 right now. That's 73 percent off the usual rate, and NordVPN throws in an addition three months for free, so you're actually getting a 27-month subscription for the sale price. As well as Nord’s VPN service, a Plus plan also includes the Threat Protection Pro anti-malware tool, password management and an ad- and tracker-blocker. A Prime plan additionally comes with encrypted cloud storage or NordProtect, which insures you against identity theft and monitors dark web activity. That's also on sale — down to $189 on the same two-year commitment with those three additional months thrown in, which works out to a 77 percent savings on the regular price. When Engadget’s Sam Chapman reviewed NordVPN earlier this year, he praised its excellent download speeds, exclusive features and extensive server network. Less impressive is its clunky interface and inconsistent design when jumping between different platforms running a NordVPN app. While it doesn't quite make the cut in our guide to the best VPNs available right now, it generally performed well in speed tests and Threat Protection Pro is really worth having. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/nordvpn-deal-get-up-to-77-percent-off-two-year-plans-151807441.html?src=rss", "ingested_utc": "2025-08-15T13:41:47Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:47Z", "source": "Engadget_All", "title": "Volkswagen is making UK owners pay extra to unlock ID.3 EV's full potential", "url": "https://www.engadget.com/transportation/evs/volkswagen-is-making-uk-owners-pay-extra-to-unlock-id3-evs-full-potential-120011898.html?src=rss", "id_key": "e1c069f725573d3302fb4a885d8d2e2196fab80f1c85b56e241c82dcdf5c271b", "summary": "It's safe to say nobody likes it when a company locks the full potential of a vehicle they already bought behind a monthly subscription, which is what Volkswagen is doing in the UK. As Electrek and Auto Express have reported, the automaker now lists the Volkswagen ID.3 Pro and Pro S on its UK website with lesser horsepower that what they're capable of. In a footnote for the ID.3 Pro S Essential page , the company notes that for new orders, 150 kW or 201 horsepower is now the new standard for engine power. Customers can only enjoy the electric vehicle's 228 hp (170 kW) capability if they activate an \"optional power upgrade for a fee.\" They can pay $22 (£16.50) a month to unlock the EV's full horsepower, pay for the whole year at once or pay a one-time lifetime fee of $880 (£649). Based on Volkswagen's wording, the one-time fee is good for the lifetime of the car, not the owner's. If the customer sells their EV, the new owner also gets the upgrade. They'd then have to pay for it again if they buy a new EV that had also been paywalled. Owners will at least get a free month-long trial in case they want to figure out if they truly needed that extra muscle. Back in 2022, BMW also locked its cars' heated seat feature in some countries behind an $18-per-month subscription fee. It offered to unlock automatic high beams for roughly $12 and steering wheel heating for another $12, as well. Like in Volkswagen's case, the EV's hardware were already capable of all those features, and customers didn't need to have anything installed. It was all just a matter of paying to unlock their availability. Well, as one would expect, users didn't like that. A year later, BMW scrapped its hardware subscription service and said that it will no longer make customers pay extra for hardware functions going forward. This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/volkswagen-is-making-uk-owners-pay-extra-to-unlock-id3-evs-full-potential-120011898.html?src=rss", "ingested_utc": "2025-08-15T13:41:47Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:56Z", "source": "TheStreet_Top", "title": "National health care company files for Chapter 11 bankruptcy", "url": "https://www.thestreet.com/retail/nationwide-healthcare-rehab-centers-file-chapter-11-bankruptcy", "id_key": "2428f68ae6983e59988c1802c5ac03fa33d742db545454f22bb095cd827ff83a", "summary": "The health care provider offers substance abuse and mental health care under multiple brand names.", "ingested_utc": "2025-08-15T13:41:56Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:57Z", "source": "AlJazeera_All", "title": "How the world is reacting to Israel’s settlement plan in occupied West Bank", "url": "https://www.aljazeera.com/news/2025/8/15/how-the-world-is-reacting-to-israels-settlement-plan-in-occupied-west-bank?traffic_source=rss", "id_key": "19c33d5f823df6f0f3894864a66968b26a9ab2375cb4b5bdc60bdf43492a4371", "summary": "Plans to develop the illegal E1 settlement, which would jeopardise a future Palestinian state, widely condemned.", "ingested_utc": "2025-08-15T13:41:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:57Z", "source": "AlJazeera_All", "title": "Israel’s Ben Gvir filmed threatening Marwan Barghouti in prison", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/15/israels-ben-gvir-filmed-threatening-marwan-barghouti-in-prison?traffic_source=rss", "id_key": "cb83d10aa8cd539b0a67fbc208ae619ec48e857c0c15b9615d19f91d16f9402c", "summary": "Palestinian officials call Israeli threats against jailed leader Marwan Barghouti, an \"unprecedented provocation.\"", "ingested_utc": "2025-08-15T13:41:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:57Z", "source": "AlJazeera_All", "title": "Liverpool target Isak ‘controls’ his Newcastle future", "url": "https://www.aljazeera.com/sports/2025/8/15/liverpool-target-isak-controls-his-newcastle-future?traffic_source=rss", "id_key": "b55da25678138afc7e63c1ccbf78902000f636db464807c20fa6eb834a01540f", "summary": "Swedish international striker Alexander Isak has been training away from his Newcastle colleagues amid Liverpool link.", "ingested_utc": "2025-08-15T13:41:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:41:57Z", "source": "AlJazeera_All", "title": "Hezbollah says Lebanon disarmament plan serves Israel, vows to keep weapons", "url": "https://www.aljazeera.com/news/2025/8/15/hezbollah-says-lebanon-disarmament-plan-serves-israel-vows-to-keep-weapons?traffic_source=rss", "id_key": "82b00d930bb4acb85a708c5a4652b39aea75861f2c374d409519d87a13928f5a", "summary": "Group's leader urges government 'not to hand over the country to an insatiable Israeli aggressor or an American tyrant'.", "ingested_utc": "2025-08-15T13:41:57Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:03Z", "source": "FinancialPost_Business", "title": "Argo Group International Holdings, Inc. Announces Full Redemption of Outstanding Depositary Shares Representing Interests in its 7.00% Resettable Fixed Rate Preferred Stock, Series A, and Full Redemption of Argo Group US, Inc.’s Outstanding 6.500% Senior Notes Due September 15, 2042 and Intent to Voluntarily Delist and Deregister", "url": "https://financialpost.com/globe-newswire/argo-group-international-holdings-inc-announces-full-redemption-of-outstanding-depositary-shares-representing-interests-in-its-7-00-resettable-fixed-rate-preferred-stock-series-a-and-full-redempti", "id_key": "03893cef47a3b7dad5ca8d4da66631b4373bdad1996d7bf3b3ba42679826f04e", "summary": "NEW YORK, Aug. 15, 2025 (GLOBE NEWSWIRE) — Argo Group International Holdings, Inc. (formerly known as Argo Group International Holdings, Ltd.) (“Argo” or “the Company”), an underwriter of specialty insurance products, today announced that, on September 15, 2025 (the “Redemption Date”), (i) the Company will redeem (the “Preferred Redemption”) all 6,000 outstanding shares of its […]", "ingested_utc": "2025-08-15T13:42:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:03Z", "source": "FinancialPost_Business", "title": "Trump Says Semiconductor Tariffs Coming Soon, Could Reach 300%", "url": "https://financialpost.com/pmn/business-pmn/trump-says-semiconductor-tariffs-coming-soon-could-reach-300", "id_key": "4505a59927a9a16a396d5b4501c8392c91028d67c763cd0aab73152322f79532", "summary": "President Donald Trump said he would set levies on semiconductors in the coming two weeks, the latest indication he’s readying a substantial expansion of his tariff regime.", "ingested_utc": "2025-08-15T13:42:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:03Z", "source": "FinancialPost_Business", "title": "Canada’s home sales climb almost 4%, the fourth monthly rise in a row", "url": "https://financialpost.com/real-estate/canada-home-sales-climb-almost-4-per-cent-july-crea", "id_key": "ef570a2ec55ee8c78959d2c69d021c93a50f6d427cbc15ae9d80021034a9b1ce", "summary": "CREA say 'the long-anticipated post-inflation crisis pickup in housing seems to have finally arrived'", "ingested_utc": "2025-08-15T13:42:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:03Z", "source": "FinancialPost_Business", "title": "Osisko Development Closes US$203 Million Private Placement Financing", "url": "https://financialpost.com/globe-newswire/osisko-development-closes-us203-million-private-placement-financing-2", "id_key": "8145a97d159df1741cf5615e9ebe4fb6ff88c4ade363f12bc0349f0d23eb7c60", "summary": "NOT FOR DISSEMINATION IN THE UNITED STATES OR FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES MONTREAL, Aug. 15, 2025 (GLOBE NEWSWIRE) — Osisko Development Corp. (NYSE: ODV, TSXV: ODV) (“Osisko Development” or the “Company“) is pleased to announce the successful closing of its previously announced private placement of 99,065,330 units of the Company (each, a “Unit“) […]", "ingested_utc": "2025-08-15T13:42:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:03Z", "source": "FinancialPost_Business", "title": "Osisko Development Closes US$203 Million Private Placement Financing", "url": "https://financialpost.com/globe-newswire/osisko-development-closes-us203-million-private-placement-financing", "id_key": "61ee921af96ba07402b3c432c8ac769230f4fe503f7d10ea58160b882e475158", "summary": "MONTREAL, Aug. 15, 2025 (GLOBE NEWSWIRE) — Osisko Development Corp. (NYSE: ODV, TSXV: ODV) (“Osisko Development” or the “Company“) is pleased to announce the successful closing of its previously announced private placement of 99,065,330 units of the Company (each, a “Unit“) at a price of US$2.05 per Unit (the “Issue Price“) for aggregate gross proceeds […]", "ingested_utc": "2025-08-15T13:42:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:03Z", "source": "FinancialPost_Business", "title": "Citi Pitches First-of-Its-Kind Debt for Ukraine Reconstruction", "url": "https://financialpost.com/pmn/business-pmn/citi-pitches-first-of-its-kind-debt-for-ukraine-reconstruction", "id_key": "f69a0983e859bbce5d07eb5b2737bd63e3d4cc7f85cf126d2b9c8e14d78004d6", "summary": "Citigroup Inc. has been working on a long-shot bid to put together a deal that it says would help Ukraine fund its reconstruction — part of a push by the Wall Street giant to secure its place in one of the biggest financing opportunities of the coming years.", "ingested_utc": "2025-08-15T13:42:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:03Z", "source": "FinancialPost_Business", "title": "FUTR Surpasses 1,000,000 Transactions and USD$380 Million in Payments Volume With FinWise Bank", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/futr-surpasses-1000000-transactions-and-usd380-million-in-payments-volume-with-finwise-bank", "id_key": "6a93b8e73a3fa7e8e55248a731964e79cfe206920fbe3fc8cfc48e02d8bb7543", "summary": "News Release Highlights FUTR and FinWise partnership began in March 2024, and in Summer 2024 completed the full FUTR customer base migration successfully. In addition to utilizing FinWise Bank’s payment rails, FUTR is now assessing additional usage of the services provided by FinWise’s award-winning MoneyRailsTM platform, which helps facilitate payment and money movement needs. Since […]", "ingested_utc": "2025-08-15T13:42:03Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T13:42:18Z", "source": "HackerNews_Top", "title": "Submerged Roman bathhouse in Baiae may be part of Cicero's villa", "url": "https://archaeologymag.com/2025/08/submerged-roman-bathhouse-in-baiae/", "id_key": "2050b8953542f119c87f71d3e8b2f9d056c85ee2fcab337eb5f7783e71b6ed15", "summary": "Comments", "ingested_utc": "2025-08-15T13:42:18Z"}
