{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Putin ready to make Ukraine deal, Trump says before Alaska summit", "url": "https://www.theguardian.com/world/2025/aug/14/keir-starmer-to-meet-volodymyr-zelenskyy-in-downing-street", "id_key": "251ad39269158708e5e828bb97f40fea4831357edfd3e2369216eb7d68a3d884", "summary": "US president’s comment that Russian and Ukrainian leaders may have to ‘divvy’ things up likely to raise alarm Donald Trump has said he believes Vladimir Putin is ready to make a deal on the war in Ukraine as the two leaders prepare for their summit in Alaska on Friday, but his suggestion the Russian leader and Volodymyr Zelenskyy could “divvy things up” may alarm some in Kyiv. The US president implied there was a 75% chance of the Alaska meeting succeeding, and that the threat of economic sanctions may have made Putin more willing to seek an end to the war. Continue reading...", "ingested_utc": "2025-08-14T22:01:51Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Gavin Newsom says California will move forward with map redrawing plan in response to Texas effort", "url": "https://www.theguardian.com/us-news/2025/aug/14/california-redistricting-map-gavin-newsom", "id_key": "6b60d2b758e7033288ab5e8a65f75c172dec529f5c19d5cf9212ef05c8786172", "summary": "Governor revealed the election rigging response act to counter Trump’s push to gain five extra seats in Texas in midterm elections Gavin Newsom, California’s governor, on Thursday said state Democratic lawmakers would move forward with a redistricting plan intended as a direct response to a Republican-led effort in Texas to redraw congressional maps to control of theHouse majority after the midterm elections. Newsom, joined by congressional Democrats and legislative leaders, unveiled his plan, known as the election rigging response act, to override the state’s independent map-making commission and approve new congressional lines that would aim to “neuter and neutralize” Texas’s proposal. Continue reading...", "ingested_utc": "2025-08-14T22:01:52Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "MarketWatch_Bulletins", "title": "Why stocks (mostly) shrugged off July's surprisingly hot PPI inflation reading", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=d41aca74-2f5c-4c35-8533-9f83165202e0&mod=mw_rss_bulletins", "id_key": "c33737e6d8df2a121ecd15723d0408840a08ca9ae44f9c65ce803b3c6ae91ec4", "summary": "", "ingested_utc": "2025-08-14T22:02:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "NYTimes_Business", "title": "Mario Paglino, 52, and Gianni Grossi, 54, Die; Designers Made Barbies Into Art", "url": "https://www.nytimes.com/2025/08/13/arts/design/mario-paglino-gianni-grossi-dead.html", "id_key": "80606790396c3d37f832e7ab4294f8823202e8d310a12df9ca0032b78e6dbff0", "summary": "They transformed dolls into one-of-a-kind pieces that sold for thousands of dollars. A married couple, they died in a car crash in Italy.", "ingested_utc": "2025-08-14T22:02:10Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "Israel Says More Aid Is Entering Gaza, but Relief Groups Warn of Bottlenecking", "url": "https://www.nytimes.com/2025/08/14/world/middleeast/israel-aid-gaza-issues.html", "id_key": "d68a48353b75b0f27d7a75ec8cdba0c88d9bf3fb9bd3f8459f21dd1b5e5f4170", "summary": "Israel says it has allowed more aid into Gaza in recent days, and food prices are dropping, but humanitarian groups warn it is not enough.", "ingested_utc": "2025-08-14T22:02:11Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "Russia and Ukraine Agree: A Trump Summit Is a Big Win for Putin", "url": "https://www.nytimes.com/2025/08/14/world/europe/trump-putin-alaska-summit.html", "id_key": "f6f980fe3a45c02ddc43c75027160e297184d10ae607f59d77c168deb5460143", "summary": "The talks on Friday in Alaska pull the Russian leader out of diplomatic isolation from the West, and Ukrainian and European leaders fear it gives him an opening to sway the American president.", "ingested_utc": "2025-08-14T22:02:11Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "NPR_Top", "title": "D.C. clergy slam federal takeover: 'Fear is not a strategy for safety'", "url": "https://www.npr.org/2025/08/14/nx-s1-5502749/d-c-clergy-slam-federal-takeover", "id_key": "c28903495a4079bffe19134dd00d53d58a9f1d9ccbbd12b4c9a10fdb0bceba8b", "summary": "A group of religious leaders in Washington, D.C. is criticizing President Donald Trump's federal takeover of the District's police force, saying his rhetoric is dehumanizing and counterproductive.", "ingested_utc": "2025-08-14T22:02:18Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FT_Home", "title": "Buffett’s Berkshire dumped Apple shares again in second quarter", "url": "https://www.ft.com/content/8c4d4941-4d10-4ade-af1c-7ef419e6f61c", "id_key": "4cebd4a63f567edb6d3834db5992dba1b167d812de1db70eb14c2d07c26926d4", "summary": "Conglomerate has reduced its exposure to publicly traded equities over the past three years", "ingested_utc": "2025-08-14T22:02:23Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FT_Home", "title": "BlackRock strikes $11bn Saudi Arabian natural gas deal", "url": "https://www.ft.com/content/2c5dc219-1d86-4d14-8102-2093edc4a4fe", "id_key": "efe0b6dc9a2839169b2d57ab694535e964136a7ba6c621b4f80955cfaaffab8e", "summary": "Agreement is kingdom’s latest effort to attract foreign capital", "ingested_utc": "2025-08-14T22:02:23Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "TheVerge_All", "title": "Supreme Court opens door to social media age-gating in US", "url": "https://www.theverge.com/news/759769/supreme-court-mississippi-age-gating-social-media-ruling", "id_key": "c2e6359705267d30959bcfaa56a25655850a7a810d8bfb29fadc4d8390d91ba0", "summary": "The Supreme Court will let Mississippi’s social media age verification law take effect while the case is being argued in court. In an unsigned ruling on Thursday, the court declined to block the law after an emergency petition from trade association NetChoice. The order offers no explanation, but in a concurring opinion, Justice Brett Kavanaugh […]", "ingested_utc": "2025-08-14T22:02:40Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "ArsTechnica_All", "title": "Starlink tries to block Virginia’s plan to bring fiber Internet to residents", "url": "https://arstechnica.com/tech-policy/2025/08/starlink-tries-to-block-virginias-plan-to-bring-fiber-internet-to-residents/", "id_key": "493cb72fe94db3846b0f0be2634f4855b8a18219cf661c4faed52a0547a6c1af", "summary": "SpaceX wants more money, asks Trump admin to reject state's broadband grant plan.", "ingested_utc": "2025-08-14T22:02:42Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "WIRED_All", "title": "AI Slop Is Ripping Off One of Summer’s Best Games. Copycats Are Proving Hard to Kill", "url": "https://www.wired.com/story/ai-slop-is-ripping-off-one-of-summers-best-games-fighting-back-is-harder-than-you-think/", "id_key": "e43695c359d8c945a304f92355dd4b514ad5a1feacaa1e37c94fa9d997956183", "summary": "Peak has sold millions of copies and is Aggro Crab’s biggest hit to date. That makes it a prime target for cloning.", "ingested_utc": "2025-08-14T22:02:43Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Steam's censorship issues have broken PayPal support in some regions", "url": "https://www.engadget.com/gaming/pc/steams-censorship-issues-have-broken-paypal-support-in-some-regions-214223035.html?src=rss", "id_key": "41972935dfa804a8d8315a8b67cca51a7f6623eae32e3052559531b2b94e1741", "summary": "If you've been unable to pay with PayPal on Steam, Valve says the limitation has to do with issues one of PayPal's banking partners has with content on the platform, according to Rock Paper Shotgun . Users have noticed PayPal was disabled in some regions as far back as July , and the issue seems like it might be out of both Valve and PayPal's hands. \"In early July 2025, PayPal notified Valve that their acquiring bank for payment transactions in certain currencies was immediately terminating the processing of any transactions related to Steam,\" Valve writes in a Steam Support page . \"This affects Steam purchases using PayPal in currencies other than EUR, CAD, GBP, JPY, AUD and USD.\" In a statement to Rock Paper Shotgun , Valve further clarified that the bank's decision to withdraw support for Steam transactions through PayPal was made \"regarding content on Steam, related to what we’ve previously commented on surrounding Mastercard.\" Opting to terminate Steam transactions means that PayPal had to be disabled as a payment method for multiple currencies. Engadget has contacted Valve and PayPal for more information on which regions this change impacts, and what other payment options will be available to them. We'll update this article if we hear back. Valve says it want to offer PayPal payments in those unsupported currencies in the future, \"but the timeline is uncertain.\" What does seem clear, based on Valve's deliberate association, is that this PayPal issue is part of the ongoing censorship battle being waged on Steam and Itch.io . Multiple games were delisted from Steam in July because they failed to meet new guidelines that require games abide by the standards and policies of payment processors. Because certain NSFW games didn't, they were removed. Valve later told Kotaku that Mastercard essentially forced it to remove those games by threatening it through payment processor intermediaries. And Mastercard was reportedly pressured to do so in the first place by conservative activists who took issue with certain sexually explicit games on Steam. In this case, a bank that works with PayPal is the weak link, rather than Steam or a payment network, but it's entirely possible that acquiring bank is responding to a similar kind of pressure. This article originally appeared on Engadget at https://www.engadget.com/gaming/pc/steams-censorship-issues-have-broken-paypal-support-in-some-regions-214223035.html?src=rss", "ingested_utc": "2025-08-14T22:02:45Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Trump's administration may look to buy a stake in Intel", "url": "https://www.engadget.com/big-tech/trumps-administration-may-look-to-buy-a-stake-in-intel-213234862.html?src=rss", "id_key": "4a35769694d8ab579bdee10d5205bdd7a95e291a6293111e43c2c99fd6381d05", "summary": "Intel has had some recent struggles in delivering results for its shareholders, but the company could soon be answering to an additional boss. The current administration is reportedly in talks to have the US government acquire a stake in the chipmaker. No specifics about the size or value of the potential share in the company have been disclosed, but the focus appears to be on increasing Intel's manufacturing footprint in the US. Bloomberg first reported the news, but at least one source cautioned the publication that the situation is still in flux. Intel initially shared plans to construct a semiconductor facility in Ohio in 2022 while Pat Gelsinger was still at the helm of the company. Since then, the project has faced delays , and at its latest quarterly earnings report, execs said Intel would \" slow the pace \" on the Ohio construction, as well as scrapping other international building plans and making workforce cuts. The potential for government ownership of Intel is the latest swing of the administration's attitude toward the company. A few days after calling for his resignation over connections to China, President Donald Trump met with CEO Lip-Bu Tan and seemed to now hold a more positive outlook on the company leader. A representative from Intel told Bloomberg in a statement that the company is \"deeply committed to supporting President Trump’s efforts to strengthen US technology and manufacturing leadership. We look forward to continuing our work with the Trump administration to advance these shared priorities, but we are not going to comment on rumors or speculation.\" This article originally appeared on Engadget at https://www.engadget.com/big-tech/trumps-administration-may-look-to-buy-a-stake-in-intel-213234862.html?src=rss", "ingested_utc": "2025-08-14T22:02:45Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "US car buyers feel tariff pain as one automaker raises prices", "url": "https://www.thestreet.com/automotive/us-car-buyers-feel-tariff-automaker-raises-prices", "id_key": "dcae613f09fc44b658d7679fdc4f1b0eb33cc703e568fc0ea04bf558a9fc93c1", "summary": "One U.S. auto industry giant is raising prices, while others are keeping prices flat.", "ingested_utc": "2025-08-14T22:02:54Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "Amazon is selling a $320 slushie machine for $180 that 'outperformed the Ninja Slushi'", "url": "https://www.thestreet.com/deals/inoviva-slushie-machine-amazon-sale", "id_key": "269e8fd4314f57ff2e827d6e275f927f4115e8bc22434286fd6edd34a13bfb6e", "summary": "\"It makes the best-tasting slushies with a nice smooth texture.\"", "ingested_utc": "2025-08-14T22:02:54Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "Robinhood is now offering its credit card users a ludicrous upgrade option they've been begging to have", "url": "https://www.thestreet.com/personal-finance/robinhood-is-now-offering-gold-card-holders-a-ludicrous-upgrade-option-theyve-been-begging-to-have", "id_key": "ed979983d962a350b2887d6ee00bb07c78d1a58dde47480c93217c16349d671d", "summary": "Turns out, 3% cash back isn't the most premium part of this card.", "ingested_utc": "2025-08-14T22:02:54Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "After bankruptcy, Starbucks rival plans aggressive expansion", "url": "https://www.thestreet.com/restaurants/after-bankruptcy-starbucks-rival-plans-aggressive-expansion", "id_key": "ee236acdda742aba3542705f72bf8f603f46de474985036716187ff457633288", "summary": "The formerly bankrupt café chain aims for a major comeback through rebranding and expansion.", "ingested_utc": "2025-08-14T22:02:54Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "AlJazeera_All", "title": "‘Going to be good for 90 years’: Trump defends record on Social Security", "url": "https://www.aljazeera.com/news/2025/8/14/going-to-be-good-for-90-years-trump-defends-record-on-social-security?traffic_source=rss", "id_key": "f4b1a4c4d571cdf75c157b2f1a3434aa982fcd37db4e78dbe8b0e09cb21fb185", "summary": "To mark Social Security's 90th anniversary, the US president pledged to 'defend' the programme, despite criticisms.", "ingested_utc": "2025-08-14T22:02:55Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "CUPE welcomes Porter cabin crew", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/cupe-welcomes-porter-cabin-crew", "id_key": "436bbdb3b9dbb66d8bd4b3022cee2a43ec6b20eac4789907dda6136e10d6bb5a", "summary": "OTTAWA, Ontario — This week, the Canada Industrial Relations Board (CIRB) announced that CUPE has been successful in its campaign to organize approximately 1,200 cabin crew at Porter Airlines. “When workers organize, they win,” said CUPE National President Mark Hancock. “We are honoured to welcome Porter cabin crew to CUPE. We look forward to making […]", "ingested_utc": "2025-08-14T22:03:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Skeena Gold & Silver Reports Q2 2025 Financial Results", "url": "https://financialpost.com/globe-newswire/skeena-gold-silver-reports-q2-2025-financial-results", "id_key": "15d5158a14b36801cbeeae7df2fd9d1e28db4441438fbe1acdd40f4dc266b3d5", "summary": "VANCOUVER, British Columbia, Aug. 14, 2025 (GLOBE NEWSWIRE) — Skeena Resources Limited (TSX: SKE, NYSE: SKE) (“Skeena Gold & Silver”, “Skeena” or the “Company”) reports interim financial results for the quarter ended June 30, 2025. The interim financial statements and management’s discussion and analysis (“MD&A”) are available on Skeena’s website and have been posted under […]", "ingested_utc": "2025-08-14T22:03:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Inflation or jobs: Federal Reserve officials are divided over competing concerns", "url": "https://financialpost.com/pmn/inflation-or-jobs-federal-reserve-officials-are-divided-over-competing-concerns", "id_key": "8b06e59c022c582818a8a184f1bbfda980b080e7035497cd348dc8a9a639fc18", "summary": "WASHINGTON (AP) — One major question will be front and center for Federal Reserve policymakers as they prepare for an annual conference in Jackson, Wyoming next week and a crucial policy meeting in September: Which is a bigger problem for the economy right now, stubborn inflation or slower hiring? Weak job gains since April have […]", "ingested_utc": "2025-08-14T22:03:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Infrastructure Dividend Split Corp. Establishes At-the-Market Equity Program", "url": "https://financialpost.com/globe-newswire/infrastructure-dividend-split-corp-establishes-at-the-market-equity-program", "id_key": "b9ac1e6c45d5391b64cc9803ad0ca870c0131eff70621cb41bf806dc8b289208", "summary": "Not for distribution to U.S. Newswire Services or for dissemination in the United States. TORONTO, Aug. 14, 2025 (GLOBE NEWSWIRE) — (TSX: IS, IS.PR.A) Infrastructure Dividend Split Corp. (the “Company”) is pleased to announce it has established an at-the-market equity program (“ATM Program”) that allows the Company to issue Class A and Preferred Shares (the […]", "ingested_utc": "2025-08-14T22:03:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Melcor Developments announces second quarter results, declares quarterly dividend of $0.13 per share", "url": "https://financialpost.com/globe-newswire/melcor-developments-announces-second-quarter-results-declares-quarterly-dividend-of-0-13-per-share", "id_key": "af9d107fea3d659285816b31ff43ca85111e776589702599c5048322c0b7a28d", "summary": "EDMONTON, Alberta, Aug. 14, 2025 (GLOBE NEWSWIRE) — Melcor Developments Ltd. (“Melcor”) (TSX: MRD), an Alberta-based real estate development and asset management company, today reported results for the second quarter ended June 30, 2025. The second quarter Management Discussion & Analysis (MD&A) and Condensed Interim Financial Statements are available on our website (www.melcor.ca) under Investors, or […]", "ingested_utc": "2025-08-14T22:03:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Chemtrade Announces Strong Results for Q2 2025, Raises Guidance for 2025 to $475M – $500M; Implementing New NCIB & Redeeming Convertible Debentures", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/chemtrade-announces-strong-results-for-q2-2025-raises-guidance-for-2025-to-475m-500m-implementing-new-ncib-redeeming-convertible-debentures", "id_key": "3dfd6ef2aca6534e7c029c9f87e7a85e3460c57c6300704b881a16a84e57558c", "summary": "TORONTO — Chemtrade Logistics Income Fund (TSX: CHE.UN) (“Chemtrade” or the “Fund”) today announced results for the three-month period ended June 30, 2025. The financial statements and MD&A will be available on Chemtrade’s website at www.chemtradelogistics.com and on SEDAR+ at www.sedarplus.com. Acquisition of Polytec, Inc. a Provider of Turnkey Water Treatment Solutions Chemtrade also announced […]", "ingested_utc": "2025-08-14T22:03:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "COSCIENS Biopharma Inc. Reports Second Quarter 2025 Financial Results and Provides Strategic Initiatives Update", "url": "https://financialpost.com/globe-newswire/cosciens-biopharma-inc-reports-second-quarter-2025-financial-results-and-provides-strategic-initiatives-update", "id_key": "60dd9b337340fe18559c76a599ebba2444fe92789484d70ff1e86f2a7c5279f9", "summary": "COSCIENS Board of Directors approves a plan to voluntarily delist from Nasdaq, while retaining the Company’s listing on the TSX TORONTO, ONTARIO, Aug. 14, 2025 (GLOBE NEWSWIRE) — COSCIENS Biopharma Inc. (NASDAQ: CSCI) (TSX: CSCI) (“COSCIENS” or the “Company”), a life science company focused on natural ingredients and pharmaceutical solutions, today reported its financial and […]", "ingested_utc": "2025-08-14T22:03:02Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "HackerNews_Top", "title": "Show HN: MCP Security Suite", "url": "https://github.com/NineSunsInc/mighty-security", "id_key": "196aa3054d52ae4a7a73546cb8dff3e735bdbc5296feb71cf9afe1f7fecb576e", "summary": "Comments", "ingested_utc": "2025-08-14T22:03:17Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "The state of Solana in 6 charts", "url": "https://blockworks.co/news/the-state-of-solana-charts", "id_key": "9f820887170f37048f9ee5c65ebfec3fe241062d905e10a79b970a008b60b375", "summary": "ETF flows slow, REV stagnates, Pump strikes back and Drift punches up", "ingested_utc": "2025-08-14T22:03:19Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "BitcoinMagazine", "title": "KindlyMD & Nakamoto Officially Merge, Plans to Buy One Million BTC", "url": "https://bitcoinmagazine.com/business/kindlymd-nakamoto-officially-merge-plans-to-buy-one-million-btc", "id_key": "da230f2703456f561fc15d437fa119dee3ec807cbe15ae113830ca6a91e5e7fb", "summary": "Bitcoin Magazine KindlyMD & Nakamoto Officially Merge, Plans to Buy One Million BTC The combined company, led by CEO David Bailey, aims to acquire one million BTC and accelerate Bitcoin adoption across global capital markets. This post KindlyMD & Nakamoto Officially Merge, Plans to Buy One Million BTC first appeared on Bitcoin Magazine and is written by Nik .", "ingested_utc": "2025-08-14T22:03:20Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "CryptoSlate", "title": "Hong Kong regulators warn against hype-driven stablecoin market swings", "url": "https://cryptoslate.com/hong-kong-regulators-warn-against-hype-driven-stablecoin-market-swings/", "id_key": "d243107d9f0af5fe5b961ddead19f9133162624b9bb118c34a133042e1522d36", "summary": "Hong Kong’s financial regulators cautioned investors to avoid making impulsive bets on stablecoin-linked assets after a spate of sharp price swings tied to speculation, corporate announcements, and unverified claims about licensing plans in the city. In a joint statement, the Hong Kong Monetary Authority (HKMA) and the Securities and Futures Commission (SFC) said they had […] The post Hong Kong regulators warn against hype-driven stablecoin market swings appeared first on CryptoSlate .", "ingested_utc": "2025-08-14T22:03:22Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "CryptoBriefing", "title": "SEC delays decision on Solana ETFs from Bitwise and 21Shares as SOL stalls near $190", "url": "https://cryptobriefing.com/sec-delays-21shares-spot-solana-etf/", "id_key": "2ae162fda36ae95020b43696d04e12aa8cb19d2e65fcba80247edeef2ac9deab", "summary": "SEC extends decision on Bitwise and 21Shares Solana ETFs to October 16 as SOL trades near $190 after hot US PPI data. The post SEC delays decision on Solana ETFs from Bitwise and 21Shares as SOL stalls near $190 appeared first on Crypto Briefing .", "ingested_utc": "2025-08-14T22:03:23Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "CryptoNews", "title": "Stablecoins Set to Capture $1 Trillion Payment Volume by 2028, Could Reshape US Monetary Policy: Report", "url": "https://cryptonews.com/news/stablecoins-set-to-capture-1-trillion-payment-volume-by-2028-could-reshape-us-monetary-policy-report/", "id_key": "0f33c06a1bb45b07c3d23216181ac6416c4fbd9f087ac7fe08da6b79664cff70", "summary": "Keyrock–Bitso research has projected a trillion in stablecoins volume by 2030, with stablecoins set to handle 12% of cross-border flows and possibly 10% of U.S. money supply. Onchain settlement has cut costs and time, while issuers’ T-bill holdings have affected yields and market structure. The post Stablecoins Set to Capture $1 Trillion Payment Volume by 2028, Could Reshape US Monetary Policy: Report appeared first on Cryptonews .", "ingested_utc": "2025-08-14T22:03:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "CryptoNews", "title": "Treasury Secretary Scott Bessent Says U.S. Will Not Buy Bitcoin For Strategic Reserve: Fox News", "url": "https://cryptonews.com/news/treasury-secretary-scott-bessent-says-u-s-will-not-buy-bitcoin-for-strategic-reserve-fox-news/", "id_key": "a66af52447406a5a10e9383ee9651c8433a2b07b1bc9d509a5766a56319b0fbe", "summary": "Scott Bessent has said the U.S. will not buy Bitcoin for a Bitcoin reserve, using confiscated coins and stopping sales. He has put holdings at $15–$20B. Bitcoin has eased from $124,000 to $117,000. January and March orders have set funding via forfeitures. The post Treasury Secretary Scott Bessent Says U.S. Will Not Buy Bitcoin For Strategic Reserve: Fox News appeared first on Cryptonews .", "ingested_utc": "2025-08-14T22:03:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "CryptoNews", "title": "ChatGPT’s XRP Analysis Reveals Key Support Test at $3.10 as $1B Market Liquidation Triggers Profit-Taking", "url": "https://cryptonews.com/news/chatgpts-xrp-analysis-reveals-key-support-test-at-3-10-as-1b-market-liquidation-triggers-profit-taking/", "id_key": "4aa3595d587ef7a032c5ec41f0548f74234ae40dde2ecca135de115fccbbc868", "summary": "ChatGPT's XRP Analysis has reported a 5.37% pullback to $3.10, testing the $2.99-$2.92 support zone as a $1B crypto liquidation prompts institutional profit-taking. Technical signals suggest a decisive move ahead, with infrastructure readiness supporting recovery potential. The post ChatGPT’s XRP Analysis Reveals Key Support Test at $3.10 as $1B Market Liquidation Triggers Profit-Taking appeared first on Cryptonews .", "ingested_utc": "2025-08-14T22:03:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "CryptoNews", "title": "PayPal and BlackRock Moves Ignite Arbitrum ($ARB) – Will $0.59 Finally Fall?", "url": "https://cryptonews.com/news/arbitrum-arb-climbs-by-0-57-can-upgrades-and-partnerships-push-arb-past-0-59/", "id_key": "2899329526bf097f65163d1dbd96ee2c71c01cd1b7d7af364c766bf3c520b943", "summary": "Arbitrum ($ARB) has built momentum through upgrades and partnerships: PYUSD support on-chain, Timeboost has been designed to speed processing, a $14M audit subsidy has been approved, and Offchain Labs has acquired ZeroDev. Price has tested $0.56–$0.57, with $0.59 watched and $0.48–$0.50 support. The post PayPal and BlackRock Moves Ignite Arbitrum ($ARB) – Will $0.59 Finally Fall? appeared first on Cryptonews .", "ingested_utc": "2025-08-14T22:03:27Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-14", "source": "Unchained", "title": "DeFi Tokens Surge — But These Hidden Gems Could Shine Next", "url": "https://unchainedcrypto.com/defi-tokens-surge-but-these-hidden-gems-could-shine-next/", "id_key": "52f529c2a7354e9d7eb6c9eb71362ebc921fbd7bada88d32aefce9bc208811cf", "summary": "DeFi tokens are having a moment. Aside from being a high-beta play on ether, which has surged 73.19% over the past three months to trade at $4,664, expectations are growing for a big influx of capital into the sector on the back of the GENIUS Act giving stablecoins the regulatory ... The post DeFi Tokens Surge — But These Hidden Gems Could Shine Next appeared first on Unchained .", "ingested_utc": "2025-08-14T22:03:30Z"}
