{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:50:44Z", "source": "Guardian_World", "title": "Australia politics live: Labor to invest $30m in trade skills teaching; MP with autistic daughter reveals fear over NDIS changes", "url": "https://www.theguardian.com/australia-news/live/2025/aug/26/australia-politics-live-labor-coalition-trades-ndis-environment-epa-anthony-albanese-sussan-ley-question-time-ntwnfb", "id_key": "e1785ca31ba0321750d743758293a94226e9aed745a274d776e9244c4556fd95", "summary": "Andrew Giles to map out plans for more electrical and construction teachers. Follow today’s news live Get our breaking news email , free app or daily news podcast As the Albanese government tries to curb the cost of the NDIS, a Coalition MP and father of an autistic child has spoken out about how he was in “two minds” about the reform, Australian Associated Press reports. Parents reacted with shock when the federal government announced last week a new scheme called Thriving Kids to serve as a cheaper alternative to the $44bn NDIS. I know that reform is needed. I get that. I understand it, but it must be done in a way where participants aren’t waking up in the morning finding out that things have changed. Continue reading...", "ingested_utc": "2025-08-25T20:50:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:50:44Z", "source": "Guardian_World", "title": "Judge halts Trump administration from deporting Kilmar Ábrego García for now", "url": "https://www.theguardian.com/us-news/2025/aug/25/kilmar-abrego-garcia-uganda-deportation-trump", "id_key": "57d6a29430da13f4386c3ed212be4625aabceefe1c1665394fe961f295112129", "summary": "Maryland man detained after reporting to Ice agents in Baltimore is threatened with deportation to Uganda Kilmar Ábrego García – who has been thrust into the middle of an acrimonious deportation saga by the second Trump administration – has been detained after reporting to Immigration and Customs Enforcement (Ice) agents in Baltimore on Monday, but a judge later ruled that he cannot be deported for now. His detainment comes just three days after his release from criminal custody in Tennessee. Shrai Popat contributed reporting Continue reading...", "ingested_utc": "2025-08-25T20:50:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:53:34Z", "source": "Engadget_All", "title": "Perplexity has cooked up a new way to pay publishers for their content", "url": "https://www.engadget.com/ai/perplexity-has-cooked-up-a-new-way-to-pay-publishers-for-their-content-204255019.html?src=rss", "id_key": "31d61a4cc5c69876b40734583d3df5ada6a479a6ee82c158da5313967c108d5b", "summary": "Perplexity is launching a new revenue-sharing plan for publishers that will pay them every time its AI assistants use an article to answer a question, The Wall Street Journal reports . Perplexity is launching the plan (and partially paying for it) with a new Comet Plus subscription that gives subscribers access \"to premium content from a group of trusted publishers and journalists.\" Comet Plus costs $5 per month, and based on Perplexity's description, it's primarily designed to account for the actions its Comet Agent (included in the Comet browser ) takes on websites, which aren't considered in existing publisher deals. \"When you ask Perplexity to synthesize recent coverage of an industry trend, that's indexed traffic,\" the company writes. \"When Comet Assistant scans your calendar and suggests articles relevant to your day’s meetings, that's agent traffic.\" The company's existing Publisher Program , which counts publications like TIME and Fortune as participants, shares ad revenue based on the traffic a Perplexity search is stealing away by providing a summary of an article. The money shared through Comet Plus will presumably account for what's lost when an AI agent visits a webpage on your behalf, zooming past ads you'd normally see or hear. Publishers will get 80 percent of the revenue of Comet Plus, according to Perplexity, with the remaining 20 percent allocated to \"compute.\" The Wall Street Journal writes that Perplexity will initially pay participating publishers out of a \"$42.5 million revenue pool\" that will expand over time, presumably as sign-ups grow for Comet Plus, and the Comet web browser becomes available to more people. That starting sum likely takes into account Perplexity's existing Pro and Max subscribers, who will receive Comet Plus as part of their subscriptions and are paying into the revenue-sharing scheme by default. It sounds generous on its face, and maybe with a large enough volume of subscribers it will be, but 80 percent of $5 is $4. That's $4 that will presumably unlock unlimited access to a publication's entire library of content. Most newspapers charge anywhere from $20 to $30 per month to access all of their articles. Why would they settle for less? It's not clear if this plan replaces Perplexity's existing Publisher Program, or will exist alongside it. It's also hard to say if not paying for Comet Plus will change the quality of responses you receive in Comet or Perplexity. Engadget has contacted Perplexity for more information and will update this article if we hear back. Perplexity likely wouldn't be exploring new revenue-sharing plans if it hadn't already been caught plagiarizing articles in the first place. The company wants its agentic browser to be a success, and that ideally requires a certain amount of participation from the people who create the articles, images, and videos agents browse. It remains to be seen if Comet Plus is the kind of arrangement that will make publishers play ball. This article originally appeared on Engadget at https://www.engadget.com/ai/perplexity-has-cooked-up-a-new-way-to-pay-publishers-for-their-content-204255019.html?src=rss", "ingested_utc": "2025-08-25T20:53:34Z"}
