{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_Business", "title": "Trump is promising a US manufacturing renaissance. Many experts are dubious", "url": "https://www.theguardian.com/us-news/2025/aug/18/trumps-tariffs-manufacturing-resurgence-jobs", "id_key": "8025099aaba497089185cba852bdee7b736d9a7ee79711fe6b8737c728bd9aa0", "summary": "Economists doubt US duties will bring about a resurgence of US factory jobs, notably due to Trump’s erratic tariff rollout Donald Trump’s hugely disruptive trade war is setting the stage for a manufacturing renaissance in the US, administration officials say. Outside the White House, many economists are skeptical. Global trade experts point to many reasons they believe the president’s tariffs will fail to bring about a major resurgence of manufacturing, among them: Trump’s erratic, constantly changing policies, his unfocused, across-the-board tariffs, and his replacing Joe Biden’s carrot-and-stick approach to brandish sticks at the world. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_Business", "title": "Flight attendant union leaders ‘ready to go to jail’ as Air Canada strike outlawed", "url": "https://www.theguardian.com/world/2025/aug/18/air-canada-flight-attendants-strike-illegal", "id_key": "ed504beb11bc02a185cfb24d20d711bc8a739989cbb78306caa35f6419e65d61", "summary": "Arbitrator orders 10,000 striking staff back to work after government intervenes – unconstitutionally union says Union leaders representing 10,000 striking flight attendants have said they would be willing to go to jail rather than comply with an order to return to work, as Canada ’s federal government seeks to end a bitter contract dispute that has halted hundreds of summer flights and stranded travellers around the world. Speaking to reporters on Monday, the national president of the Canadian Union of Public Employees said members would remain on the picket lines as part of a work stoppage that has halted Air Canada’s national and international operations during its busiest season. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Zambian president’s feud with late rival continues over funeral plans", "url": "https://www.theguardian.com/world/2025/aug/18/zambian-presidents-feud-with-late-rival-continues-over-site-of-funeral", "id_key": "d3d07c7d9d453a0b0306a8411d9b452636f809f287ace15e5eb46a8a10a7a7a1", "summary": "Family of Edgar Lungu trying to prevent repatriation of his body for state funeral presided over by his successor A furious row is raging over whether the Zambian president, Hakainde Hichilema, will preside over the funeral of his predecessor, Edgar Lungu, as the former president’s family wage a legal battle in South Africa to try to prevent his body from being repatriated. The legal fight marks the latest twist in a feud between the two men that goes back at least a decade and has now outlasted the former president, who died in South Africa in June aged 68 while being treated for an undisclosed illness. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Trump says ceasefire not necessary to negotiate Ukraine-Russia peace deal but US will give Kyiv ‘very good protection’ – live", "url": "https://www.theguardian.com/world/live/2025/aug/18/ukraine-war-live-update-russia-zelenskyy-washington-trump-europe-meeting-talks-latest-news", "id_key": "a0f92ffb9ff9ffb634da1f89b6b656c68bc626666d1e6cecf4d031a3731d237f", "summary": "US president also touts ‘very substantial progress’ in Putin talks and confirms US will be ‘involved’ in Ukraine’s security A Russian drone attack on a five-storey apartment block in the Ukrainian city of Kharkiv early Monday killed five people and wounded more than a dozen others, Ukrainian authorities said . The attack, which took place just before dawn, reduced part of the building to rubble and sparked fires on at least three floors, the region’s governor Oleg Synegubov said on Telegram. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Son of Norway’s crown princess charged with four counts of rape", "url": "https://www.theguardian.com/world/2025/aug/18/son-norway-crown-princess-charged-offences-marius-borg-hoiby", "id_key": "624b0e5436b66483dd0fc71a0058e38663127493c7d888bbe4e8ea557899e91e", "summary": "Marius Borg Høiby charged with 32 offences and could face up to 10 years in prison if found guilty Marius Borg Høiby, the son of the Norwegian crown princess, has been charged with 32 offences including four counts of rape, a prosecutor has said. Høiby, whose mother is the crown princess, Mette-Marit, and whose stepfather is the crown prince, Haakon, Norway’s future king, is expected to stand trial early next year and could face up to 10 years in prison if found guilty of the most serious charges. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Hamas tells mediators it approves latest Gaza ceasefire proposal – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/18/israel-protests-government-new-offensive-gaza-city-middle-east-latest-updates-news", "id_key": "02b11813c73573a4145738e8f504bfdc6c2b231d52aa9d19a7c00b4b2a92d203", "summary": "Hamas official tells Reuters news agency it has approved latest Gaza ceasefire proposal. This live blog is closed Hamas says it accepts proposal for Gaza ceasefire and release of hostages Norway’s sovereign wealth fund, the world’s largest, said on Monday it had decided to exclude six companies with connections to the West Bank and Gaza from its portfolio, following a review of its Israeli investments. The $2tn wealth fund did not name the companies it had decided to exclude, but said these would be made public once the divestment was completed, Reuters reports. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Hamas says it accepts proposal for Gaza ceasefire and release of hostages", "url": "https://www.theguardian.com/world/2025/aug/18/hamas-gaza-proposed-ceasefire-hostage-release-deal-israel", "id_key": "9b8bbdf96d00f0226b0541be01b91a805e80f6a8629672ec44d989264d09a329", "summary": "Deal would include 60-day halt to violence and exchange of half of living Israeli hostages for Palestinian prisoners Hamas officials say they have accepted a proposal for a Gaza ceasefire deal that would include the release of half of the approximately 20 remaining living Israeli hostages as part of a phased resolution to the war, as Gaza health officials said 62,000 Palestinians had died in the 22 months of war. The proposed deal follows negotiations between Hamas and Egyptian and Qatari officials that have been taking place in Cairo in recent days, and comes after the Israeli prime minister, Benjamin Netanyahu, was confronted on Sunday by Israel’s biggest protests of the war , which called for a deal to secure the release of the hostages. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Netanyahu criticises protests in Israel against his handling of Gaza war", "url": "https://www.theguardian.com/world/2025/aug/18/netanyahu-criticises-protests-israel-handling-gaza-war-hostages", "id_key": "ba47d90a39ca1c34e14a4f0d28fe6bd405249ffb2f46d22341ad515bed0e988b", "summary": "Israeli PM suggests demonstrators are toughening Hamas’s stance and delaying the release of hostages Benjamin Netanyahu has criticised massive street protests against his handling of the Gaza war, and failure to secure the release of remaining Israeli hostages, suggesting demonstrators were giving comfort to Hamas’s position in negotiations. The Israeli prime minister made his comments against the backdrop of the largest protests in almost two years of war, with estimates that upwards of 400,000 people joined marches across Israel on Sunday. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Police officers warned against dancing with revellers at Notting Hill carnival", "url": "https://www.theguardian.com/culture/2025/aug/18/police-officers-warned-against-dancing-ahead-of-notting-hill-carnival", "id_key": "8e89605b4ecf93ac2698a89cc0be15a02bc7910accf661ff4df93e248263c497", "summary": "With two murders and over 60 officers injured during last year’s festivities, the Met fears dancing distracts police on duty For George Michael, it was guilty feet that left him unable to dance. For Eddy Grant, a world full of problems left him rooted to the spot as the music played. But for police officers amid the sound systems at this weekend’s Notting Hill carnival, it is orders from on high that dictate that no matter how the beat moves them, they are banned from dancing with revellers. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "NHS data reveals A&E ‘Uber ambulance crisis’ in England, say Lib Dems", "url": "https://www.theguardian.com/society/2025/aug/18/figures-gathered-from-nhs-trusts-reveal-uber-ambulance-crisis-in-england", "id_key": "1a5bbf2d93b402392743e2f00c1117003716c9d069070e7763bcf5e79abfcc64", "summary": "Party says figures highlight growing loss of faith in ability of services to be there for people when needed Growing numbers of patients are making their own way to A&E instead of taking ambulances with nearly 2.7 million people taking alternative transport to emergency departments last year. The figure is a 14% increase from 2.36 million in 2019 and highlights the number of people losing faith in ambulance services, the Liberal Democrats have said, after gathering the data from NHS trusts. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Treasury criticises ‘unachievable’ plan for underground nuclear waste dump in Cumbria", "url": "https://www.theguardian.com/environment/2025/aug/18/treasury-criticises-unachievable-plan-for-underground-nuclear-waste-dump-in-cumbria", "id_key": "3b5850119e09837e4e9f808679bcdb8bf56d80b1430c8b116d18d6fd1350fec3", "summary": "Assessment suggests cost of project to store 700,000 cubic metres of radioactive waste could reach £54bn The UK’s proposal for a new underground nuclear waste dump has been described as “unachievable” in a Treasury assessment of the project. Ministers have put new nuclear power at the centre of their green energy revolution. But the problem of what to do with 700,000 cubic metres of radioactive waste – roughly the volume of 6,000 doubledecker buses – from the country’s past nuclear programme, as well as future waste from nuclear expansion, has yet to be solved. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Tenants in England spending ‘unaffordable’ 36% of income on rent, shows survey", "url": "https://www.theguardian.com/money/2025/aug/18/tenants-in-england-spending-unaffordable-36-of-income-on-rent-shows-survey", "id_key": "509f3a68c1de0cc41ba4fbe13b06c011cef199a0bcaa3362b5c310bf9db0bc9a", "summary": "ONS figures for 2024 show top 10 least affordable areas all in London (42% of income) while most affordable region was north east (20%) Renting homes in England is becoming increasing unaffordable, according to official figures that show tenants pay an average of 36.3% of their income on rent, a figure that rises to 41.6% in London. People earning a median salary spent 36.3% of their income on an average-priced rented home in England in 2024, up from 34.2% in 2023, according to the Office for National Statistics (ONS). Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Trump doubles down on baseless claims that mail-in voting is ‘corrupt’, undermines voting machines", "url": "https://www.theguardian.com/us-news/live/2025/aug/18/national-guard-deployment-three-states-washington-dc-donald-trump-administration-us-politics-latest-updates-news", "id_key": "c73634286c391ff3573f9808a019a268ae00086774ee0c682d1417f1f75ec494", "summary": "The president tells reporters that an executive order scrapping mail ballots is ‘being written’ — citing debunked theories about fraud, cost and inaccuracy Trump pledges to scrap mail ballots before 2026 midterms An aid group that coordinates medical care in the United States for badly injured children from Gaza has said it is “distressed” by the US state department’s decision to stop issuing visitor visas for Palestinians after a far-right influencer complained directly to the secretary of state about their work. Laura Loomer, who has previously described herself as a “proud Islamophobe”, told the New York Times that she had spoken to Marco Rubio on Friday night to warn the secretary of state of what she called the threat posed by “Islamic invaders”. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Suspect in custody after two police officers were shot and killed in Utah", "url": "https://www.theguardian.com/us-news/2025/aug/18/two-police-officers-dead-utah-shooting", "id_key": "a9c8f539beb8279442de28f71d50d940125204d898eb6ddf633fcbfbf3ca7b30", "summary": "A sheriff’s deputy and a police dog were also injured as they arrived to respond to a domestic disturbance call Two police officers responding to a domestic disturbance call were shot and killed in Utah , and a man was taken into custody after bystanders persuaded him to drop the gun, authorities said on Monday. A sheriff’s deputy and a police dog were also shot and wounded in their car as they arrived to help at a neighborhood in Tremonton amid the deadly violence on Sunday night. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:55:56Z", "source": "Guardian_World", "title": "Two Carnival cruise guests drown at new Bahamas resort on same day", "url": "https://www.theguardian.com/business/2025/aug/18/americans-drown-carnival-cruise", "id_key": "d1445747201df42df794798316c230de7e7dffafc4a9f00d562d45a4239ad238", "summary": "Deaths of Americans aged 74 and 79 occurred at Celebration Key, a private destination for Carnival cruise passengers Two US nationals in their 70s apparently drowned in two separate incidents on Friday at a new resort in the Bahamas, according to officials. The deaths happened at Celebration Key, a $600m private destination created for Carnival Cruise Line passengers that launched in July about 100 miles (160km) off the coast of Florida. Continue reading...", "ingested_utc": "2025-08-18T18:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:56:16Z", "source": "CryptoSlate", "title": "Polygon DeFi TVL jumps 43% in 2025 as QuickSwap, Polymarket lead inflows", "url": "https://cryptoslate.com/polygon-defi-tvl-jumps-43-in-2025-as-quickswap-polymarket-lead-inflows/", "id_key": "d559f7a8a2e3c6906ba18829e6c4605f5215bf00ed49e19574df431ec6372b18", "summary": "The total value locked (TVL) in Polygon’s (POL) DeFi ecosystem is up nearly 43% since the start of this year. According to DefiLlama data, the network recorded $864 million in TVL on Jan. 1, and added roughly $400 million in the following months to hit $1.23 billion as of Aug. 18. Furthermore, the POL price […] The post Polygon DeFi TVL jumps 43% in 2025 as QuickSwap, Polymarket lead inflows appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T18:56:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:56:17Z", "source": "CryptoBriefing", "title": "US Treasury advances GENIUS Act mandate, seeks public input on stablecoin oversight", "url": "https://cryptobriefing.com/stablecoin-regulation-genius-act/", "id_key": "552bcddfb6ba610165073fe31b6ded25a8a89f2352e45a0ba2cc272fd4debbcb", "summary": "The GENIUS Act's regulatory framework could enhance US financial leadership, boost stablecoin demand, and drive innovation in digital finance. The post US Treasury advances GENIUS Act mandate, seeks public input on stablecoin oversight appeared first on Crypto Briefing .", "ingested_utc": "2025-08-18T18:56:17Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:56:18Z", "source": "Protos", "title": "MicroStrategy abandons MSTR dilution promise after mNAV drop", "url": "https://protos.com/microstrategy-abandons-mstr-dilution-promise-after-mnav-drop/", "id_key": "cb76a2deb52370f986953bd3d279a10c24990644f1158cc663ed125453ef1f1f", "summary": "Anti-dilution guidance from MicroStrategy only lasted two weeks. In its place is revised, vague language about ‘advantageous’ conditions. The post MicroStrategy abandons MSTR dilution promise after mNAV drop appeared first on Protos .", "ingested_utc": "2025-08-18T18:56:18Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:56:20Z", "source": "CryptoNews", "title": "ChatGPT’s XRP Analysis Flags $2.94 Support – Rebound Setup or Breakdown?", "url": "https://cryptonews.com/news/chatgpts-xrp-analysis-can-bulls-hold-2-94-support/", "id_key": "818738c182f41eb850bb00b7f12575c8eeca0c19c1b7a9b15695bcc926670c85", "summary": "ChatGPT's XRP analysis has observed a move to $3.0047 with a test of 50-day EMA near $2.9422, while price has stayed above 100- and 200-day EMAs. MACD has been below zero with a positive histogram, RSI has approached oversold, and institutions have adjusted amid liquidations and a security review. The post ChatGPT’s XRP Analysis Flags $2.94 Support – Rebound Setup or Breakdown? appeared first on Cryptonews .", "ingested_utc": "2025-08-18T18:56:20Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:56:20Z", "source": "CryptoNews", "title": "Bitcoin Miner TeraWulf Announces $400M Private Notes – Data Center Push, $60M Upsize Option", "url": "https://cryptonews.com/news/bitcoin-miner-terawulf-announces-400m-private-notes-data-center-push-60m-upsize-option/", "id_key": "c657a434a0153b47a615ac12d31d31396c4404cab88288ae83fcbdc5f84af219", "summary": "Bitcoin Miner TeraWulf has announced a $400M private offering of convertible notes due 2031, partly funding data center expansion. The notes offer financing flexibility while delaying dilution, as demand for high-performance computing drives interest in adapting infrastructure for AI and cloud services. The post Bitcoin Miner TeraWulf Announces $400M Private Notes – Data Center Push, $60M Upsize Option appeared first on Cryptonews .", "ingested_utc": "2025-08-18T18:56:20Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:58:09Z", "source": "MarketWatch_Bulletins", "title": "The bull case for Nvidia just got stronger, according to these analysts", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=d42a672c-76d8-45a5-9951-e7dd390519fc&mod=mw_rss_bulletins", "id_key": "13fb8009212422dcac9c827d686fb5129e534fe6001e7b07e5ba762f20d4b275", "summary": "", "ingested_utc": "2025-08-18T18:58:09Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:58:25Z", "source": "NPR_Top", "title": "Hurricane Erin: No direct hit forecast on U.S., but flood risks prompt evacuations", "url": "https://www.npr.org/2025/08/18/nx-s1-5506150/hurricane-erin-forecast-path-evacuation-outer-banks", "id_key": "4fa9af6d5cf25647c0136d4b2158170e322078e2846cd590e19ba841a866b482", "summary": "Parts of North Carolina's Outer Banks are under mandatory evacuation orders, as the National Hurricane Center warns that Hurricane Erin could bring tall waves topping 15 to 20 feet.", "ingested_utc": "2025-08-18T18:58:25Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:58:56Z", "source": "TheVerge_All", "title": "Roblox is locking down sexual content and access to ‘adult’ locations after lawsuits", "url": "https://www.theverge.com/news/760805/roblox-sexual-content-lawsuit-age-verification", "id_key": "639e1b8e312f9733e00fba8bd285665f7bfa9bb998fb6bd80cb8988102d762f7", "summary": "Roblox is updating its policies prohibiting romantic or sexual content to also forbid “content, settings, or behavior that implies sexual activity,” according to a Friday post from chief safety officer Matt Kaufman (emphasis Kaufman’s). The changes follow recent lawsuits against the company, including one from Louisiana Attorney General Liz Murrill that alleges the platform creates […]", "ingested_utc": "2025-08-18T18:58:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:58:58Z", "source": "ArsTechnica_All", "title": "Elon Musk’s “thermonuclear” Media Matters lawsuit may be fizzling out", "url": "https://arstechnica.com/tech-policy/2025/08/elon-musks-thermonuclear-media-matters-lawsuit-may-be-fizzling-out/", "id_key": "6bea92936741f26347cf2f0d1218ea50becf048f254fe3d0788d3fa80c68c814", "summary": "Judge blocks FTC's Media Matters probe as a likely First Amendment violation.", "ingested_utc": "2025-08-18T18:58:58Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:58:59Z", "source": "WIRED_All", "title": "Jackery Explorer 1000 Deal: $350 Off Battery Bank Right Now", "url": "https://www.wired.com/story/jackery-explorer-1000-deal/", "id_key": "e87e73546ab4f68dad8d85942eecc577bca92b4492dbb3ae10135dac3757aada", "summary": "Save cash and store power with a massive discount on this portable battery bank.", "ingested_utc": "2025-08-18T18:58:59Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:00Z", "source": "Engadget_All", "title": "Workday says hackers used social engineering to access personal data during a breach", "url": "https://www.engadget.com/cybersecurity/workday-says-hackers-used-social-engineering-to-access-personal-data-during-a-breach-183451732.html?src=rss", "id_key": "12d65396e8447d0009537d2e343550d047335621d8fefc302737248d6d02b545", "summary": "Human resources technology company Workday has confirmed that a data breach has affected its third-party CRM platform. In a blog post announcing the breach, the company said that a social engineering campaign had targeted its employees, with threat actors posing as IT or HR in order to trick employees into sharing account access or personal information. The company says that while the threat actors were able to access some information from the CRM, there is no indication of any access to customer accounts or the data within them. \"We acted quickly to cut the access and have added extra safeguards to protect against similar incidents in the future,\" the post reads. Workday says that the information gathered from the CRM consists of \"commonly available\" business contact information such as names, email addresses and phone numbers. From the sound of its blog post, the information of Workday end users was not revealed, only information from the companies it has contracts with. What is known with some certainty at this point is that Workday's CRM was breached. The company's statement that \"no indication\" of a deeper customer data breach was found is far from a guarantee — often, the full scope of hacks like this aren’t known until later. Earlier this year, Workday laid off around 1,750 employees, or around 8.5 percent of its workforce. The company said it was \"prioritizing innovation investments like AI and platform development, and rigorously evaluating the ROI of others across the board.\" The precise third-party CRM Workday is referring to was not disclosed. Earlier this year Google fell victim to a hack via the Salesforce app, and last year Disney said it would stop using Slack, the Salesforce-owned messaging platform, after a hack exposed company data. This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/workday-says-hackers-used-social-engineering-to-access-personal-data-during-a-breach-183451732.html?src=rss", "ingested_utc": "2025-08-18T18:59:00Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:00Z", "source": "Engadget_All", "title": "iOS 26 updates: Everything you need to know about Apple's big software changes coming to iPhone and iPad", "url": "https://www.engadget.com/mobile/ios-26-updates-everything-you-need-to-know-about-apples-big-software-changes-coming-to-iphone-and-ipad-135749771.html?src=rss", "id_key": "7f4c7fe601c573a826b0407034b33b6f50d9619f0e3fb3a99ccce620fc2c797b", "summary": "Liquid Glass is a huge new change coming to iOS 26. (Apple) We're past the the halfway point of August, which means that we're very likely less than a month away from Apple's annual iPhone event. In addition to announcing its newest iPhone 17 lineup , the company will also give us an official date for downloading iOS 26 . While we wait to find out, you can download and install the newly released public beta 2 (or iOS 26 developer beta 6 for developers). I've been playing around with it for the past couple of weeks, and have found that taking screenshots is way better in the new operating system — Google and ChatGPT search options are now in the screenshots editor, for instance. You can see a more complete view of the new features in our preview of the iOS 26 public beta release , which shows off the fresh home and lock screen redesign. Called Liquid Glass , the new translucent look will extend across all of Apple's upcoming operating systems. The overhaul is one of several big changes coming to iOS, macOS , iPadOS and the rest of Apple's software suite, all of which were showcased during the company's WWDC keynote on June 9. After overpromising on AI plans last year, Apple kept its iOS roadmap focused more on basic quality of life improvements this year. There are multiple useful additions coming to the Phone and Messages apps on your iPhone, for instance: Apple execs outlined the ability to weed out spam texts or other unknown senders and an option to hold your spot on a phone call when you've been waiting for a representative to pick up. Plus, a treasured feature that we took for granted is coming back (hint: it's in the Photos app). Siri, meanwhile, is in a holding pattern. Apple has previously specified that its smarter voice assistant — first promised at WWDC 2024 — is delayed until some point \" in the coming year ,\" so you shouldn't expect any major changes in the current betas. But there are reports that Apple is aiming to give Siri a bigger brain transplant by basing it on third-party artificial intelligence models like OpenAI's ChatGPT or Anthropic's Claude, which could make 2026 a pivotal year. The company is also reportedly working on a 'stripped-down' AI chatbot to rival ChatGPT. With each beta, it seems like additional new improvements are popping up, like this new AirPods gesture we're all curious about, and this FaceTime feature that'll freeze your video if it detects nudity . With the release of the iOS 26 developer beta 5 , we saw more added features, like a new bouncy animation on the passcode screen and in the Control Center, MacRumors reports . Some or all of those changes will likely soon migrate into the separate public beta (see below). Most newer iPhone models are eligible to download iOS 26 (both the betas and final version). Want to see the full list of new features coming this fall? Read on. What is iOS 26? The current iPhone operating system is iOS 18, and Apple is still actively updating it — version 18.6.1 was just recently released to restore Apple Watch blood oxygen monitoring functionality for certain users in the US, and another minor iOS 18 update is expected before the newest OS is launched, according to a leaker who shared the info with MacRumors . But don't expect to see iOS 19. Instead, Apple is skipping the numbering ahead to iOS 26 later this year. The company has decided to line up its iOS version numbers with a year-based system, similar to car model years. So while iOS and its sibling operating systems will be released in late 2025, they're all designated \"26\" to reflect the year ahead. It's official, we're moving to iOS 26. (Apple) What is Liquid Glass design? Let's be honest. Out of everything announced at WWDC this year, the new Liquid Glass design was the star of the show. The iPhone's home and lock screens have looked pretty much the same year after year — the last exciting thing (in my opinion) was the option to add your own aesthetic to your home screen by customizing your apps and widgets. So seeing the home and lock screens' new facelift is refreshing. So what exactly is Liquid Glass? Apple calls it a \" new translucent material \" since, well, the apps and widgets are clear. However, the screen can still adapt to dark and light modes, depending on surroundings. You'll also notice buttons with a new floating design in several apps, like Phone and Maps. They're designed to be less distracting than the current buttons, but are still easy to see. While the design overhaul has proven to be controversial since its announcement, some — including Engadget's own Devindra Hardawar — like the new direction, even if it's somewhat reminiscent of Microsoft's translucent Windows Vista Aero designs from nearly twenty years ago. That said, as of the release of the iOS 26 beta 2, Apple has already incorporated some user feedback into the design, dialing back the transparency in at least some places. And while it will continue to evolve, Apple users won't be able to escape it: Liquid Glass was designed to make all of Apple's OSes more cohesive. Here's a look at how the translucent aesthetic will look with the new macOS Tahoe 26 on your desktop. What are the new and notable features of iOS 26? iOS 26 has a laundry list of new features. Among the most worthwhile: Phone app redesign: You'll finally be able to scroll through contacts, recent calls and voicemail messages all on one screen. It also comes with a new feature called Hold Assist that'll notify you when an agent comes to the phone so you can avoid the elevator music and continue on with other tasks. Live Translation in Phone, FaceTime and Messages: iOS 26 is bringing the ability to have a conversation via phone call or text message with someone who speaks another language. Live Translation will translate your conversation in real time, which results in some stop-and-go interactions in the examples Apple shared during its presentation. Polls in group chats: Tired of sorting through what seems like hundreds of messages in your group chat? You and your friends will soon be able to create polls in group messages for deciding things like which brunch spot you're eating at or whose car you're taking on a road trip. Filtering unknown senders in Messages: If you haven't received spam texts about unpaid tolls or other citations, you're lucky. For those of us who have, those annoying messages will soon be filtered away in a separate folder. Visual Intelligence: Similar to a reverse Google image search, this new feature will allow you to search for anything that's on your iPhone screen. For instance, if you spot a pair of shoes someone is wearing in an Instagram photo, you can screenshot it and use Visual Intelligence to find those shoes (or similar ones) online. Photos tabs are back: For anyone who's still frustrated with the Photos changes made last year , you'll be happy to know that your tabs are coming back. Library and Collections will have their own separate spaces so you don't have to scroll to infinity to find what you're looking for. FaceTime \"Communication Safety\" feature: A newer addition to iOS 26 appears to be the FaceTime \"Communication Safety\" feature that pauses communications if and when nudity is detected. The feature appears to be a child safety feature that uses on-device detection, thus obviating any cloud-based privacy issues. New lock screen options : The iPhone lock screen gets more customizable in iOS 26, with a cooler clock, 3D wallpaper effects, more widgets and better focus mode options. Apple's Hold Assist will be nifty for those pesky services that put you on hold for 10 or more minutes. (Apple) New changes coming to iPadOS 26 Your iPad isn't getting left behind when it comes to big updates. Here's what's coming this fall. Multitasking and real windowing: When you download the newest update, you'll be able to have multiple apps running on your screen at the same time. Once you open an app, it'll appear on your screen as normal but you'll be able to resize and move it across your screen to make room for other apps. This feature is optional so you can turn it off if you don't like it. Visual update: Along with the other new OSes, iPadOS 26 is coming with the Liquid Glass aesthetic. This new look will appear on the lock and home screens, as well as the drop-down menus. New menu bar: When you swipe down on your screen, the new menu bar will appear with options like File, Edit, Windows and more. There's also a search option if you're looking for something specific. Check out our first impressions of iPadOS 26 . What about AirPods? AirPods are also getting updated with iOS 26. Here are some of the more notable functions. Enhanced audio recording: Apple calls this \"studio-quality\" audio recording, and with it, you'll notice more clarity while in noisy environments. Camera remote control: Using this, you can take a photo or start and stop video recording with just one press on your AirPods. When taking photos, you'll get a three-second countdown before your iPhone or iPad snaps the picture. Live translation feature: While not officially announced or confirmed, it appears that the long-rumored live translation for AirPods could be coming with iOS 26 . The evidence comes from a system asset spotted in the in iOS 26 beta showing a gesture that's triggered by pressing both earbud stems at the same time. The photo also shows words in several different languages. Which iPhones will be able to upgrade to iOS 26? A few iPhone models that run the current version of iOS — iPhone XR, XS and XS Max — won't be compatible with the latest upgrade. But any iPhones released in 2019 or later will be eligible for the iOS 26 update . iPhone SE (second generation or later) iPhone 11 iPhone 11 Pro iPhone 11 Pro Max iPhone 12 iPhone 12 mini iPhone 12 Pro iPhone 12 Pro Max iPhone 13 iPhone 13 mini iPhone 13 Pro iPhone 13 Pro Max iPhone 14 iPhone 14 Plus iPhone 14 Pro iPhone 14 Pro Max iPhone 15 iPhone 15 Plus iPhone 15 Pro iPhone 15 Pro Max iPhone 16 iPhone 16 Plus iPhone 16 Pro iPhone 16 Pro Max iPhone 16e Not listed here are the presumed new iPhone 17 models (or maybe iPhone 26?) that are all but certain to be announced and released in September. How to install iOS 26 beta The iOS 26 public beta is now available to download via the Apple Beta Software Program . If you're not already a member, you'll need to sign up to try out all the latest features. Just visit beta.apple.com and sign up with your phone number or email address. It's free. Once you're in, you can install it by going to Settings > General > Software Update and selecting iOS 26 public beta . A word of caution: Don't sign up with your main iPhone unless you're OK with any risks that occur with using an OS that isn't finalized. When will the final version of iOS 26 be released? iOS 26 will be released to the public this fall. It usually comes in September, within a week of the Apple iPhone event. Last year, it rolled out to iPhone users on September 16 — exactly one week after the iPhone 16 lineup was announced. If you're more interested in the Apple Intelligence features coming, here's everything Apple revealed for iOS, macOS and more during WWDC. Also, check out how iOS 26 screenshots could be an intriguing preview of Apple's delayed Siri rework . Update, August 18: Added details about a potential iOS 18.6 update. Update, August 15: Added to link to what to expect at the Apple iPhone event and details about what's available in the iOS 26 screenshots editor. Update, August 13: Added new AirPods detail spotted in the iOS 26 beta. Update, August 11: Noted that iOS 26 developer beta has hit beta 6. Update, August 8: Added new features coming with iPadOS 26 and AirPods. Update, August 6: Noted the release of iOS 26 beta 5 and the new bouncy feature on passcode screen and Control Center. Update, August 4: Noted that Apple is reportedly working on a ChatGPT rival. Update, August 1: Added quote from Tim Cook about iOS 26. Update, July 31: Noted that iOS 18.6 is now available. Update, July 24: Noted the iOS 26 public beta is now available. Update, July 3: Noted new FaceTime feature found in the developer beta. Update, June 30: Noted ongoing iOS 18 releases, and reports that Apple is considering additional external LLMs for Siri. Update, June 25: Noted changes added in iOS 26 beta 2. This article originally appeared on Engadget at https://www.engadget.com/mobile/ios-26-updates-everything-you-need-to-know-about-apples-big-software-changes-coming-to-iphone-and-ipad-135749771.html?src=rss", "ingested_utc": "2025-08-18T18:59:00Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:00Z", "source": "Engadget_All", "title": "NordVPN will discontinue Meshnet on December 1", "url": "https://www.engadget.com/cybersecurity/vpn/nordvpn-will-discontinue-meshnet-on-december-1-175538284.html?src=rss", "id_key": "744f730168aa1784cbbda21c045b0e906d22bf35dd7d5a4a1b6616bba7d31381", "summary": "NordVPN announced today in a blog post that its Meshnet feature will shut down on December 1. All aspects of Meshnet will stop working on that date, though nothing else about NordVPN will be affected. If you were using Meshnet to connect computers, route web traffic through a personal device or share files, you'll need to find another solution by December. As I mentioned in my NordVPN review , Meshnet was one of the most envelope-pushing features on any VPN, letting users link their devices through a NordLynx tunnel without needing to go through a third-party server. Once the tunnel was set up, you could access either device through the other one to share files or access services. With enough connected devices, you could check your work email, visit a friend's media server, play a remote game on another server and watch your home-based TV subscriptions — all from a single laptop anywhere on the planet. Unbelievably, it was even free to use. I'm sad to see Meshnet go, but as NordVPN's blog post makes clear, it never found its audience. As exciting as it was to people like me who spend all day squinting at the guts of VPNs, it didn't provide enough everyday value to catch on with the majority of NordVPN's customers. Hindsight shows us that Meshnet's benefits, like remote desktop and file sharing, were mainly business-oriented; selling those was always going to be an uphill battle in a market where VPNs are more commonly used for personal reasons . If you're one of the few people who was actually using Meshnet, you have a few months to arrange alternatives. Should you want to stay within the NordVPN ecosystem, you can replace its file sharing features with NordLocker , which gives you 3 GB of storage for free. Of course, Google Drive is also an option. For remote access, NordVPN recommends ZeroTier , a platform where you can connect up to 10 devices without paying. This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/nordvpn-will-discontinue-meshnet-on-december-1-175538284.html?src=rss", "ingested_utc": "2025-08-18T18:59:00Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:00Z", "source": "Engadget_All", "title": "China's inaugural 'Robot Olympics' delivers impressive feats and disastrous falls", "url": "https://www.engadget.com/ai/chinas-inaugural-robot-olympics-delivers-impressive-feats-and-disastrous-falls-221450458.html?src=rss", "id_key": "454f38b496b3e8e26b6f9cd7625cda0afe7fbd5827dbf1b164c76eb4086f03c2", "summary": "The first-ever World Humanoid Robot Games have come to a close with some new world records, but don't expect them to beat humans in a 100-meter dash any time soon. The three-day robotics event in Beijing, China that saw humanoid robots compete in everything from boxing to cleaning concluded this weekend. According to the World Humanoid Robot Games, more than 280 teams from 16 countries, including the US, Germany, Brazil and the host country, entered their robots into the event. A majority of the teams came from universities, but several teams came from established robotics companies like Unitree and Fournier Intelligence. Hundreds of robots competed in traditional sporting events like running, soccer and table tennis, along with events for more practical tasks, like cleaning or sorting medicine. Unitree snagged gold medals in four categories, including the 1,500-meter, 400-meter, 100-meter, and 4x100-meter dash events. According to Unitree, the fastest speed achieved by one of its robots during the event was 4.78 m/s, which is roughly 10 mph. In the 100-meter sprint, Unitree boasted a 33.71-second time, but that's nowhere near the world record holder Usain Bolt's time of 9.58 seconds , which was achieved in 2009. Instead, most teams took this event as an opportunity to showcase the abilities of their designs, while also stress-testing their robots in a competitive environment. We're still a long way from widespread adoption of these humanoid bots though, especially if they can't avoid running into each other . This article originally appeared on Engadget at https://www.engadget.com/ai/chinas-inaugural-robot-olympics-delivers-impressive-feats-and-disastrous-falls-221450458.html?src=rss", "ingested_utc": "2025-08-18T18:59:00Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:02Z", "source": "TheEconomist_Finance", "title": "In praise of complicated investing strategies", "url": "https://www.economist.com/finance-and-economics/2025/08/18/in-praise-of-complicated-investing-strategies", "id_key": "c59b674124ef7eef7c16d84ece6d3589ff724b3bd4b6f5d5a5f84461a9f65db5", "summary": "To understand markets, forget Occam’s razor", "ingested_utc": "2025-08-18T18:59:02Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:08Z", "source": "TheStreet_Top", "title": "Expect fiery outcomes from Fed’s Jackson Hole conference this week", "url": "https://www.thestreet.com/fed/expect-fiery-outcomes-from-feds-jackson-hole-conference-this-week", "id_key": "953867c236b5e0852789eeabf976d7d864a2b75c67f84337a6be6813c5543e3b", "summary": "Unlike previous years, 2025 Jackson Hole conference participants face multiple monetary and geopolitical challenges.", "ingested_utc": "2025-08-18T18:59:08Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:08Z", "source": "TheStreet_Top", "title": "90-year-old fast-food burger chain closed 200 restaurants", "url": "https://www.thestreet.com/restaurants/fast-food-burger-chain-opened-in-1934-closes-200-restaurants", "id_key": "f4ad5d7e9c2e2002adae43cb177b21a801273f98630b43b5a791b759fdd421da", "summary": "The long-lived national chain also dropped table service and adopted a Chick-fil-A-style business model.", "ingested_utc": "2025-08-18T18:59:08Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:15Z", "source": "FinancialPost_Business", "title": "Terra Balcanica Intersects Gold Mineralization Over 72 m and Starts Drill Program At Brezani Target in Bosnia", "url": "https://financialpost.com/globe-newswire/terra-balcanica-intersects-gold-mineralization-over-72-m-and-starts-drill-program-at-brezani-target-in-bosnia", "id_key": "d9f56aecd5f47bcc133ed2cdd82bbbab5786afa3a0a633ac0d67f321adf98d8f", "summary": "Vancouver, British Columbia, Aug. 18, 2025 (GLOBE NEWSWIRE) — Terra Balcanica Resources Corp. (“Terra” or the “Company”) (CSE:TERA; FRA: UB1) is pleased to announce an expansion of the surface gold skarn system at Brezani and the start of the Phase III drill program at its Viogor-Zanik project, Bosnia and Herzegovina. Highlights The Brezani drillhole BRE23001 […]", "ingested_utc": "2025-08-18T18:59:15Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:15Z", "source": "FinancialPost_Business", "title": "Goldman-Backed Firm Raises €2 Billion as Circular Economy Gains", "url": "https://financialpost.com/pmn/business-pmn/goldman-backed-firm-raises-e2-billion-as-circular-economy-gains", "id_key": "8a5e803235c428847448dc68b10627c38e05168698c814556fa7303989eb4b13", "summary": "Inside Goldman Sachs Asset Management, a bet made back in 2021 is starting to look increasingly prescient for a world ever-more reliant on recycling.", "ingested_utc": "2025-08-18T18:59:15Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:15Z", "source": "FinancialPost_Business", "title": "Air Canada Cancels More Flights After Cabin Crew Defies Ruling", "url": "https://financialpost.com/pmn/business-pmn/air-canada-cancels-more-flights-after-cabin-crew-defies-ruling", "id_key": "55758799afd8c93e8061c6a538fb4cf47ff8357ffc64fe9a14a82a7a9340ca98", "summary": "Air Canada’s flight attendants stayed on strike Monday even after the country’s labor board ordered them back to work, causing the airline to delay plans to restart flights.", "ingested_utc": "2025-08-18T18:59:15Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T18:59:31Z", "source": "HackerNews_Top", "title": "Robots.txt is a suicide note (2011)", "url": "https://wiki.archiveteam.org/index.php/Robots.txt", "id_key": "b100ad279f9dab125038a5876e685aa8c48f3f741c80576b4d008362298184c3", "summary": "Comments", "ingested_utc": "2025-08-18T18:59:31Z"}
