{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:04Z", "source": "BBC_Business", "title": "Keurig Dr Pepper buy coffee chain for £13bn", "url": "https://www.bbc.com/news/articles/cr4e7vp19p1o?at_medium=RSS&at_campaign=rss", "id_key": "6b67d313e49bd19b93862938339dca8672f35c375252a3cbf77c0402079bcd2d", "summary": "Two of the world's biggest coffee firms are to combine as the industry grapples with tariffs and high prices for beans.", "ingested_utc": "2025-08-25T16:49:04Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:06Z", "source": "Guardian_Business", "title": "Postal services in Europe suspend parcel shipments to US amid uncertainty over tariffs", "url": "https://www.theguardian.com/business/2025/aug/25/postal-services-in-europe-suspend-parcel-shipments-to-us-amid-uncertainty-over-tariffs", "id_key": "6c507db9e54427c6c43b5d2d0fdb4782716a3a95f6b304c842d3ac5742410925", "summary": "Donald Trump’s late announcement left operators with ‘extremely limited timeframe to get prepared’ Postal services across Europe have suspended most parcel shipments to the US, citing widespread uncertainty about the impact of new import tariffs announced by Donald Trump. France’s La Poste on Monday joined other operators, including Germany’s Deutsche Post, Spain’s Correos, Poste Italiane and the Belgian, Swedish and Danish postal services, which all halted a majority of US-bound shipments over the weekend. Continue reading...", "ingested_utc": "2025-08-25T16:49:06Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:06Z", "source": "Guardian_Business", "title": "Ørsted shares at all-time low after Trump halts work on US windfarm", "url": "https://www.theguardian.com/environment/2025/aug/25/rsted-shares-at-all-time-low-after-trump-halts-work-on-us-windfarm", "id_key": "54787b723281a09199d445d63b141d836be85619494530626e644d8d6e10a342", "summary": "Shares drop by 17% after stop-work order on $1.5bn project off Rhode Island, which was 80% complete Shares in Ørsted hit an all-time low on Monday after the Trump administration ordered Europe’s largest wind power company to stop work on a near complete windfarm. Ørsted’s shares plunged 17%, after it was forced to stop construction on its $1.5bn (£741m) Revolution Wind project off the coast of Rhode Island. Continue reading...", "ingested_utc": "2025-08-25T16:49:06Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:06Z", "source": "Guardian_World", "title": "Israel bombed Gaza hospital a second time, killing rescuers, say health officials", "url": "https://www.theguardian.com/world/2025/aug/25/journalists-among-people-killed-by-israeli-strike-on-gaza-hospital", "id_key": "459669b11f6bd3ddf899427b63a80c190a0469d6fd14604b8f57f60e9a7c7cef", "summary": "At least 20 people, including five journalists, died as they rushed to help those wounded in the first strike Israel bombed the main hospital in southern Gaza on Monday and then struck the same spot again as rescuers and journalists rushed to help the wounded, killing at least 20 people including five journalists, health officials said. The first strike hit the top floor of a building at the Nasser hospital, killing the Reuters journalist Hussam al-Masri and others. Journalists and rescuers then rushed to the scene to help the wounded, when a second bomb struck the same spot 15 minutes later. Continue reading...", "ingested_utc": "2025-08-25T16:49:06Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:07Z", "source": "Guardian_World", "title": "UK gender pay gap underestimated for two decades, report says", "url": "https://www.theguardian.com/world/2025/aug/25/uk-gender-pay-gap-underestimated-for-two-decades-report-says", "id_key": "bb77e5a5f091c779bc8031d1b95cc0d03d5f45e46f327bd2fe6066c3aeb4aa23", "summary": "Findings suggest since 2004 ONS failed to properly account for fact it received more data from larger employers The UK’s gender pay gap has been underestimated for more than 20 years, according to research that could raise fresh questions about the quality of data used to inform key pay decisions across the UK. The findings, released in the British Journal of Industrial Relations on Monday, suggest that, since 2004, the Office for National Statistics (ONS) had failed to properly account for the fact that it received more data from larger employers, when it reported its annual survey of hours and earnings (Ashe). Continue reading...", "ingested_utc": "2025-08-25T16:49:07Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:07Z", "source": "Guardian_World", "title": "Strictly Come Dancing star arrested on suspicion of rape, reports say", "url": "https://www.theguardian.com/uk-news/2025/aug/25/strictly-come-dancing-star-arrested-on-suspicion-of-met-police-say", "id_key": "23a11d54cf1476ffd9dcba181dddf1e5367ac414ec9140c09edd1a3b4e571489", "summary": "The man, in his 30s, was also detained over alleged offence of ‘non-consensual intimate image abuse’, says Met A Strictly Come Dancing star has been arrested on suspicion of rape, according to reports. The man in his 30s, who has not been named, was also detained over a separate alleged offence of “non-consensual intimate image abuse”, the Metropolitan police said. Continue reading...", "ingested_utc": "2025-08-25T16:49:07Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:07Z", "source": "Guardian_World", "title": "‘Some brass neck’: Rayner’s allies rebuke Cleverly over council tax criticisms", "url": "https://www.theguardian.com/politics/2025/aug/25/angela-rayner-allies-rebuke-james-cleverly-over-council-tax-accusations", "id_key": "d9514383b90c124e93dda4d9a8c61096227204ac5607a7fe9d3ef5416d04234a", "summary": "Labour source says questions around deputy PM’s new seaside flat are motivated by political opportunism Angela Rayner’s allies have hit back at James Cleverly, accusing the shadow housing secretary of having “some brass neck” for criticising the deputy prime minister over her council tax arrangements on a property she bought this year. Rayner acquired the seaside flat in Hove, East Sussex, for more than £700,000. The property is subject to the 100% council tax premium on second homes that was introduced in April, which she now pays in full. Continue reading...", "ingested_utc": "2025-08-25T16:49:07Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:27Z", "source": "CryptoSlate", "title": "The hidden signal in Bitcoin’s 439k daily transactions and falling big trades", "url": "https://cryptoslate.com/the-hidden-signal-in-bitcoins-439k-daily-transactions-and-falling-big-trades/", "id_key": "c8dd22a87e7bce1dee92ebe5088ab60d037bb00788afa3dda71697d903dce9bb", "summary": "Bitcoin’s on-chain data shows a rise in daily transactions, a small decline in active wallets, and a drop in the total tokens moved on-chain, a pattern consistent with more frequent, smaller transfers concentrated among a narrower set of participants. Data from CryptoQuant showed that, in 2025, mean daily transactions were 394,382, and the last 30 […] The post The hidden signal in Bitcoin’s 439k daily transactions and falling big trades appeared first on CryptoSlate .", "ingested_utc": "2025-08-25T16:49:27Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:32Z", "source": "CryptoNews", "title": "Gemini Launches Visa-like $XRP Credit Card with Crypto Rewards", "url": "https://cryptonews.com/news/gemini-launches-visa-like-xrp-credit-card-with-crypto-rewards/", "id_key": "80ac147c15c61b24aa727cf020f15743e967391fc054d3049ec77e0d9f25edca", "summary": "Gemini’s new move effectively ties everyday spending to XRP while elevating Ripple’s RLUSD into the trading core for U.S. users The post Gemini Launches Visa-like $XRP Credit Card with Crypto Rewards appeared first on Cryptonews .", "ingested_utc": "2025-08-25T16:49:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:32Z", "source": "CryptoNews", "title": "Dogecoin, XRP, SUI ETFs Incoming? October Could Spark Next Crypto ETF Boom", "url": "https://cryptonews.com/news/dogecoin-xrp-sui-etfs-incoming-october-could-spark-next-crypto-etf-boom/", "id_key": "80e17fdcf1e540ec674e50e969cea3203860c5dfe900deedc6776329c1c3912e", "summary": "The U.S. exchange-traded fund (ETF) market may soon see an expansion well beyond Bitcoin and Ethereum. In recent filings, 21Shares submitted proposals for an active crypto ETF, as well as 2x leveraged products for Dogecoin and Sui. The post Dogecoin, XRP, SUI ETFs Incoming? October Could Spark Next Crypto ETF Boom appeared first on Cryptonews .", "ingested_utc": "2025-08-25T16:49:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:32Z", "source": "CryptoNews", "title": "$HYPE Nears All-Time High on Rising Volume and Deep Liquidity", "url": "https://cryptonews.com/news/hype-nears-all-time-high-on-rising-volume-and-deep-liquidity/", "id_key": "d7acd6c591f0d4fd4c7e41c58b85b6d3878682b6c330224f2a14acbc3edc7cd9", "summary": "$HYPE is climbing toward its all-time high with a 4.5% jump to $45.62, backed by strong trading volume and deep liquidity. The token is now testing a key resistance level that could determine its next major move. A wave of strong protocol developments and economic upgrades is creating new utility and demand for the token. […] The post $HYPE Nears All-Time High on Rising Volume and Deep Liquidity appeared first on Cryptonews .", "ingested_utc": "2025-08-25T16:49:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:49:32Z", "source": "CryptoNews", "title": "Largest Since March: Crypto Funds Hit by $1.43B Weekly Outflows, CoinShares Says", "url": "https://cryptonews.com/news/crypto-funds-face-1-43b-outflows-largest-since-march-coinshares/", "id_key": "527f7d9cdc980faaa43b1e1d3de9fd82a7cab9ea203ce7272f86909c62f7a286", "summary": "CoinShares has reported $1.43B in weekly outflows across crypto funds, the steepest since March. Bitcoin has borne $1B in losses, while Ethereum has sustained $2.5B month-to-date inflows, reflecting divergent investor sentiment during Fed policy uncertainty. The post Largest Since March: Crypto Funds Hit by $1.43B Weekly Outflows, CoinShares Says appeared first on Cryptonews .", "ingested_utc": "2025-08-25T16:49:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:51:35Z", "source": "NYTimes_Business", "title": "Inflation Sweetener? Denmark Plans Tax Cut on Chocolate and Coffee.", "url": "https://www.nytimes.com/2025/08/25/business/denmark-taxes-coffee-chocolate.html", "id_key": "ca13566be1876963defe9b025d11e3041a93c45996b0f3198a674fb75928f03b", "summary": "The Scandinavian country has proposed scrapping its tax on chocolate, cake and other sweets, as well as coffee, to help consumers cope with high food prices.", "ingested_utc": "2025-08-25T16:51:35Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:51:47Z", "source": "FT_Home", "title": "Israel says it will scale back presence in Lebanon if Hizbollah is disarmed", "url": "https://www.ft.com/content/917c4e08-ed84-4cfb-adde-bdb38cf57b1e", "id_key": "c82a6687d42be1fa7806691f747cd52822064a772db67ea22c5e1cc16451714f", "summary": "Israeli forces to make ‘phased reduction’ in southern regions if Lebanese army removes weapons from Shia militant group", "ingested_utc": "2025-08-25T16:51:47Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:05Z", "source": "TheVerge_All", "title": "Our favorite smart lock is on sale for the first time today", "url": "https://www.theverge.com/smart-home/765121/kwikset-halo-select-smart-lock-sonos-era-300-deal-sale", "id_key": "422a09a9e87e99172d580dcb6c722d32bd9f16ef71e47a86c8b693b367583fe8", "summary": "Setting up a smart home security system is important, even if you never want to think about having to use it. Thankfully, Kwikset’s Halo Select — the best smart lock we’ve ever tested — is currently down to $259 ($20 off) at Amazon, Lowe’s, and The Home Depot, marking the first time the lock has […]", "ingested_utc": "2025-08-25T16:52:05Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:05Z", "source": "TheVerge_All", "title": "Elon Musk&#8217;s xAI is suing OpenAI and Apple", "url": "https://www.theverge.com/news/765171/elon-musk-apple-openai-antitrust-lawsuit", "id_key": "ae405f56eaa172daefee265a743d0ca3b6cd31df76e66db67330a785a002bc72", "summary": "Elon Musk is suing Apple and OpenAI over claims that their deal to build ChatGPT into the iPhone is stifling competition in the AI industry. In a lawsuit filed on Monday, the Musk-owned X Corp. and xAI also accuse Apple’s Apple Store of “deprioritizing” rival chatbots and “super” apps, including Grok and X. Musk’s companies […]", "ingested_utc": "2025-08-25T16:52:05Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:05Z", "source": "TheVerge_All", "title": "This new delivery robot will bring the entire grocery store to you", "url": "https://www.theverge.com/news/765167/robomart-autonomous-food-delivery-locker-rm5", "id_key": "b47754563c1d9a792659b6596ff4c2789883df1201bcf0999ea8f3b5567ceb0f", "summary": "A new company aims to take the idea of sidewalk delivery robots and supersize it. Los Angeles-based Robomart unveiled its new delivery robot Monday, with the goal of making “on‑demand delivery work economically.” The level-four autonomous vehicle is the size of a shuttle bus and can carry up to 500 lbs of payload. With no […]", "ingested_utc": "2025-08-25T16:52:05Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:05Z", "source": "TheVerge_All", "title": "Trump told a major offshore wind project to stop construction just before it reached the finish line", "url": "https://www.theverge.com/news/765175/trump-offshore-wind-farm-revolution-orsted-halt", "id_key": "49a3489290a715f006c367ae38fe53e160d1e96e5b38491dd5c2aac34f1f064f", "summary": "The Revolution Wind farm was already 80 percent complete before the US Bureau of Ocean Energy Management sent it a letter Friday to “halt all ongoing activities” to address purported national security concerns and “interference” with other potential uses for the area. The move comes as data centers, domestic manufacturing, and electric vehicles are raising […]", "ingested_utc": "2025-08-25T16:52:05Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:05Z", "source": "TechCrunch_All", "title": "How chatbot design choices are fueling AI delusions", "url": "https://techcrunch.com/2025/08/25/how-chatbot-design-choices-are-fueling-ai-delusions-meta-chatbot-rogue/", "id_key": "10132b0f5a27f3ec746efe781a2a370733f30f8d4f5f3a8150f5f730d65fa457", "summary": "Experts say that many of the AI industry’s design decisions are likely to fuel episodes of AI psychosis. Many raised concerns about several tendencies that are unrelated to underlying capability, including models’ habit of praising and affirming the user’s question (often called sycophancy), issue constant follow-up questions, and use of “I,” “me” and “you” pronouns.", "ingested_utc": "2025-08-25T16:52:05Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:09Z", "source": "Engadget_All", "title": "The best deals on MacBooks, AirPods, iPads and other Apple gear you can get right now", "url": "https://www.engadget.com/deals/best-apple-deals-150020110.html?src=rss", "id_key": "e053cc5286c35a0bb42600a05931d38dd80e39d1a7996c07bd1097bf97ced7b2", "summary": "It goes without saying that Apple devices tend to be fairly high-quality — the company's gear currently occupies the top spots in several of our buying guides, from laptops and tablets to smartphones and smartwatches . As a result, that gear usually doesn't come cheap. But that doesn’t mean you always have to pay full price. To help you save a bit of cash, we're keeping a running list of the best Apple deals you can shop right now on AirPods, MacBooks, iPads and more. Just note that you’ll almost always find the best Apple deals from third-party retailers like Amazon , Best Buy , Walmart , Target and the like, not from Apple's own online store. Unless you shop refurbished , you’ll usually pay top dollar buying direct (though for some items like iPhones, that might be the best route to take). Best AirPods deals Apple AirPods Pro 2 for $169 ($80 off) : The AirPods Pro 2 are Apple’s best overall set of wireless earbuds (for now), as they offer the full set of Apple-focused features, strong ANC, onboard volume controls, a comfy in-ear design and a warm sound profile that most should find agreeable. They can even work as a hearing aid , though their six-hour battery life still isn’t the best, and you should only get them if you’re all-in on Apple hardware. But if that’s the case, we consider them the best wireless earbuds for iPhone owners. This deal is $20 off the all-time low we saw last month, but it's still a ways below the set's usual going rate. Also at Walmart and Best Buy . Exercise caution, though: If you're not in a rush, we may see a refresh for this device within the next couple of months. Best iPad deals Apple iPad Air 13-inch (M3) for $649 ($150 off) : Engadget's Nate Ingraham gave the 13-inch iPad Air a score of 89 when it was released in March. It has a bigger and slightly brighter display than its 11-inch counterpart; otherwise, the two slates are the same. If you plan to keep your iPad hooked up to a keyboard, the extra screen space is lovely for taking in movies and multitasking for work. This is another new low, and it applies to various color options and storage configs. Apple iPad mini (A17 Pro) for $399 ($100 off) : The iPad mini is exactly what it sounds like : the smaller iPad. This latest iteration has an improved A17 Pro chip — which is enough to support Apple Intelligence — along with 128GB of storage in the base model and Apple Pencil Pro support. As before, you’d buy it if you value the smaller 8.3-inch display and want a tablet you can more easily hold with one hand. This deal is $20 more than the lowest price we've tracked. Also at Target and Best Buy . Apple iPad Pro 11-inch (M4) for $895 ($105 off) : The iPad Pro is much more tablet than most people need, but it’s the ultimate iPad for those who can stomach its price tag. It’s wonderfully thin, its OLED display is one of the best we’ve seen on a consumer device and its M4 chip can handle virtually anything you’d ever do on an iPad. It’s also the only Apple tablet with Face ID, plus it has a better speaker setup than the iPad Air. We gave it a score of 84 in our review, with the only real drawback being its price. Also at BJ's for $45 less, if you have a membership there. Apple iPad Pro 13-inch (M4) for $1,099 ($200 off) : The 13-inch iPad Pro has all the same specs as the 11-inch model, only it's bigger and more expensive. Again, it may be worth the extra cost if you plan to multitask regularly or just want more display area for enjoying movies. Also at Target and Best Buy . Best Mac deals Apple MacBook Air (15-inch, M4) for $999 ($200 off) : The 15-inch MacBook Air is nearly identical to the smaller version but features more robust speakers and a more spacious trackpad alongside its roomier display. $999 is the lowest price we've tracked. Apple MacBook Pro (14-inch, M4 Pro) for $1,699 ($300 off) : The MacBook Pro goes beyond most people’s needs, but it remains a powerhouse for coders, media editors or anyone else with especially demanding workloads. We gave it a score of 92 last November. Just keep in mind that it’s heavier than the MacBook Air and that it still lacks a standard USB-A port. Also at Best Buy . Apple Mac mini (M4) for $499 ($100 off) : The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard (finally), two front-facing USB-C ports (finally!), an extra Thunderbolt 4 port and the ability to drive three external displays. It lacks USB-A ports, however. We gave the M4 Pro model a review score of 90 . This deal is for the entry-level version with a base M4 chip, 16GB of RAM and a 256GB SSD — we’ve seen it fall as low as $469 in the past, but this is still a decent savings compared to buying direct from Apple. Also at Best Buy . Best Apple Watch deals Apple Watch SE (GPS, 40mm) for $169 ($80 off) : As with the more premium models, we wouldn’t be surprised to see an update to Apple’s budget smartwatch sometime soon (and we have a few suggestions on the matter). But thanks to discounts like this, the Apple Watch SE has turned out to be the most affordable way to get an iPhone companion for your wrist. Despite a lackluster screen and limited extra features, it handles the basics well. Also at Target . Best Apple accessories deals Apple Pencil Pro for $99 ($30 off) : The highest-end option in Apple’s confusing stylus lineup , the Pencil Pro supports pressure sensitivity, wireless charging, tilt detection, haptic feedback and support for Apple’s double tap and squeeze gestures , among other perks. It’s a lovely tool for more intricate sketching and note-taking, but the catch is that it’s only compatible with the M4 iPad Pro, M2 and M3 iPad Air and most recent iPad mini. We've seen this deal fairly often over the course of the year, but it's a decent discount compared to buying from Apple directly. Also at Walmart , Best Buy and Target . Apple Pencil (USB-C) for $69 ($10 off) : This more affordable Apple Pencil doesn’t support pressure sensitivity, but it still makes for a useful stylus for the basics. If you’re a casual note-taker and can live without wireless charging, you’ll save a few bucks by picking this one up. Also at Walmart , Best Buy and Target . Read more Apple coverage : The best AirPods The best Apple Watches The best MacBooks The best iPhones The best iPads Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/best-apple-deals-150020110.html?src=rss", "ingested_utc": "2025-08-25T16:52:09Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:18Z", "source": "TheStreet_Top", "title": "Analysts rework price target on Broadcom ahead of earnings", "url": "https://www.thestreet.com/technology/analysts-rework-price-target-on-broadcom-ahead-of-earnings", "id_key": "5c5a4a81ddf5adddacaadfa9b12d2050f74382fed0056aee404819d45bd34369", "summary": "This is what could happen next to Broadcom shares.", "ingested_utc": "2025-08-25T16:52:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:18Z", "source": "TheStreet_Top", "title": "Kate Spade Outlet is selling a 'functional' $179 bifold wallet in 8 colors for as low as $38", "url": "https://www.thestreet.com/deals/lena-small-bifold-wallet-kate-spade-outlet-sale", "id_key": "cc8a70efdd4df9da7d15c016ddc45b0fffcd12b634200ea3487846bef14ac7ec", "summary": "\"It's the perfect size for what I need it for, and the color options are unbelievable!\"", "ingested_utc": "2025-08-25T16:52:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:18Z", "source": "TheStreet_Top", "title": "Bank of America sounds the alarm on inflation ahead of key report", "url": "https://www.thestreet.com/economy/bank-of-america-resets-inflation-forecast-before-crucial-pce-report-this-week", "id_key": "e841a585629cb651afa65ea7f00e815643a16be3605ddeeabcb7adfac9d0be41", "summary": "The Wall Street firm updated its inflation outlook ahead of the latest data.", "ingested_utc": "2025-08-25T16:52:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:18Z", "source": "AlJazeera_All", "title": "Intel says US govt stake could hurt sales, White House hints at more deals", "url": "https://www.aljazeera.com/economy/2025/8/25/intel-says-us-govt-stake-could-hurt-sales-white-house-hints-at-more-deals?traffic_source=rss", "id_key": "5c9176308fa75a0f0421916df9080743e7f98a6d8afad45064329d22119ea85f", "summary": "White House economic adviser Kevin Hassett says the US could take stakes in other companies in the sector.", "ingested_utc": "2025-08-25T16:52:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:26Z", "source": "FinancialPost_Business", "title": "The Victorica Group Returns to eXp Realty With 100+ Agent Network", "url": "https://financialpost.com/globe-newswire/the-victorica-group-returns-to-exp-realty-with-100-agent-network", "id_key": "43ea2d8b30348f37b26ef99250edb5aa5335ac9b6c23ab9b7e0b2d8b140998a9", "summary": "After weighing industry-wide offers, the Victorica Group returns to eXp for its culture and long-term vision. BELLINGHAM, Wash., Aug. 25, 2025 (GLOBE NEWSWIRE) — eXp Realty®, “the most agent-centric™ real estate brokerage on the planet”™ and the core subsidiary of eXp World Holdings, Inc. (Nasdaq: EXPI), today announced the return of the Victorica Group, a […]", "ingested_utc": "2025-08-25T16:52:26Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:26Z", "source": "FinancialPost_Business", "title": "Inter-Rock Announces Normal Course Issuer Bid for Common Shares", "url": "https://financialpost.com/globe-newswire/inter-rock-announces-normal-course-issuer-bid-for-common-shares-3", "id_key": "fdff899ac4d0f397a505e191de177d8d25513177fb11e2a2b71ca661e29b59ef", "summary": "TORONTO, Aug. 25, 2025 (GLOBE NEWSWIRE) — Inter-Rock Minerals Inc. (TSX-V: IRO) (“Inter-Rock” or the “Company”) today announced that it has filed a Notice of Intention and received acceptance from the TSX Venture Exchange (the “TSXV”) to commence a normal course issuer bid (the “NCIB”) to purchase for cancellation from time to time up to […]", "ingested_utc": "2025-08-25T16:52:26Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:26Z", "source": "FinancialPost_Business", "title": "Cineplex shareholder calls for share buyback, sale of non-core assets like Scene Plus", "url": "https://financialpost.com/pmn/cineplex-shareholder-calls-for-share-buyback-sale-of-non-core-assets-like-scene-plus", "id_key": "b9799a1398bd2a9f122f026292d2bd2e6ff2fa2e62985d7324d470b044eee580", "summary": "TORONTO — One of Cineplex Inc.’s shareholders is calling on the theatre operator to embark on a major share buyback program and sell what it considers to be non-core assets like its loyalty program to deliver more value to investors. Florida-based investment firm Windward Management LP said in a letter released Monday to the Cineplex […]", "ingested_utc": "2025-08-25T16:52:26Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:26Z", "source": "FinancialPost_Business", "title": "Democrats demand Trump resume a major offshore wind project near Rhode Island", "url": "https://financialpost.com/pmn/democrats-ask-trump-to-resume-a-major-offshore-wind-project-near-rhode-island", "id_key": "35b8b9b9fea7a72a30564d60cea5cd337f3d94a555fd49189d476b29c70ecb3a", "summary": "A nearly complete wind farm off the coast of Rhode Island and Connecticut faces an uncertain future as the states’ Democratic governors, members of Congress and union workers are calling Monday for the Trump administration to let construction resume. The administration halted construction on the Revolution Wind project last week, saying the federal government needs […]", "ingested_utc": "2025-08-25T16:52:26Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:33Z", "source": "Nikkei_Asia_Top", "title": "Evergrande's delisting marks new chapter in China's property slump", "url": "https://asia.nikkei.com/business/markets/china-debt-crunch/evergrande-s-delisting-marks-new-chapter-in-china-s-property-slump", "id_key": "8fc21b7da161bd3481eda3b4e5f6f1116d304314fdac0f091dea4802b40ebafd", "summary": "", "ingested_utc": "2025-08-25T16:52:33Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T16:52:41Z", "source": "HackerNews_Top", "title": "Launch HN: April (YC S25) – Voice AI to manage your email and calendar", "url": "https://news.ycombinator.com/item?id=45015230", "id_key": "afb4c49d627945815d3b3f73ab9f5c2d706e76e3342a3a37b74e93e42c0a7588", "summary": "Comments", "ingested_utc": "2025-08-25T16:52:41Z"}
