{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:28Z", "source": "BBC_World", "title": "Peruvian woman arrested in Bali for smuggling drugs in sex toy", "url": "https://www.bbc.com/news/articles/cn92eywlwjlo?at_medium=RSS&at_campaign=rss", "id_key": "c53358fe92ac0fd351c193970c93e06e46d869aa747c4a08ac5efbece37e4934", "summary": "The 42-year-old allegedly also concealed drugs in her underwear, police said.", "ingested_utc": "2025-08-19T15:38:28Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:30Z", "source": "Guardian_Business", "title": "US pursuing stake in struggling chipmaker Intel, commerce secretary says", "url": "https://www.theguardian.com/us-news/2025/aug/19/intel-stake-trump-chips-science-act", "id_key": "4c3c82a4bcb020e36545f721b97d7acca1b0fab3f7d40626abacf2259b352650", "summary": "Trump administration looking to convert funding from Chips Act into equity in the semiconductor manufacturer The US government is pursuing a stake in Intel , the US commerce secretary said on Tuesday, confirming reports of discussions between officials and the company that have circulated for the better part of a week. The Trump administration wants to convert funding from the Chips and Science Act, which funds research and manufacturing of semiconductor chips in the US, into equity in the struggling tech company, according to Howard Lutnick. Continue reading...", "ingested_utc": "2025-08-19T15:38:30Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Conservative leader wins Canada byelection, regaining parliament seat", "url": "https://www.theguardian.com/world/2025/aug/19/pierre-poilievre-wins-canada-parliament", "id_key": "60ec19b5b932543b5bbd87c4f6f60d8b95b80098b18e222577f3820ea0f9478a", "summary": "Pierre Poilievre returns to House of Commons after shock April loss and narrower margin in Tory stronghold Canada’s Conservative leader, Pierre Poilievre, has won a closely watched byelection in the province of Alberta, giving him a chance to return to parliament after suffering a shock defeat in April’s federal election. Poilievre finished with 80.4% of the vote after Monday’s election in the riding of Battle River-Crowfoot, in the deeply Conservative western province. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Flight attendant union leaders ‘ready to go to jail’ as Air Canada strike outlawed", "url": "https://www.theguardian.com/world/2025/aug/18/air-canada-flight-attendants-strike-illegal", "id_key": "ead27a6437e94c7fc5f6c4532c0938e5e4e95f015fc533bedc750ff971367224", "summary": "Arbitrator orders 10,000 striking staff back to work after government intervenes – unconstitutionally, union says Union leaders representing 10,000 striking flight attendants have said they would be willing to go to jail rather than comply with an order to return to work, as Canada ’s federal government seeks to end a bitter contract dispute that has halted hundreds of summer flights and stranded travellers around the world. Speaking to reporters on Monday, the national president of the Canadian Union of Public Employees said members would remain on the picket lines as part of a work stoppage that has halted Air Canada’s national and international operations during its busiest season. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Four-day work week? Six weeks of holidays? Australians have a choice about how to bank productivity gains", "url": "https://www.theguardian.com/australia-news/2025/aug/20/four-day-work-week-six-weeks-holidays-vacation-australia-boost-improve-productivity", "id_key": "c1949d3513b111f12ecc5a0b8d8436b9b93d19742bc868a727b119d061ace9e4", "summary": "Business groups call it a ‘populist, anti-productivity thought bubble’, but a four-day week holds obvious appeal Get our breaking news email , free app or daily news podcast One of the ideas that has captured many peoples’ attention amid the flurry of proposals ahead of the economic roundtable is the Australian Council of Trade Unions’ vision of a four-day working week. The peak union body argued that working less could actually be productivity enhancing, although the studies behind those claims aren’t too rigorous. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Legal stoush between NSW and commonwealth halts crucial water flows into Murray-Darling", "url": "https://www.theguardian.com/australia-news/2025/aug/20/legal-stoush-between-nsw-and-commonwealth-halts-crucial-water-flows-into-murray-darling", "id_key": "f95c76ebd3cd3ff34a1572d2b7ed0d1c0bb370fe0432b2e63117f6cce48962b6", "summary": "One scientist warned long suspension poses potential risks to some wetland areas and native species of fish and birds Environmental flows in the Murray-Darling necessary to keep wetlands and fish healthy have come to an abrupt halt due to a legal stoush between the commonwealth and the New South Wales government. The commonwealth environmental water holder, Simon Banks, announced on Monday that he would no longer be releasing water into the river system because “as a model licence holder” he was no longer confident he is complying with NSW law. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "More than two-thirds of NSW public land suitable for housing sold to private developers", "url": "https://www.theguardian.com/australia-news/2025/aug/20/more-than-two-thirds-of-nsw-public-land-suitable-for-housing-sold-to-private-developers", "id_key": "612a9a7145c7aca5db1a1254ca9b36a4685e6ad17d1293dbdd2c6f8bf20a3505", "summary": "Exclusive: Despite Labor policy to prioritise government land for public housing, Homes NSW has bought just three of 55 sites and expressed interest in further seven Get our breaking news email , free app or daily news podcast The New South Wales government has sold more than two-thirds of publicly owned sites identified as surplus and suitable for housing to private developers as a result of its much-vaunted statewide property audit . Many sites are being sold without requirements for social or affordable housing. The dive site for WestConnex at Camperdown will not have any social or affordable housing, although the project will earmark 230 units for essential worker homes out of a likely 600 units, because of its proximity to the Royal Prince Alfred hospital. A site at 164 Talavera Road, Marsfield, also owned by Roads and Maritime, was sold for $4.4m to a developer for high-density development. The agent on the sale, Ray White’s Peter Vines, said there was no requirement for social or affordable housing. The buyer intends to build student accommodation, he said. A major site at 870 Windsor Road, Rouse Hill, not far from the new metro station, is at the tender stage. The CBRE agent Ben Wicks said there were no firm requirements from the government about levels of social and affordable housing. Bidders had been invited to put in multiple proposals that included social and affordable housing as well as build-to-rent projects, he said. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Perth’s water supply at ‘high risk’ from Alcoa bauxite mining, expert study finds", "url": "https://www.theguardian.com/australia-news/2025/aug/20/perth-water-supply-risk-alcoa-bauxite-mining", "id_key": "4c636e9e9d417e66ec115464027e6d4c01563620496085a5101676a43371f84e", "summary": "Exclusive: GHD identified 22 pathways for Alcoa’s mining to contaminate dams inland of Perth Get our breaking news email , free app or daily news podcast Alcoa’s plan to vastly expand its strip mining of forest near Perth’s dams poses a high risk to the water supply for the city’s 2.3 million people, according to global engineering consultancy GHD. The US aluminium producer commissioned the detailed analysis as part of its bid for approval to mine an additional 67 square kilometres of jarrah forest for bauxite – the source material for aluminium. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Trump rules out sending US ground troops to Ukraine and warns Putin of ‘rough situation’ if he does not move towards peace – live", "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news", "id_key": "d1d411ef80a109c3dcca6fc656a567eb0806c3f1660a788886c866822acc4c3f", "summary": "US president says it’s possible Russian leader does not want to make deal Volodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February , which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough. In his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports. A meeting between Zelenskyy and Putin ... could it finally happen? The need for security guarantees agreed – but details unclear Trump believes he is very good at solving conflicts A potential boost for the US arms industry Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Putin must tread carefully amid hyped up expectations of breakthrough", "url": "https://www.theguardian.com/world/2025/aug/19/white-house-meeting-european-leaders-russia-putin-trump-analysis", "id_key": "ef7d4a837a81bcc4de28828fa7757a0f182f84d2ed85aeb2dd8cb6f115dcb568", "summary": "Goal of European leaders at White House meeting was to try to push the Russian leader into a corner Ukraine war – latest updates The mood in the White House on Monday was strikingly upbeat. Nato’s ever-cheerful secretary general, Mark Rutte, set the tone as he addressed Donald Trump, Volodymyr Zelenskyy and the gathered European leaders. “Let’s make the best out of today,” he said with a smile, before repeatedly thanking the US president for his attention to the war in Ukraine. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Met chief rejects calls to scrap live facial recognition at Notting Hill carnival", "url": "https://www.theguardian.com/culture/2025/aug/19/met-chief-rejects-calls-scrap-live-facial-recognition-notting-hill-carnival", "id_key": "99f097ab24b15aa3e14b631dae3380a5a8d49c7e45648ff962615483883b8b71", "summary": "Mark Rowley says technology will be ‘non-discriminatory’ and ‘does not perform in a way which exhibits bias’ The Metropolitan police commissioner has hit back at demands to drop the use of live facial recognition cameras at this weekend’s Notting Hill carnival over concerns of racial bias and an impending legal challenge. Mark Rowley wrote in a letter that the instant face-matching technology would be used at Europe’s biggest street carnival “in a non-discriminatory way” using an algorithm that “does not perform in a way which exhibits bias”. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Epping council wins high court bid to stop hotel housing asylum seekers", "url": "https://www.theguardian.com/uk-news/2025/aug/19/high-court-judge-orders-closure-of-essex-asylum-hotel-after-far-right-protests", "id_key": "e35f80a295bf4f0cdff36cf1df0870110db39a20269bf00cd45d5cc3d72f350e", "summary": "Epping district council had cited disruption and safety concerns, as well as alleged breach of planning law A hotel housing asylum seekers that has attracted repeated violent far-right demonstrations has been ordered closed down by a high court judge. Mr Justice Eyre granted an urgent request for an interim injunction against the owners of the Bell hotel in Epping, Essex, after hearing the local council’s complaints that they were breaching planning law by changing the site’s use. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Ed Davey calls for review of terrorism legislation after Palestine Action arrests – as it happened", "url": "https://www.theguardian.com/politics/live/2025/aug/19/environment-infrastructure-projects-labour-conservatives-keir-starmer-kemi-badenoch-uk-politics-live-news", "id_key": "fa026ee05fd14d54cc0b83d5178e4cbdc4428b9d60257bfdb91c1f7931473efd", "summary": "The Lib Dem leader is seeking a review of the laws to prevent the ‘en masse’ arrests Parents in England are skipping meals and turning to buy-now-pay-later services such as Klarna in order to afford school uniforms before the autumn term, according to a survey. Almost half (47%) of the 2,000 parents who took part in the poll said they were worried about uniform costs, which can run into hundreds of pounds due to expensive branded items, while more than a quarter (29%) said they had forgone food or heating to pay for uniforms. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "DC residents question troops’ focus on low-crime areas amid Trump takeover", "url": "https://www.theguardian.com/us-news/2025/aug/19/trump-dc-takeover-low-crime", "id_key": "a7a52c22ba36f81d87efee89f4215b2b4de0d9edf3655882afec76cdc3b6371e", "summary": "Many federal agents have been seen standing around in tourist areas, with few spotted addressing violent crime US politics live – latest updates As Donald Trump’s federal takeover of Washington DC’s police entered its second week, and six states vowed to send hundreds of additional national guard troops to assist the administration, residents questioned why federal agents seem to be largely patrolling high-profile but low-crime parts of the nation’s capital. The Washington Post has tracked where federal forces are patrolling the city, finding that few interactions have been witnessed in the parts of the city with the highest rates of crime. The White House refuted that claim on Tuesday, saying that “nearly half of non-immigration related arrests have happened in the most crime-hit areas in DC”, but before Tuesday, the White House had been releasing data showing many of their arrests were of undocumented immigrants, and few federal agents have been spotted addressing or responding to violent crime. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Jeffries: Noem will be ‘one of the first hauled up to Congress’ if Democrats win midterms", "url": "https://www.theguardian.com/us-news/2025/aug/19/hakeem-jeffries-kristi-noem-democrats-midterms", "id_key": "fca73f90d3a2b114079089faa6d94b3e82f28d361e7b6f7b5db0c2d0ac3794db", "summary": "US House minority leader outlines his concerns on the Bulwark Podcast about homeland security secretary The US House minority leader, Hakeem Jeffries , is making the homeland security secretary, Kristi Noem, and her aggressive immigration enforcement tactics squarely in Democrats’ crosshairs for congressional investigation if they flip the House in the midterms. Speaking on the Bulwark Podcast with Tim Miller recently, Jeffries said Noem would be “one of the first people hauled up to Congress shortly after the gavels change hands” to answer for what he called the Department of Homeland Security’s troubling conduct. Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:31Z", "source": "Guardian_World", "title": "Father of CDC shooter says son believed Covid vaccine had sickened him", "url": "https://www.theguardian.com/us-news/2025/aug/19/father-cdc-shooter-covid-vaccine", "id_key": "c49f22d94ba58dbdcd5306d05ae7c49c43a3e89c4998d400d8483a5a85344946", "summary": "Ken White said his son Patrick, who killed a police officer at CDC HQ in Atlanta, had untreated mental illness The father of the man who opened fire outside the Centers for Disease Control and Prevention (CDC) headquarters in Atlanta earlier in August has said that his son was grappling with untreated mental health issues when misinformation convinced him that the Covid-19 vaccine was lethally sickening him. “I know my son wanted to make this about ‘the jab’, and that was his latest cause, but this is more about mental health than anything,” Ken White said in a new interview with Atlanta News First . Continue reading...", "ingested_utc": "2025-08-19T15:38:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:49Z", "source": "BitcoinMagazine", "title": "KindlyMD Buys 5,744 Bitcoin For $679 Million To Expand Nakamoto Bitcoin Treasury", "url": "https://bitcoinmagazine.com/news/kindlymd-buys-5744-bitcoin-for-679-million-to-expand-nakamoto-bitcoin-treasury", "id_key": "4a25981cb2ade24b61b1503f39ccf19d57a82de9ec7489b668428b5f8f1c0b75", "summary": "Bitcoin Magazine KindlyMD Buys 5,744 Bitcoin For $679 Million To Expand Nakamoto Bitcoin Treasury KindlyMD purchased 5,743.91 BTC at $118,204.88 per Bitcoin for a total of $679 million, bringing its total holdings to 5,764.91 BTC, marking its first major acquisition since merging with Nakamoto Holdings. This post KindlyMD Buys 5,744 Bitcoin For $679 Million To Expand Nakamoto Bitcoin Treasury first appeared on Bitcoin Magazine and is written by Vivek Sen .", "ingested_utc": "2025-08-19T15:38:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:49Z", "source": "BitcoinMagazine", "title": "The Secrets Behind Matt Odell’s Bitcoin Empire", "url": "https://bitcoinmagazine.com/business/secrets-matt-odells-bitcoin-empire", "id_key": "95d212fc92ca1d72d3fe72f0e4771e10da61c97b54c23953c04a9e526ca59398", "summary": "Bitcoin Magazine The Secrets Behind Matt Odell’s Bitcoin Empire Matt Odell's vision to make open source freedom money profitable, might just work... This post The Secrets Behind Matt Odell’s Bitcoin Empire first appeared on Bitcoin Magazine and is written by Juan Galt .", "ingested_utc": "2025-08-19T15:38:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:51Z", "source": "CryptoSlate", "title": "Wyoming unveils FRNT state stablecoin, joining the battle in the $285B arena", "url": "https://cryptoslate.com/wyoming-unveils-frnt-state-stablecoin-joining-the-battle-in-the-285b-arena/", "id_key": "e41ccce4792dc5103e006b78f4662d7cf8290a5b483b53412f2fc86450910a24", "summary": "Wyoming has introduced the Frontier Stable Token (FRNT), the first stablecoin created and issued by a US government entity, according to an Aug. 19 announcement. Formerly called the Wyoming Stable Token (WYST), FRNT aims to deliver fast, secure, and transparent digital transactions for individuals, businesses, and institutions worldwide. According to the statement, each FRNT token […] The post Wyoming unveils FRNT state stablecoin, joining the battle in the $285B arena appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T15:38:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:51Z", "source": "CryptoSlate", "title": "TRON to be Natively Integrated into MetaMask, Unlocking Global Access to TRON Assets", "url": "https://cryptoslate.com/tron-to-be-natively-integrated-into-metamask-unlocking-global-access-to-tron-assets/", "id_key": "9fcab293c5d740f00bd761e2e937d7530ae74fed7785ab3a3bfd6678891462b8", "summary": "Geneva, Switzerland – August 19, 2025 – TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), announced today a strategic agreement with MetaMask. MetaMask will natively integrate TRON into the world’s leading self-custodial crypto wallet developed by Consensys. This integration will enable MetaMask users […] The post TRON to be Natively Integrated into MetaMask, Unlocking Global Access to TRON Assets appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T15:38:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:51Z", "source": "CryptoSlate", "title": "BTCS hands out $0.40 per share in Ethereum dividend and its stock jumps 10 percent", "url": "https://cryptoslate.com/btcs-hands-out-0-40-per-share-in-ethereum-dividend-and-its-stock-jumps-10-percent/", "id_key": "fe39a7fbe718199f734184030d370152603748d928a6211c9519cda8aa4911b3", "summary": "BTCS will distribute a dividend in Ethereum to shareholders later this year, marking the first instance of a public company paying a corporate dividend in ETH. The company said investors will receive a payment equal to $0.05 per share in Ethereum in September. A second component, described as a loyalty dividend, will distribute an additional […] The post BTCS hands out $0.40 per share in Ethereum dividend and its stock jumps 10 percent appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T15:38:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:51Z", "source": "CryptoBriefing", "title": "TRON to be natively integrated into MetaMask, unlocking global access to TRON assets", "url": "https://cryptobriefing.com/tron-metamask-integration-global-access/", "id_key": "458e60f41313fc313ec0f7d42077190096c6542a51619f874339c5086cd15139", "summary": "TRON MetaMask integration enables native access to TRON assets, enhancing global reach and seamless Web3 experience for users. The post TRON to be natively integrated into MetaMask, unlocking global access to TRON assets appeared first on Crypto Briefing .", "ingested_utc": "2025-08-19T15:38:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:58Z", "source": "CryptoNews", "title": "KindlyMD Snaps Up 5,744 BTC—Is the Nakamoto Bitcoin Treasury Becoming Crypto’s New Whale?", "url": "https://cryptonews.com/news/kindlymd-snaps-up-5744-btc-is-the-nakamoto-bitcoin-treasury-becoming-cryptos-new-whale/", "id_key": "ab61f3e6891666dc8b6d1f4c0dd4575f64e23d8a316deb52402487ba7b5f774a", "summary": "KindlyMD, now merged with Nakamoto, reports acquiring 5,744 Bitcoin, bringing its Nakamoto Bitcoin Treasury to 5,764.91 BTC The post KindlyMD Snaps Up 5,744 BTC—Is the Nakamoto Bitcoin Treasury Becoming Crypto’s New Whale? appeared first on Cryptonews .", "ingested_utc": "2025-08-19T15:38:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:38:58Z", "source": "CryptoNews", "title": "Wyoming’s Stablecoin FRNT Hits Mainnet – Could This Be the End of U.S. Bank Fees?", "url": "https://cryptonews.com/news/wyoming-launches-first-state-issued-stablecoin/", "id_key": "e935d3a238093d54266dcc9c56afb6a5398af46c85386bf2cb977617c3a4e3a5", "summary": "Wyoming has officially launched FRNT, the first state-backed stablecoin in the U.S., backed by cash and Treasuries with 2% overcollateralization. Live across seven blockchains, it will be listed on Kraken and audited monthly for transparency, setting a precedent in digital asset regulation. The post Wyoming’s Stablecoin FRNT Hits Mainnet – Could This Be the End of U.S. Bank Fees? appeared first on Cryptonews .", "ingested_utc": "2025-08-19T15:38:58Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:40:47Z", "source": "NYTimes_Business", "title": "How Keen Footwear Stays Ahead of Trump’s Shifting Tariffs", "url": "https://www.nytimes.com/2025/08/19/business/trump-tariffs-keen-footwear.html", "id_key": "16000bee00a61d3e34b997f35786282372aab981aeee6682af6bff358dfc29ba", "summary": "Keen Footwear has limited its exposure to supply chain trouble and opened a plant in Kentucky. But the trade upheaval has strained its adaptive strategy.", "ingested_utc": "2025-08-19T15:40:47Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:40:56Z", "source": "NPR_Top", "title": "Spain battles record wildfires even as the end of a heat wave brings lower temperatures", "url": "https://www.npr.org/2025/08/19/g-s1-83505/spain-wildfires-record-heat-wave-galicia", "id_key": "b1389258736ccdefd40ec03dac2854f0262120a671e321b3425d131cd79d7082", "summary": "The fires have ravaged small, sparsely populated towns in the country's northwest, forcing locals in many cases to act as firefighters. About 2,382 square miles have burned across Spain and Portugal.", "ingested_utc": "2025-08-19T15:40:56Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:40:57Z", "source": "NPR_Economy", "title": "Electricity prices are climbing more than twice as fast as inflation", "url": "https://www.npr.org/2025/08/16/nx-s1-5502671/electricity-bill-high-inflation-ai", "id_key": "d72c74d953ede33ec02e41dac277acc98b3a9651155083274334670bcefbd71c", "summary": "Electricity prices are rising more than twice as fast as overall inflation. That's especially costly during the dog days of summer when air conditioners are working hardest. In addition to hot weather, a variety of factors are causing power bills to climb, including the high cost of natural gas used to generate electricity and soaring demand from data centers.", "ingested_utc": "2025-08-19T15:40:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:01Z", "source": "FT_Markets", "title": "Tether hires former head of Trump’s crypto advisory council", "url": "https://www.ft.com/content/884775bf-8634-4940-a410-1c3a36be97ac", "id_key": "5fd6c4b2816644f84392308be99811eb11b10e26402f28d4ba992d294ac1efa2", "summary": "Bo Hines joins world’s biggest stablecoin issuer as strategic adviser", "ingested_utc": "2025-08-19T15:41:01Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:16Z", "source": "TheVerge_All", "title": "Made by Google 2025: What to expect from Google’s new Pixel hardware", "url": "https://www.theverge.com/news/761300/made-by-google-what-to-expect-pixel-10-pro-xl-fold-watch-4-buds-2a", "id_key": "b3a6426b274901f9f05db97d4cfc778eaf85ffe9179ffdd3267abda014406f58", "summary": "Google is gearing up to launch a new slate of Pixel devices at its Made by Google event this week, led by the flagship Pixel 10 phone line, with updated watches and earbuds expected to arrive, too. This year’s Pixel line has been leaked extensively over the past few weeks, revealing just about everything we […]", "ingested_utc": "2025-08-19T15:41:16Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:16Z", "source": "TheVerge_All", "title": "The best laptop deals you can get right now", "url": "https://www.theverge.com/good-deals/23161948/apple-macbook-lenovo-acer-deal-sale", "id_key": "4bb216ea73f8e5a57a8bf4271f924775b612a399db79c7052a2fd2d315e6c65d", "summary": "If you want a great laptop, you’re going to have to fork over a ton of money, right? Not necessarily. There are dozens of good laptops on the market at various price points. However, it can feel overwhelming to find the right one for your needs (some are better suited for, say, college students, whereas […]", "ingested_utc": "2025-08-19T15:41:16Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:18Z", "source": "WIRED_All", "title": "Labubus Are on Track to Be a Billion-Dollar Business This Year", "url": "https://www.wired.com/story/labubu-pop-mart-earnings-2025/", "id_key": "b36f02050778900a14a4763213cf6e40af2f68848ad2dd686f6538628d300ae0", "summary": "Pop Mart, the Chinese company behind the Labubu franchise, has sold $670 million worth of related products so far this year—more than iconic US toy lines Barbie and Hot Wheels.", "ingested_utc": "2025-08-19T15:41:18Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:20Z", "source": "Engadget_All", "title": "There's a Hollow Knight: Silksong livestream on April 21 at 10:30AM ET", "url": "https://www.engadget.com/gaming/theres-a-hollow-knight-silksong-livestream-on-april-21-at-1030am-et-153220983.html?src=rss", "id_key": "abdcb06b248ea6669e9b316d1afa32c29c83c4a827fe20c2ca3743ea8fb3f409", "summary": "Is it finally happening? Team Cherry just announced a livestream for the long-anticipated sequel Hollow Knight: Silksong . It takes place on April 21 at 10:30AM ET. The company says it will be making a \"special announcement\" about the game. We don't exactly know what this announcement will be, but it's starting to feel like a release date or at least a release window. Rumors have been swirling that the title would finally be getting a release date during this week's Gamescom festivities , with Geoff Keighley offering a tease a couple of days ago . This is all happening more than six years after the game was first announced . It's possible that the special announcement won't involve the release date at all, but will instead offer new game modes or a deeper dive into the story. It's worth noting that reports have indicated that the game would finally see the light of day this year , though we've been fooled by that kind of thing before. For the uninitiated, Hollow Knight: Silksong is the followup to Hollow Knight , which was an indie Metroidvania that absolutely took the world by storm. It actually started as DLC for the original game before the developers realized the scope of their ambitions would take nearly seven years to see through. This article originally appeared on Engadget at https://www.engadget.com/gaming/theres-a-hollow-knight-silksong-livestream-on-april-21-at-1030am-et-153220983.html?src=rss", "ingested_utc": "2025-08-19T15:41:20Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:20Z", "source": "Engadget_All", "title": "10 Pixels in, the purpose of a Google-made smartphone remains the same", "url": "https://www.engadget.com/mobile/smartphones/10-pixels-in-the-purpose-of-a-google-made-smartphone-remains-the-same-160007404.html?src=rss", "id_key": "f121182155ede38dd116d7e7138286c025a5ca236209eba94c297e4becdfffd4", "summary": "Google didn't need to make its own smartphone. Even though the company spent several years having other manufacturers build phones it could slap its \"Nexus\" branding on, selling hardware is not core to Google's business. Things like advertising and Search still handily dwarf the inroads the company's made as a smartphone manufacturer, and that will likely remain true for the foreseeable future. Compared to the contributions the iPhone makes to Apple's bottom line, the Pixel has always, in some sense, been a hobby. Which means Google finds itself in a familiar place heading into the launch of the Pixel 10 . It's better than it's ever been at the business of building phones, but the task for the Pixel remains the same: get people to use Google software (especially Search). The first smartphones \"made by Google\" Google sold its own hardware, including a lineup of phones, under the Nexus brand from 2010 to 2016 — but it was always known that hardware manufacturers like HTC and Samsung were actually building the hardware. That changed with the Pixel, the first time Google started using the now-ubiquitous \"made by Google\" phrasing. Ever since the first Pixel phone arrived in October 2016, Google’s phones have been defined by their camera skills. Google's significant breakthroughs in computational photography influenced the entire industry, and continue to do so today. The original Pixel and Pixel XL featured a single 12.3-megapixel camera and let anyone take great HDR photos without any fuss. Purchasing a Pixel or Pixel XL also unlocked unlimited full-resolution backups of your photos in Google Photos for free, a strong incentive to consider switching to Google's smartphone in its own right. The company's glass and aluminum phone was more than just its camera sensor, though. A big part of Google's early pitch for the Pixel, and other hardware like Google Home, was that it could serve as a vehicle for Google Assistant . The AI-powered voice assistant had shades of Siri, and voice control features previously available in Android. But it was far more integrated into Google's software and services and had a deep well of knowledge to draw on from Google Search. An \"OK Google\" could let you set a timer on your phone, but it could also answer trivia or tell you about an upcoming calendar event. Google continued to lean on software for the release of the Pixel 2 and Pixel 2 XL , which put Google Now -style proactive information on a new always-on display, along with a refined design with pressure sensitive sides that could activate specific functions on the phone. In terms of the camera, Google's major improvements over the original Pixel were the addition of optical image stabilization for video and a custom imaging chip, dubbed the Pixel Visual Core , that handled the image processing for both first-party and third-party camera apps. Besides being the first instance of Google sneaking some of its own custom silicon into its phone, the Pixel 2 was also was a significant challenge to Apple's dominance in the photography department That pattern continued with the release of the Pixel 3 and Pixel 3 XL , which again featured a slightly modified design, wireless charging and a collection of new camera features. The biggest was Night Sight, Google's software solution for taking really good photos when there’s barely any light available. The feature was released after the Pixel 3 came out, and gave the phone the ability to capture more or less light at night depending on the shakiness of your hand. The third-generation Pixel was also paired with the introduction of Google Assistant's Call Screen feature, a mixture of visual voicemail and audio transcription that allowed users to see why someone is calling and only pick up if they wanted to. Google would go on to introduce the first budget version of the Pixel a few months later with the Pixel 3a , a practice that continues to this day. In the following years, the company's releases were mostly memorable for gimmicks like the Pixel 4's Motion Sense feature (using radar to detect hand gestures to launch shortcuts) and the adoption of industry trends, with the Pixel 5's support for 5G . The company followed up those phones with a few releases that were only memorable for gimmicks like the Pixel 4's Motion Sense feature (essentially motion controls for specific apps) and the adoption of an industry trend, with the Pixel 5's 5G support . Say hello to the camera bar and Tensor chip It would take the radical new design of the Pixel 6 to snap things back into focus for Google. Not only did the Pixel 6 have a massive, shelf-like camera bar on the back, but the phone was also the first to be powered by a custom SoC developed by Google. Rather than focus on raw power, the Google Tensor chip was designed to handle on-device AI tasks like Magic Eraser for editing photos, Live Translate for converting text to another language as you type and Direct My Call, which lets the Pixel navigate phone trees on your behalf. The splashy launch of the Pixel 6 in 2021 marks the new path Google's smartphones have been heading for the last four years. They're still good at taking photos, but their main role is to be a showcase for whatever AI feature the company has cooked up most recently. Google continued to refine the idea with the release of the Pixel 7 , which was paired with the first Pixel Watch following Google's acquisition of Fitbit in 2021. 2023 brought the Pixel 8 as well as the company's first foldable, the Pixel Fold . The move also matched internal shifts at Google itself. The teams developing the Android operating system have long been separate from the teams building Pixel phones out of respect for Google's partners who make their own Android phones. That changed in 2024 when Google announced a reorganization that placed Pixel and Android under the same \"Platforms & Devices\" umbrella. The stated motivation was that aligning software and hardware would let the company release new AI features even faster, which bore out in the various Gemini features on the Pixel 9 lineup and whatever the company has planned for the Pixel 10. On some level the intimate role smartphones play in people's lives makes them an obvious venue for AI, something the company clearly wants to take advantage of based on in-development features like Project Astra . Google clearly experimented throughout the life of the Pixel, but the phone has always been a tool to sell software ideas. Demonstrating the potential of computational photography had early success, and now the company is trying to do the same thing with generative AI and Gemini. Competition remains fierce — OpenAI shared in December 2024 that ChatGPT had 300 million weekly users, making it a real threat to Google's core business. Google has never been a hardware company, nor has it needed to win at hardware. But with stiffer competition in software than ever, using the Pixel series to get people to use Google's many services is arguably more important than ever. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/10-pixels-in-the-purpose-of-a-google-made-smartphone-remains-the-same-160007404.html?src=rss", "ingested_utc": "2025-08-19T15:41:20Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:20Z", "source": "Engadget_All", "title": "Apple is reportedly manufacturing all four iPhone 17 models in India", "url": "https://www.engadget.com/mobile/smartphones/apple-is-reportedly-manufacturing-all-four-iphone-17-models-in-india-145528499.html?src=rss", "id_key": "9cbffec3b01cd806bf1938f0d5c5647d1de2f3034f65f8ee84c4a010ad464414", "summary": "Apple is shifting more iPhone production to India ahead of next month’s iPhone 17 launch, Bloomberg reports. The company will build all four iPhone 17 models there, and for the first time US-bound shipments for the entire lineup will come from India at launch. The shift comes amid production expansion across five factories in India, including two plants that recently opened. Apple has been working to decrease its reliance on China for the manufacturing of US-bound iPhones. According to Bloomberg , factories controlled by Tata Group, an Indian multinational headquartered in Mumbai, will account for as much as half of India’s iPhone output over the next two years. Apple’s longtime partner Foxconn Technology Group is also involved through its production hub in Bangalore. The iPhone 17 lineup is expected to be unveiled in September, though the exact date is still unknown. We expect to see the usual iPhone 17, 17 Pro, and 17 Pro Max models announced, with the added possibility of a slimmer premium model in the form of an iPhone Air. The iPhone 17e, the next generation of Apple's budget-friendly model, is more likely to arrive in early 2026 if it follows the same pattern as the iPhone 16e . In the United States, the Trump administration had threatened Apple with tariffs on iPhones if it continued manufacturing the devices overseas. More recently, however, Apple announced from the Oval Office that it would invest an additional $100 billion in the US as part of a new “American Manufacturing Program.” This was announced as part of a $600 billion overall investment by Apple to produce more components domestically. While India is among the many countries facing the Trump administration’s ever-changing tariff landscape, Bloomberg reported earlier this summer that iPhones imported from India have so far evaded tariffs as the US Commerce Department works to determine what sectors it deems vital to national security. With that in mind, it’s not surprising to see Apple shipping as many iPhones to the US from India as possible, at least for now. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/apple-is-reportedly-manufacturing-all-four-iphone-17-models-in-india-145528499.html?src=rss", "ingested_utc": "2025-08-19T15:41:20Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:28Z", "source": "TheStreet_Top", "title": "After closing 200 restaurants, Steak 'n Shake finds a new path", "url": "https://www.thestreet.com/restaurants/fast-food-burger-chain-opened-in-1934-closes-200-restaurants", "id_key": "9572ec9e8142b7be6c3d70794df56d4a5ffade4a608d38d64b29849d6eb72500", "summary": "Steak ’n Shake, the 90-year-old burger chain, has closed over 200 restaurants, ended table service, and adopted a new franchise model, but the brand is showing signs of a comeback.", "ingested_utc": "2025-08-19T15:41:28Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:35Z", "source": "FinancialPost_Business", "title": "Apple launches program in Canada helping customers self-repair devices", "url": "https://financialpost.com/pmn/apple-launches-program-in-canada-helping-customers-self-repair-devices", "id_key": "2159bf7b642897663d2f93cdab8aa023cff644190c96745d057cf66d60a1dc77", "summary": "Canadians who want to repair their own Apple devices can now get parts, tools and manuals from the tech giant, which brought its self-service repair program to the country on Tuesday. The program gives customers free access to manuals and diagnostic software that help troubleshoot issues with iPads, iPhones and Macs. Customers are then able […]", "ingested_utc": "2025-08-19T15:41:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:35Z", "source": "FinancialPost_Business", "title": "Inflation reading won’t ‘move the needle’ for Bank of Canada, says economist", "url": "https://financialpost.com/news/economy/bank-of-canada-rate-cut-uncertain-inflation-data", "id_key": "269b94748b41b98fd7c0720555c8a8e30f867e1a30e1386188afc8c61a59e6e1", "summary": "Still a lot of data to come before the central bank's September decision", "ingested_utc": "2025-08-19T15:41:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:35Z", "source": "FinancialPost_Business", "title": "RealTruck Scores Overwhelming Win in First Phase of Patent Infringement Lawsuit Against Rough Country", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/realtruck-scores-overwhelming-win-in-first-phase-of-patent-infringement-lawsuit-against-rough-country", "id_key": "2a7e323accb1a26c3d909ba63ee1c5d782f64554fac8af08daa101de1559944d", "summary": "Reinforces RealTruck’s deep commitment to vigorously protect its 1,000+ patent portfolio against infringement ANN ARBOR, Mich. — RealTruck, a global aftermarket product and accessory brand and a digital destination for truck, Jeep®, Bronco® and off-road enthusiasts, achieved a significant victory in its lawsuit against Rough Country, LLC, when the U.S. District Court for the Western […]", "ingested_utc": "2025-08-19T15:41:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:35Z", "source": "FinancialPost_Business", "title": "US Copper Firms Hike Prices Even After Trump Tariff Reprieve", "url": "https://financialpost.com/pmn/business-pmn/us-copper-firms-hike-prices-even-after-trump-tariff-reprieve", "id_key": "786b5673056c87a35fc5bffde30028d19117c613523db3033c8ad07bcec42626", "summary": "Major US producers of electrical wire are raising prices just weeks after a surprise decision by President Donald Trump to exempt the most basic copper imports from tariffs, suggesting that American consumers may end up paying more even after metal prices plunged.", "ingested_utc": "2025-08-19T15:41:35Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:41:42Z", "source": "Nikkei_Asia_Top", "title": "LG Electronics chases bigger slice of India's red-hot appliance market", "url": "https://asia.nikkei.com/business/electronics/lg-electronics-chases-bigger-slice-of-india-s-red-hot-appliance-market", "id_key": "2db32f46dafe569e97e32ce14b94b9ea604208d6a661ea7cb974cb2334aa2637", "summary": "", "ingested_utc": "2025-08-19T15:41:42Z"}
