{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T22:47:58Z", "source": "Guardian_World", "title": "Australia news live: Paterson condemns Burke over ‘inflammatory’ criticism of Israel; Chalmers promises to act on intergenerational fairness", "url": "https://www.theguardian.com/australia-news/live/2025/aug/22/australia-news-live-penny-wong-gaza-israel-netanyahu-anthony-albanese-childcare-safety-education-database-ntwnfb", "id_key": "790f4eb5387f86175dbf2cdb10805f25cfae23564a668b2a3f68fc8604a11dc8", "summary": "Senator says Tony Burke’s remarks were ‘grossly irresponsible’. Follow today’s news live Get our breaking news email , free app or daily news podcast Coalition says if Labor tries to raise taxes after roundtable it would be ‘major breach of faith’ with Australian people James Paterson , the shadow minister for finance, says if the government moves to increase taxes it would be a “major breach of faith with the Australian people”. Paterson spoke to RN Breakfast after the conclusion of yesterday’s roundtable, where Chalmers said there was a longer-term process to consider major reform on the matter. No Australian voted for higher taxes at the election, and so it seems that Jim Chalmers isn’t on the same page as the prime minister because he was unwilling to repeat that commitment at his press conference yesterday. And he is leaving open the door to higher taxes, and particularly on people’s retirement savings, on family trusts, on a whole range of other things. When those questions were raised during the election campaign, Jim Chalmers and the Labor party said that was a Liberal Party scare campaign. So, if they go ahead and try and increase taxes, that’ll be a major breach of faith with the Australian people . Continue reading...", "ingested_utc": "2025-08-21T22:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T22:47:58Z", "source": "Guardian_World", "title": "California approves special election to reshape congressional map in favor of Democrats", "url": "https://www.theguardian.com/us-news/2025/aug/21/california-legislature-redistricting-plan", "id_key": "1faab70cfa2b05b01d0fe13e97bb230d47c86d8540c2313df0d81ffe0bbebfee", "summary": "Lawmakers on Thursday authorized a November vote to ask residents to redraw congressional boundaries California lawmakers have authorized a November special election to ask voters to redraw the state’s congressional boundaries and create five potential new Democratic US House seats. The state legislature voted to advance the redistricting plan on Thursday after hours of debate. The state’s Democratic governor, Gavin Newsom , who has led the redistricting push, is expected to sign the bill shortly. Continue reading...", "ingested_utc": "2025-08-21T22:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T22:47:58Z", "source": "Guardian_World", "title": "Lil Nas X arrested and hospitalized after altercation with police", "url": "https://www.theguardian.com/music/2025/aug/21/lil-nas-x-arrested-hospitalized-police", "id_key": "780bf3bd1232a75b32ab50824d7862438a2ce3439ac94f1682eb799607703ad3", "summary": "The 26-year-old rapper and singer was seen walking down the street in his underwear Thursday morning in LA Lil Nas X has been arrested and briefly hospitalized after an altercation with police in the early hours of Thursday morning, according to authorities in Los Angeles. . Continue reading...", "ingested_utc": "2025-08-21T22:47:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T22:50:59Z", "source": "FinancialPost_Business", "title": "Global Mail Services Halt US Deliveries Ahead of De Minimis End", "url": "https://financialpost.com/pmn/business-pmn/global-mail-services-halt-us-deliveries-ahead-of-de-minimis-end", "id_key": "0fb6d5cc4410680ea95fa01f311688c7bcc95a6ef4a04e5ceed13b8780e4622e", "summary": "Postal services across the world are cutting off parcel deliveries to the US as the fast-approaching end of a tariff exception for low-value packages sows chaos in global shipping.", "ingested_utc": "2025-08-21T22:50:59Z"}
