{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:24Z", "source": "BBC_World", "title": "Nigeria deports Chinese scammers in crackdown on 'foreign-led' cyber crime", "url": "https://www.bbc.com/news/articles/c89059k37ezo?at_medium=RSS&at_campaign=rss", "id_key": "da154a77ee00643d62f98ce600a8da1e28554585a5400b87df3415a3e062f2b0", "summary": "A total of 102 deported foreigners have been convicted of \"cyber-terrorism and internet fraud\" this week.", "ingested_utc": "2025-08-22T14:39:24Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:26Z", "source": "BBC_Technology", "title": "Apple TV+ raises subscription prices worldwide, including in UK", "url": "https://www.bbc.com/news/articles/c1le9l6pee5o?at_medium=RSS&at_campaign=rss", "id_key": "12f3ebe66e8089b97d61f96e9b9cbcf0dc422be54b0bc869d1408762a7b6ba77", "summary": "The streaming industry has seen a series of price hikes from its major players in the past year.", "ingested_utc": "2025-08-22T14:39:26Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:27Z", "source": "Guardian_Business", "title": "US Fed’s Powell signals possible rate cut in Jackson Hole speech – business live", "url": "https://www.theguardian.com/business/live/2025/aug/22/asia-shares-ftse-stocks-markets-jackson-hole-speech-us-federal-reserve-jerome-powell-trump-business-live", "id_key": "4d6824b981b3703c56017018a4a797a976439a9e48e9a3938ba6b36f0657757d", "summary": "Chair of the Federal Reserve says US economy is facing ‘challenging situation’ as inflation risks persist and job market cools Unions are raising concerns about the threat of TikTok layoffs , warning it would put millions of British TikTok users at risk. John Chadfield of the Communication Workers Union (CWU) said: TikTok workers have long been sounding the alarm over the real-world costs of cutting human moderation teams in favour of hastily developed, immature AI alternatives. This has been a constant concern throughout the process of TikTok workers’ effort to form a union. Continue reading...", "ingested_utc": "2025-08-22T14:39:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:27Z", "source": "Guardian_World", "title": "Court challenge to US-Eswatini deportation deal postponed", "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed", "id_key": "dce78841a339ce4d8ce43377197b4b7d3ba3c2f90172ce520d700af346e8d00e", "summary": "Hearing delayed after attorney general fails to attend in case brought by NGOs against accepting ‘dangerous criminals’ A court case challenging Eswatini’s acceptance of five people deported by the US has been postponed until September, after the attorney general failed to show up on Friday, according to one of the NGOs that brought the case. The men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers. Continue reading...", "ingested_utc": "2025-08-22T14:39:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:27Z", "source": "Guardian_World", "title": "Thousands face deportation to danger as Trump targets temporary protections", "url": "https://www.theguardian.com/us-news/2025/aug/22/temporary-protected-status-tps-immigration-trump", "id_key": "a9703fb3b797e880b5521dc1b4241dcd5de499ec61c74286973f7d39d0b27f5c", "summary": "People with temporary protected status face possible deportation even though their home countries – including Afghanistan and Haiti – remain unsafe Many thousands of immigrants living in the US who came from certain countries regarded as risky or dangerous are at the mercy of US judges and the Trump administration’s agenda to slash their work authorization and protection from deportation. Since taking office, the Trump administration has announced the termination of temporary protected status ( TPS ) for citizens of seven of the 15 countries previously designated for shelter under this legal umbrella – with the Department of Homeland Security (DHS) controversially citing improved conditions in some of those places. Continue reading...", "ingested_utc": "2025-08-22T14:39:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:27Z", "source": "Guardian_World", "title": "A-levels and GCSEs need overhaul to keep pace with generative AI, experts say", "url": "https://www.theguardian.com/education/2025/aug/22/a-levels-and-gcses-need-overhaul-to-keep-pace-with-generative-ai-experts-say", "id_key": "32b7a8e5b21c06e7fef2e6b3b60f0b0eba784bb0c9ae8f8a994db853d2d71f77", "summary": "Oral assessments, tightened security and faster marking could result as use of AI itself becomes core digital skill Oral assessments, more security checks and speedier marking are all on the cards as generative artificial intelligence (AI) could transform exams for the next generation of students. As the 2025 exam season draws to a close with GCSE students picking up their results on Thursday, after mostly sitting traditional pen and paper exams, AI is already changing the landscape. Continue reading...", "ingested_utc": "2025-08-22T14:39:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:27Z", "source": "Guardian_World", "title": "Key findings from the high court ruling in Noel Clarke’s libel case against the Guardian", "url": "https://www.theguardian.com/culture/2025/aug/22/what-high-court-ruled-in-noel-clarke-libel-case-against-the-guardian", "id_key": "c48876451db115649d11074780b21a9b396212389fb2dbb685320e57997e7cc5", "summary": "A 224-page judgment backed both the Guardian’s defences and found Clarke was ‘not a credible or reliable witness’ • Clarke loses case against Guardian over sexual misconduct investigation The 224-page judgment in the libel case brought by Noel Clarke against the Guardian was handed down by Mrs Justice Steyn in the high court on Friday. Here are the key issues: Continue reading...", "ingested_utc": "2025-08-22T14:39:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:27Z", "source": "Guardian_World", "title": "Seven Wyoming newspapers were about to be shut. They were given a second life", "url": "https://www.theguardian.com/us-news/2025/aug/22/wyoming-newspapers-nmc-bought", "id_key": "b74e24f1db04c0124351628bb8aba1685e0f16c8f6cf806f791361126d679586", "summary": "A group of news execs stepped in to buy them, but across the US, 3,200 local news outlets have shuttered since 2005 Wyoming saw a resurrection last week. Eight small towns across the vast rural state were reeling from the gut punch of the abrupt closures of their newspapers just a week earlier. Staff had woken up to an email from News Media Corporation (NMC) announcing the immediate closures of the printing presses. Continue reading...", "ingested_utc": "2025-08-22T14:39:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:46Z", "source": "CryptoSlate", "title": "Bitcoin treasury companies: Hedge or house of cards?", "url": "https://cryptoslate.com/market-reports/bitcoin-treasury-companies-hedge-or-house-of-cards/", "id_key": "df2be0de8812110c814b561051672a471efc2e02aa47e6da7d4fc676603e959b", "summary": "The post Bitcoin treasury companies: Hedge or house of cards? appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T14:39:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:50Z", "source": "CryptoNews", "title": "Taiwan Charges 14 in Record-Breaking $75M Crypto Laundering Case Using CoinW Exchange", "url": "https://cryptonews.com/news/taiwan-charges-14-in-record-breaking-75m-crypto-laundering-case-using-coinw-exchange/", "id_key": "a927007fd60c9c5369d3e9755150f678f8a4b7ceadd12b8cf601818133d07b41", "summary": "Taiwan prosecutors indicted 14 people in the country's largest cryptocurrency money laundering scheme worth NT$2.3 billion ($75M) as Shilin District Prosecutor's Office concluded investigation into fraud ring that operated through fake Coin Exchange franchises using CoinW brand, victimizing over 1,500 people in one year. The post Taiwan Charges 14 in Record-Breaking $75M Crypto Laundering Case Using CoinW Exchange appeared first on Cryptonews .", "ingested_utc": "2025-08-22T14:39:50Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:50Z", "source": "CryptoNews", "title": "Decentralized Science Protocols Take Over, BIO Skyrockets 27% Overnight", "url": "https://cryptonews.com/news/decentralized-science-protocols-take-over-bio-skyrockets-27-overnight/", "id_key": "344320ee19f2db594c21803ef874af8aa3b81d4262428676ad730c434fdc4b36", "summary": "Decentralized Science protocol BIO Protocol surges over 27% overnight to achieve five-month peak of $0.1976 following recent Bithumb exchange listing, pushing weekly gains to 91% and August gains to nearly 200% as blockchain-powered scientific research protocol gains momentum with AI-powered BioAgents technology. The post Decentralized Science Protocols Take Over, BIO Skyrockets 27% Overnight appeared first on Cryptonews .", "ingested_utc": "2025-08-22T14:39:50Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:39:54Z", "source": "Unchained", "title": "MetaMask Unveils mUSD Stablecoin", "url": "https://unchainedcrypto.com/metamask-unveils-musd-stablecoin/", "id_key": "7ed689ad15d18945b27b6fa9507eee7f108b5877b8b3d32de741252d762189f7", "summary": "Popular self-custodial wallet firm MetaMask has officially revealed that it will launch its own native dollar stablecoin called MetaMask USD (mUSD) later this year. mUSD will be issued by Stripe-owned platform Bridge and powered by the decentralized protocol M0. Each mUSD token will be backed 1:1 by U.S. cash and ... The post MetaMask Unveils mUSD Stablecoin appeared first on Unchained .", "ingested_utc": "2025-08-22T14:39:54Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:41:43Z", "source": "NYTimes_Business", "title": "Trump Threatens to Fire Fed Governor Lisa Cook If She Does Not Resign", "url": "https://www.nytimes.com/2025/08/22/business/trump-lisa-cook-federal-reserve-governor.html", "id_key": "659c5d316dd4ef0e68a6538f61cdf09a7f5872b29deabfbaeca6e8d5e8a332de", "summary": "President Trump said he would fire Lisa Cook, a Federal Reserve governor, if she did not resign. But his ability to fire a Fed governor is limited.", "ingested_utc": "2025-08-22T14:41:43Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:41:43Z", "source": "NYTimes_Business", "title": "British Government to Rescue Another Ailing Steel Maker", "url": "https://www.nytimes.com/2025/08/22/business/britain-steel-takeover.html", "id_key": "382308ba00e10e85d15d88dd4411d7a37e88644b9179f962493e961717b7d570", "summary": "The move, which comes after a court-approved liquidation of Speciality Steel, is meant to preserve jobs and domestic manufacturing.", "ingested_utc": "2025-08-22T14:41:43Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:41:55Z", "source": "FT_Home", "title": "Powell says ‘shifting’ economic risks heighten case for Fed rate cut", "url": "https://www.ft.com/content/cdd1dd0f-f0ba-41f3-be97-e598785676f5", "id_key": "b25e1c7f25ab4c5e2e712050554de00ca27267bb2497387ad20df5a72a173562", "summary": "Central bank chair warns of ‘challenging situation’ with tariffs pushing up inflation and jobs market cooling", "ingested_utc": "2025-08-22T14:41:55Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:41:55Z", "source": "FT_Home", "title": "Fortress JPMorgan: Jamie Dimon’s monument to American finance", "url": "https://www.ft.com/content/e9f8ab1e-56c4-45aa-aab2-67c8abe2d99c", "id_key": "d4b8fefa3f8a15111eec2305985c8213e2e70f958b10b9146f32a8c07f7953e0", "summary": "The bank’s new Manhattan headquarters is a physical manifestation of its unparalleled position", "ingested_utc": "2025-08-22T14:41:55Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:13Z", "source": "TechCrunch_All", "title": "Waymo approved to start autonomous vehicle testing in New York City", "url": "https://techcrunch.com/2025/08/22/waymo-approved-to-start-autonomous-vehicle-testing-in-new-york-city/", "id_key": "f94288cd3e6acf771e8f090dafe38f880c909814e63f860be646c52019db9b37", "summary": "It's the first permit of its kind, and a crucial step along the path toward launching a true robotaxi service in the Big Apple.", "ingested_utc": "2025-08-22T14:42:13Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:15Z", "source": "WIRED_All", "title": "Best Massagers for When You’d Rather Not Pay Spa Prices (2025)", "url": "https://www.wired.com/gallery/the-best-massagers/", "id_key": "0e002f153d420ee6bfd8e688dbb33688ce346aae35d2eb85323f44fa7eafd6f8", "summary": "Don’t cancel physical therapy just yet, but these portable, at-home massagers might be the hack you need after stressful days.", "ingested_utc": "2025-08-22T14:42:15Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:16Z", "source": "Engadget_All", "title": "Google Drive now offers in-browser video editing", "url": "https://www.engadget.com/apps/google-drive-now-offers-in-browser-video-editing-143417668.html?src=rss", "id_key": "487499a113a710e3b6b5175030712f3112c0797dacef8da690f94468beeb2c73", "summary": "Google is now offering a way to edit videos right in Drive via Google Vids in a compatible browser. Whenever you're previewing a video in Google Drive, you may see an \"Open\" button in the top right of the screen. Clicking this opens the clip in Google Vids , where you can trim the video, add text and music and make other changes. Veo is available in the app too. After you open a file in Vids, a new file is created, and you'll have to save or export that if need be. Google for Education has a free course detailing how to use Vids . Google In general, it seems like a useful way to edit videos that you've already uploaded to Drive, but there are some caveats here. For one thing, it's restricted to paid users, including those on various Workspace business and enterprise plans, nonprofits and those with the Gemini Education or Gemini Education Premium add-ons. Google AI Pro and Ultra users will get access as well. So too will anyone who bought the Gemini Business and Enterprise add-ons before Google discontinued them earlier this year. Vids will be enabled for supported organizations by default unless they've opted to block access to Google Docs. This Google Vids feature works on the latest couple of versions of Chrome, Firefox and Microsoft Edge (Windows only). Compatibility on other browsers may vary. MP4, Quicktime, OGG and WebM videos are supported, with individual clips having limits of 35 minutes of runtime and a file size of 4GB. This article originally appeared on Engadget at https://www.engadget.com/apps/google-drive-now-offers-in-browser-video-editing-143417668.html?src=rss", "ingested_utc": "2025-08-22T14:42:16Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:16Z", "source": "Engadget_All", "title": "Anker wireless chargers are up to 35 percent off ahead of Labor Day", "url": "https://www.engadget.com/deals/anker-wireless-chargers-are-up-to-35-percent-off-ahead-of-labor-day-145325460.html?src=rss", "id_key": "0b85546d507783b497a908376a123bdc00bef9c2753800c5a0931aa8408d4417", "summary": "Anker's 3-in-1 MagSafe charging station is on sale for a record low price of $63 — that works out to savings of 30 percent.The Qi2-certified charger wirelessly charges your compatible iPhone, Apple Watch, and AirPods on one compact and convenient dock. Qi2 boasts 15W of power, so you can take advantage of fast charging on compatible devices. This means the station can charge an iPhone 16 Pro Max to 20 percent in just 20 minutes and an Apple Watch Series 10 from zero to 100 percent in just over an hour. The magnetic stand for your iPhone is adjustable with 45 degrees of vertical rotation and 360 degrees of horizontal rotation, so you can always find the perfect angle for your phone while charging. Being able to wirelessly charge these three daily devices at once might remind you of Apple's wireless charging pad that never was, but Anker's 3-in-1 charging station offers an elegant solution. We tend to like Anker's charging products , and we’ve found they make some of the best charging stations on the market. Anker's products can be a bit pricey, though, which is why the best time to pick them up is during these sales. The company actually has a slew of its charging products on sale right now . Its 3-in-1 wireless charging cube is 31 percent off right now and down to $104. If you're a Prime member and have a Qi2-compatible iPhone, then you might also look at Anker's simple Qi2 charging pad , which is 35 percent off for a two-pack right now. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/anker-wireless-chargers-are-up-to-35-percent-off-ahead-of-labor-day-145325460.html?src=rss", "ingested_utc": "2025-08-22T14:42:16Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:16Z", "source": "Engadget_All", "title": "Apple's MacBook Air M4 drops to a record-low price", "url": "https://www.engadget.com/deals/apples-macbook-air-m4-drops-to-a-record-low-price-123031057.html?src=rss", "id_key": "fb5f30981f2640250166c63f90bc1ba80134139c85a70d8b146900bec47c2fba", "summary": "If you've put off getting a new MacBook then today is your lucky day. Right now in the lead-up to Labor Day, the 2025 13- and 15-inch MacBook Air M4 are available on Amazon for record-low prices. The 13-inch model is our pick for best MacBook to buy this year, and it's one of the best laptops for college students going back to school soon as well. You can pick up the 13-inch MacBook Air M4 for $799, down from $999 — a 20 percent discount. This model comes with 16GB of RAM and a 256GB SSD. You can upgrade to 512GB SSD for $999 , down from $1,199, another all-time low price, or 24GB of RAM and a 512GB SSD for $1,199, down from $1,399. Then there's the 15-inch MacBook Air M4 , whose cheapest model is on sale for $999, dropping from $1,199. The 17 percent discount is the best deal we've seen since the pair debuted in March. As with the 13-inch model, the 16GB and 512GB SSD option is also a record-low price, dropping to $1,199 from $1,399. Then there's the 24GB upgrade , which is $1,399, down from $1,599. We're big fans of the MacBook Air M4, giving it a 92 in our review . Part of that comes from an already lower starting price for the MacBooks than their predecessors. The 2025 models also get a speed boost thanks to the M4 chip and are very thin with a 0.44-inch thickness. Neither the 13- or 15-inch will drag you down, weighing 2.7 pounds and 3.2 pounds, respectively. Plus, they both have excellent battery life, lasting over 18 hours while playing an HD video. The big differences in the 15-inch model mostly come down to size. The screen is obviously bigger, as is its trackpad. Other than that, it offers better speakers than its 13-inch sibling. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/apples-macbook-air-m4-drops-to-a-record-low-price-123031057.html?src=rss", "ingested_utc": "2025-08-22T14:42:16Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:16Z", "source": "Engadget_All", "title": "Trump is forming a 'National Design Studio' to spruce up government websites", "url": "https://www.engadget.com/big-tech/trump-is-forming-a-national-design-studio-to-spruce-up-government-websites-140053273.html?src=rss", "id_key": "8b39bd488c422333db36115824d5ee94209df22c1f0dce7bdd82ce784a48297e", "summary": "The Trump administration is forming a \"National Design Studio,\" with the aim of improving government websites and the efficiency of digital services at federal agencies. Trump has already signed an executive order to create the studio. According to Reuters , the president will appoint Airbnb co-founder Joe Gebbia as the head of the new organization, which one of its sources described as a stripped-down version of the Department of Government Efficiency (DOGE). DOGE, which was once led by Elon Musk, aimed to cut wasteful government spending and modernize its IT systems. It facilitated mass layoffs of hundreds of thousands of federal workers and even dismantled whole agencies. As Reuters has noted, though, its activities have greatly slowed down after Musk left the organization and his role as Trump's advisor altogether. The White House did not respond to Reuters ' request for comment, and it's unclear if DOGE will continue operating once the studio has been formed. Gebbia will be apparently be named as the studio's the Chief Design Officer and will lead its efforts to upgrade the \"usability and aesthetics\" of federal digital services. The news organization says the studio will standardize design for websites meant to allow people to interact with the government and will advise agencies on how to reduce costs on duplicative designs. Based on Trump's executive order, the studio will shut down in three years before he steps down from office. While Gebbia will be the Chief Design Officer, an administrator will run the studio and will be in charge of reporting to White House Chief of Staff Susie Wiles. This article originally appeared on Engadget at https://www.engadget.com/big-tech/trump-is-forming-a-national-design-studio-to-spruce-up-government-websites-140053273.html?src=rss", "ingested_utc": "2025-08-22T14:42:16Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:25Z", "source": "TheStreet_Top", "title": "Powell drops hints about Fed interest rate cuts", "url": "https://www.thestreet.com/fed/powell-drops-hints-about-fed-interest-rate-cuts", "id_key": "1e30d9e9f218974d4ca9ca52cbe75dcd06de85dd5148a1c3f61450ae7c805de3", "summary": "With tariff inflation rising and job growth nearly stalling, the Federal Reserve chair gives his final Jackson Hole remarks.", "ingested_utc": "2025-08-22T14:42:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:25Z", "source": "TheStreet_Top", "title": "The US government gets a great deal on AI, but at what cost?", "url": "https://www.thestreet.com/technology/the-us-government-got-a-great-deal-on-ai-but-at-what-cost", "id_key": "e8684c8d310836013548061bea99392359b7b5e5af2229471f51f83f1fbd9521", "summary": "The General Services Administration made a series of deals that seem too good to be true.", "ingested_utc": "2025-08-22T14:42:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:25Z", "source": "TheStreet_Top", "title": "Amazon Gives Prime Members Something Grocery Chains Can’t Match", "url": "https://www.thestreet.com/retail/amazon-has-fresh-recipe-to-disrupt-kroger-publix-local-grocery", "id_key": "575f6bfb5f612bd8a6c3e3bdc08fe52499bf72293335c5397e1513269cf2fc92", "summary": "After early failures, Amazon is now quietly building a grocery empire.", "ingested_utc": "2025-08-22T14:42:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:25Z", "source": "AlJazeera_All", "title": "At least 52 killed in Gaza as Israel escalates attacks on Gaza City", "url": "https://www.aljazeera.com/news/2025/8/22/at-least-52-killed-in-gaza-as-israel-escalates-attacks-on-gaza-city?traffic_source=rss", "id_key": "69bd8bbae06f075199f01322349d00a0adc96aec3f02d3ae7d498231fa032347", "summary": "Israel's defence minister warns that Gaza City will be destroyed unless Hamas yields to Israel's terms for ending war.", "ingested_utc": "2025-08-22T14:42:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:25Z", "source": "AlJazeera_All", "title": "Serbian president calls for ‘democratic dialogue’ with antigov’t protesters", "url": "https://www.aljazeera.com/news/2025/8/22/serbia-president-calls-for-democratic-dialogue-with-antigovt-protesters?traffic_source=rss", "id_key": "c74b0bf4a591c60aa4913b397c376affcbeee4b0e46b43dc09d4b00bc58ac8f8", "summary": "Opposition dismisses possibility of talks as President Aleksandar Vucic urges debate after months of angry protests.", "ingested_utc": "2025-08-22T14:42:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:32Z", "source": "FinancialPost_Business", "title": "Fed Chair Powell’s Remarks Friday at Jackson Hole (Full Text)", "url": "https://financialpost.com/pmn/business-pmn/fed-chair-powells-remarks-friday-at-jackson-hole-full-text", "id_key": "4fb3e85350592d5387e3bf1be6e71d7cdf0d70c12730256605bd2be1102804be", "summary": "The following is a reformatted version of prepared remarks titled “Monetary Policy and the Fed’s Framework Review,” which Federal Reserve Chair Jerome Powell is delivering Friday in Jackson Hole, Wyoming:", "ingested_utc": "2025-08-22T14:42:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:32Z", "source": "FinancialPost_Business", "title": "FT Portfolios Canada Co. Announces Cash Distributions for Its Exchange Traded Funds", "url": "https://financialpost.com/globe-newswire/ft-portfolios-canada-co-announces-cash-distributions-for-its-exchange-traded-funds-37", "id_key": "98b4e61dad0f94683c9dd992934c0299be4d17e66bdd8a42d23ca2b3f2844a65", "summary": "TSX: FUD, FSL & ETP Cboe CA: FJFB & SDVD TORONTO, Aug. 22, 2025 (GLOBE NEWSWIRE) — FT Portfolios Canada Co. (“First Trust Canada”) is pleased to announce cash distributions for its Exchange Traded Funds (“First Trust ETFs”) listed on the Toronto Stock Exchange and Cboe Canada for the month ending August 31, 2025 The […]", "ingested_utc": "2025-08-22T14:42:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:32Z", "source": "FinancialPost_Business", "title": "Year-Round Shipping from Port of Churchill Focus of New Agreement Between Arctic Gateway Group and Fednav Limited", "url": "https://financialpost.com/globe-newswire/year-round-shipping-from-port-of-churchill-focus-of-new-agreement-between-arctic-gateway-group-and-fednav-limited", "id_key": "4068d1bd39cb35c29ef4632b950f1d6da47806944f5861fc77c6fb9c571543e0", "summary": "Fednav brings decades of Arctic marine experience to inform sustainable year-round shipping from the Port of Churchill WINNIPEG, Manitoba, Aug. 22, 2025 (GLOBE NEWSWIRE) — Arctic Gateway Group (AGG) and Fednav Limited (Fednav) have signed a Memorandum of Understanding (MOU) to explore strengthening Canada’s Arctic trade corridor through the Port of Churchill. This collaboration will […]", "ingested_utc": "2025-08-22T14:42:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T14:42:47Z", "source": "HackerNews_Top", "title": "Thunderbird Pro August 2025 Update", "url": "https://blog.thunderbird.net/2025/08/tbpro-august-2025-update/", "id_key": "cdc5ad82f2237634b4c607d4e21f27748beeb57b4f76c34285ac0ddcfcb0f5c7", "summary": "Comments", "ingested_utc": "2025-08-22T14:42:47Z"}
