{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "Uganda reaches agreement with US to take in some of its failed asylum seekers", "url": "https://www.theguardian.com/world/2025/aug/21/uganda-reaches-agreement-with-us-to-take-in-some-of-its-failed-asylum-seekers", "id_key": "e04a885da0b835ff524eb68953f8b08762620a644013658259806169b9ecdaf8", "summary": "African country’s foreign ministry says the two countries are working on the details of a deal over deportees Uganda has reached an agreement with the US to take in deportees from third countries who may not get asylum, but are “reluctant” to go back to their own countries, according to Uganda’s foreign ministry. Uganda won’t accept people with criminal records or unaccompanied minors under the temporary arrangement, ​​ the foreign ministry’s permanent secretary said in a statement . He did not say whether Uganda was receiving any payment or other benefits and how many deportees it would accept. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "Appeal judges ‘struggle to understand’ case by Bruce Lehrmann’s lawyer over distinctions in rape", "url": "https://www.theguardian.com/australia-news/2025/aug/21/bruce-lehrmann-defamation-appeal-lawyer-ntwnfb", "id_key": "45b49efa017ab04c6a86a27f3d5cadfc743e777379f6e3cf198a06130bf381f1", "summary": "Zali Burrows told she has had ‘plenty’ of opportunity to consider issue in case despite repeated requests to adjourn early Appeal judges have “struggled to understand” the case made by Bruce Lehrmann’s lawyer, who says the federal court judgment that her client raped Brittany Higgins in Parliament House in 2019 found the action was a “soft rape” but was characterised in a Network Ten broadcast as a “violent” assault. Sydney criminal solicitor Zali Burrows – representing Lehrmann because, as the court heard Wednesday, he “couldn’t afford” his chosen barrister – submitted that her client was not given an opportunity to be questioned about the type of rape found by Justice Michael Lee. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "ACTU claims of agreement with tech firms over training AI dismissed by creative peak bodies", "url": "https://www.theguardian.com/australia-news/2025/aug/21/actu-claims-of-agreement-with-tech-firms-over-training-ai-dismissed-by-creative-peak-bodies", "id_key": "980446f70f7f1c44ea2af543fc36c57c1b3c3f478650a330207d1dd1ef45ac4b", "summary": "CEO of Australian Recording Industry Association says tech companies should simply comply with existing copyright law Get our breaking news email , free app or daily news podcast The Australian Council of Trade Unions claims that it has reached a “breakthrough” agreement with the tech sector on a model for payment for using creative content in training AI has triggered alarm among bodies representing creative professionals. Speaking on the sidelines of the economic reform roundtable , the secretary of the ACTU, Sally McManus, said “there was discussion with the Tech Council and ACTU about wanting to address the issue of paying creatives, journalists and academics for their data (and) their creative work that they do”. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "There’s an app for that: finding a sunny cafe in Paris, the city of light", "url": "https://www.theguardian.com/technology/2025/aug/21/sunniest-cafe-paris-app-jveuxdusoleil", "id_key": "afc2cf643a569210a31cd8a143540a4885e8a451cea4889e256dae0c3689bfa3", "summary": "Jveuxdusoleil (I want sun) taps into a key part of Parisian culture: drinks on the terrasse, as many fear the extinction of the bistrot In August, Paris is uncharacteristically quiet as hordes of residents scatter to the country’s beaches and coasts for a yearly month of vacation. Businesses close and the city nearly grinds to a halt. Among those who remain, there is an eternal, quintessentially Parisian quest: hunting for a balmy terrasse bathed in sunlight for an evening apéritif. Finding the perfect seat on the pavement outside a cafe may be a matter of a chance stroll or a timely text from a friend. This summer, though, a digital solution has gained popularity in an extremely French instance of the old Apple slogan “there’s an app for that”: Jveuxdusoleil, an app that tracks the sun’s movement through the city’s maze of buildings to pinpoint exactly where you can claim a sunny spot on a terrace for your coffee. It arrives at a precarious moment for this particularly Parisian pursuit. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "Number of asylum seekers housed in UK hotels up 8% on 12 months ago – UK politics live", "url": "https://www.theguardian.com/politics/live/2025/aug/21/kemi-badenoch-conservative-councils-legal-challenge-asylum-hotel-uk-politics-latest-updates-news", "id_key": "322ec890ca14c039e7e41981f5d7a4ec4d213119f264845bb4130e9c613d6e37", "summary": "A total of 32,059 people were being housed temporarily in UK hotels at the end of Labour’s first year in government, Home Office data shows Despite a good month for the public finances , the Treasury won’t be putting in any champagne orders, writes the Guardian’s senior economics writer, Phillip Inman . You can read his analysis, on why radical tax reform may be only way for chancellor Rachel Reeves to balance the books, at the link below: Everyone deserves dignity and security in retirement, but too many retired women have been left without enough to get by. We must make sure that these inequalities are addressed for future generations. That’s why reviving the pensions commission – bringing together unions, employers and independent experts – is a vital step forward. We’re determined to close the gender pensions gap, and the new state pension has already reduced historic inequalities faced by women and low earners. Alongside this, the pensions commission will tackle barriers to close the gender pensions gap in private pensions to ensure women have the dignity and security they deserve in retirement. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:22Z", "source": "Guardian_World", "title": "WH Smith cuts profit forecasts after £30m accounting error", "url": "https://www.theguardian.com/business/2025/aug/21/wh-smith-cuts-profit-forecasts-after-30m-accounting-error", "id_key": "d241a479298b65bb616a0ad00fa9c676fa251d9249b2e20bb4c7d42b70290a7c", "summary": "Retailer launches independent review after mistake relating to North American arm was discovered WH Smith shares have plunged as it cut financial forecasts and launched an independent review after discovering an accounting blunder that led it to overstate profits by £30m. Investors wiped nearly £500m off the retailer’s market value on Thursday morning as it reported the multimillion-pound accounting error, sending the stock price down as much as 36% to £7.06 a share. Continue reading...", "ingested_utc": "2025-08-21T09:38:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:38:45Z", "source": "CryptoNews", "title": "[LIVE] DOGE Price Tracker: Latest Dogecoin News and Price Updates for August 21, 2025", "url": "https://cryptonews.com/news/live-doge-price-tracker-latest-dogecoin-news-and-price-updates-for-august-21-2025/", "id_key": "279e549c43c702c3ef219baeb34c502ca1f5a96ff3658572743be371d742b18d", "summary": "Dogecoin (DOGE) is staging a notable rebound on August 21, 2025, following a sharp intraday low of $0.21. In the 24 hours through 04:00 UTC, DOGE surged approximately 5%, settling around $0.22. This recovery was fueled in part by significant whale activity—on‑chain data reveals that around 680 million DOGE were accumulated throughout August, underscoring growing […] The post [LIVE] DOGE Price Tracker: Latest Dogecoin News and Price Updates for August 21, 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-21T09:38:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:36Z", "source": "NYTimes_Business", "title": "Behind Powell’s Big Gamble in Final Jackson Hole Speech", "url": "https://www.nytimes.com/2025/08/21/business/jerome-powell-fed-jackson-hole.html", "id_key": "bd6ef244368932b86a4b8aaed61ed48fba3657819818efb5e059ed41eb01ac3e", "summary": "Jerome Powell, the Federal Reserve chair, is managing a high-stakes balancing act as he grapples with a cooling labor market, rising inflation and White House pressure to cut interest rates.", "ingested_utc": "2025-08-21T09:40:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:36Z", "source": "NYTimes_World", "title": "Brazil-U. S. Talks on Mining Rare Earth Minerals Are Complicated by Trump’s Tariffs", "url": "https://www.nytimes.com/2025/08/21/world/americas/brazil-us-rare-earth-minerals-tariffs.html", "id_key": "aaf25fba3bc8c1878704c75fa73e886965c25e2652181f88230f0f4101535f14", "summary": "Tensions between President Trump and Brazil’s leader could derail a promising alliance to unlock the world’s second largest reserve of the minerals.", "ingested_utc": "2025-08-21T09:40:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:36Z", "source": "NYTimes_World", "title": "Ukraine Works to Identify 6,000 Bodies Sent From Russia in Makeshift Rail Platform Lab", "url": "https://www.nytimes.com/2025/08/21/world/europe/ukraine-russia-war-exchange-soldier-bodies.html", "id_key": "355663864ff635cf6d2f7ac13a9e7e5f9eabf3dadbd25a048e4dd77b58a089b2", "summary": "The mass return of fallen soldiers is one of the few concrete results of U.S.-orchestrated truce negotiations.", "ingested_utc": "2025-08-21T09:40:36Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:44Z", "source": "NPR_Top", "title": "Try this when your doctor says 'yes' to a preventive test but insurance says 'no'", "url": "https://www.npr.org/2025/08/21/nx-s1-5501533/preventive-care-health-insurance-denial-appeal", "id_key": "40239831cc067ed0064df142c2fe0ed20c32069689a33cd368b7c80ba7a6588b", "summary": "Health insurance wouldn't cover one child's hearing tests. Reporters with Health Care Helpline investigated and share this advice for what to do if preventive care gets denied.", "ingested_utc": "2025-08-21T09:40:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:44Z", "source": "NPR_Top", "title": "A 'black moon' will appear in the sky this weekend, but you won't see it. Here's why", "url": "https://www.npr.org/2025/08/21/nx-s1-5505395/black-new-moon-explainer", "id_key": "c2860026045e3f5be980d35bd007d336964913ce57b89d9b10a8d901bd93176c", "summary": "A black moon is a type of new moon, when the moon is nearly between Earth and the sun.", "ingested_utc": "2025-08-21T09:40:44Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:44Z", "source": "NPR_Business", "title": "Trump calls for resignation of Fed governor in latest line of attack", "url": "https://www.npr.org/2025/08/20/nx-s1-5508276/trump-calls-for-resignation-of-fed-governor-in-latest-line-of-attack", "id_key": "e6e69078997da8aae42fe52d58670f2052cbe66544c34e37856c23b59dddbd79", "summary": "President Trump is calling for the resignation of Federal Reserve governor Lisa Cook after a Trump ally accused her of making false statements on mortgage applications.", "ingested_utc": "2025-08-21T09:40:44Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:45Z", "source": "NPR_World", "title": "Morning news brief", "url": "https://www.npr.org/2025/08/21/nx-s1-5505973/morning-news-brief", "id_key": "84e81c2422c587e109b60dae079509218f6759786fcc97a3214ea9362a4a1add", "summary": "Israeli military to call up 60,000 reservists as it plans to seize Gaza City, Pentagon officials meet with European counterparts over Ukraine security guarantees, Hurricane Erin lashes North Carolina.", "ingested_utc": "2025-08-21T09:40:45Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:47Z", "source": "FT_Home", "title": "Ukrainian attacks disrupt Russian petrol supplies and push up prices", "url": "https://www.ft.com/content/1a22515d-f0e2-4f11-8e1f-6d7b9d30ef13", "id_key": "f556655d9a298bdcc84f7537899f2cf08a067fdd0fc25634eabd915096b560fd", "summary": "Moscow has banned exports following drone strikes on oil refineries", "ingested_utc": "2025-08-21T09:40:47Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:40:48Z", "source": "FT_Markets", "title": "Tech stocks slip as investors rotate towards defensive sectors", "url": "https://www.ft.com/content/b6c96fc7-ab27-42f1-a8f3-aae7937dc939", "id_key": "4338717d3aedbed7f49ef65aabeb83e90d937d94c7e5d818fe1f7c8818894bd6", "summary": "Concerns about durability of AI rally dent sentiment for second day", "ingested_utc": "2025-08-21T09:40:48Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:07Z", "source": "Engadget_All", "title": "The best MacBook for 2025: Which Apple laptop should you buy?", "url": "https://www.engadget.com/computing/laptops/best-macbook-140032524.html?src=rss", "id_key": "de87071369f2f55938ab780b7a5cc0950c3c5353808433025d34b18f8202efd5", "summary": "Apple’s next big to-do for 2025 will be the upcoming iPhone 17 event , which will likely happen some time in September. Historically, the company uses those events to announce new iPhones, AirPods and Apple Watches — MacBooks tend to get their own, separate shindig (though we do expect the new macOS 26 software to come out around that time). For now, the most recent MacBooks are the M4 MacBook Air and the M4 MacBook Pro. Deciding between just two models may seem easy, but there are still plenty of variables to consider before you add one to your cart — screen size, chip capabilities, price and memory configurations will all come into play. We’ve reviewed every MacBook model to come out in the last 17 years or so , so we compiled this guide to help you pick the best MacBook for you. Table of contents Best MacBooks for 2025 What about budget MacBooks? Factors to consider when buying a MacBook MacBooks specs comparison chart Best MacBook FAQs Best MacBooks for 2025 What about budget MacBooks? Historically, Apple kept the previous year’s MacBook Air in its lineup as a sort of budget option. But the company took a different approach with the release of the M4 MacBook Air. Instead of continuing to sell the older model, Apple discontinued the M3 Air and gave its newest computer a $100 price cut. Now, if you can even find a brand new M3 MacBook Air (typically from retailers like Amazon or B&H), it’s often more expensive than the M4 version. During sales like Amazon Prime Day, we’ve seen the newest M4 Air go for as little as $799. That effectively makes our overall pick a budget pick as well. Of course, $800 isn’t exactly a small investment either for college students or others on a budget. Especially when you can find some decent PCs for under $500 . If you’re looking to save even more on a MacBook, we recommend checking out refurbished options directly from Apple , or even third party sellers like BackMarket. There are a few guidelines to keep in mind, which we go over in our refurbished guide , but mainly, you’ll want to shop from a reputable source that has a stated process and offers at least a year-long warranty. Using your old gear as a trade-in will bring down your final cost as well. Factors to consider when buying a MacBook Compared to PCs, Apple computers tend to have more streamlined specifications. The company has long been known for this simplicity, and the M-series “system-on-a-chip” condenses things even further. Prior to the M1 chip, Apple used Intel chips in its laptop and desktop computers. The M2 and M3 generations followed that first chip and currently sells MacBooks equipped with M4-series chips. You’ll find the standard M4 processor in the Air and the base-model Pro and the upgraded M4 Max and M4 Pro chips as options for the MacBook Pro (currently there is no M4 Ultra chip, as there was with the M3 series in the Mac Studio). All M-series chips combine, among other technologies, the CPU, graphics card and unified memory (RAM). Apple’s Neural Engine is included too, which is a specialized group of processor cores that handles machine learning tasks such as image analysis and voice recognition. While a unified chip means you have fewer decisions to make when picking a MacBook, there are still a few factors to consider, including specs like the number of CPU cores, amount of RAM, storage capacity, screen size, and, obviously, price. The finish color may be a minor consideration, but it's worth pointing out that the Pro comes in just two colors (Silver or Space Black) but the Air comes in four hues (Midnight, Starlight, Sky Blue and Silver). CPU cores The lowest-specced chip in a current-lineup MacBook is the standard M4 chip, which is found in all models of the MacBook Air and the base model MacBook Pro 14-inch. That chip houses a 10-core CPU and either an 8- or 10-core GPU. In total, there are three versions of the M4 chip: standard M4, M4 Pro and M4 Max (which are each a step up from their predecessors, the M3, M3 Pro and M3 Max chips). The burliest chip, the M4 Max is built with either a 14- or 16-core CPU and a 32- or 40-core GPU. Cores are, in essence, smaller processing units that can handle different tasks simultaneously. Having more of them translates to the computer being able to run multiple programs and applications at once, while also smoothly processing demanding tasks like video and photo editing and high-level gaming. In short, more cores allow for more advanced computing and better performance. But if your processing power needs fall below professional-level gaming and cinematic video and audio editing, getting the highest number of cores is likely overkill — and after all, more cores equals higher cost and more power usage. Photo by Devindra Hardawar/Engadget RAM Your options for RAM, or in Apple’s terminology, unified memory, varies, but with the switch to the M4 chip in all laptops, the lowest amount of RAM you can get is now 16GB. That’s a necessary spec-bump to accommodate the tech world’s favorite feature of the moment: AI or, in this case, Apple Intelligence (still AI, but Cupertino’s version). The M4 Pro chip has 24 or 48GB memory options, while the M4 Max chip supports 48, 64 or a whopping 128GB of RAM. You’ve likely heard the analogy comparing memory to the amount of workspace available on a literal desktop surface, whereas storage is the amount of drawers you have to store projects to work on later. The larger the worktop surface, the more projects you can work on at once. The bigger the drawers, the more you can save for later. In addition to supporting Apple Intelligence, more RAM is ideal for people who plan to work in multiple apps at once. And the more demanding each program is, the more RAM will be required. Extra memory can also come in handy if you’re the type who likes to have infinite numbers of tabs open on your browser. If your daily workflow doesn’t involve simultaneously using a vast number of memory-intensive programs, you can save yourself money and buy the RAM configuration that you’re most likely to actually use. For a long time, Apple continued to offer MacBooks with just 8GB of RAM, and we recommended upgrading to at least 16GB of RAM. With this being the standard today, grabbing a base model should be fine for most non-pro-level users. One thing to note is that, unlike most PCs, the RAM in a MacBook is not user-upgradable since it’s tied into the system-on-a-chip. If you think you might end up needing more memory, you should go for the spec upgrade up front. Storage capacity (SSD) Storage options range from 256GB of SSD for the base-model MacBook Air and 8TB of storage for the MacBook Pros with the M4 Max chip. If you want to rotate between a long roster of game titles or keep lots of high-res videos on hand, you’ll want more storage. If you’re mostly working with browser- and cloud-based applications, you can get away with a smaller-capacity configuration. That said, we recommend springing for 512GB of storage or more, if it’s within your budget. You’ll quickly feel the limits of a 256GB machine as it ages since the operating system alone takes up a good portion of that space. Having 1TB will feel even roomier and allow for more data storage over the life of your laptop. When Apple announced the iPhone 15 , the company also announced new iCloud+ storage storage plans , with subscriptions that allow up to 12TB of storage shared among your iOS and MacOS devices. You could also transfer files to an external storage device. But if you don’t want to pay for a monthly subscription and prefer the convenience of having immediate access to your files, it’s best to get the highest amount of storage space your budget allows for at the outset. Screen size The MacBook Air comes in 13- or 15-inch sizes. Pro models have either 14- or 16-inch screens. A two-inch delta may not seem like much but, as Engadget’s Nathan Ingraham noted when he reviewed the then-new 15-inch M2-powered MacBook Air, a larger screen \"makes a surprising difference.” That’s especially true if you plan to use your laptop as an all-day productivity machine and won’t be using an external monitor. More space means you can more clearly view side-by-side windows and have a more immersive experience when watching shows or gaming. But screen size is one of the main factors influencing weight. The 13-inch MacBook Air M4 weighs 2.7 pounds, whereas the top-end 16-inch MacBook Pro with the Max chip weighs 4.7 pounds. If you plan to travel a lot or swap your work locations regularly, a smaller screen will make life easier in the long run. All MacBooks feature IPS LCD panels ( in-plane switching , liquid crystal display), which Apple markets as Retina displays. The MacBook Air M4 has a Liquid Retina display and the Pro models have Liquid Retina XDR displays. “Liquid” refers to the way the lighted portion of the display “flows” within the contours of the screen, filling the rounded corners and curving around the camera notch. “XDR” is what Apple calls HDR (high dynamic range). You also get the option of a standard or nano-texture display on the MacBook Pro. The glass, which reduces glare and is also available on the Studio Display, iMac and iPad Pro, comes with a $150 price increase, but if you really don’t like reflections on your screen, it could be worth it. Compared to most other laptops, MacBook displays are notably bright, sharp and lush. But one feature worth pointing out is another Apple marketing term: ProMotion. It’s the company’s term to describe a screen with a higher, 120Hz refresh rate, which results in smoother scrolling and more fluid-looking graphics. Only MacBook Pros offer ProMotion; the Air maxes out at 60Hz, which is perfectly fine for everyday browsing and typical workdays. But if you want buttery-smooth motion from your display, you’ll have to shell out more money for an upgrade. Operating systems Software considerations won’t make much of a difference when deciding between MacBook models — all come with macOS installed. But if you’re switching from, say, a Windows PC, the operating system may be something to factor into your decision — though it’s probably less of an issue than it once was. Now that so much of the work we do on our computers is browser- and cloud-based, the learning curve between the two platforms isn’t as steep. Apps and programs like Gmail perform similarly regardless of what computer you’re using. Apple machines have historically had more limited support of AAA gaming titles, but even that is changing with more AAA games and better graphics coming to Macs. As for macOS, it’s getting better too. With macOS Tahoe 26 , the Spotlight function is more advanced, making it easier to find apps and perform tasks straight from your keyboard. The software also implements Apple's unifying Liquid Glass design for a modern look that looks consistent across iOS and iPad devices. New enhanced iPhone continuity features also make MacBooks and the handset work better together. A revamped Shortcuts app is more powerful as well, giving users custom automations that leverage Apple Intelligence (the company’s own AI). Price When Apple announced the MacBook Air M4, it also delivered a bit of refreshing news: The latest model now starts $100 cheaper than the previous generation. So now, the least expensive MacBook is the 13-inch, M4-powered Air with 16GB of RAM and 256GB of storage for $999. Alternatively, you can spend up to $7,349 for the 16-inch MacBook Pro M4 Max with the nano-texture glass, 128GB of RAM and 8TB of storage. Chip type, screen size, memory and storage capacity all influence the final price, which is why guides like this can help you determine just what you need (and what you don’t) so you can get the most cost-effective machine for you. AppleCare is another cost to consider. The extended warranty plan from Apple covers repairs from accidents and offers free battery replacement and starts at $3.50 per month or $35 per year for MacBooks. We recommend the MacBook Air M4 for most people, and thanks to that $100 price cut, it’s also a good budget option. If you want something even cheaper, we recommend looking at refurbished M-series models from Apple. We think the 14- or 16-inch MacBook Pros are best for professionals. If you have extra money to spare once you’ve picked your machine, we recommend upgrading to at least 512GB of storage to make your machine as future-proof as possible. Of course, if you're just after the M4 chip and want the cheapest route to get it, you might consider the M4 Mac mini , which starts at $599 (though you'll have to supply the screen, mouse and keyboard). Best MacBooks spec comparison chart Product Superlative Tested configuration Tested battery life Rated battery life Apple MacBook Air M4 (13-inch) Best MacBook overall Apple M4, 16GB RAM, 256GB SSD 18.25 hours Up to 18 hours Apple MacBook Pro M4 (14-inch) Best MacBook for creatives Apple M4, 16GB RAM, 512GB SSD 34.25 hours Up to 22 hours Best MacBook FAQs What's the difference between MacBook Air and Pro? Both the MacBook Air and Pro models come with the M4 chip. MBP models have the option of more powerful M4 Pro or M4 Max chips. The Pro has a higher resolution screen with a higher peak brightness that supports up to 120Hz adaptive refresh rates and XDR (extreme dynamic range). The battery life on most Pro models is longer than on the Air models as well. Pro models also have more ports and more speakers. In short, the MacBook Air is aimed at everyday users looking for good productivity and entertainment capabilities, while Pro models are aimed at professionals who need a high-performance computer. What's the difference between macOS and Windows? MacOS is the operating system developed by Apple and used in all of its desktop and laptop computers. It can only be found in hardware made by Apple including MacBooks and iMacs. Microsoft’s Windows operating system can be found in the company’s own Surface laptops as well as computers made by a wide array of manufacturers, like Acer, Asus, Dell and Razer. This article originally appeared on Engadget at https://www.engadget.com/computing/laptops/best-macbook-140032524.html?src=rss", "ingested_utc": "2025-08-21T09:41:07Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:16Z", "source": "AlJazeera_All", "title": "ICE agents use pepper spray while detaining protester in San Francisco", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/21/ice-agents-use-pepper-spray-while-detaining-protester-in-san-francisco?traffic_source=rss", "id_key": "15174153a88d70ba6ff3696095bbe05f6fb8b38661da7b0cef1f52a6af8470cd", "summary": "Federal immigration agents have been filmed using pepper spray and zip ties against a protester in San Francisco.", "ingested_utc": "2025-08-21T09:41:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:16Z", "source": "AlJazeera_All", "title": "Match abandoned in Argentina with 10 hurt, 90 arrested as violence erupts", "url": "https://www.aljazeera.com/sports/2025/8/21/match-abandoned-in-argentina-with-ten-hurt-90-arrested-as-violence-erupts?traffic_source=rss", "id_key": "1992232f120f2d5490a89b46ff935838d9beaf4d87d55d1f8047b84e683a82b2", "summary": "The match in Buenos Aires between Independiente and visiting Universidad de Chile was abandoned in the second half.", "ingested_utc": "2025-08-21T09:41:16Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:22Z", "source": "FinancialPost_Business", "title": "DSR Bank Development Group Welcomes Søren Elbech and Matthew Westerman to Its Board", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/dsr-bank-development-group-welcomes-soren-elbech-and-matthew-westerman-to-its-board", "id_key": "d99e1fa31c36e9d2ca9d2dac80f19b697d5d9ef88241af431a14175d7fdd8229", "summary": "LONDON — The Defence, Security and Resilience Bank (DSRB) Development Group today announced the appointment of Søren Elbech and Matthew Westerman to its Board, strengthening the institution’s financial and capital markets leadership as it advances toward formal establishment. Søren Elbech brings unique multilateral banking expertise to the DSRB Board. Since September 2023, Elbech serves as […]", "ingested_utc": "2025-08-21T09:41:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:22Z", "source": "FinancialPost_Business", "title": "Nexstar Media Group buying Tegna in deal worth $6.2 billion", "url": "https://financialpost.com/pmn/nexstar-media-group-buying-tegna-in-deal-worth-6-2-billion", "id_key": "d85746149473c4e9b2f0052c24c62f880df551ac75d56df193eec8f86c974a1e", "summary": "NEW YORK (AP) — Nexstar Media Group is buying broadcast rival Tegna for $6.2 billion, bringing together two major players in U.S. television and the country’s local news landscape. If the transaction is approved, Nexstar will pay $22 in cash for each share of Tegna’s outstanding stock. And the regulatory greenlight could be likely under […]", "ingested_utc": "2025-08-21T09:41:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:22Z", "source": "FinancialPost_Business", "title": "Precore Gold Announces up to C$2 Million Private Placement", "url": "https://financialpost.com/globe-newswire/precore-gold-announces-up-to-c2-million-private-placement", "id_key": "d58f3b8001eca53c19a7ff032c3ab48737f15e03e95b14a0eb3e94ee7e6fa449", "summary": "VANCOUVER, British Columbia, Aug. 21, 2025 (GLOBE NEWSWIRE) — Precore Gold Corp. (CSE: PRCG) (the “Company” or “Precore Gold”) is pleased to announce that it has arranged, subject to receipt of regulatory approval, a non-brokered private placement (the “Private Placement”) to raise gross proceeds of up to $2,000,000. The Private Placement will consist of the […]", "ingested_utc": "2025-08-21T09:41:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:37Z", "source": "MIT_TechReview", "title": "On the ground in Ukraine’s largest Starlink repair shop", "url": "https://www.technologyreview.com/2025/08/21/1122035/ukraines-largest-starlink-repair-shop/", "id_key": "d4e33ebaee2120bf7eeaff212d633da6e72326343b54f5667247e2ac013fde59", "summary": "Oleh Kovalskyy thinks that Starlink terminals are built as if someone assembled them with their feet. Or perhaps with their hands behind their back. To demonstrate this last image, Kovalskyy—a large, 47-year-old Ukrainian, clad in sweatpants and with tattoos stretching from his wrists up to his neck—leans over to wiggle his fingers in the air…", "ingested_utc": "2025-08-21T09:41:37Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T09:41:37Z", "source": "HackerNews_Top", "title": "Basic dependency injection in OCaml with objects", "url": "https://gr-im.github.io/a/dependency-injection.html", "id_key": "12e30e9e18e7c0c1f9bd437c2a01efe22891015f7b5f0a81374683c2a0df54e1", "summary": "Comments", "ingested_utc": "2025-08-21T09:41:37Z"}
