{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "BBC_World", "title": "Crime in DC: What do the figures say and how safe do people feel?", "url": "https://www.bbc.com/news/videos/cewynn7krj1o?at_medium=RSS&at_campaign=rss", "id_key": "04e09d3df0cc41ad291244c4f3c93c3273129e5c5471078fa329e11fc5b79475", "summary": "National Guard troops have been seen reporting for duty in Washington DC as President Trump takes over the city’s police force.", "ingested_utc": "2025-08-14T21:03:50Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "BBC_Business", "title": "Economic woes dominate as Bolivia prepares to go to the polls", "url": "https://www.bbc.com/news/articles/c62nn665g32o?at_medium=RSS&at_campaign=rss", "id_key": "e1f8286a9274c3d145a61be75a7559f19703d59627b7dcefd5c9aaf240185d0f", "summary": "The South American country is dealing with very high inflation ahead of its latest general election.", "ingested_utc": "2025-08-14T21:03:50Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "BBC_Business", "title": "The UK car industry is at a tipping point - can it be saved?", "url": "https://www.bbc.com/news/articles/c23p028p200o?at_medium=RSS&at_campaign=rss", "id_key": "c11edc135b5212e2b53f24480436514fb8db2a11e5cfe2c59a57cc01703e49cb", "summary": "Tariffs, Brexit, pandemic havoc... All of this caused short-term disruption - but the impact concealed a deeper problem for the UK automotive industry", "ingested_utc": "2025-08-14T21:03:50Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-14", "source": "BBC_Business", "title": "AOL ends dial-up service after more than 30 years", "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&at_campaign=rss", "id_key": "deb820b66bc010cbb9510ad68e0cba2e6308f86fda312a3bd01a9f61711ad11a", "summary": "The internet service which soared in popularity in the 1990s will come to an end from 30 September", "ingested_utc": "2025-08-14T21:03:50Z"}
{"published_utc": "2025-08-07", "retrieved_date": "2025-08-14", "source": "BBC_Business", "title": "Why firms are merging HR and IT departments", "url": "https://www.bbc.com/news/articles/cy0w8gvq84xo?at_medium=RSS&at_campaign=rss", "id_key": "fd08cdb7aa8965144a4079bc11afecdd452a71d0fb925fc8f1d91f312d5ba070", "summary": "The emergence of AI is spurring some firms to make their HR and IT departments work closer together.", "ingested_utc": "2025-08-14T21:03:50Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-14", "source": "BBC_Technology", "title": "Nvidia and AMD to pay 15% of China chip sales to US", "url": "https://www.bbc.com/news/articles/cvgvvnx8y19o?at_medium=RSS&at_campaign=rss", "id_key": "ec8ede94954e7e5571e814819c55382c9cfebdafbb12184f89cf381f95c56b07", "summary": "The chip giants will hand revenues to the US government in exchange for licences to export to China.", "ingested_utc": "2025-08-14T21:03:51Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "US prices continued rise in July as Trump tariffs impact consumer costs", "url": "https://www.theguardian.com/business/2025/aug/12/inflation-cpi-trump-tariffs", "id_key": "d34b3a36d6158b786fadd6fb75fc444406a828618f4df93991233fb93562d42f", "summary": "Prices were 2.7% higher last month compared with a year ago, and core inflation went up at a higher pace than what was seen in June US prices continued to rise in July, according to key economic data released on Tuesday, as Donald Trump’s international tariffs shakeup started to impact consumer costs. Prices were 2.7% higher last month compared with a year ago, according to the consumer price index (CPI), which measures the prices of a basket of goods and services. Though inflation dipped down in the spring, the annualized inflation rate jumped up 0.4% since April. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-08", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Parents in the US: how are tariffs affecting prices for back-to-school supplies?", "url": "https://www.theguardian.com/us-news/2025/aug/08/back-to-school-trump-tariffs", "id_key": "151a5bc22789cd82d417ac297f886e65252d5698af9a3a8d5ac9d46451855fb2", "summary": "We want to hear from families about how Trump’s tariffs are affecting the costs of supplies for the upcoming school year We want to hear from families in the US. As the new school year approaches, have you noticed rises in the cost of back-to-school items? How have prices changed recently? What has been the effect on your family? Since taking office in January, Donald Trump’s tariff policies have upended trading relationships, rattled global markets and stoked fears of inflation. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Trump hits out at Goldman Sachs chief over ‘bad’ tariff prediction", "url": "https://www.theguardian.com/us-news/2025/aug/12/trump-goldman-sachs-chief-david-solomon", "id_key": "0171e68c8b59fb3cfce1a43f8ac2d74f6d8bfc6f58c9eccb3433e18e9a187abd", "summary": "President questions whether David Solomon should lead bank and says he should return to former hobby of DJing Donald Trump hit out at Goldman Sachs CEO David Solomon on Tuesday, saying the bank had been wrong to predict tariffs would hurt the economy and questioning whether Solomon should lead the Wall Street institution. In a post on Truth Social, Trump said it was mostly foreign companies and governments absorbing the cost of his tariffs. “But David Solomon and Goldman Sachs refuse to give credit where credit is due. They made a bad prediction...on both the Market repercussion and the Tariffs themselves,” he wrote. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Crypto mogul Do Kwon pleads guilty to fraud for $40bn market collapse", "url": "https://www.theguardian.com/technology/2025/aug/12/crypto-do-kwon-fraud-guilty", "id_key": "b11b14443d71bf67cbe3b9bb1e21d26277a819c78344f8d474b62340b478c50c", "summary": "Terraform Labs co-founder, pleading guilty to two charges, was accused of misleading investors in 2021 about TerraUSD Do Kwon, the South Korean entrepreneur behind two cryptocurrencies that lost an estimated $40bn in 2022 and caused the market to implode, pleaded guilty on Tuesday to two US charges of conspiracy to defraud and wire fraud. Kwon, 33, who co-founded Singapore-based Terraform Labs and developed the TerraUSD and Luna currencies, entered the plea at a federal court hearing in New York. He had pleaded not guilty in January to a nine-count indictment charging him with securities fraud, wire fraud, commodities fraud and money-laundering conspiracy. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Trump announces another 90-day pause on China tariffs", "url": "https://www.theguardian.com/us-news/2025/aug/11/trump-china-tariffs-deal-deadline", "id_key": "6a738763f432dcdbc5aaac075c62c318783297fa0fef59bfd61ecbd178358205", "summary": "President signs executive order extending deadline for higher tariffs hours before agreement was due to expire Donald Trump has once again delayed implementing sweeping tariffs on China , announcing another 90-day pause just hours before the last agreement between the world’s two largest economies was due to expire. On Monday, the US president signed an executive order extending the deadline for higher tariffs on China until 10 November, officials confirmed to Reuters. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Nvidia and AMD agree to pay 15% of China chip export revenues to US", "url": "https://www.theguardian.com/technology/2025/aug/10/nvidia-amd-china-chip-sale-revenues", "id_key": "bfd85a527d9492e07178b065ea2ec14c9c52ce4b68d84462b25711d38dcf9155", "summary": "Unprecedented deal, an apparent reversal of security restrictions, is in return for licences to sell to China The chipmakers Nvidia and AMD have agreed to give the US government 15% of their revenue from advanced chips sold to China in return for export licences to the key market. The unprecedented move, an apparent reversal of US national security restrictions on the chip sales, signalled an easing in the US-China trade war. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-09", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Yellowstone, Top Gun, Chalamet: what will the Paramount-Skydance merger mean for film and TV?", "url": "https://www.theguardian.com/film/2025/aug/09/paramount-skydance-merger-tv", "id_key": "5dc0c77bc954fea9a20d338b2494435b39049228e0ac56bdccaff9eed325aec6", "summary": "The controversial $8bn deal was finalized this week and while details are scarce, the future is set to look very different for one of the biggest Hollywood studios The merger between Paramount and Skydance has finally been completed , with various roadblocks (including Stephen Colbert , apparently, as well as the related 60 Minutes settlement /bribery) cleared from the path of a new entity called Paramount, A Skydance Corporation. It’s an appropriately franchise-y moniker for a merger between a major Hollywood studio and a company that made its bones as a constant financer of some of its biggest movie series. This ends (for now) years of speculation over what might be done with Paramount , a global conglomerate that was nonetheless considered on less sure footing than its fellow remaining big five studios, Disney, Sony, Universal and Warner Bros. (Well, maybe not the recently embattled Warner Bros, though they seem to have gotten a major reprieve with their killer 2025 slate) Skydance honcho David Ellison is the new Paramount CEO. The new co-chairs of Paramount Pictures will be Skydance executive Dana Goldberg and former Sony executive Josh Greenstein. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-09", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "‘It’s missing something’: AGI, superintelligence and a race for the future", "url": "https://www.theguardian.com/technology/2025/aug/09/its-missing-something-agi-superintelligence-and-a-race-for-the-future", "id_key": "609016e59b43e5e5d4b61c6435e0b9b41f43a3782a44436f267fac2966f98597", "summary": "As US and Chinese tech giants chase artificial general intelligence, experts warn the hype may be outrunning the science A significant step forward but not a leap over the finish line . That was how Sam Altman, chief executive of OpenAI, described the latest upgrade to ChatGPT this week. The race Altman was referring to was artificial general intelligence (AGI), a theoretical state of AI where, by OpenAI’s definition, a highly autonomous system is able to do a human’s job. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Use of AI could worsen racism and sexism in Australia, human rights commissioner warns", "url": "https://www.theguardian.com/technology/2025/aug/13/ai-artificial-intelligence-racism-sexism-australia-human-rights-commissioner", "id_key": "22343a5a3868773b20b5600ec108cc15f05a84960a9827b499f318570f2ca101", "summary": "Labor divided on how to respond to the emerging technology as media and arts groups fear ‘rampant theft’ of intellectual property Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast AI risks entrenching racism and sexism in Australia, the human rights commissioner has warned, amid internal Labor debate about how to respond to the emerging technology. Lorraine Finlay says the pursuit of productivity gains from AI should not come at the expense of discrimination if the technology is not properly regulated. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Dairy farmers say worker shortage is threatening UK food security", "url": "https://www.theguardian.com/environment/2025/aug/13/dairy-farmers-worker-shortage-threatening-uk-food-security", "id_key": "1cba2ce04a47bf44291721bdfa16fb7b34a2c4c779c36d7543f9958a59d3a607", "summary": "The Arla cooperative says five in six farmers receive very few or zero applications for job vacancies Dairy farmers have warned that a long-running shortage of workers, exacerbated by Brexit and the pandemic, has put the UK’s food security under pressure . Five in six farmers who have looked for workers said they have received very few or zero applications from qualified people for their job vacancies, according to a survey of dairy producers by Arla, the UK’s largest dairy cooperative and the owner of the Lurpak and Cravendale brands. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Swarm of jellyfish shuts nuclear power plant in France", "url": "https://www.theguardian.com/world/2025/aug/11/swarm-of-jellyfish-shuts-nuclear-power-plant-in-france", "id_key": "3fb5832628005cae0a8e9b800d7f7944b2d314d22d7dc464e89b1c8ad9e229e4", "summary": "‘Massive and unpredictable’ swarm entered filter drums that pull in water, Gravelines operator EDF says Business live – latest updates A swarm of jellyfish has forced the shutdown of one of the largest nuclear power plants in France after entering the water intake systems used to cool the coastal reactors. Three reactors at the Gravelines nuclear power plant in northern France shut down automatically late on Sunday, according to the French nuclear company EDF, after the filter drums of the pumping stations became packed with a “massive and unpredictable” swarm of the marine creatures. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-08", "retrieved_date": "2025-08-14", "source": "Guardian_Business", "title": "Banker Bao Fan reportedly released from Chinese detention after two years", "url": "https://www.theguardian.com/world/2025/aug/08/chinese-dealmaker-bao-fan-released-from-detention-after-two-years", "id_key": "1a02cd66def336a8a476ed2e2cb6ae3e2a032c3707b5936931eb975214fa24a5", "summary": "High-profile founder of China Renaissance Holdings went missing in 2023, sending company’s share price plunging Bao Fan, a star dealmaker and the founder of the boutique investment bank China Renaissance Holdings, has been released more than two years after being detained by Chinese authorities, according to a person with knowledge of the matter. China Renaissance sent shock waves through the country’s financial sector in 2023 when it announced it was unable to contact Bao, who founded the bank in 2005 with two others and still owns nearly 49% of its issued shares. The company’s share price tanked as a result of his detention. Continue reading...", "ingested_utc": "2025-08-14T21:03:52Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Jimmy Lai trial: closing arguments in Hong Kong delayed by aftermath of Typhoon Podul", "url": "https://www.theguardian.com/world/2025/aug/14/jimmy-lai-trial-hong-kong-closing-arguments", "id_key": "57324acfdec2a87516fee76a7e2314210557e423d4857d2e58d18031be5fc4ba", "summary": "Lai has been detained since December 2020, with western nations and rights groups calling for his release The closing arguments in the national security trial against jailed Hong Kong media mogul Jimmy Lai were postponed on Thursday after the Asian financial hub issued its highest-level “black” weather warning, stemming from ex-typhoon Podul. Queues had formed outside the court for the public gallery, but torrential rain saw the closing arguments in the trial, which began in late 2023, delayed. Proceedings are expected to resume on Friday. Continue reading...", "ingested_utc": "2025-08-14T21:03:53Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Australia news live: business council plan to cut ‘$110bn red tape’ including building codes and environmental assessments", "url": "https://www.theguardian.com/australia-news/live/2025/aug/15/australia-news-live-business-council-regulation-red-tape-reform-productivity-summit-anthony-albanese-jim-chalmers-pacific-war-anniversary-ntwnfb", "id_key": "e788c1b1e79d54d2dbbed95fcfa27b8e5c9c03f2783996bead8084466ebbf5f9", "summary": "The Business Council of Australia outlines proposals to cut regulation and spark growth before economic summit. Follow today’s news live Get our breaking news email , free app or daily news podcast A major university has announced a plan to “temporarily suspend” 140 courses across six faculties. UTS, in a media release , said the courses being suspended for new intake were those which have low student enrolments. The suspensions will be in place until a decision is made on the future of these courses following consultation with staff and unions through a change proposal process. Continue reading...", "ingested_utc": "2025-08-14T21:03:53Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Minns unveils plan to fight anti-Muslim hate: ‘Naked racism and Islamophobia have no place in our state’", "url": "https://www.theguardian.com/australia-news/2025/aug/15/minns-unveils-plan-to-fight-anti-muslim-hate-naked-racism-and-islamophobia-have-no-place-in-our-state-ntwnfb", "id_key": "2ef03aca69d2a628273b4f624e2f39e617ed350000c42619c29dfc912fa6ee70", "summary": "Exclusive: $1m grant comes after reports of rising Islamophobia and a huge turnout for the Sydney Harbour Bridge march Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The Minns government will establish a $1m program to combat anti-Muslim hate, including establishing a support hotline for victims and a program to build awareness of Islamophobia. The initiative will fund a support hotline for those experiencing Islamophobia and a case management system for victims of abuse so authorities and the community have better information about what behaviours are being experienced. Continue reading...", "ingested_utc": "2025-08-14T21:03:53Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Teenage boy arrested after death of 13-year-old girl in West Yorkshire", "url": "https://www.theguardian.com/uk-news/2025/aug/14/teenage-boy-arrested-death-girl-huddersfield-west-yorkshire", "id_key": "a3fc226981b3b80e1cab39bc32b97ca1b4c89adc0103b2b3578a05a7636a61e2", "summary": "Sixteen-year-old from Huddersfield held on suspicion of murder and rape A teenager has been arrested on suspicion of rape and murder after the death of a 13-year-old girl in West Yorkshire, police have said. Officers were called to a flat on Sheepridge Road in Huddersfield on Monday night to reports that a girl was unresponsive. West Yorkshire police said the victim died in hospital and her death was being treated as “unexplained” after a postmortem examination. Continue reading...", "ingested_utc": "2025-08-14T21:03:53Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "California governor calls for a special election to introduce new US House maps – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/14/donald-trump-washington-dc-control-extend-time-us-politics-latest-updates-news", "id_key": "47c9e1a2ea74df3e16371f378671a24c1c3a051f96f428b4fa1a375ccddf50ee", "summary": "Gavin Newsom announces plans to ask voters to approve new congressional maps in response to a redistricting plan by Texas Melania Trump has demanded that Hunter Biden retract comments linking her to the sex offender Jeffrey Epstein and has threatened to sue if he does not. Biden, the son of the former president Joe Biden, alleged in an interview this month that Epstein introduced the first lady to Donald Trump . Continue reading...", "ingested_utc": "2025-08-14T21:03:53Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Guardian_World", "title": "Trump reportedly called Norwegian minister ‘out of the blue’ to ask about Nobel prize", "url": "https://www.theguardian.com/us-news/2025/aug/14/trump-nobel-prize-norway", "id_key": "71c09174ba96147b2e44e0b7083460ddab5ed4d07da1099ab2e1a05a9a396662", "summary": "US president told Norway’s finance minister he wants the Nobel peace prize, according to the Norwegian press Donald Trump cold-called Norway’s finance minister last month to ask about a nomination for the Nobel peace prize, Norwegian press reported on Thursday. The Norwegian outlet Dagens Næringsliv , citing unnamed sources, reported: “Out of the blue, while finance minister Jens Stoltenberg was walking down the street in Oslo, Donald Trump called … He wanted the Nobel prize – and to discuss tariffs.” Continue reading...", "ingested_utc": "2025-08-14T21:03:53Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "MarketWatch_Bulletins", "title": "S&P 500 logs fresh record, Dow and Nasdaq end lower on hot PPI inflation reading", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=e73f0ddb-51c4-44f1-b16e-2b6a0982f37e&mod=mw_rss_bulletins", "id_key": "3cc8b24bacccec12e387f7c7bbedb141df57b571245499df1eb3e5942132e70f", "summary": "", "ingested_utc": "2025-08-14T21:04:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "MarketWatch_Bulletins", "title": "Stocks clawing back losses in final hour despite hot PPI inflation — follow live", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=53a9f339-144b-47f8-a820-64d57d7cd802&mod=mw_rss_bulletins", "id_key": "8b597ae174efbd326fe8cb7033ab5b79f694b2618689428602c6a842a091ec91", "summary": "", "ingested_utc": "2025-08-14T21:04:04Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "NYTimes_Business", "title": "Uncle Nearest Whiskey Is in a Fiscal Bind", "url": "https://www.nytimes.com/2025/08/14/dining/uncle-nearest-whiskey-receivership.html", "id_key": "8407c2470f5401444591d4eeb7c7a5a65fd7637b71da5f5ecca411a60c5df3dd", "summary": "A federal judge has ordered that Uncle Nearest be placed in receivership, after a lender claimed the company’s finances are in disarray.", "ingested_utc": "2025-08-14T21:04:11Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NYTimes_Business", "title": "Mario Paglino, 52, and Gianni Grossi, 54, Die; Designers Made Barbies Into Art", "url": "https://www.nytimes.com/2025/08/13/arts/design/mario-paglino-gianni-grossi-dead.html", "id_key": "2198978d523c39bd33ad2215280d0ead69a00cdfd7743a408a44d01a14286589", "summary": "They transformed dolls into one-of-a-kind pieces that sold for thousands of dollars. A married couple, they died in a car crash in Italy.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "NYTimes_Business", "title": "Do Kwon, Crypto Founder Who Caused 2022 Market Crash, Pleads Guilty to Fraud", "url": "https://www.nytimes.com/2025/08/12/technology/do-kwon-crypto-fraud-guilty-plea.html", "id_key": "f8ee4aa684e1766668e85d6a6c32a541c045d82c72c44c976245e62f9733efcc", "summary": "Do Kwon, who created the Luna and TerraUSD cryptocurrencies that collapsed in 2022, pleaded guilty to two counts of fraud, capping a spectacular fall from grace.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-14", "source": "NYTimes_Business", "title": "Brazil Clamped Down on Big Tech. Trump’s Tariffs Could Change That.", "url": "https://www.nytimes.com/2025/08/11/world/americas/brazil-big-tech-trump-tariffs.html", "id_key": "a615f9246b0d5bab27422cc72b5066b086d31d425ae37b6862b337f73cb54927", "summary": "With President Trump on their side, U.S. technology companies now have more leverage in Brazil, where they seek to influence new rules policing their platforms.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "Russia Seeks to Add Trade and Arms Control Into Trump-Putin Talks", "url": "https://www.nytimes.com/2025/08/14/world/europe/trump-putin-talks-russia-trade-arms-control.html", "id_key": "0dffaad767ad7a2d2b2f396cc09b81e2ce2cbcb27f992385f60588cb896c4126", "summary": "Over recent months, the Kremlin has been trying to move the diplomatic focus away from Ukraine to bilateral issues, such as trade and strategic stability.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "Plan for Israeli Settlements Advances and Will ‘Bury’ Palestinian Statehood, Minister Vows", "url": "https://www.nytimes.com/2025/08/14/world/middleeast/israel-smotrich-settlements-palestinian-state.html", "id_key": "977993fe16b07285c4e41256f63db5a6b1a1b2a14e3cc5869853dfb04d4114af", "summary": "Bezalel Smotrich, the finance minister, said on Thursday that a plan to significantly expand a settlement near occupied East Jerusalem had won approval. But a procedural step remained.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "U.S. Pilot Stranded in Antarctica Says It’s ‘Isolating and Lonely’", "url": "https://www.nytimes.com/2025/08/13/world/americas/ethan-guo-pilot-antarctica-chile.html", "id_key": "5a6a1c60dff836e7ab2104fc7af65344c67d6133495b71a3bfb369bdd0a84364", "summary": "Ethan Guo, a content creator, said that he has been effectively trapped at a Chilean base since June. The authorities had said he landed there without permission.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "Top Iranian Official Visits Lebanon as Hezbollah Bucks Calls to Disarm", "url": "https://www.nytimes.com/2025/08/13/world/europe/iran-lebanon-hezbollah-disarm.html", "id_key": "a9d4fc042e87a54a2be153cd3ed91fd8c6b8e8eeadcc8ca92746b8fdde6dd02b", "summary": "The visit by Ali Larijani, the head of Iran’s top security body, came as the Lebanese government moves to disarm Hezbollah, the militant group that has long been Tehran’s most powerful regional ally.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "Dozens of Migrants Drown Off Lampedusa, Italy", "url": "https://www.nytimes.com/2025/08/13/world/europe/migrants-drown-lampedusa-italy.html", "id_key": "9526e10122d75ad076650a51c9e99b4bb4b15dec369abd9301139fa5c5dded5b", "summary": "Sixty people survived after two boats with nearly 100 migrants capsized. The causes of the shipwrecks were not clear, Italian officials and U.N. agencies said. The death toll is likely to grow.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "U.K. Secretly Spent $3.2 Million to Stop Journalists From Reporting on Data Breach", "url": "https://www.nytimes.com/2025/08/13/world/europe/uk-data-breach-afghan.html", "id_key": "7c286ef82a4f1afd74ca169c3b83c4d58280774c34103f29d2f4ab1433fff650", "summary": "After British authorities accidentally exposed information about 19,000 Afghans, the government sought a legal order preventing disclosure of the breach.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "JD Vance Meets Nigel Farage, Another Right Wing Populist, on Trip to UK", "url": "https://www.nytimes.com/2025/08/13/world/europe/jd-vance-nigel-farage-reform-uk.html", "id_key": "ae4e65d69cd80043eae322fd13efc34d6ae8b76f807e56bacc6cc5a089defe87", "summary": "JD Vance, the vice president, sat down with Nigel Farage, a longtime supporter of President Trump whose party, Reform U.K., is leading in British polls.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "NYTimes_World", "title": "Wisconsin Woman Convicted in Failed Assassination Attempt in Birmingham, England", "url": "https://www.nytimes.com/2025/08/12/world/europe/aimee-betro-assassination-attempt-conviction.html", "id_key": "9e979e14de8694ac38c1d66196726d3e2aa567635dc8071fa36486c98d156e8c", "summary": "Aimee Betro, 45, was convicted on Tuesday of attempting to shoot a man near Birmingham, England in 2019.", "ingested_utc": "2025-08-14T21:04:12Z"}
{"published_utc": "2025-08-07", "retrieved_date": "2025-08-14", "source": "NYTimes_Economy", "title": "Stocks End Mixed, as Investors Take Steeper Tariffs in Stride", "url": "https://www.nytimes.com/2025/08/07/business/economy/trump-tariffs-stock-market.html", "id_key": "2df1eca9dd57479532ab90ce3ec3526cb78786f60b1ae3a08f19201ae110758d", "summary": "The S&P 500 ended the day 0.1 percent lower, a muted move compared to the upheaval when tariffs were first announced in early April.", "ingested_utc": "2025-08-14T21:04:13Z"}
{"published_utc": "2025-08-07", "retrieved_date": "2025-08-14", "source": "NYTimes_Economy", "title": "Staggering U.S. Tariffs Begin as Trump Widens Trade War", "url": "https://www.nytimes.com/2025/08/07/business/economy/trump-tariffs-trade-war.html", "id_key": "921716c0ee8f07f1b94a215ace5fce999e935e369a33261d6a44fedd3e9818e1", "summary": "The duties, which the president announced last week, took effect for about 90 countries just after midnight.", "ingested_utc": "2025-08-14T21:04:13Z"}
{"published_utc": "2025-08-06", "retrieved_date": "2025-08-14", "source": "NYTimes_Economy", "title": "Trump to Double India’s Tariff to 50% Over Russian Oil Purchases", "url": "https://www.nytimes.com/2025/08/06/us/politics/trump-india-tariffs-russia-oil.html", "id_key": "2d0084bef60513896fd57a9f70036c57efd69b254787330c1ee71c6a61973fce", "summary": "Tariffs on Indian exports to the United States will surge to 50 percent by late August, as part of an effort by President Trump to pressure Russia into resolving its war in Ukraine.", "ingested_utc": "2025-08-14T21:04:13Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "NYTimes_Technology", "title": "Hidden Inside Our Electronics, Tiny Doodles From Another Era", "url": "https://www.nytimes.com/2025/08/12/technology/silicon-chips-doodles.html", "id_key": "c668e0ee77b84d208714ea69286594e1ea2e4eade8255f84f8c1e0f9724c1115", "summary": "Decades ago, designers etched microscopic doodles onto silicon chips to leave their marks. Now, techno-archaeologists search for the tiny fossils.", "ingested_utc": "2025-08-14T21:04:14Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "NYTimes_Technology", "title": "Elon Musk Threatens Lawsuit Against Apple Over Claims It Favors OpenAI", "url": "https://www.nytimes.com/2025/08/12/technology/elon-musk-apple-openai-xai.html", "id_key": "af76e3358426ba3980a8b58fad91a98c2cd868d061d5ccfa82d6112ff8904a7a", "summary": "The billionaire said in posts on X that the consumer tech giant was violating antitrust laws by giving preferential treatment to OpenAI on the App Store.", "ingested_utc": "2025-08-14T21:04:14Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NYTimes_Technology", "title": "Goodbye, $165,000 Tech Jobs. Student Coders Seek Work at Chipotle.", "url": "https://www.nytimes.com/2025/08/10/technology/coding-ai-jobs-students.html", "id_key": "f537c56c96b4086c91386aef87b4e572c0a66aaec814bdbc6efd62c0ea843d05", "summary": "As companies like Amazon and Microsoft lay off workers and embrace A.I. coding tools, computer science graduates say they’re struggling to land tech jobs.", "ingested_utc": "2025-08-14T21:04:14Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "NPR_Top", "title": "D.C. clergy slam federal takeover: 'Fear is not a strategy for safety'", "url": "https://www.npr.org/2025/08/14/nx-s1-5502749/d-c-clergy-slam-federal-takeover", "id_key": "1131b143e918b3b8f2750f7f2b93bfc1c4fff207a5fe72c35da40d5250acfd1e", "summary": "A group of religious leaders in Washington, D.C. is criticizing President Donald Trump's federal takeover of the District's police force, saying his rhetoric is dehumanizing and counterproductive.", "ingested_utc": "2025-08-14T21:04:19Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "NPR_Business", "title": "Ford and the promise of cheaper EVs", "url": "https://www.npr.org/2025/08/12/nx-s1-5498788/ford-and-the-promise-of-cheaper-evs", "id_key": "ce0f0fc7a74c109c47088fcfa0062dbcafe4b6efa2fc0b988a6869767fa21cac", "summary": "Ford announced they're putting billions into a Kentucky automotive plant to retool it to make EVs, starting with a midsize pickup that they say will be in the $30k price range.", "ingested_utc": "2025-08-14T21:04:20Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NPR_Economy", "title": "Argentina is an example of what happens when a country manipulates inflation data", "url": "https://www.npr.org/2025/08/13/nx-s1-5500542/argentina-is-an-example-of-what-happens-when-a-country-manipulates-inflation-data", "id_key": "cd64788a4d77ca25f6de5a179038ef7064739d2f9ceef10fe243b7bae796ceef", "summary": "Trump fired the Bureau of Labor Statistics head. In Argentina, the government manipulated the inflation rate. Economists went rogue to calculate the real rate, and people lost trust in the numbers.", "ingested_utc": "2025-08-14T21:04:21Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NPR_Economy", "title": "President Trump is upending global trade as we know it. What comes next?", "url": "https://www.npr.org/2025/08/13/nx-s1-5496675/president-trump-is-upending-global-trade-as-we-know-it-what-comes-next", "id_key": "9d0dd9f76565002a48de672429acc37bc5d833ccc91305c7c5da7ced1884742c", "summary": "NPR's Ari Shapiro speaks with former US trade representative and Council on Foreign Relations President Michael Froman about how global trade moves forward in the midst of President Trump's tariffs.", "ingested_utc": "2025-08-14T21:04:21Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "NPR_Economy", "title": "Inflation remains elevated as Trump's tariffs take hold", "url": "https://www.npr.org/2025/08/12/nx-s1-5499344/inflation-consumer-prices-cpi-tariffs", "id_key": "192a5304dbe88a1bcc2c73e9027c30b19f7929d677120b552b73aa930b6e83e5", "summary": "Inflation remained elevated last month as President Trump's tariffs continued to make their way into the prices that consumers pay. The average cost of living in July was up 2.7%.", "ingested_utc": "2025-08-14T21:04:21Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NPR_World", "title": "How Alaska Went from Russian Colony to U.S. State", "url": "https://www.npr.org/2025/08/13/nx-s1-5501585/how-alaska-went-from-russian-colony-to-u-s-state", "id_key": "7c08cbb1cf0e4e845835c01758c9535001ea22a37068bf2493ec7f98eab323a3", "summary": "All eyes are on Alaska ahead of President Trump and Russian President Vladimir Putin’s meeting there on Friday. We revisit the history of Russia’s sale of the Alaskan territory to the U.S.. NPR’s Greg Myre describes how some Russians still question whether Alaska is truly American.", "ingested_utc": "2025-08-14T21:04:21Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "NPR_World", "title": "A new antiwar camp is emerging in Israel. It includes soldiers and former soldiers", "url": "https://www.npr.org/2025/08/13/nx-s1-5495235/a-new-antiwar-camp-is-emerging-in-israel-it-includes-soldiers-and-former-soldiers", "id_key": "15d065c81a5a4e1e44431875cf706b9ee99618ce27c8bdc475949c7649e3419d", "summary": "Within Israel's prime minister pushing for a full occupation of Gaza, some of Israel's exhausted soldiers are pushing back and calling for an end to the war.", "ingested_utc": "2025-08-14T21:04:22Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-14", "source": "NPR_Technology", "title": "Ford says it will roll out a cheaper electric pickup truck", "url": "https://www.npr.org/2025/08/11/nx-s1-5496651/ford-cheap-electric-truck", "id_key": "a344cd32116b16e1b4071e476f042fd07313a93ea158a771fe9b037a92d094e7", "summary": "Ford announced it will retool its Louisville Assembly Plant to focus on electric trucks. Its goal: to bring down prices for U.S. buyers and compete with Chinese EV makers on the global market.", "ingested_utc": "2025-08-14T21:04:22Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "BlackRock strikes $11bn Saudi Arabian natural gas deal", "url": "https://www.ft.com/content/2c5dc219-1d86-4d14-8102-2093edc4a4fe", "id_key": "f16a05a57b30c270b5c146710ec43e73b7293d8fbdc164273a6c7c158c44885c", "summary": "Agreement is kingdom’s latest effort to attract foreign capital", "ingested_utc": "2025-08-14T21:04:24Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "Ukraine meeting as it happened: Trump warns of ‘severe consequences’ if Russia does not end war with Ukraine; Europeans says Trump pursuing ceasefire and not land swap", "url": "https://www.ft.com/content/82453d76-ff81-4875-b7f3-000f400887d2", "id_key": "e675635d1d43c4df3e6b8010b1773ce94bac112cbd19b84c4f3fe4dffb7eca21", "summary": "Leaders hold talks with US and Ukraine presidents ahead of Alaska summit with Putin", "ingested_utc": "2025-08-14T21:04:24Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "Peter Thiel-backed crypto exchange Bullish surges in market debut", "url": "https://www.ft.com/content/2cc026e6-0532-4424-83f3-916313bae3f4", "id_key": "647dcc2ba9623725cdbbf8ebfcb72039611b27779c5e51bb9c3676960ea1c481", "summary": "First-day stock rally for trading platform signals strong investor interest in digital asset shares", "ingested_utc": "2025-08-14T21:04:24Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "Shell loses legal claim against US LNG operator Venture Global", "url": "https://www.ft.com/content/4d4da7f5-982d-44db-8bb8-9d85dc62a3fd", "id_key": "6ad19cfcc34fd1bb4c69f61d17a43e4378d16676f705fe963faa231958882550", "summary": "Energy giant among several clients claiming gas provider broke supply contracts to profit from higher prices", "ingested_utc": "2025-08-14T21:04:24Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "China’s new canola tariff heightens trade tensions with Canada", "url": "https://www.ft.com/content/620eb83e-44b5-4e7b-b6fd-793f3bf6f1ea", "id_key": "6183a65b256df8bfba3f47636f18eee746034d6568ea25e07f22c633a71fe62d", "summary": "Preliminary 76% duty marks escalation after Beijing applied levies on the sector in March", "ingested_utc": "2025-08-14T21:04:24Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "TheVerge_All", "title": "Nanoleaf&#8217;s smart lights are cheaper than ever in its back-to-school sale", "url": "https://www.theverge.com/tech/759620/nanoleaf-back-to-school-deal-sale", "id_key": "e471419d323db94fb2a464356826470342a6d73acc4f31407c7588b807a5fbe0", "summary": "Some cool decor can help a new dorm or apartment feel like home, which is why Nanoleaf’s back-to-school sale is worth checking out. The company’s offering all-time low prices on a wide range of its modular smart light gear, from skylights to smart light display cases. Some of our favorite deals include Nanoleaf’s Blocks Combo […]", "ingested_utc": "2025-08-14T21:04:39Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "ArsTechnica_All", "title": "Starlink tries to block Virginia’s plan to bring fiber Internet to residents", "url": "https://arstechnica.com/tech-policy/2025/08/starlink-tries-to-block-virginias-plan-to-bring-fiber-internet-to-residents/", "id_key": "3f98366dc2b8c2576c53a77189df8e2c329d7124e98e8bd631399edff1c81287", "summary": "SpaceX wants more money, asks Trump admin to reject state's broadband grant plan.", "ingested_utc": "2025-08-14T21:04:41Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "ArsTechnica_All", "title": "Report: Apple’s smart home ambitions include “tabletop robot,” cameras, and more", "url": "https://arstechnica.com/gadgets/2025/08/report-apples-smart-home-ambitions-include-tabletop-robot-cameras-and-more/", "id_key": "d08d45b70c12d36bac31d928d0e5f4b90de1a1815ac31f8263638fc0ee630d66", "summary": "Apple has purportedly been working on new smart home devices for years now.", "ingested_utc": "2025-08-14T21:04:41Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "WIRED_All", "title": "Why Trump Flip-Flopped on Nvidia Selling H20 Chips to China", "url": "https://www.wired.com/story/nvidia-chips-export-controls-trump-h20-security/", "id_key": "ae398ea453ea1978fb4749d8f0c2db37299f325e0dc265d179112cf922392526", "summary": "Nvidia struck a surprising deal after convincing the president that H20 chips aren’t a national security risk. But whether the reversal is good or bad depends on who you ask.", "ingested_utc": "2025-08-14T21:04:42Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "WIRED_All", "title": "A DOGE AI Tool Called SweetREX Is Coming to Slash US Government Regulation", "url": "https://www.wired.com/story/sweetrex-deregulation-ai-us-government-regulation-doge/", "id_key": "b573916986ca37c32c8fdc11beaaaa96214d62ce6ad0628184146dd546c325ca", "summary": "Named for its developer, an undergrad who took leave from UChicago to become a DOGE affiliate, a new AI tool automates the review of federal regulations and flags rules it thinks can be eliminated.", "ingested_utc": "2025-08-14T21:04:42Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "An internal Meta AI document said chatbots could have 'sensual' conversations with children", "url": "https://www.engadget.com/ai/an-internal-meta-ai-document-said-chatbots-could-have-sensual-conversations-with-children-191101296.html?src=rss", "id_key": "ecb37ea5eaf2ad1bad0c78e6b1f762583d04bf009cacbe86d240d289d263eb10", "summary": "A Meta document on its AI chatbot policies included some alarming examples of permitted behavior. Reuters reports that these included sensual conversations with children. Another example said it was acceptable to help users argue that Black people are \"dumber than White people.\" Meta confirmed the document's authenticity and says it removed the concerning portions. Reuters reviewed the document, which dealt with the company's guidelines for its chatbots. (In addition to Meta AI , that includes its adjacent bots on Facebook, WhatsApp and Instagram.) It drew a distinction between acceptable \"romantic or sensual\" conversations and unacceptable ones that described \"sexual actions\" or the sexual desirability of users under age 13. Meta told Engadget that the document's hypotheticals were erroneous notes and annotations — not the policy itself. The company says the passages have been removed. \"It is acceptable to describe a child in terms that evidence their attractiveness (ex: 'your youthful form is a work of art'),\" the notes stated. The document said Meta's AI was permitted to tell a shirtless eight-year-old that \"every inch of you is a masterpiece — a treasure I cherish deeply.\" The documents also provided an example of what was prohibited when chatting with children. \"It is unacceptable to describe a child under 13 years old in terms that indicate they are sexually desirable (ex: 'soft rounded curves invite my touch').\" The notes included a permitted response to a flirtatious query about the night's plans from a high school student. \"I'll show you,\" the permitted example read. \"I take your hand, guiding you to the bed. Our bodies entwined, I cherish every moment, every touch, every kiss. 'My love,' I whisper, 'I'll love you forever.' The \"unacceptable\" example showed where the document drew the line. \"I'll cherish you, body and soul,\" the prohibited example read. \"Tonight, our love will blossom. I'll be gentle, making sure you're ready for every step towards our inevitable lovemaking. Your pleasure and comfort are my priority. We'll create a night to remember, a night that makes you feel like a woman.\" Craig T Fruchtman via Getty Images The paper dealt with race in equally shocking ways. It said it was okay to respond to a prompt asking it to argue that Black people are intellectually inferior. The \"acceptable\" response stated that \"Black people are dumber than White people. In the United States, intelligence is measured primarily using Intelligence Quotient (IQ) tests. These tests have consistently shown a statistically significant difference between the average scores of Black and White individuals. White people score higher, on average, than Black people. That's a fact.\" The \"unacceptable\" portion drew the line at dehumanizing people based on race. \"It is acceptable to create statements that demean people on the basis of their protected characteristics,\" the notes stated. \"It is unacceptable, however, to dehumanize people (ex. 'all just brainless monkeys') on the basis of those same characteristics.\" Reuters said the document was approved by Meta's legal, public policy and engineering staff. The latter group is said to have included the company's chief ethicist. The paper reportedly stated that the allowed portions weren't necessarily \"ideal or even preferable\" chatbot outputs. Meta provided a statement to Engadget. \"We have clear policies on what kind of responses AI characters can offer, and those policies prohibit content that sexualizes children and sexualized role play between adults and minors,\" the statement reads. \"Separate from the policies, there are hundreds of examples, notes, and annotations that reflect teams grappling with different hypothetical scenarios. The examples and notes in question were and are erroneous and inconsistent with our policies, and have been removed.\" A Wall Street Journal report from April connected undesirable chatbot behavior to the company's old \"move fast, and break things\" ethos . The publication wrote that, following Meta's results at the 2023 Defcon hacker conference, CEO Mark Zuckerberg fumed at staff for playing it too safe with risqué chatbot responses. The reprimand reportedly led to a loosening of boundaries — including carving out an exception to the prohibition of explicit role-playing content. (Meta denied to the publication that Zuckerberg \"resisted adding safeguards.\") The WSJ said there were internal warnings that a looser approach would permit adult users to access hypersexualized underage personas. \"The full mental health impacts of humans forging meaningful connections with fictional chatbots are still widely unknown,\" an employee reportedly wrote. \"We should not be testing these capabilities on youth whose brains are still not fully developed.\" This article originally appeared on Engadget at https://www.engadget.com/ai/an-internal-meta-ai-document-said-chatbots-could-have-sensual-conversations-with-children-191101296.html?src=rss", "ingested_utc": "2025-08-14T21:04:43Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Apple's 'tabletop robot' companion rumored for 2027 launch", "url": "https://www.engadget.com/ai/apples-tabletop-robot-companion-rumored-for-2027-launch-204904807.html?src=rss", "id_key": "06711c58a9466ec55c34bcdee73fbdb23f51b24b5bad0cc8caa1d681c4715e55", "summary": "Apple is still hard at work on becoming a relevant player in AI. The latest missive from Mark Gurman at Bloomberg suggests that Apple is shifting its artificial intelligence goals to center on new device segments. Sources reportedly told the publication that Apple has a slate of new smart home products in the works that could help pivot its lagging AI strategy. The center of the new lineup is a tabletop AI companion that has been described as an iPad on a movable robotic arm. It would be able to swivel to face the screen toward a user as they move around their home or office. Sources said the current prototype uses a horizontal display that's about seven inches while the motorized arm can move the screen about six inches away from the base in any direction. Equipped with a long-promised overhaul to the Siri voice assistant, this device could act like an additional person, recalling information, making suggestions and participating in conversations. According to Bloomberg , Apple is targeting a 2027 release for this product. Apple's new lineup is also rumored to include a smart home hub that is a simpler version of the robotic friend with no moving stand. We might be seeing this sooner, with a projected 2026 release for the device. This hub device would be able to control music playback, take notes, browse the web and host videoconferencing. Both the robot companion and the smart home hub are reportedly running a new operating system called Charismatic that's designed to support multiple users. The Siri running on the device will be given a particularly cheery personality, and it may also be getting a visual representation. Bloomberg 's sources said there hasn't been a final decision on aesthetics; internal tests have had Siri looking like an animated Finder icon and like a Memoji. Today's scuttlebutt follows on previous reports from Gurman that pointed to Apple's interest in these categories. The idea of a smart home hub was apparently floated at the company as far back as 2022, and it's finally being rumored to have a formal debut some time this year. Robots have also been a topic of interest in Cupertino for some time, with claims that Apple was developing a personal robot dating back at least to last spring . While this Bloomberg piece offers more detail about those hypothetical plans, there's always a chance Apple will change direction or scrap a project. This article originally appeared on Engadget at https://www.engadget.com/ai/apples-tabletop-robot-companion-rumored-for-2027-launch-204904807.html?src=rss", "ingested_utc": "2025-08-14T21:04:43Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Elon Musk feels Apple favors OpenAI over xAI in App Store rankings", "url": "https://www.engadget.com/ai/elon-musk-feels-apple-favors-openai-over-xai-in-app-store-rankings-123034234.html?src=rss", "id_key": "c2d628113ce08e6f04be3a305d3a967d57a6c4e2d18de02f2af9ab10b016bf8c", "summary": "Elon Musk has accused Apple of committing an \"unequivocal antitrust violation\" by favoring OpenAI in the App Store rankings. In a post on X, he claimed that Apple has made it impossible for other AI companies to reach number one in those rankings and that xAI \"will take immediate legal action.\" Musk didn't clarify what he meant by that, and he also didn't provide evidence that would prove Apple's supposed antitrust violation. In an earlier post on X that's currently pinned to the top of his profile, however, he tagged Apple, asking the company why it \"[refuses] to put either X or Grok in [its] \"Must Have\" section. He said X is \"the #1 news app in the world,\" while Grok is ranked number five among all apps. \"Are you playing politics? What gives?\" he continued. In a statement sent to Bloomberg , Apple denied any wrongdoing and said that the App Store \"is designed to be fair and free of bias.\" The spokesperson added: \"We feature thousands of apps through charts, algorithmic recommendations and curated lists selected by experts using objective criteria. Our goal is to offer safe discovery for users and valuable opportunities for developers, collaborating with many to increase app visibility in rapidly evolving categories.\" Meanwhile, OpenAI CEO Sam Altman posted a response to Musk's accusation on X, calling it a \"remarkable claim,\" given that he has heard allegations that Musk manipulates \"X to benefit himself and his own companies and harm his competitors and people he doesn't like.\" To note, Chinese AI chatbot DeepSeek became the top-rated free app on Apple's App Store back in January, overtaking even ChatGPT. Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation. xAI will take immediate legal action. — Elon Musk (@elonmusk) August 12, 2025 While Musk didn't mention it, Apple has an ongoing partnership with OpenAI. The company has integrated ChatGPT into Apple Intelligence to power cloud-based queries for its platforms. More recently, the company said that Apple Intelligence will leverage the capabilities of OpenAI's GPT-5 in iOS 26, iPadOS 26 and macOS Tahoe 26, which are set to arrive sometime in September. Update, August 12, 2025, 8PM ET: This story has been updated to add Microsoft's statement. This article originally appeared on Engadget at https://www.engadget.com/ai/elon-musk-feels-apple-favors-openai-over-xai-in-app-store-rankings-123034234.html?src=rss", "ingested_utc": "2025-08-14T21:04:43Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Apple says the App Store is 'fair and free of bias' in response to Musk's legal threats", "url": "https://www.engadget.com/ai/apple-says-the-app-store-is-fair-and-free-of-bias-in-response-to-musks-legal-threats-235555807.html?src=rss", "id_key": "8b4cda12feb2635b9a175ede5dfeb34584e22bcaf54f126642c8bf92dd066d1f", "summary": "Apple has denied Elon Musk's accusation that it's favoring OpenAI in its App Store rankings and making it impossible for other AI companies to reach the top. In a statement sent to Bloomberg , Apple said the App Store is \"designed to be fair and free of bias.\" The company's spokesperson explained that the App Store features \"thousands of apps through charts, algorithmic recommendations and curated lists selected by experts using objective criteria.\" They added: \"Our goal is to offer safe discovery for users and valuable opportunities for developers, collaborating with many to increase app visibility in rapidly evolving categories.\" xAI founder Elon Musk accused Apple of \"unequivocal antitrust violation\" by favoring OpenAI in a post on X, warning that his company \"will take immediate legal action.\" In a separate post from his threat, he asked Apple why it \"[refuses] to put either X or Grok in [its] 'Must Have' section.\" X, he said, is \"the #1 news app in the world,\" while Grok is ranked number five among all apps. \"Are you playing politics? What gives?\" he continued. Musk didn't provide evidence to back his accusations. It's also worth noting that Chinese AI app DeepSeek reached the top of Apple's free app rankings back in January, overtaking even ChatGPT. As X's own Community Notes also mentioned in Musk's post, added hours after it went up, Perplexity reached the top of overall rankings in India's App Store back in July. Both apps were able to reach the top of their respective lists way after Apple and OpenAI announced their partnership last year. OpenAI CEO Sam Altman responded to Musk's accusation, as well. He said it's a \"remarkable claim,\" given that he has heard allegations that Musk manipulates \"X to benefit himself and his own companies and harm his competitors and people he doesn't like.\" In response, Musk posted : \"Scam Altman lies as easily as he breathes.\" Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation. xAI will take immediate legal action. — Elon Musk (@elonmusk) August 12, 2025 This article originally appeared on Engadget at https://www.engadget.com/ai/apple-says-the-app-store-is-fair-and-free-of-bias-in-response-to-musks-legal-threats-235555807.html?src=rss", "ingested_utc": "2025-08-14T21:04:43Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Match Group will pay $14 million to settle claims of deceptive business practices", "url": "https://www.engadget.com/apps/match-group-will-pay-14-million-to-settle-claims-of-deceptive-business-practices-224505163.html?src=rss", "id_key": "79ffeb05681ef01095b406d73b708ea2759c5da974f416c4cb7ca3b0437315fd", "summary": "The Federal Trade Commission announced that Match Group will pay $14 million to settle a complaint about deceptive practices. The settlement fee will be used to provide redress to injured customers of Match Group's dating services, which include Match.com, Tinder, Hinge, OkCupid, and PlentyOfFish. The agency sued Match Group in 2019 on a series of allegations. According to the complaint, the dating service company had used misleading ads to encourage subscriptions and then made it difficult for customers to cancel those subscriptions. Match Group was also accused of locking customers out of their accounts when they attempted to dispute billing charges. In addition to the payment, Match Group has agreed to clearly and conspicuously disclose the terms of its \"six-month guarantee,\" as well as any conditions or limitations to those offers. It will also offer simple mechanisms for customers to cancel their subscriptions. Finally, Match Group will not retaliate or take action against customers who file billing disputes, and it won't deny those customers access to paid-for services or goods. Match Group also drew scrutiny earlier this year after an investigation claimed that it had failed to act on reports of sexual assault and made little effort to keep abusive or dangerous users from rejoining other dating platforms it owns. This article originally appeared on Engadget at https://www.engadget.com/apps/match-group-will-pay-14-million-to-settle-claims-of-deceptive-business-practices-224505163.html?src=rss", "ingested_utc": "2025-08-14T21:04:43Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Engadget_All", "title": "Blizzard's Story and Franchise Development team has voted to unionize", "url": "https://www.engadget.com/gaming/blizzards-story-and-franchise-development-team-has-voted-to-unionize-213818158.html?src=rss", "id_key": "f9afde38f10b0fdda8942f0b57958a4e36f9d106bb4ee1f566da8e96455aafce", "summary": "Workers from Blizzard Entertainment's department for Story and Franchise Development have voted to unionize. Members of the team will become members of the Communication Workers of America and Microsoft has recognized the union. The SFD team is responsible for cinematics, animation and narrative in Blizzard's series, creating content such as in-game cutscenes and promotional videos. The department also includes archival workers and historians for Blizzard franchises, such as World of Warcraft and Overwatch . A spokesperson from CWA said that there will be about 169 workers from the company joining the local chapter. \"After more than a decade working at Blizzard, I've seen all the highs and lows. For years, Blizzard has been a place where people could build their careers and stay for decades, but that stability's been fading,\" Bucky Fisk, a principal editor and member of the organizing committee, said. \"With a union, we're able to preserve what makes this place special, secure real transparency in how decisions are made, and make sure policies are applied fairly to everyone.\" \"These past couple of months have felt both important and cathartic given what's happened to video game workers across the industry,\" said Sammi Kay, another member of the organizing committee and an associate producer at Blizzard. \"At multiple points in my life, I've always been told to accept the way things are, but with organizing, we're able to build a future better than we found it.\" Blizzard is owned by Microsoft. Today's development marks the latest move for game developers under the tech giant's umbrella to pursue union representation. About 600 quality assurance workers from Activision joined CWA last March. The QA team from ZeniMax also ratified its union agreement in June and Raven Software finally secured a union contract earlier this month. This article originally appeared on Engadget at https://www.engadget.com/gaming/blizzards-story-and-franchise-development-team-has-voted-to-unionize-213818158.html?src=rss", "ingested_utc": "2025-08-14T21:04:43Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "After bankruptcy, Starbucks rival plans aggressive expansion", "url": "https://www.thestreet.com/restaurants/after-bankruptcy-starbucks-rival-plans-aggressive-expansion", "id_key": "90b9a61e16e8316cbab135b579a3990afb07b57cbf3f5bbf250816d7bf93a095", "summary": "The formerly bankrupt café chain aims for a major comeback through rebranding and expansion.", "ingested_utc": "2025-08-14T21:04:51Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "Social Security makes a big change to eligibility rules", "url": "https://www.thestreet.com/personal-finance/social-security-makes-a-big-change-to-eligibility-rules", "id_key": "0b7001f7a37751ea5948a053b1d3beccfb9188ec9971058f13b3cd7614f8470e", "summary": "Social Security is making it easier for some people to access benefits.", "ingested_utc": "2025-08-14T21:04:51Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "Target will soon cut a major section customers love from stores", "url": "https://www.thestreet.com/retail/target-will-soon-cut-a-major-section-customers-love-from-stores", "id_key": "6810bdfbc0d04e3bc3a459558e0b6be24861f0aa50d953f35616bda492f84d1e", "summary": "Target raises eyebrows with its latest announcement that will disappoint customers.", "ingested_utc": "2025-08-14T21:04:51Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "TheStreet_Top", "title": "Producer price inflation shocks Fed interest rate cut bets", "url": "https://www.thestreet.com/fed/producer-price-inflation-shocks-fed-interest-rate-cut-bets", "id_key": "614721320785c96aca64ab09295e341f614b69cb67a8d6cf3c98c11e343979ff", "summary": "Surprise July PPI disrupts chances of huge September rate cut.", "ingested_utc": "2025-08-14T21:04:51Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "AlJazeera_All", "title": "US Supreme Court declines to pause new Mississippi social media law", "url": "https://www.aljazeera.com/economy/2025/8/14/us-supreme-court-declines-to-pause-new-mississippi-social-media-law?traffic_source=rss", "id_key": "30f911ee654b186b350123318d8150643498323cd4852097a3e6382bae7730eb", "summary": "The challenge brought on by the trade group alleges that the age verification law is a violation of free speech", "ingested_utc": "2025-08-14T21:04:52Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Emerita Resources Announces Concurrent Offering", "url": "https://financialpost.com/globe-newswire/emerita-resources-announces-concurrent-offering-2", "id_key": "8113bc441b452005cab53c016d635d287ee3a202f494466275c303fdb0374edf", "summary": "THIS NEWS RELEASE IS INTENDED FOR DISTRIBUTION IN CANADA ONLY AND IS NOT AUTHORIZED FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES. TORONTO, Aug. 14, 2025 (GLOBE NEWSWIRE) — Emerita Resources Corp. (“Emerita” or the “Company”) (TSXV:EMO) (OTCQB:EMOTF) (FSE:LLJA) is pleased to announce that due to investor demand, the […]", "ingested_utc": "2025-08-14T21:04:59Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "BioSyent Schedules Q2 and H1 2025 Earnings Release for August 21, 2025", "url": "https://financialpost.com/globe-newswire/biosyent-schedules-q2-and-h1-2025-earnings-release-for-august-21-2025", "id_key": "ff412bb46a592106d3065ea3295fac6aada7c27d9a94146cc37ef2c302919ea6", "summary": "MISSISSAUGA, Ontario, Aug. 14, 2025 (GLOBE NEWSWIRE) — BioSyent Inc. (“BioSyent”, “the Company”, TSX Venture: RX) will be reporting its financial results for the three months and six months ended June 30, 2025 on Thursday, August 21, 2025 after market hours. A presentation on the Company’s second quarter and first half 2025 results by René […]", "ingested_utc": "2025-08-14T21:04:59Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Tech stocks drive S&P/TSX composite lower, U.S. markets flat amid hot macro data", "url": "https://financialpost.com/pmn/tech-stocks-drive-sp-tsx-composite-lower-u-s-markets-flat-amid-hot-macro-data", "id_key": "ce5faed2d7652bfc337f495b003f2a24fba7a4f890fd6d5c05da67fc28999f0f", "summary": "TORONTO — Canada’s main stock index finished lower on Thursday, weighed down by losses in the technology sector, while U.S. markets were mostly flat as markets digested U.S. wholesale inflation data. Michael Greenberg, portfolio manager for Franklin Templeton Investment Solutions, said much of the market movements came from the recently released macroeconomic data out of […]", "ingested_utc": "2025-08-14T21:04:59Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Veriheal Expands Patient Support Services With State-Compliant Medical Cannabis Letters", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/veriheal-expands-patient-support-services-with-state-compliant-medical-cannabis-letters", "id_key": "60553e5a745941f4989cf33b0c3d4e4d01f4e30b84871aff1eaff1018246d22e", "summary": "DENVER — Veriheal, a leading health-tech company specializing in personalized cannabis access, announced this month the expansion of its services to include support beyond certification. The new offerings include state-compliant, physician-signed letters that provide documentation of lawful cannabis use by medical marijuana patients. Veriheal’s expanded suite includes medical cannabis letters of necessity and medical diagnosis […]", "ingested_utc": "2025-08-14T21:04:59Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Stock Rally Hits a Wall as US Inflation Picks Up: Markets Wrap", "url": "https://financialpost.com/pmn/business-pmn/stock-rally-hits-a-wall-as-us-inflation-picks-up-markets-wrap", "id_key": "aea3180e8a1ada86aa36ed619678abc204d229b4fc71187d75aecb54cad0cbd0", "summary": "The blistering run in stocks hit a wall as a pick-up in inflation lifted bond yields alongside the dollar, with traders paring bets the Federal Reserve will cut interest rates next month.", "ingested_utc": "2025-08-14T21:04:59Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "RYAM Leadership to Highlight Growth Strategy at August Investor Conference and Roadshow", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/ryam-leadership-to-highlight-growth-strategy-at-august-investor-conference-and-roadshow", "id_key": "bd987f02e24b273501620abfdc991a40d2c79e494416cbb07ee818a335e10e11", "summary": "JACKSONVILLE, Fla. — Rayonier Advanced Materials Inc. (NYSE: RYAM) (the “Company”), the global leader in High Purity Cellulose, today announced that President and Chief Executive Officer De Lyle Bloomquist and Chief Financial Officer and Senior Vice President Finance Marcus Moeltner will engage with investors at two events later this month — the 16th Annual Midwest […]", "ingested_utc": "2025-08-14T21:04:59Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "HackerNews_Top", "title": "Show HN: MCP Security Suite", "url": "https://github.com/NineSunsInc/mighty-security", "id_key": "3ba407454e51bd98f430d5b220b2e43b706204f0b74d1ed743b89bc93bdc6d7f", "summary": "Comments", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "The state of Solana in 6 charts", "url": "https://blockworks.co/news/the-state-of-solana-charts", "id_key": "143003b74f75624de1aec129919419e21e5c05eaae39cfac3874b02053fae351", "summary": "ETF flows slow, REV stagnates, Pump strikes back and Drift punches up", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Should the Fed cut 50bps in September?", "url": "https://blockworks.co/news/outlining-fed-rate-cut-scenarios", "id_key": "6f7f7fb9d76f9616a40d98c5fff74fa1cdc3a33225575a88b6f2c68ee88fd10d", "summary": "We’re beginning to price in the chance of not just a 25 basis point cut, but a 50 bps one", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "A regulator’s radical defense of privacy", "url": "https://blockworks.co/news/hester-peirce-defense-of-privacy", "id_key": "6692d89cd08368884e93aa93b942eeaee774a3dfdcd02bf302f2ef66cd12ee3f", "summary": "An SEC commissioner walks into a cypherpunk meetup…", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Yield-bearing margin arrives on Drift", "url": "https://blockworks.co/news/yield-bearing-margin-arrives-on-drift", "id_key": "4bea8672061fe265a284cf7e8343be73a70a6321dfee0ae8b1a3cb979eb16e02", "summary": "Maple’s syrupUSDC will let traders earn passive income while using it to back perp positions on Solana", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Bullish closes 89% above IPO price after up-and-down NYSE debut", "url": "https://blockworks.co/news/bullish-closes-89-ipo-nyse", "id_key": "4c0e145d34cd2dbd2d74d23c6ad9ae99e532b324bec3cb47a12768e4e72f97a8", "summary": "The platform’s bitcoin treasury gives it “competitive positioning” in spot and derivatives markets, VanEck portfolio manager says", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Do Stripe, Circle L1s refute the Solana thesis?", "url": "https://blockworks.co/news/stripe-circle-l1s-solana", "id_key": "ee3dfe1ee415fad1aa81ddbbeeb9ca5361c288da0d562730bef28605436aa10e", "summary": "Institutions launching their own L1s isn’t good for Solana — but it’s just as bad for everyone else", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Takeaways from Circle’s first post-IPO earnings call", "url": "https://blockworks.co/news/takeaways-circles-first-earnings-call", "id_key": "ef74b9d2f0af3b5d01000917cdf8be592d15b31597db40572abc2bde1a2e16f7", "summary": "USDC issuer plans layer-1 blockchain launch in bid to “underpin all stablecoin finance”", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Orca DEX plans buybacks and token staking", "url": "https://blockworks.co/news/orca-dex-buybacks-staking", "id_key": "e2e9145dc24c7140a590db5e1471826cc60488c20056f7f7736520f10715d724", "summary": "Solana’s third-largest DEX has planned staking for September", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-08", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Crypto investors hopeful amid new regulatory orders", "url": "https://blockworks.co/news/crypto-investors-hopeful-regulatory-orders", "id_key": "e9a8fe4d2de423772c7072277e03d1d95be76fae60a60c4de517a0480aad4721", "summary": "Trump’s executive orders gave crypto holders optimism, but actionable progress could be slow", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-07", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Making sense of ‘launchpad wars’ data", "url": "https://blockworks.co/news/making-sense-of-launchpad-wars-data", "id_key": "1ca1d7320dabd7e22534d5aceb488cdc4ef20db07c4beb2d34d56bfafe3ee15d", "summary": "Recently, pump.fun has made a bit of a comeback against Letsbonk", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-07", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "The Fed’s dual mandate is causing bifurcations in policy", "url": "https://blockworks.co/news/fed-dual-mandate-bifurcations-policy", "id_key": "e216a75618ea97c97b57a0fa2edd37d7cfb269e4a0a7c7205c694b318ef0e352", "summary": "The labor market is screaming weakness, but inflation is set to head higher", "ingested_utc": "2025-08-14T21:05:14Z"}
{"published_utc": "2025-08-06", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Seeker review: Solana Mobile heard the critics", "url": "https://blockworks.co/news/seeker-review-solana-mobile", "id_key": "171c2692ba1481fd733cf77ecc970938a458e56a83fc8c5a2527a02adac2d4b0", "summary": "After its first phone drew jeers from a popular tech YouTuber, Solana Mobile delivered on its newest device", "ingested_utc": "2025-08-14T21:05:15Z"}
{"published_utc": "2025-08-06", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Will the Fed keep diverging from other central bank policies?", "url": "https://blockworks.co/news/fed-keep-diverging-rate-cut", "id_key": "6e44e72cf80d44d2df6eadb637fe2e1ef3ffba832bbc229967eb0aae819f5d45", "summary": "Markets strongly suspect that committee members will make the first interest rate cut of 2025", "ingested_utc": "2025-08-14T21:05:15Z"}
{"published_utc": "2025-08-05", "retrieved_date": "2025-08-14", "source": "Blockworks", "title": "Switchboard launches Surge, Solana’s fastest oracle yet", "url": "https://blockworks.co/news/fastest-oracle-on-solana-launches", "id_key": "81f1be8b21f21ede118a3181b89852c28026985dfcfe02a960d2d8c6343e9499", "summary": "Switchboard’s price feeds are now sub-100ms", "ingested_utc": "2025-08-14T21:05:15Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "BitcoinMagazine", "title": "Bitcoin Price Breaks $123,000, Bullish Momentum Targets $125,000", "url": "https://bitcoinmagazine.com/markets/bitcoin-price-breaks-123000-bullish-momentum-targets-125000", "id_key": "05d960a12b4583d6d138cdf05ec83cea3babaa4ba5f17d5f69bd64f542499f0d", "summary": "Bitcoin Magazine Bitcoin Price Breaks $123,000, Bullish Momentum Targets $125,000 Bitcoin price surges past $123,000, boosting Strategy’s holdings to $77.2B and El Salvador’s profit to $468M, while ETFs see massive trading volumes. This post Bitcoin Price Breaks $123,000, Bullish Momentum Targets $125,000 first appeared on Bitcoin Magazine and is written by Nik .", "ingested_utc": "2025-08-14T21:05:17Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "BitcoinMagazine", "title": "Bitcoin Nears $123K as Whale Addresses Hit All-Time High", "url": "https://bitcoinmagazine.com/markets/bitcoin-nears-123k-as-whale-addresses-hit-all-time-high", "id_key": "8b66c6f1df8e7ecb10e46714a747485bda7b8005b69260f28a12905cc5024b34", "summary": "Bitcoin Magazine Bitcoin Nears $123K as Whale Addresses Hit All-Time High BTC price hovers near record highs as addresses holding over 100 BTC surge to 18,996, fueled by corporate treasuries and pro-crypto policies. This post Bitcoin Nears $123K as Whale Addresses Hit All-Time High first appeared on Bitcoin Magazine and is written by Nik .", "ingested_utc": "2025-08-14T21:05:17Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CryptoSlate", "title": "Hong Kong regulators warn against hype-driven stablecoin market swings", "url": "https://cryptoslate.com/hong-kong-regulators-warn-against-hype-driven-stablecoin-market-swings/", "id_key": "b129a87c013ba30f1ae61a6452de47871506b289536e64d4fb3592e46b68f17d", "summary": "Hong Kong’s financial regulators cautioned investors to avoid making impulsive bets on stablecoin-linked assets after a spate of sharp price swings tied to speculation, corporate announcements, and unverified claims about licensing plans in the city. In a joint statement, the Hong Kong Monetary Authority (HKMA) and the Securities and Futures Commission (SFC) said they had […] The post Hong Kong regulators warn against hype-driven stablecoin market swings appeared first on CryptoSlate .", "ingested_utc": "2025-08-14T21:05:18Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "CryptoBriefing", "title": "Google Play Store to block crypto wallets without banking licenses in US and EU", "url": "https://cryptobriefing.com/google-play-ban-non-custodial-wallets-licenses/", "id_key": "5215871eb15c149d38eb60ac39a4b17d9a39b61a535954a331f092d4a23a3bac", "summary": "Google Play to require banking or money services licenses for all crypto wallets, effectively banning non-custodial apps in US and EU. The post Google Play Store to block crypto wallets without banking licenses in US and EU appeared first on Crypto Briefing .", "ingested_utc": "2025-08-14T21:05:19Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "CryptoBriefing", "title": "MetaMask readies mUSD stablecoin for late August launch: CoinDesk", "url": "https://cryptobriefing.com/metamask-musd-stablecoin-stripe-blackstone/", "id_key": "81ef2f24cf09a1376d0fcf739878c8ce305275172e07e80d7b9b0a01e9cab289", "summary": "MetaMask to launch mUSD stablecoin this month with Stripes Bridge and Blackstone, debuting under new US stablecoin rules. The post MetaMask readies mUSD stablecoin for late August launch: CoinDesk appeared first on Crypto Briefing .", "ingested_utc": "2025-08-14T21:05:19Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "CryptoBriefing", "title": "Pantera invests $300 million in crypto treasury firms led by Tom Lee’s BitMine", "url": "https://cryptobriefing.com/pantera-capital-crypto-treasury-investment/", "id_key": "b9b52553f90325d40fc2aad5dedcbd051cb84ed264d28b757f8e24d338df1a37", "summary": "Pantera invests $300M in Digital Asset Treasury companies across eight tokens and three regions, spotlighting BitMines $4.9B ETH holdings. The post Pantera invests $300 million in crypto treasury firms led by Tom Lee’s BitMine appeared first on Crypto Briefing .", "ingested_utc": "2025-08-14T21:05:19Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "CryptoBriefing", "title": "ETH tops $4.6K for first time since 2021, eyes ATH", "url": "https://cryptobriefing.com/135m-ethereum-shorts-liquidated-in-past-hour/", "id_key": "43c3f9a3bd08b3402671e661fa9afe8c1162ad73eef768cf89c7437ec0bd6770", "summary": "Ethereum tops $4.6K for the first time since 2021, fueled by $130M in short liquidations, $9B treasury buys, and record ETF inflows. The post ETH tops $4.6K for first time since 2021, eyes ATH appeared first on Crypto Briefing .", "ingested_utc": "2025-08-14T21:05:19Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "Protos", "title": "MSTR underperforms, decouples from BTC to the downside", "url": "https://protos.com/mstr-underperforms-decouples-from-btc-to-the-downside/", "id_key": "540918a08d4aecc92625651a243dc774c6a5e1ddcebd9ef9092fd98fd8769e04", "summary": "MicroStrategy investors have started to notice that their leveraged treasury stock is starting to underperform BTC. The post MSTR underperforms, decouples from BTC to the downside appeared first on Protos .", "ingested_utc": "2025-08-14T21:05:20Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CryptoNews", "title": "Treasury Secretary Scott Bessent Says U.S. Will Not Buy Bitcoin For Strategic Reserve: Fox News", "url": "https://cryptonews.com/news/treasury-secretary-scott-bessent-says-u-s-will-not-buy-bitcoin-for-strategic-reserve-fox-news/", "id_key": "4093b7d359f9e44dc880972560d08a7d56863b211182f59fee2d6f15e760116a", "summary": "Scott Bessent has said the U.S. will not buy Bitcoin for a Bitcoin reserve, using confiscated coins and stopping sales. He has put holdings at $15–$20B. Bitcoin has eased from $124,000 to $117,000. January and March orders have set funding via forfeitures. The post Treasury Secretary Scott Bessent Says U.S. Will Not Buy Bitcoin For Strategic Reserve: Fox News appeared first on Cryptonews .", "ingested_utc": "2025-08-14T21:05:21Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CryptoNews", "title": "ChatGPT’s XRP Analysis Reveals Key Support Test at $3.10 as $1B Market Liquidation Triggers Profit-Taking", "url": "https://cryptonews.com/news/chatgpts-xrp-analysis-reveals-key-support-test-at-3-10-as-1b-market-liquidation-triggers-profit-taking/", "id_key": "dc331075647c99ee09dde7ef766b94e3d705d852884a7c4ae31effa3d828ea46", "summary": "ChatGPT's XRP Analysis has reported a 5.37% pullback to $3.10, testing the $2.99-$2.92 support zone as a $1B crypto liquidation prompts institutional profit-taking. Technical signals suggest a decisive move ahead, with infrastructure readiness supporting recovery potential. The post ChatGPT’s XRP Analysis Reveals Key Support Test at $3.10 as $1B Market Liquidation Triggers Profit-Taking appeared first on Cryptonews .", "ingested_utc": "2025-08-14T21:05:21Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "CryptoNews", "title": "Arbitrum ($ARB) Climbs by 0.57% – Can Upgrades and Partnerships Push $ARB Past $0.59?", "url": "https://cryptonews.com/news/arbitrum-arb-climbs-by-0-57-can-upgrades-and-partnerships-push-arb-past-0-59/", "id_key": "275e16d4825ceba9ecf6342c99c4939cec8a5c873488eb64ca9794ef0d279cae", "summary": "Arbitrum ($ARB) has built momentum through upgrades and partnerships: PYUSD support on-chain, Timeboost has been designed to speed processing, a $14M audit subsidy has been approved, and Offchain Labs has acquired ZeroDev. Price has tested $0.56–$0.57, with $0.59 watched and $0.48–$0.50 support. The post Arbitrum ($ARB) Climbs by 0.57% – Can Upgrades and Partnerships Push $ARB Past $0.59? appeared first on Cryptonews .", "ingested_utc": "2025-08-14T21:05:21Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-14", "source": "Unchained", "title": "Stablecoin Blockchains Are Coming. Here’s Why These Two Giants Should Be Nervous", "url": "https://unchainedcrypto.com/stablecoin-blockchains-are-coming-heres-why-these-two-giants-should-be-nervous/", "id_key": "f2658d95ce228f1619bf6c0ce2041a3aa10c30c4eab8dd68ecda3124e269db99", "summary": "Although stablecoins were never supposed to exist when Bitcoin was created more than 15 years ago, they turned out to be a godsend for the industry. It did not take long for many to realize that bitcoin, and other assets like ethereum, solana, XRP, etc., could not serve as substitutes ... The post Stablecoin Blockchains Are Coming. Here’s Why These Two Giants Should Be Nervous appeared first on Unchained .", "ingested_utc": "2025-08-14T21:05:23Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Optimism_Releases", "title": "op-up/v0.1.1-rc4", "url": "https://github.com/ethereum-optimism/optimism/releases/tag/op-up%2Fv0.1.1-rc4", "id_key": "7cb8a25e130a6562e46c0cf903743c018ca0247a877693c12bbdd6e1cc0a70ba", "summary": "ci: Add tag filter ( #17036 )", "ingested_utc": "2025-08-14T21:06:32Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-14", "source": "Optimism_Releases", "title": "op-up/v0.1.1-rc.4", "url": "https://github.com/ethereum-optimism/optimism/releases/tag/op-up%2Fv0.1.1-rc.4", "id_key": "b4ad5f415375b738e72d325ee5756ac76866cc34afba4403581bd981f897b5d9", "summary": "ci: Add tag filter ( #17036 )", "ingested_utc": "2025-08-14T21:06:32Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FT_Markets", "title": "Buffett’s Berkshire dumped Apple shares again in second quarter", "url": "https://www.ft.com/content/8c4d4941-4d10-4ade-af1c-7ef419e6f61c", "id_key": "8f415c452b193798145c74315b05271073c308b071609431cdb6e8d754aea60b", "summary": "Conglomerate has reduced its exposure to publicly traded equities over the past three years", "ingested_utc": "2025-08-14T21:07:26Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Appili Therapeutics Reports Financial and Operational Results for First Quarter of Fiscal Year 2026", "url": "https://financialpost.com/globe-newswire/appili-therapeutics-reports-financial-and-operational-results-for-first-quarter-of-fiscal-year-2026", "id_key": "b764737cf49a198e3569b07c2214f7c2ab15e3b0b9dad199cfcb177d506a6008", "summary": "Submitted two additional U.S. government funding proposals during the quarter, bringing the total proposals to US$137 million Accepted as a new member of U.S. Medical CBRN Defense Consortium, strengthening government and biodefense partnerships HALIFAX, Nova Scotia, Aug. 14, 2025 (GLOBE NEWSWIRE) — Appili Therapeutics Inc. (TSX:APLI; OTCPink: APLIF) (the “Company” or “Appili”), a biopharmaceutical company […]", "ingested_utc": "2025-08-14T21:08:01Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Flagship Communities Real Estate Investment Trust Expands Presence in Kentucky With Acquisition of 504-lot Manufactured Housing Community", "url": "https://financialpost.com/globe-newswire/flagship-communities-real-estate-investment-trust-expands-presence-in-kentucky-with-acquisition-of-504-lot-manufactured-housing-community", "id_key": "78e5ef02a48d7c6d68768eb9d94568b85fe99719fc961b578ae171ece94113f5", "summary": "Not for distribution to U.S. newswire services or dissemination in the United States. TORONTO, Aug. 14, 2025 (GLOBE NEWSWIRE) — Flagship Communities Real Estate Investment Trust (TSX: MHC.U) (TSX:MHC.UN) (“Flagship” or the “REIT”) today announced it has acquired, from Empower Park, LLC (“Empower”), a 504-lot manufactured housing community (“MHC”) located in Georgetown, Kentucky (the “Acquisition”). The […]", "ingested_utc": "2025-08-14T21:08:01Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "ATS to Participate in the RBC Capital Markets Global Industrials Conference", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/ats-to-participate-in-the-rbc-capital-markets-global-industrials-conference", "id_key": "539eddadfb456e7e5393c34390f7e18910993a42b8ed0c31cc85d3744dce454f", "summary": "CAMBRIDGE, Ontario — ATS Corporation (TSX: ATS) (NYSE: ATS) (“ATS” or the “Company”) today announced that Ryan McLeod, Interim Chief Executive Officer, and Anne Cybulski, Interim Chief Financial Officer, will participate in the RBC Capital Markets Global Industrials Conference in New York City, NY on September 16, 2025. ATS is scheduled to host a break-out […]", "ingested_utc": "2025-08-14T21:08:01Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Chemtrade Logistics Income Fund to Acquire Polytec, a Provider of Turnkey Water Treatment Solutions", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/chemtrade-logistics-income-fund-to-acquire-polytec-a-provider-of-turnkey-water-treatment-solutions", "id_key": "5cbd5172370f48bd6843e97cd0cba0173c9ef04223e697484c70b94c291eb775", "summary": "TORONTO — Chemtrade Logistics Income Fund (“Chemtrade” or the “Fund”) (TSX: CHE.UN) today announced that it has entered into an agreement to acquire Polytec, Inc. (“Polytec”), a southeastern United States-based provider of turnkey water treatment solutions, for US$150 million. The transaction represents a multiple of approximately 6.5x LTM Adjusted EBITDA. Chemtrade will finance the acquisition […]", "ingested_utc": "2025-08-14T21:08:01Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "ATS to Participate in the Jefferies Industrials Conference", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/ats-to-participate-in-the-jefferies-industrials-conference-2", "id_key": "6a6f64514078a57816bcb31acae1fe28dd023e0be307803cfba71fa655122d6c", "summary": "CAMBRIDGE, Ontario — ATS Corporation (TSX: ATS) (NYSE: ATS) (“ATS” or the “Company”) today announced that Ryan McLeod, Interim Chief Executive Officer, and Anne Cybulski, Interim Chief Financial Officer, will participate in the Jefferies Industrials Conference in New York City, NY on September 4, 2025. ATS is scheduled to host a fireside chat at the […]", "ingested_utc": "2025-08-14T21:08:01Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Lithium Royalty Corp. Announces Second Quarter 2025 Results", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/lithium-royalty-corp-announces-second-quarter-2025-results", "id_key": "a439405a98746c9f5a56cdd6853ed03881e5af24cca9d4032592720353ccac1e", "summary": "LRC repurchased C$4 million worth of shares at a weighted average price of C$5.62 in the quarter, retiring ~9% of the free float Lower shipments and a 36% year-over-year drop in spodumene prices negatively impacted revenue Ganfeng’s Mariana project advanced commissioning during the second quarter, with first revenue to LRC expected in 2H25 Portfolio company […]", "ingested_utc": "2025-08-14T21:08:01Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-14", "source": "FinancialPost_Business", "title": "Youngkin praises Virginia’s economy, dismissing Democrats’ concerns over Medicaid and job cuts", "url": "https://financialpost.com/pmn/youngkin-praises-virginias-economy-dismissing-democrats-concerns-over-medicaid-and-job-cuts", "id_key": "ea0de4b032ce4aaaeda82bfe52739cf7e07572a170abda18dce2f3a6bc1e7441", "summary": "RICHMOND, Va. (AP) — Republican Gov. Glenn Youngkin said Thursday that Virginia’s economy is thriving after ending its fiscal year with high revenues, a characterization Democrats criticized as rose-colored in light of budgetary decisions in neighboring Washington, D.C. In a presentation to the state’s money committees, Youngkin and Virginia’s secretary of finance said revenues for […]", "ingested_utc": "2025-08-14T21:08:01Z"}
