{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:49:55Z", "source": "BBC_World", "title": "Israel tells medics and aid groups to prepare for Gaza City evacuation", "url": "https://www.bbc.com/news/articles/cq589y168e1o?at_medium=RSS&at_campaign=rss", "id_key": "8a1a9142da609f56e9f44b7f5b893288f5c99882799d6d3a377040ab4929d220", "summary": "Gaza's Hamas-run health ministry says it rejects \"any step that would undermine what remains of the health system\".", "ingested_utc": "2025-08-21T18:49:55Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:49:55Z", "source": "BBC_World", "title": "French streamer's death 'not due to trauma', autopsy finds", "url": "https://www.bbc.com/news/articles/cr4e1k6l4lyo?at_medium=RSS&at_campaign=rss", "id_key": "6332efa4414eae78bfd614eaf93abb6930639996039554881b931bcef5f31a9c", "summary": "The online personality known as Jean Pormanove was found dead in his home in Nice on Monday.", "ingested_utc": "2025-08-21T18:49:55Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:49:58Z", "source": "Guardian_World", "title": "David Lammy among 21 foreign ministers to condemn plan for illegal West Bank settlement", "url": "https://www.theguardian.com/world/2025/aug/21/david-lammy-among-21-foreign-ministers-to-condemn-plan-for-west-bank-settlement", "id_key": "2e4c410b5294320c1db05c003cc1a063a5b89fe97631ba3a18a6b3527937acde", "summary": "Israeli ambassador to UK summoned as joint statement says move will fuel further violence and break international law David Lammy has joined 20 other foreign ministers around the world in condemning Israeli plans to build an illegal settlement on the West Bank, with the Foreign Office summoning the Israeli ambassador to communicate the government’s displeasure. The foreign secretary co-signed a joint statement on Thursday criticising the so-called E1 plan, a 3,400-home settlement that critics say would divide the West Bank in half. Continue reading...", "ingested_utc": "2025-08-21T18:49:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:49:58Z", "source": "Guardian_World", "title": "Man charged with murder after ice-cream seller stabbed in Wembley", "url": "https://www.theguardian.com/uk-news/2025/aug/21/man-charged-ice-cream-seller-stabbed-wembley-london", "id_key": "7e069af9ec392157e380bb499adab1cb838ce86c3e3a6c9f4bb131fac67a822f", "summary": "Zaher Zaarour, 26, to appear in court after death of 41-year-old Shazad Khan in north-west London A man has been charged with murder after an ice-cream seller was stabbed to death in north-west London. Shazad Khan, 41, was pronounced dead at the scene after officers responded to reports of an altercation in Monks Park, Wembley, at 6.10pm on Tuesday. Continue reading...", "ingested_utc": "2025-08-21T18:49:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:49:58Z", "source": "Guardian_World", "title": "As Covid effect ebbs, GCSE results reveal broken legacy of Gove’s resit policy", "url": "https://www.theguardian.com/education/2025/aug/21/as-covid-effect-ebbs-gcse-results-reveal-broken-legacy-of-goves-resit-policy", "id_key": "371aeae45263e8f02226530b665d98aa1a0a848d5a5631d4672ddb10f93d106d", "summary": "Experts talk of ‘resit crisis’ as number accounts for nearly a quarter of maths and English entries, an all-time high This year’s GCSE results in England delivered something that teachers and policymakers had craved in recent years: stability, at least for most 16-year-olds. Covid and its aftermath had sent GCSE results seesawing until this summer, when results were more similar to the previous year than at any time since the pandemic struck in 2020. Continue reading...", "ingested_utc": "2025-08-21T18:49:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:49:58Z", "source": "Guardian_World", "title": "Brent Hinds, former lead guitarist of Mastodon, dies in motorcycle crash", "url": "https://www.theguardian.com/us-news/2025/aug/21/brent-hinds-mastodon-dies-motorcycle-crash", "id_key": "23bab79bdee829966db67aede524898f3794e90e1657d52bf10c0cf794c5a29c", "summary": "The 51-year-old, who left the successful heavy metal group earlier this year, died in a collision in Atlanta Brent Hinds, the former lead guitarist of the acclaimed heavy metal group Mastodon , was killed in Atlanta overnight. Police said Hinds, 51, died late on Wednesday after his Harley-Davidson collided with a BMW SUV whose driver did not yield while making a turn. The crash occurred at about 11.35pm. Continue reading...", "ingested_utc": "2025-08-21T18:49:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:15Z", "source": "Blockworks", "title": "DBS taps Ethereum for tokenized structured notes, but trading stays fenced", "url": "https://blockworks.co/news/dbs-ethereum-tokenized-structured-notes", "id_key": "f7cf920c0c1826a948a503096035ca70bf2c71efea73b5a86dc493fb538885e8", "summary": "Singapore’s largest bank is issuing crypto-linked structured notes on Ethereum, but the tokens will remain permissioned", "ingested_utc": "2025-08-21T18:50:15Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:20Z", "source": "CryptoSlate", "title": "How the US Treasury’s cash rebuild could cap Bitcoin enthusiasm through fall", "url": "https://cryptoslate.com/how-the-us-treasurys-cash-rebuild-could-cap-bitcoin-enthusiasm-through-fall/", "id_key": "3ba18f00efba21fa30c06424c2c34df909f54888c10f5a97a6ad0f2ccb61d113", "summary": "Macro conditions suggest Bitcoin (BTC) might face a multi-week performance slowdown if global M2 money supply peaks in September, according to a recent report by Delphi Digital. The BTC-M2 relationship using a 10-week offset shows M2 data already rolling over roughly 8% from projected September highs. Bitcoin has historically followed M2 peaks with performance lags, […] The post How the US Treasury’s cash rebuild could cap Bitcoin enthusiasm through fall appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T18:50:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:21Z", "source": "CryptoBriefing", "title": "State Street successfully executes first digital debt deal on JPMorgan’s blockchain-based platform", "url": "https://cryptobriefing.com/state-street-jpmorgan-custodian-digital-debt/", "id_key": "7b622d1dadf0820013ebe04b0445721203747f743106c39c697a49376e4a4fc1", "summary": "State Street's blockchain integration could revolutionize institutional debt markets, enhancing efficiency and reducing operational risks. The post State Street successfully executes first digital debt deal on JPMorgan’s blockchain-based platform appeared first on Crypto Briefing .", "ingested_utc": "2025-08-21T18:50:21Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:22Z", "source": "Protos", "title": "Bullish and Gemini IPO docs use new GAAP rules to boost income", "url": "https://protos.com/bullish-and-gemini-ipo-docs-use-new-gaap-rules-to-boost-income/", "id_key": "23839caf580335f92e3925a62d537c3195d4d833ae7c53ef209aa5eea29cb890", "summary": "Bullish and Gemini have used new accounting rules to make their net income/loss look even better, but the IPO was their main focus all along. The post Bullish and Gemini IPO docs use new GAAP rules to boost income appeared first on Protos .", "ingested_utc": "2025-08-21T18:50:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:25Z", "source": "CryptoNews", "title": "OKB, Aave, and Monero Could Make You Rich Beyond Your Wildest Dreams This Altcoin Season", "url": "https://cryptonews.com/news/altcoin-season-rotation-pulls-in-okb-aave-and-monero/", "id_key": "4ec9e6e0d3db100a58130743b947a6310c4e3ba366e19dfa1e99841afa82a41c", "summary": "Altcoin Season has developed unevenly, with liquidity and usage concentrating in a few names. OKB has benefited from exchange fee utility and burns, Aave has supported on-chain lending, and Monero has provided privacy settlement as Bitcoin dominance has remained above 60%. The post OKB, Aave, and Monero Could Make You Rich Beyond Your Wildest Dreams This Altcoin Season appeared first on Cryptonews .", "ingested_utc": "2025-08-21T18:50:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:26Z", "source": "CoinJournal", "title": "Verb Technology confirms $713M TON stake after $558M private placement", "url": "https://coinjournal.net/news/verb-technology-confirms-713m-ton-stake-after-558m-private-placement/", "id_key": "86af167a468fe89165a5a637d955e4855cf2786af5b0c62a8a009cabcbf17ae1", "summary": "Its treasury has surpassed $780M, comprising $713M in Toncoin and cash worth $67M. The milestone comes after a $558M private placement completed early this month. Verb aims to accumulate 5% of Toncoin’s circulating supply. Institutional players dominate market trends with dib-buying activities after the current broad market decline. NASDAQ-listed Verb Technology, which will soon rebrand […] The post Verb Technology confirms $713M TON stake after $558M private placement appeared first on CoinJournal .", "ingested_utc": "2025-08-21T18:50:26Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:26Z", "source": "CoinJournal", "title": "Kanye West’s “Yeezy Money” crypto crashes 61% despite $3B hype", "url": "https://coinjournal.net/news/kanye-wests-yeezy-money-crypto-crashes-61-despite-3b-hype/", "id_key": "f118958889aac486664c1b04073fe6e642b35f06d661e112a3e4b2f540633fbf", "summary": "Yeezy Money (YZY) hit $3B market cap before crashing over 60% in hours. Top wallets hold nearly 90% of the supply, sparking rug-pull fears. Insider trades flipped $450K into $1.5M within launch day. Kanye West’s bold entry into the world of digital assets has taken a dramatic turn. His Solana-based crypto, Yeezy Money (YZY), launched […] The post Kanye West’s “Yeezy Money” crypto crashes 61% despite $3B hype appeared first on CoinJournal .", "ingested_utc": "2025-08-21T18:50:26Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:50:28Z", "source": "Unchained", "title": "Stripe and Coinbase Are Racing to Own Crypto Payments. Who Will Win?", "url": "https://unchainedcrypto.com/stripe-and-coinbase-are-racing-to-own-crypto-payments-who-will-win/", "id_key": "1d7144223677c2ff15f0156c4f8c92d652a4be8d37ff37d343662c4ced0bee1a", "summary": "On the heels of the passage of the GENIUS Act, the market flooded with announcements from companies launching stablecoin initiatives, and even their own blockchains. Once largely the domain of crypto-native firms, the space is catching the attention of major financial services firms broadly, from banks to fintech giants. All ... The post Stripe and Coinbase Are Racing to Own Crypto Payments. Who Will Win? appeared first on Unchained .", "ingested_utc": "2025-08-21T18:50:28Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:52:29Z", "source": "NYTimes_Business", "title": "Bruce Slovin, Who Unified Jewish Archives in New York, Dies at 89", "url": "https://www.nytimes.com/2025/08/20/nyregion/bruce-slovin-dead.html", "id_key": "262c05ffc70400e468b96466d4879ed9609a149cc3fa1b313daeb242c76433a6", "summary": "A corporate executive who specialized in mergers, he brought together five Jewish institutions and their collections at the Center for Jewish History in Manhattan.", "ingested_utc": "2025-08-21T18:52:29Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:52:40Z", "source": "NPR_World", "title": "Russian airstrikes hit a U.S. factory in western Ukraine", "url": "https://www.npr.org/2025/08/21/g-s1-84146/russia-ukraine-american-factory", "id_key": "c6fd4eee405300b2f0d16382c88a4975ef3dbab0af7dd82925b3b42317ef2b55", "summary": "Two Russian cruise missiles hit a U.S. electronics plant in the far west of Ukraine. The strike was part of an overnight barrage of more than 600 drones and missiles.", "ingested_utc": "2025-08-21T18:52:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:52:41Z", "source": "FT_Home", "title": "Justice department calls on Fed to sack governor Lisa Cook", "url": "https://www.ft.com/content/6cd08c78-e61e-4ee5-93a6-0f5b811db9ac", "id_key": "bf220667ac7c3baee1960c2e4f4ac0131cfcfe3fd0a2aeed7b006bc8d6a1422e", "summary": "Letter to central bank chief Jay Powell is latest escalation in Trump administration’s assault on the institution", "ingested_utc": "2025-08-21T18:52:41Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:52:57Z", "source": "TheVerge_All", "title": "Microsoft’s Xbox handheld is a good first step toward a Windows gaming OS", "url": "https://www.theverge.com/notepad-microsoft-newsletter/763357/microsoft-asus-xbox-ally-handheld-hands-on-notepad", "id_key": "d37695984a7fa0c1cfb83363a7a8e0e8e0777fa97c2ffff92c45c9b792f3889a", "summary": "The first thing I did when I got my hands on the Xbox Ally was reboot it. I wanted to see exactly how Microsoft manages to hide Windows beneath the Xbox interface that's debuting on these handheld devices. After a short startup, I was met with the standard Windows login prompt. But I could use […]", "ingested_utc": "2025-08-21T18:52:57Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:52:58Z", "source": "ArsTechnica_All", "title": "After successes like Severance and The Studio, Apple TV+ gets a price hike", "url": "https://arstechnica.com/culture/2025/08/after-successes-like-severance-and-the-studio-apple-tv-gets-a-price-hike/", "id_key": "fc97dbf4bed7dad2141a7fbb7a867da89fd4f57eee4c1c0bb96154e0f38a6739", "summary": "Apple, like other streamers, is facing a difficult economic reality.", "ingested_utc": "2025-08-21T18:52:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:01Z", "source": "Engadget_All", "title": "Google Pixel 10 Pro Fold vs. Samsung Galaxy Z Fold 7: How the newest foldable phones stack up", "url": "https://www.engadget.com/mobile/smartphones/google-pixel-10-pro-fold-vs-samsung-galaxy-z-fold-7-how-the-newest-foldable-phones-stack-up-165018793.html?src=rss", "id_key": "caa40e5d83c8ae6ca5bffe38d999839e5749ef37c8d11b13ac012d714bd8c9e6", "summary": "The latest and greatest of the foldable phone world. (Google, Sam Rutherford/Engadget) Last month, the Samsung Galaxy Z Fold 7 was released and immediately became the de facto king of the foldable phone hill. But now a new challenger has arrived: The Pixel 10 Pro Fold . The full details are now available in the wake of Google's splashy launch event , which debuted the Fold alongside the full new Pixel 10 line, a new Pixel smartwatch and two new earbuds, too (see everything Google announced ). But the Pixel 10 Pro Fold was the star of the show, and it's vying with the Z Fold 7 for the title of best foldable — both offer very similar designs, but each bringing something unique to the table. Samsung launched its first foldable phone in 2019, so it's had quite a bit of time to refine the Galaxy Fold over the years. Google on the other hand just released its first Pixel Fold a couple years ago — but has already largely evened the match . And, of course, with enhanced Gemini AI software integration front and center, you'll have access to Google's impressive artificial intelligence features at nearly every turn. We'll break down how the Pixel 10 Pro Fold and Galaxy Z Fold 7 stack up to one another. You can also check out our comparison of the Pixel 9 Pro Fold and the Galaxy Fold 6 to see how much has changed in a year. Price First things first, how much will one of these high-tech folding phones cost you? That is the make-or-break question, after all. The newest Pixel foldable is still less expensive than this year's Z Fold: it starts at $1,799 while the Galaxy smartphone starts at $2,000. You don't have any other real choices for \"book-style\" foldables in the US market. The OnePlus Open can be had for $1,499, but it's almost two years old. And Apple's most expensive phone is currently the $1,599 1TB iPhone 16 Pro Max — but as a non-foldable model with just a single screen, it's hardly a straight comparison. If the rumor mill is to be believed, Apple may finally bow a foldable iPhone in 2026 . Dimensions and display It's a race for the largest display and Samsung won this time — but not by much. The Galaxy Z Fold is just a hair bigger than the Pixel Pro Fold. Both phones' inner displays are 8 inches across when fully opened, while Samsung comes out ahead on the outer display with 6.5 inches (the Pixel is 6.4 inches). As for height, the new foldable Pixel phone is 6.1 inches and the Galaxy Z is 6.2 inches — not a huge difference there. When unfolded, the Samsung wins on size efficiency, packing the identically sized 8-inch internal display into an area that's 0.3 inches smaller — 5.6 inches versus the Pixel's 5.9. This year, the Pixel 10 Pro Fold’s displays have been upgraded to a Super Actua Flex OLED display with ultra-thin glass. Both the front screen and back cover come equipped with Corning Gorilla Glass Victus 2. As for the Galaxy Z Fold 7, it has a Dynamic AMOLED display (inner and outer) and comes with the Corning Gorilla Glass Ceramic 2 on the front and the Gorilla Glass Victus 2 on the backside. The glass is ultra-thin, yet it's 50 percent thicker than before. While slightly bigger, the Galaxy Z Fold 7 is still lighter than the Pixel 10 Pro Fold. The Samsung model weighs only 7.6 ounces — down nearly an ounce from its 2024 model — while its Google competition comes in at 9.1 ounces (the same as last year's model). The Samsung Galaxy Z Fold 7 (left) compared to the new Pixel 10 Pro Fold (right). (Sam Rutherford/Engadget) Processor, RAM, storage and battery The Pixel 10 Fold Pro runs the Tensor G5 chip — Google says its CPU features 34 percent better performance compared to the Tensor G4 chip. The Z Fold 7 is powered by Qualcomm's Snapdragon 8 Elite for Galaxy. \"Everything feels fast and snappy,\" Engadget's Sam Rutherford said of the Snapdragon 8 Elite performance on the Z Fold 7. (Sam also has first impressions of the Pixel 10 Pro Fold , but speed tests will happen a bit later.) Both phones offer the choice of 256GB, 512GB or 1TB storage. On the RAM front, the Pixel Fold delivers 16GB across the line, while the Samsung model reserves that level for the top 1TB storage tier; the small models get 12GB instead. The Galaxy phone will cost you $2,419 if you decide you need the maximum amount of storage, whereas the Pixel Fold tops out at $2,149. When it comes to battery life, Samsung's foldable lasts up to 24 hours with a 4,400mAh battery. The Pixel lasts up to 30 hours thanks to a more capacious 5,015mAh battery rating. Furthermore, the Pixel Fold is certified for Qi2 wireless charging, which Google is branding as \" Pixelsnap \" across its 2025 Pixel line for the first time. Cameras For many shoppers, a phone is only as good as its cameras, and both of these phones bring a strong lens game. Each has three rear cameras, though they're different aesthetically. You'll notice the Pixel has a larger camera bump with two rows, while the Galaxy has a thinner vertical line of cameras. The Pixel 10 Pro Fold's rear camera array consists of a 48MP wide sensor, a 10.5MP ultrawide and a 10.8MP telephoto with 5x optical zoom. All three offer \"Super Res Zoom\" up to 20x with optical and electronic image stabilization. Per our own Sam Rutherford, the potential drawback here is that Google played it safe: \"The biggest potential shortcoming of the P10PF is that its camera hardware is largely staying the same. Granted, that's not a huge deal because the previous model had the best photo quality of any foldable phone.\" By comparison, the Samsung Galaxy Fold 7 rear camera trio includes the same 200MP wide-angle camera as the company's Galaxy S25 Ultra, but carries over the 12MP ultrawide and 10MP telephone from the Z Fold 6. Zoom levels are 3x optical and 30x digital. While we have yet to put the Pixel 10 Pro Fold cameras through their paces, Sam was still liking last year's Pixel Fold versus the Galaxy Z Fold 7 when he reviewed the latter: \"At night, the Fold 7's shots remained surprisingly sharp. I still prefer the Pixel 9 Pro Fold due to its more accurate white balance and often sharper focus, though Samsung's phone isn't far behind.\" And the entire Pixel line's cameras are (of course) supercharged with some new Google Gemini AI niceties, like the Camera Coach feature that enables voice-controlled photo editing. Both the Pixel and Galaxy offer similar 10MP specs on their front and inner selfie cameras. Color options If you like having multiple colors to choose from, the Galaxy Z Fold 7 is winning in this category. It comes in Mint, Jetblack, Blue Shadow and Silver Shadow. Mint is only available if you buy your phone online — you won't be seeing that one in stores. As for the Pixel 10 Fold Pro, your options are Moonstone and Jade. Full specs comparison Google Pixel 10 Pro Fold Samsung Galaxy Z Fold 7 Starting price $1,799 $2,000 Dimensions Folded: 6.1 x 3.0 x 0.4 inches (155.2 x 76.3 x 10.8mm) Unfolded: 6.1 x 5.9 x 0.2 inches (155.2 x 150.4 x 5.2mm) Folded: 6.2 x 2.9 x 0.4 inches (158.4 x 72.8 x 8.9mm) Unfolded: 6.2 x 5.6 x 0.2 inches (158.4 x 143.2 x 4.2mm) Weight 9.1 oz (258g) 7.6 oz (215g) Processor Tensor G5 Snapdragon 8 Elite for Galaxy (3nm) Display Inner: 8-inch Super Actua Outer: 6.4-inch Actua Inner: 8-inch Dynamic AMOLED Outer: 6.5-inch Dynamic AMOLED Storage 256GB / 512GB / 1TB 256GB / 512GB / 1TB RAM 16GB 12GB (for 256GB, 512GB configs) | 16GB (for 1TB config) Battery 5,015mAh | \"Up to 30 hours\" 4,400mAh | \"Up to 24 hours\" Camera Main: 48MP wide (F1.7) | 10.5MP Ultrawide (F2.2) | 10.8MP Telephoto lens (F3.1) with 5x optical | Super Res Zoom up to 20x Front: 10MP (F2.2) Inner: 10 MP (F2.2) Main: 200MP Wide (F1.7) | 12MP Ultrawide (F2.2) | 10 MP (F2.4) Telephoto (F2.4) with 3x optical zoom Front: 10MP (F2.2) Inner: 10MP (F2.2) Stylus support No No Colors Moonstone, Jade Mint (online only), Jetblack, Blue Shadow, Silver Shadow Updated August 21, 2:26PM ET: Added a section comparing the cameras on both phones. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/google-pixel-10-pro-fold-vs-samsung-galaxy-z-fold-7-how-the-newest-foldable-phones-stack-up-165018793.html?src=rss", "ingested_utc": "2025-08-21T18:53:01Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:01Z", "source": "Engadget_All", "title": "Feds investigate Tesla over inaccurate autopilot and FSD crash reports", "url": "https://www.engadget.com/transportation/evs/feds-investigate-tesla-over-inaccurate-autopilot-and-fsd-crash-reports-175837772.html?src=rss", "id_key": "041cc77c2ef8ee744a874dbff0419d29755d6b24489c363899c235f06bce35b6", "summary": "The National Highway Traffic Safety Administration (NHTSA) just announced an investigation into Tesla regarding its Autopilot and Full Self-Driving (FSD) systems, according to a report by Electrek . The road safety regulator says the probe involves inconsistencies with how the company reports crashes regarding the aforementioned systems. The NHTSA requires automakers to report crashes involving autonomous and driver assistance systems within five days of being notified of them. The agency claims that Tesla has sometimes waited months to report these crashes. It's worth remembering that the company's vehicles are outfitted with technology that automatically records and sends out data regarding a collision within minutes of an accident. Tesla has acknowledged the issue but says this is all due to an error in its systems, which has since been fixed. However, the agency will continue the investigation, citing that it will \"assess whether any reports of prior incidents remain outstanding and whether the reports that were submitted include all of the required and available data.\" The NHTSA has good reason to not accept Tesla's explanation at face value. It currently has other open investigations into the company. There's one involving its remote parking feature that has allegedly caused a number of crashes and another looking into the efficacy of a recent software fix that followed a massive recall . NHTSA Tesla also recently lost a wrongful death case involving an Autopilot crash in which it was revealed in testimony that the company lied and misled police and plaintiffs to hide pertinent data. The company leads other auto manufacturers by a country mile when it comes to crashes involving driver assistance systems . Tesla vehicles were involved in the vast majority of total incidents reported to the NHTSA from 2021 to 2024. That translates to over 2,300 crashes, compared to 55 for second-place GM . This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/feds-investigate-tesla-over-inaccurate-autopilot-and-fsd-crash-reports-175837772.html?src=rss", "ingested_utc": "2025-08-21T18:53:01Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:09Z", "source": "TheStreet_Top", "title": "Amazon Promises Low Prices in Same Day, Fresh Grocery Push", "url": "https://www.thestreet.com/retail/amazon-has-fresh-recipe-to-disrupt-kroger-publix-local-grocery", "id_key": "358c1630a0eca1ed43ce4d0bbe08497de47774445a8da9f25da2fff88cee6a3b", "summary": "After early failures, Amazon is now quietly building a grocery empire.", "ingested_utc": "2025-08-21T18:53:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:09Z", "source": "TheStreet_Top", "title": "43-year-old auto parts retail chain files Chapter 11 bankruptcy", "url": "https://www.thestreet.com/retail/struggling-auto-parts-retail-chain-files-chapter-11-bankruptcy", "id_key": "845a5d13dce764a37624968bba107cc2de7013b1fa321cc63d848822b1586166", "summary": "The auto parts and accessories retail chain files for bankruptcy protection, seeking to sell its assets.", "ingested_utc": "2025-08-21T18:53:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:10Z", "source": "AlJazeera_All", "title": "Walmart scoops customers from rivals but warns inventory cost is rising", "url": "https://www.aljazeera.com/economy/2025/8/21/walmart-scoops-customers-from-rivals-but-warns-inventory-cost-is-rising?traffic_source=rss", "id_key": "a48caf77ecb4446dfc830ff6742a2b9fbca02a707213b0726f22217ccfffc0e3", "summary": "Second-quarter results showed that the retailer has continued to benefit from price sensitivity among US consumers.", "ingested_utc": "2025-08-21T18:53:10Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:10Z", "source": "AlJazeera_All", "title": "Lebanon begins disarming Palestinian groups in refugee camps", "url": "https://www.aljazeera.com/news/2025/8/21/lebanon-begins-disarming-palestinian-groups-in-refugee-camps?traffic_source=rss", "id_key": "285903dde219f61cf415e828a5790d6e292d6dacde4a037d27e5fa9203bb31a5", "summary": "PM's office says the weapons transfer to the Lebanese army marks the start of a wider disarmament campaign.", "ingested_utc": "2025-08-21T18:53:10Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:17Z", "source": "FinancialPost_Business", "title": "Next Hydrogen Announces Closing of $1.5 million in Loans", "url": "https://financialpost.com/globe-newswire/next-hydrogen-announces-closing-of-1-5-million-in-loans", "id_key": "27b9da9b71c3793a8c4194f604c506d240f3d95b1274c74c0e37810bf757c72c", "summary": "MISSISSAUGA, Ontario, Aug. 21, 2025 (GLOBE NEWSWIRE) — Next Hydrogen Solutions Inc. (the “Company” or “Next Hydrogen”) (TSXV:NXH, OTC:NXHSF) is pleased to announce that further to its press release dated July 23, 2025, it entered into a loan agreement with certain existing directors and officers of the Company (the “Lenders”) providing for the advance of […]", "ingested_utc": "2025-08-21T18:53:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:17Z", "source": "FinancialPost_Business", "title": "Canada cultivates Nordic connections to reduce reliance on U.S.", "url": "https://financialpost.com/financial-times/canada-nordic-connections-reliance-us", "id_key": "dea07006248eade28137e77c3ce4128fd569c9c5ecf6c7043e01fd013d3a7832", "summary": "Industry minister tours Sweden and Finland to explore commercial ties while also seeking to bolster Arctic security", "ingested_utc": "2025-08-21T18:53:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:17Z", "source": "FinancialPost_Business", "title": "Introducing the World’s First Global Cannabis Infrastructure Platform from Tyson 2.0 and Green Success 1.0", "url": "https://financialpost.com/globe-newswire/introducing-the-worlds-first-global-cannabis-infrastructure-platform-from-tyson-2-0-and-green-success-1-0", "id_key": "90463b05565c587bb571f18dab28564974df56b6ad46a082490a570705f303bd", "summary": "BERLIN, Aug. 21, 2025 (GLOBE NEWSWIRE) — Green Success 1.0 (GS1.0), a next-generation cannabis infrastructure company, today announced a strategic partnership with legendary boxer Mike Tyson and U.S.-based powerhouse Tyson 2.0. This collaboration will establish a global infrastructure to support compliant, brand-led cannabis expansion, with a focus on bridging legacy culture with advanced automation, digital […]", "ingested_utc": "2025-08-21T18:53:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:17Z", "source": "FinancialPost_Business", "title": "Streamline your workflow with Microsoft Office 2021’s productivity apps", "url": "https://financialpost.com/personal-finance/business-essentials/microsoft-office-2021-productivity-apps", "id_key": "e754708103ee15a215f14ac8b7979e96d622a22730591cf70470941a1281ba5d", "summary": "Benefit from Microsoft Office's arsenal of productivity-enhancing apps.", "ingested_utc": "2025-08-21T18:53:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:17Z", "source": "FinancialPost_Business", "title": "Evolve Plans to Launch the Evolve US Equity UltraYield ETF", "url": "https://financialpost.com/globe-newswire/evolve-plans-to-launch-the-evolve-us-equity-ultrayield-etf", "id_key": "39c477805cbc0ea03efb2b090b1211566d035d101474164939d03562d4ded983", "summary": "TORONTO, Aug. 21, 2025 (GLOBE NEWSWIRE) — Evolve Funds Group Inc. (“Evolve” or the “Manager”) is pleased to announce that it has filed a preliminary prospectus with the Canadian securities regulators for plans to list the Evolve US Equity UltraYield ETF (“BIGY” or the “Evolve Fund”) on the Toronto Stock Exchange. BIGY aims to offer investors modestly levered […]", "ingested_utc": "2025-08-21T18:53:17Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T18:53:17Z", "source": "FinancialPost_Business", "title": "3 principles to invest by, whatever comes next", "url": "https://financialpost.com/pmn/3-principles-to-invest-by-whatever-comes-next", "id_key": "d01c5bec74ffad0d7f63a0c4eeb3dd418d4eddad58a25925f60ab8714609ae25", "summary": "I recently opened a second-quarter investment account statement, not to euphoria_but relief. Let’s not forget, US equities flirted with a bear market earlier this year. There were concerns that China’s DeepSeek artificial intelligence would bring down US technology titans. There were the tariffs. Yet, here we sit in the third quarter of 2025 with the […]", "ingested_utc": "2025-08-21T18:53:17Z"}
