{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T11:49:23Z", "source": "Guardian_Business", "title": "Greater risk of toxic derailments if $85bn railroad merger is approved, warn unions", "url": "https://www.theguardian.com/us-news/2025/aug/25/union-pacific-norfolk-southern-railroad-merger", "id_key": "07df1377c8783614faf0db6e856379b62557d9cefec17a8cfe79a841827cc399", "summary": "Workers sound alarm over proposed Union Pacific and Norfolk Southern deal and its risks to jobs, prices and power A proposed mega-merger of two of the largest railroad companies in the US will hurt jobs, raise costs for consumers and increase the risk of more catastrophic train crashes, according to workers and unions. Union Pacific proposed a $85bn deal to buy Norfolk Southern last month, which would create the first transcontinental railroad network in the US. Continue reading...", "ingested_utc": "2025-08-25T11:49:23Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T11:49:24Z", "source": "Guardian_World", "title": "Politicians risk ignoring many voters by not being on TikTok, Tory MP warns", "url": "https://www.theguardian.com/politics/2025/aug/25/uk-politicians-risk-ignoring-voters-tiktok-tory-mp-luke-evans", "id_key": "5dbb3d173a89694a4ee1c57008b242a50f4454a8a5dcbd96a8be7937445d44e4", "summary": "‘You’ve got to be where the electorate are,’ says Luke Evans, the sixth-most followed UK politician on the platform Politicians are at risk of ignoring a large chunk of the electorate because of their reluctance to communicate on TikTok, according to a Tory MP who has one of the biggest followings of any UK politician on the social media platform. Luke Evans, who is the sixth-most followed UK politician on TikTok, said his colleagues were missing out on engaging particularly with young voters because of security concerns and a lack of knowledge about the platform. Continue reading...", "ingested_utc": "2025-08-25T11:49:24Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T11:52:10Z", "source": "Engadget_All", "title": "Google tests QR code verification for text messages", "url": "https://www.engadget.com/mobile/google-tests-qr-code-verification-for-text-messages-114357424.html?src=rss", "id_key": "e0f96c8eb96c853d33eaabaa3a3d5ac372f0b4bfec58e06465e53f19f9db2c56", "summary": "Google is changing the way you confirm if contacts are legit. The company has begun rolling out a QR code to verify that the person you're communicating with is, in fact, who they say they are, 9to5Google reports . The feature is currently available in beta. An end-to-end encryption card isn't anything new, but verifying the encryption meant seeing an 80-digit code you could compare. Now, you'll still go Google Messages, tap their name and then go to their details page. But, instead, there will be an option to show your QR code or scan their code. Verify keys \"ensure only you and your contact can read the RCS messages you send each other,\" Google states. The 80-digit comparison is still available if there's an issue with the QR code. Google first announced the new feature last October, stating, \"We’re creating a unified system for public key verification across different apps, which you can verify through QR code scanning or number comparison.\" At the time, it said the feature would be available on all Android 9 devices and newer. QR codes could be the new norm at Google. The company is also planning to switch SMS-based two-factor authentication on Gmail to QR codes. This article originally appeared on Engadget at https://www.engadget.com/mobile/google-tests-qr-code-verification-for-text-messages-114357424.html?src=rss", "ingested_utc": "2025-08-25T11:52:10Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T11:52:19Z", "source": "AlJazeera_All", "title": "Bangladeshi leader demands justice for Rohingya, ‘safe return’ to Myanmar", "url": "https://www.aljazeera.com/news/2025/8/25/bangladeshi-leader-demands-justice-for-rohingya-safe-return-to-myanmar?traffic_source=rss", "id_key": "050f3be355c560adc0df753f0f8802f534991737b6ce798b4db1dcbe7bd1ee9e", "summary": "Nobel laureate Muhammad Yunus says justice and security are vital for Rohingya before returning to Myanmar.", "ingested_utc": "2025-08-25T11:52:19Z"}
