{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:29Z", "source": "Guardian_Business", "title": "Soho House members’ club to go private in $2.7bn deal as Ashton Kutcher joins board", "url": "https://www.theguardian.com/business/2025/aug/18/soho-house-members-club-deal-private-mcr-hotels-nyse", "id_key": "91b8be342426f21d69c04676c030ba3d5f720cc2d82b81ccb4cdb4c9afbe375a", "summary": "MCR Hotels to lead new equity investors in members’ club chain after four years on New York stock exchange Business live – latest updates The members’ club chain Soho House has agreed a $2.7bn (£2bn) deal to take it private after a tricky four years listed on the New York stock exchange. New York-based MCR Hotels will lead new equity investors in the chain of clubs as part of a deal that will involve it ditching its stock market listing. Continue reading...", "ingested_utc": "2025-08-18T13:48:29Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "Zelenskyy accuses Russia of ‘cynical’ attacks before Washington talks", "url": "https://www.theguardian.com/world/2025/aug/18/trump-ukraine-crimea-nato-zelesnkyy-washington-meeting", "id_key": "502f131704b88e9b0e88d5121262d84a0dfa961eceae3393d4b9b87391279971", "summary": "Ukrainian president says latest strikes have killed at least 10 people and intended to ‘humiliate diplomatic efforts’ Russia-Ukraine war – latest news updates Volodymyr Zelenskyy has accused Russia of trying to humiliate Ukraine and Europe by “deliberately killing civilians” before talks with Donald Trump in the White House to be attended by Ukraine’s president and a group of European leaders. Zelenskyy described the latest strikes by Moscow on four Ukrainian cities as “demonstrative and cynical”. At least seven people were killed in a drone attack on Kharkiv, including a small girl, while three were killed in another bombing in Zaporizhzhia, he said. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "Former Swedish security adviser on trial for allegedly mislaying classified papers", "url": "https://www.theguardian.com/world/2025/aug/18/former-swedish-security-adviser-trial-allegedly-mislaying-classified-papers-henrik-landerholm", "id_key": "062ac883075e2252fee15a0b0928ef96547454a7d68e320ea3698919835a6465", "summary": "Henrik Landerholm resigned in January after he was accused of leaving official documents in a hotel Sweden’s former national security adviser has gone on trial for the allegedly negligent handling of classified information, seven months after he resigned amid revelations he had left official documents in a hotel. Henrik Landerholm, a longstanding friend of the Swedish prime minister, Ulf Kristersson, appeared on Monday in front of a packed gallery at Attunda district court in Sollentuna, north of Stockholm. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "UK metals firms threaten to sue government over tariffs on steel imports from Asia", "url": "https://www.theguardian.com/business/2025/aug/18/uk-metals-steel-imports-asia", "id_key": "5a48a50d95a6698a2e98409ca38c6f16aee1d6590a8cb22cca6f73bb22a93f17", "summary": "Companies send letter to business secretary complaining new rules were imposed with 24 hours’ notice Business live – latest updates UK metals companies have threatened to take legal action against the government over tariffs on raw steel imports from Asia which they claim have caused a “tsunami” of problems for the industry. Earlier this summer, the business secretary, Jonathan Reynolds, reduced the amount of raw steel from Vietnam and South Korea that can be imported tariff-free in a move designed to protect UK raw steel makers, which face competition from cheap imports. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "Feargal Sharkey accuses Environment Agency of illegally draining River Lea", "url": "https://www.theguardian.com/environment/2025/aug/18/feargal-sharkey-accuses-environment-agency-of-illegally-draining-river-lea-court-action-threat-abstraction-fishing-club", "id_key": "052b1cf666df3a818e6f21ca6456a2e74eb3b63057a12546ac7610004654ce88", "summary": "Fishing club chaired by singer threatens court action over abstraction it says is putting rare trout population at risk The singer and environmentalist Feargal Sharkey is threatening to take the Environment Agency to court for draining a river that hosts the oldest fishing club in England and putting a rare population of brown trout at risk. The former Undertones frontman chairs the Amwell Magna Fishery, which has used the secluded stretch of the River Lea in Hertfordshire since 1841. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "Trump says he will sign order targeting mail-in ballots and voting machines ahead of 2026 midterm elections – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/18/national-guard-deployment-three-states-washington-dc-donald-trump-administration-us-politics-latest-updates-news", "id_key": "10e457c505c823d51784a91540df82b4ad1848b2b7a478854d0218fddcc82a5f", "summary": "President attacks ‘highly inaccurate, very expensive, and seriously controversial’ voting machines in Truth Social post An aid group that coordinates medical care in the United States for badly injured children from Gaza has said it is “distressed” by the US state department’s decision to stop issuing visitor visas for Palestinians after a far-right influencer complained directly to the secretary of state about their work. Laura Loomer, who has previously described herself as a “proud Islamophobe”, told the New York Times that she had spoken to Marco Rubio on Friday night to warn the secretary of state of what she called the threat posed by “Islamic invaders”. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "US private prison healthcare industry grows despite alleged medical neglect", "url": "https://www.theguardian.com/us-news/2025/aug/18/us-private-prison-healthcare-industry", "id_key": "20550c8e27fca136193bb933e6769673280b9ebeab182e6f740c4c57ed3853df", "summary": "The Guardian examined two private-equity backed companies that have been accused of failing to protect inmates from risk of harm, and even preventable death Early one morning this spring, staff at a Santa Barbara county jail heard screams coming from one of the cells. A 57-year-old inmate was moaning and hyperventilating. She said her “guts are all twisted up”. Rather than sending her to the ER, medical staff chalked her pain up to opioid withdrawal, since they had taken a prescription opioid away upon her arrival days before, a grand jury investigation later found. They placed the inmate – referred to as CF in the grand jury’s report – on mental health observation and gave her Tylenol. Even as the cell floor became covered in vomit, staff ignored her requests to go to the hospital. The documentation that should have been filled out to explain why her request was not honored was never completed. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "Washington DC restaurants suffer sharp drop in diners since Trump crackdown", "url": "https://www.theguardian.com/us-news/2025/aug/18/trump-washington-dc-national-guard-restaurants", "id_key": "f0eec92f32b39b4470db302941778caa7580491a08e28d9fe877b7c00a82452d", "summary": "Eating out drops by up to 31% amid federal takeover of policing that Democrats call ‘stunt’ to distract from Epstein US police – live updates The number of people eating at restaurants in Washington DC has plummeted since Donald Trump deployed federal troops to the city, according to data, as the president’s purported crackdown on crime continues. Research by Open Table found that restaurant attendance was down every day last week compared with 2024, with the number of diners dipping by 31% on Wednesday, two days after Trump ordered the national guard to patrol Washington. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "Hurricane Erin knocks out power lines in Puerto Rico before heading north", "url": "https://www.theguardian.com/us-news/2025/aug/18/hurricane-erin-puerto-rico-power", "id_key": "61ddd655b40a788bddb143aaa539344e50b2b79c925f725874bf541431043dd1", "summary": "Most of more than 147,000 customers affected reconnected by Monday as category 4 storm not forecast to make landfall Hurricane Erin ’s outer bands pelted the US territory of Puerto Rico with heavy rains and tropical-storm winds during the day on Sunday, knocking out power to tens of thousands of customers, according to officials. At one point, more than 147,000 utility customers were without power in Puerto Rico, according to Luma Energy, a private company that oversees the transmission and distribution of power on the island. By 5.30am on Monday, 96.3% of customers had electric service, with most who were affected by outages being concentrated in the Caguas, Mayagüez and San Juan regions, Luma said on X. Guardian staff contributed reporting Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:30Z", "source": "Guardian_World", "title": "Trump’s move to sanitize US history gets little support with national park visitors", "url": "https://www.theguardian.com/us-news/2025/aug/18/national-park-visitors-signs-trump", "id_key": "fc5c5495e28a7dc7a67f733166c4ecedefafb554599bb07ba8b33d312d0f701c", "summary": "Exclusive: Public comments show that a crackdown on signs ‘disparaging’ Americans is not popular As part of his administration’s war on “woke”, Donald Trump has asked the American public to report anything “negative” about Americans in US national parks. But the public has largely refused to support a world view without inconvenient historical facts, comments submitted from national parks and seen by the Guardian show. Notices have been erected at every National Park Service (NPS) site, which spans 433 national parks, monuments and battlefields, following an order from May entitled “Restoring Truth and Sanity to American History” , issued by Trump’s department of the interior. The president had demanded a crackdown on any material that “inappropriately disparages Americans”. Continue reading...", "ingested_utc": "2025-08-18T13:48:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:47Z", "source": "BitcoinMagazine", "title": "Bitcoin Price Slides Below $115,000 As Strategy And Metaplanet Buys Additional Bitcoin", "url": "https://bitcoinmagazine.com/markets/bitcoin-price-slides-below-115000-as-strategy-and-metaplanet-buys-additional-bitcoin", "id_key": "95cbd5c88231f3ba9a1d194fe6d98a775a179d3ab59b30041ec7627c5e59a02f", "summary": "Bitcoin Magazine Bitcoin Price Slides Below $115,000 As Strategy And Metaplanet Buys Additional Bitcoin Bitcoin price dropped below $115,000 as Metaplanet acquired 775 BTC for $93 million at $120,006 per coin, bringing its holdings to 18,888 BTC, while Strategy purchased 430 BTC for $51.4 million, increasing its total to 629,376 BTC. This post Bitcoin Price Slides Below $115,000 As Strategy And Metaplanet Buys Additional Bitcoin first appeared on Bitcoin Magazine and is written by Vivek Sen .", "ingested_utc": "2025-08-18T13:48:47Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:48Z", "source": "CryptoSlate", "title": "Ethereum captures 77% of $3.75 billion inflows while Bitcoin trails behind", "url": "https://cryptoslate.com/ethereum-captures-77-of-3-75-billion-inflows-while-bitcoin-trails-behind/", "id_key": "f0074e743357e15cb5aa57d72953a6489a94435ea1b0cd0c16fc6161ce8050f8", "summary": "Digital asset investment products pulled in $3.75 billion in net inflows last week, marking one of the largest weekly gains in history, according to CoinShares latest weekly report. The renewed appetite follows several weeks of tepid market sentiment and coincides with a recent crypto price rally. Notably, these inflows lifted total assets under management (AuM) […] The post Ethereum captures 77% of $3.75 billion inflows while Bitcoin trails behind appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T13:48:48Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:48Z", "source": "CryptoSlate", "title": "Tokenized assets near $300 billion as Wall Street quietly floods on chain", "url": "https://cryptoslate.com/tokenized-assets-near-300-billion-as-wall-street-quietly-floods-on-chain/", "id_key": "20d160d762adf2b384ad9c6b0b844a691e1947a2be184c48ddc1177e14c94602", "summary": "Tokenized assets recorded on public blockchains have reached approximately $293 billion, according to data from RWA.xyz. The figure, which includes stablecoins valued at about $266.7 billion, places tokenization near the $300 billion threshold, emphasizing its role as a structural layer in on-chain financial markets. Excluding stablecoins, tokenized real-world assets account for around $26.3 billion. The […] The post Tokenized assets near $300 billion as Wall Street quietly floods on chain appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T13:48:48Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:49Z", "source": "CryptoBriefing", "title": "Bhutan moves 800 BTC to new wallets, possibly for Binance deposit", "url": "https://cryptobriefing.com/bhutan-bitcoin-transfer-binance/", "id_key": "2aea3bb7d49b74dedcd8b2194c47674a22ad3a6d2f2d263fdd5f5c38caf2e673", "summary": "Bhutan's strategic Bitcoin management could enhance its economic resilience and attract ESG-focused investments through green crypto initiatives. The post Bhutan moves 800 BTC to new wallets, possibly for Binance deposit appeared first on Crypto Briefing .", "ingested_utc": "2025-08-18T13:48:49Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:49Z", "source": "CryptoBriefing", "title": "Tom Lee’s BitMine reports holding over $6.6 billion in Ethereum and Bitcoin", "url": "https://cryptobriefing.com/ethereum-treasury-holdings-bitmine-3/", "id_key": "7d61ed67ab5e3afb9c92dc5081125e59e8dca6cc3fcd95ac562ff88da3f1d50b", "summary": "BitMine's massive crypto holdings could reshape financial systems, highlighting Ethereum's pivotal role in future macroeconomic trends. The post Tom Lee’s BitMine reports holding over $6.6 billion in Ethereum and Bitcoin appeared first on Crypto Briefing .", "ingested_utc": "2025-08-18T13:48:49Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:49Z", "source": "CryptoBriefing", "title": "Michael Saylor’s Strategy acquires 430 Bitcoin, now owns 3% of Bitcoin in circulation", "url": "https://cryptobriefing.com/bitcoin-treasury-strategy-saylor/", "id_key": "9e186c8f917e6ad8f076f97b3893d7ab0db0fcfde675045446e402e611ad12d4", "summary": "Michael Saylor's firm's growing Bitcoin holdings could influence market dynamics and raise questions about corporate influence in cryptocurrency. The post Michael Saylor’s Strategy acquires 430 Bitcoin, now owns 3% of Bitcoin in circulation appeared first on Crypto Briefing .", "ingested_utc": "2025-08-18T13:48:49Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:52Z", "source": "CryptoNews", "title": "Circle Mints $1.25B USDC on Solana in 7 Days, Hits $24B in 2025 — Here’s Why It Matters", "url": "https://cryptonews.com/news/circle-mints-1-25b-usdc-on-solana-in-7-days-hits-24b-in-2025-heres-why-it-matters/", "id_key": "90420e3246bbeb1337ee357f830504a4c941790f56943d75ee7cb16ed63b5e79", "summary": "Circle’s latest $1.25B USDC surge on Solana crowns a $24B 2025 minting run, giving USDC a commanding 72% of Solana’s $11.6B stablecoin pool. The post Circle Mints $1.25B USDC on Solana in 7 Days, Hits $24B in 2025 — Here’s Why It Matters appeared first on Cryptonews .", "ingested_utc": "2025-08-18T13:48:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:52Z", "source": "CryptoNews", "title": "Is Chainlink the Lone Wolf of This Bull Run? LINK Price Remains In the Green Despite Severe Market Crash", "url": "https://cryptonews.com/news/is-chainlink-the-lone-wolf-of-this-bull-run-link-price-remains-in-the-green-despite-severe-market-crash/", "id_key": "239af72cbff7bd5dc85f56abf838a5420108dba171ecc161af77389a53590979", "summary": "The LINK price has consolidated while the rest of the market has fallen – is this a bullish sign for Chainlink's future? The post Is Chainlink the Lone Wolf of This Bull Run? LINK Price Remains In the Green Despite Severe Market Crash appeared first on Cryptonews .", "ingested_utc": "2025-08-18T13:48:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:52Z", "source": "CryptoNews", "title": "$360M in Crypto Longs Liquidated as Bitcoin Falls Below $116K – Is This the Top?", "url": "https://cryptonews.com/news/360m-in-crypto-longs-liquidated-as-bitcoin-falls-below-116k-is-this-the-top/", "id_key": "765cd421268562857ff17af3dd79e90aa28039edc88a13a6e2ab424611bc3ed8", "summary": "$360M in crypto longs liquidated as Bitcoin drops below $116K and Ethereum falls under $4,300 with 116,598 traders eliminated days after Bitcoin's $124,457 all-time high. The post $360M in Crypto Longs Liquidated as Bitcoin Falls Below $116K – Is This the Top? appeared first on Cryptonews .", "ingested_utc": "2025-08-18T13:48:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:52Z", "source": "CryptoNews", "title": "XRP Ledger Ranks Lowest for Security Among 15 Blockchains in New Report", "url": "https://cryptonews.com/news/xrp-ledger-ranks-lowest-for-security-among-15-blockchains-in-new-report/", "id_key": "f0b0e0e1c7618d7c76dba99f2e02252a63b964d339ad3e2c33260e140d19f6f1", "summary": "The XRP Ledger, the blockchain behind the world’s third-largest cryptocurrency, has come under scrutiny after ranking last in a new security assessment. The post XRP Ledger Ranks Lowest for Security Among 15 Blockchains in New Report appeared first on Cryptonews .", "ingested_utc": "2025-08-18T13:48:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:52Z", "source": "CryptoNews", "title": "World’s 8th Largest Bank CMB Launches 24/7 Bitcoin and Crypto Trading in Hong Kong", "url": "https://cryptonews.com/news/worlds-8th-largest-bank-cmb-launches-24-7-bitcoin-and-crypto-trading-in-hong-kong/", "id_key": "9291246d1c64b3a50640637778d68b17828e1636fae607cde990eb634c727d15", "summary": "CMB International Securities launches 24/7 Bitcoin and crypto trading services on August 18 becoming first Chinese bank-affiliated securities firm offering compliant virtual asset transactions in Hong Kong. The post World’s 8th Largest Bank CMB Launches 24/7 Bitcoin and Crypto Trading in Hong Kong appeared first on Cryptonews .", "ingested_utc": "2025-08-18T13:48:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:53Z", "source": "CoinJournal", "title": "NEO price dips 7% as Binance ends support for Neo Legacy Network", "url": "https://coinjournal.net/news/neo-price-dips-7-as-binance-ends-support-for-neo-legacy-network/", "id_key": "cc0ce7a89715e6945ddc742c354a87a5fa02ffd49eddfa90c126428eff923152", "summary": "The exchange has confirmed plans to halt deposits and withdrawals on Neo Legacy. The phase-out will begin on August 25, with a complete shutdown scheduled for October 15. NEO has plummeted amidst community uncertainty. The digital assets landscape endured a bloodbath on Monday as the global crypto market cap plunged 3.27% in the past day […] The post NEO price dips 7% as Binance ends support for Neo Legacy Network appeared first on CoinJournal .", "ingested_utc": "2025-08-18T13:48:53Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:48:53Z", "source": "CoinJournal", "title": "Bio Protocol defies crypto downturn with a 720% surge in volume", "url": "https://coinjournal.net/news/bio-protocol-defies-crypto-downturn-with-a-720-surge-in-volume/", "id_key": "01ac4d3ab73507ce558bbf5874c00dccc89431e9a021284c60a1c96ad9593a68", "summary": "Bio Protocol price rose more than 50% as bulls defied broader market selling to hit $1.46 Despite overall sell-off pressure, BIO price is up double-digits in 24 hours as volume spikes 720%. BIO has benefited from key network developments, including staking and partnerships. The price of Bio Protocol (BIO) shrugged off a broader crypto downturn […] The post Bio Protocol defies crypto downturn with a 720% surge in volume appeared first on CoinJournal .", "ingested_utc": "2025-08-18T13:48:53Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:50:43Z", "source": "NYTimes_Business", "title": "MSNBC to Change Its Name to MS NOW", "url": "https://www.nytimes.com/2025/08/18/business/media/goodbye-msnbc-hello-ms-now.html", "id_key": "76c6a782147c30c85b01f6e7a7a359cf0f5735fd129153006f1ae32a51b0d507", "summary": "The cable news network is changing its name this year because a corporate spinoff is separating MSNBC from its cousin, NBC News.", "ingested_utc": "2025-08-18T13:50:43Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:50:43Z", "source": "NYTimes_Business", "title": "The Bull and Bear Cases for Another Market Rally", "url": "https://www.nytimes.com/2025/08/18/business/dealbook/sp-500-market-valuations.html", "id_key": "0192532a4020fb59afc6ab5e0d342a11487b7d0d5b341ac90c01dafa85693833", "summary": "Stocks are still flying high. But doubts are creeping in about the S&P 500’s run, as some analysts have flashbacks to valuations during the dotcom boom.", "ingested_utc": "2025-08-18T13:50:43Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:50:43Z", "source": "NYTimes_Business", "title": "Uncle Nearest Whiskey Is in a Fiscal Bind", "url": "https://www.nytimes.com/2025/08/14/dining/uncle-nearest-whiskey-receivership.html", "id_key": "686024669f096a0adb6e7b7062d22622731d35070677a1d4280fef492de278fd", "summary": "A federal judge has ordered that Uncle Nearest be placed in receivership, after a lender claimed the company’s finances are in disarray.", "ingested_utc": "2025-08-18T13:50:43Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:50:52Z", "source": "NPR_Top", "title": "Chinese literature is tough to find in English. One editor hopes to change that", "url": "https://www.npr.org/2025/08/15/nx-s1-5461446/expanding-chinese-literature-in-america", "id_key": "c1caeab0816003fdc5e7ab70f7f56e0ff042cf94aa34b3d6be2dd9f961fdfd83", "summary": "The novel Women Seated is a thriller about a nanny for a rich family and a kidnapping gone awry. It's the first in a new effort to redefine the types of Chinese literature get translated into English.", "ingested_utc": "2025-08-18T13:50:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:50:55Z", "source": "FT_Home", "title": "Zelenskyy and European leaders set to press Trump on Ukraine", "url": "https://www.ft.com/content/1ddf31d2-2083-432e-aabc-a2daa562646a", "id_key": "47348eda85a4c78e34a6f25ecea6c80fea54a40a9a5178b52394546df83505d2", "summary": "US security guarantees in focus as Trump says Kyiv can end war ‘almost immediately’", "ingested_utc": "2025-08-18T13:50:55Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:50:55Z", "source": "FT_Home", "title": "Gupta lines up BlackRock on deal to buy key steel business out of insolvency", "url": "https://www.ft.com/content/ae61a045-5624-41b5-aaea-01be5d52ec9a", "id_key": "287e5322812ed891c93b213f84a2024f9fec61782a584582b55e41d9edc4ea24", "summary": "Move sets up clash between metals magnate and creditors including UBS that are owed hundreds of millions of dollars", "ingested_utc": "2025-08-18T13:50:55Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:12Z", "source": "TheVerge_All", "title": "Grammarly says its AI agent can predict an A paper", "url": "https://www.theverge.com/news/760508/grammarly-ai-agents-help-students-educators", "id_key": "22bb58e8165c8cbdfae0f8101f81695e3358df33655db50d5f4ef3059dbc871f", "summary": "Grammarly is launching several new AI agents for specific writing challenges, from educators trying to detect plagiarism and AI-generated text to students looking to gauge reader reaction to their paper, needing help with citations, and even seeing their predicted grade. The specialized AI agents are available in docs — which is Grammarly’s new “AI-native writing […]", "ingested_utc": "2025-08-18T13:51:12Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:12Z", "source": "TheVerge_All", "title": "The best gadgets and apps in August (so far)", "url": "https://www.theverge.com/tech/756896/best-gadgets-apps-weve-covered", "id_key": "b06786303ad77d5e6d6529dc95301622869fa34e7c52029d79ab2e59042fe899", "summary": "During the last half month, we've covered a lot of interesting gadgets and apps and thought we'd highlight a few that caught our attention the most. For example, we have a robovac that can mop the edges of your walls (something that my manual mop usually fails at), a charging cable that with any luck […]", "ingested_utc": "2025-08-18T13:51:12Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:13Z", "source": "TechCrunch_All", "title": "Grammarly gets a design overhaul, multiple AI features", "url": "https://techcrunch.com/2025/08/18/grammarly-gets-a-design-overhaul-multiple-ai-features/", "id_key": "85d96916bee96f6dc8d115b94c5f7d8821e0cce84ea0474b10da09e372ac3092", "summary": "Grammarly now has a new document-based interface, built on the back of Coda, the productivity startup it acquired last year. The interface also sports an AI assistant, as well as a few AI tools meant for students and professionals, including an AI grader, proofreader and citation finder.", "ingested_utc": "2025-08-18T13:51:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:15Z", "source": "WIRED_All", "title": "9 Picks of the Best Gaming Mouse, Tested and Reviewed (2025)", "url": "https://www.wired.com/gallery/best-gaming-mouse/", "id_key": "3694ec0458ba0c09ae97226a086e24ff1e08d2e88af26d3673cbcc0e79cb52fd", "summary": "From wired to wireless to ultralight, we've tested dozens of gaming mice to find the best for work, your next MMO, and everything in between.", "ingested_utc": "2025-08-18T13:51:15Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "A Nintendo Direct focused on Kirby Air Riders is set for August 19", "url": "https://www.engadget.com/gaming/nintendo/a-nintendo-direct-focused-on-kirby-air-riders-is-set-for-august-19-134353712.html?src=rss", "id_key": "e613e3819b72809922201a98e9d221ce807d184ef9047d33c39142652c47c6e9", "summary": "Nintendo has a few major first-party Nintendo Switch 2 games lined up for the rest of the year. One of those is Kirby Air Riders , a sequel to the 2003 GameCube title Kirby Air Ride . The company is set to reveal much (much) more about what it has in store for the new game, as it has lined up a dedicated Nintendo Direct. You'll be able to watch the showcase, which was first announced via the Nintendo Today! app , at 9AM ET on August 19. You won't have to go hunting for it on Nintendo's channel either, as you can click the big red button on the YouTube video above. The stream will run for about 45 minutes and \"provide an in-depth look at the upcoming Nintendo Switch 2 game,\" according to the company. On the surface, that seems like a very long showcase for a single game by Nintendo standards, considering that it's able to rip through a couple of dozen game reveals (or more) in a regular Direct that's as long or shorter. The recent Direct for Donkey Kong Bananza clocked in at just under 18 minutes and had a ton of info about that game. However, if you've ever seen a character reveal for game director Masahiro Sakurai's previous project, Super Smash Bros. Ultimate , you'll be aware that the man tends to get into the nitty gritty. After all, the deep dive into the final SSBU fighter, Sora from Kingdom Hearts, is 42 minutes long . So a 45-minute Direct for a whole new Sakurai game suddenly doesn't seem as excessive. A release date for Kirby Air Riders seems like a safe bet for this Direct. The timing of the showcase is pretty interesting too, as it will air just before Gamescom gets underway. Perhaps Kirby Air Riders will be playable at Nintendo's booth at the event. This article originally appeared on Engadget at https://www.engadget.com/gaming/nintendo/a-nintendo-direct-focused-on-kirby-air-riders-is-set-for-august-19-134353712.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "Apple's Mac mini M4 is back on sale for $499", "url": "https://www.engadget.com/deals/apples-mac-mini-m4-is-back-on-sale-for-499-131518476.html?src=rss", "id_key": "c116d5d5bdcf674160655ef5ff8dacbb25ac7637de4035ad4235dfa4e64cfb6b", "summary": "Buying a computer, especially one from Apple, is typically going to cost you a pretty penny. So sales are critical for getting all the devices we want. Right now, we're looking at the Apple 2024 Mac mini M4 , which is down to $499 from $599. The 17 percent discount gets you a model with 16GB of RAM and 256GB of SSD. We gave the Mac mini M4 a 90 in our review thanks to features like its small design but very fast performance. Seriously, it's less than half the size of its predecessor. It also offers a standard of 16GB of RAM, USB-C and headphone ports, which the Mac minis have been lacking. Think you might need a bit more storage? The best deal is actually on the Mac Mini M4 with 16GB of RAM and 512GB of SSD . It's down to $689 from $799 — saving you $110. Then there's the version with 24GB of RAM and 512GB of SSD , which has dropped to $902 from $999. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/apples-mac-mini-m4-is-back-on-sale-for-499-131518476.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "Apple's iPad Air M3 is $150 off and down to a record low", "url": "https://www.engadget.com/deals/apples-ipad-air-m3-is-150-off-and-down-to-a-record-low-162908393.html?src=rss", "id_key": "f1db7880dbdc070ac4f573bfb7a23429d3f35eb7e879cf4ce6ea4241a84df200", "summary": "The back-to-school season is a good time to save on tech, whether you're returning to campus or not. While some discounts are reserved for students, others are available to everyone. One of the best right now is on Apple's M3-powered iPad Air , which is somewhat of a goldilocks tablet — one that will be a great option for just about everyone. You can grab it for $150 off at Amazon right now. This deal applies to each configuration of the 11-inch and 13-inch versions of the most recent iPad Air. So, the 11-inch model is as low as $449, while the 13-inch model is down to $649. The same deals can be found at Best Buy and Target if you prefer to shop somewhere other than Amazon. This is an all-time low price and beats the deal we saw on Prime Day by $30. The iPad Air M3 is more of an iterative refresh than a grand overhaul, but the spec bump means it’ll last you a long time before the tablet’s performance becomes a problem. This iPad occupies the position of \"best for most\" in our iPad buying guide , reinforcing that goldilocks analogy. The M3 chip is the main draw here, with Geekbench 6 scores proclaiming it around 16 percent more powerful than the M2 iPad Air, which is no slouch itself. Beyond the chip, it has a superior display and speakers to the entry-level model , and wider accessory support. You also get the option of a 13-inch display, which is great for artists or anyone who sees the iPad as a viable laptop replacement. If there’s an obvious downside to the iPad Air M3, it’s that it doesn't have the nice 120Hz OLED display of the iPad Pro. This is hardly surprising, as Apple often focuses on display tech to differentiate its Pro and non-Pro devices, but it’s probably time the refresh rate on the middle-of-the-road iPad at least jumped up to ProMotion. Face ID is long overdue too. If you can live with these caveats, though, the iPad Air is an excellent option, particularly at this price. If you think the Air is too much for your needs, the iPad A16 , Apple's entry-level tablet, is down to $299 right now. It was slightly cheaper during Prime Day in July, but this discount is still worth considering if you're looking to pick up a newer iPad for less. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/apples-ipad-air-m3-is-150-off-and-down-to-a-record-low-162908393.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "Samsung brings its AirPods-esque 'blade' design to the Galaxy Buds 3 FE", "url": "https://www.engadget.com/audio/headphones/samsung-brings-its-airpods-esque-blade-design-to-the-galaxy-buds-3-fe-130056520.html?src=rss", "id_key": "7c97a92c1ecfeaf8afec4aa07cc01245ae4fdc2d9b557fa47e02e5a26a8ac5d9", "summary": "Last summer, Samsung overhauled its Galaxy Buds line with the Galaxy Buds 3 and 3 Pro . This year, the company is adding a third, more affordable option to its earbuds family with the Galaxy Buds 3 FE ($150) . This so-called \"fan edition\" carries a \"blade\" design similar to the existing Galaxy Buds 3 duo, but has the ear tip fit akin to the Galaxy Buds 3 Pro. Active noise cancellation (ANC) is still in the mix here, even with the lower price, and a solid list of features make these an option to consider for owners of a recent Galaxy phone. The Galaxy Buds 3 FE are the successor to the the Galaxy Buds FE that debuted in 2023 . As such, many of the company's comparisons and claims about improvements are pitted against the performance of that model. That previous version came before Samsung swapped over to the AirPods-like stem design, or \"blade\" as the company describes it, so this new FE edition looks very different from its predecessor. The onboard controls are situated along that stem like the rest of the Galaxy Buds 3 line, including audio playback and volume adjustments. Samsung's Galaxy Buds 3 FE have a similar \"blade\" design to the existing Galaxy Buds 3 duo Samsung To improve call quality on the Galaxy Buds 3 FE, Samsung says it relocated the voice microphones to the stem so they're closer to the user's mouth. The company also explains that it made changes to audio quality thanks to larger speakers than the previous FE version for \"powerful sound with deep bass and clear treble.\" There's also \"enhanced\" ANC and the aforementioned call upgrades include noise reduction technology that can isolate your voice in less-than-ideal environments. Another slight improvement is in the area of battery life. The Galaxy Buds 3 FE can last up to eight and a half hours with ANC off, or up to 30 hours total when you factor in the charging case. That's 90 minutes longer than the Galaxy Buds 3 Pro. With ANC enabled, battery life compared to the current Pro model is unchanged at six hours (24 hours total with the case). Lastly, the ingress protection isn't quite as robust as the Galaxy Buds 3 and Galaxy Buds 3 Pro. Those two sets of earbuds are IP57 rated for dust protection and water immersion. However, the Galaxy Buds 3 FE is IP54 rated, so it's only promised to withstand water splashes. The Galaxy Buds 3 FE will be available on September 4 for $150 in Black and Gray color options. This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/samsung-brings-its-airpods-esque-blade-design-to-the-galaxy-buds-3-fe-130056520.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "Pixel 9 Pro Fold one year later: How Google caught up to Samsung in just two generations", "url": "https://www.engadget.com/mobile/smartphones/pixel-9-pro-fold-one-year-later-how-google-caught-up-to-samsung-in-just-two-generations-130008722.html?src=rss", "id_key": "d5d602390879e7ee8d749ee8e6b2c285fce303ce139d244c3f1b6e87890704dd", "summary": "The Pixel 9 Pro Fold was one of my favorite gadgets of 2024 to the point where it even landed on our list of the biggest winners of the year. Not only was it a worthy alternative to Samsung's long-running Galaxy Z Fold phones, its straightforward design once again proved that keeping things simple is often the wisest way to go. It turns out, the best approach to foldable phone design is to make something that's the same size and shape as a regular handset, but just happens to have a big flexible display hidden inside. However, after using the Pixel 9 Pro Fold (which I will refer to as the P9PF for short) for just shy of a year, I wanted to re-review the device to reflect on how it held up after 11 months of wear and tear and to consider what Google might be able to improve on the next model. Design and features Sam Rutherford for Engadget Google figured out something when it shifted away from the short and squat dimensions of the original Pixel Fold for its second foldable phone. By making the Pixel 9 Pro Fold's exterior display essentially the same size as a normal Pixel 9, the company eliminated any confusion for when you just want to quickly send a text, check a map or doomscroll on social media. The obvious downside to this is that when you open the phone up, its interior display has essentially a square aspect ratio, which isn't great for watching movies. However, with an increased size of eight inches across, the P9PF still has one of the largest flexible panels around, so it's not like anyone was really hurting for screen real estate. And for stuff like games, comics or ebooks, it's arguably even better. If manufacturers were able to bring the price of foldables down, they might kill the market for small tablets (nine inches and under) overnight. On top of that, unlike Samsung’s foldables, the Pixel 9 Pro Fold didn't really sacrifice on camera quality or features. It has a 5x optical zoom just like you get on a standard Pixel 9 Pro, and while it doesn't have the same main sensor, you'd be hard-pressed to tell unless you do some serious side-by-side pixel peeping. Plus, you get fun tools like Look at Me that are only possible due to its foldable design, not to mention other nifty features like Add Me. Sam Rutherford for Engadget Granted, Google's Tensor G4 chip lags behind equivalent Qualcomm Snapdragon processors. But it's still fast enough for everything I’ve thrown at it, aside from maybe hardcore video editing or the most demanding games. And I maintain that foldable phones are still the best devices for mobile trading card apps like Marvel Snap or Pokémon TCG Pocket . The presence of a big screen that can be deployed or hidden away at a moment's notice is perfect for matches that only last a couple of minutes, so you can squeeze a round in pretty much anywhere or any time. Durability I'm not a fan of cases. That’s true even on foldables, because while they are more fragile than a typical smartphone, the added bulk and heft that comes with most aftermarket protectors are just kind of annoying. Furthermore, especially in recent years, most foldables are generally tough enough to withstand life's everyday drops and tumbles. Unless you're out there regularly burying your phone in the sand or dropping it on concrete, my experience with previous foldables (from both Samsung and Google ) has me feeling relatively confident about their overall durability. Sam Rutherford for Engadget That said, I did make one small change when living with the P9PF. Instead of a case, I installed a skin from Dbrand (which I bought myself) to give the phone a tiny extra cushion in the back. Granted, there are still several scratches and dings on its frame and front screen. But that was kind of the point. I wanted to see how Google's second-gen foldable would hold up with minimal protection and this phone has probably taken more of a beating than any device I've owned to date. Fun fact: I shot and edited the review photos for the Pixel 9 Pro Fold just an hour before I had to go to the hospital for the birth of my daughter. And in the time since, the P9PF has been spat up on, crawled on, walked on by my three-year-old son and fallen out of my pocket during bathtime a countless number of times. And for the most part, it's taken those hits like a boxer with an iron chin (or in Google's case, aluminum). Sam Rutherford for Engadget If you're really trying to maximize resale value, you may want something more substantial. For everyone else, the addition of a skin and a screen protector for its exterior display is all you really need. My Pixel 9 Pro Fold's interior screen is still pristine after almost a year. Yes, it has a crease, but if that's an issue, you may never be able to own a foldable phone. Or at the very least, not in the near future. Meanwhile, the blemishes elsewhere aren't distracting enough to make using the P9PF any less enjoyable. Though everyone is different, so you may feel otherwise. Potential concerns The one potential issue going forward is that in just the last couple of weeks, I've noticed the phone occasionally takes longer to turn on the inner display after opening it up. It doesn’t happen every time and it'll usually fix itself in a few seconds or after a couple taps. Furthermore, sometimes the phone's SIM card will stop working too, which can be addressed by resetting the Pixel's internet connections. Sam Rutherford for Engadget While I haven't been able to confirm if this is due to a software update (like a recent Android patch) or something loose inside (possibly a shaky display cable), it sounds very similar to a thread I spotted recently on Reddit . Based on the post, the owner of that P9PF takes much better care of their phone than I do, which suggests the cause may be related to build quality or its underlying design instead of simple wear and tear. Regardless, if you own a Pixel 9 Pro Fold and have also run into this issue, let me know so I can investigate this further. Future outlook Even with a possible service call clouding the future of my Pixel 9 Pro Fold, I've thoroughly enjoyed my time with it over the last year. Pairing a bigger flexible screen with best-in-class cameras and a simple but very effective design is a winning formula for a modern foldable. And while I don't expect a full redesign this year after the big jump we got from the OG Pixel Fold, if Google can tweak little things like the awkward-looking corner in the top left of its exterior display, improve durability and maybe increase the battery capacity in addition to its usual assortment of yearly AI-powered tools and features, the Pixel 10 Pro Fold could be a very solid followup. I took the skin off for this story and as you can see, it did a good job of protecting the backside of the phone. Sam Rutherford for Engadget However, the arrival of the Galaxy Z Fold 7 means Google has some work to do. I'm waiting to see what the next foldable Pixel brings (and hopefully the OnePlus Open 2 as well) before picking which phone I want to use for the next year. Unless Google or OnePlus can match the exquisite thinness, excellent performance and improved battery life on Samsung's latest flagship, I feel like I'm going to be doing the gadget version of the distracted boyfriend meme every time I go to pick up a significantly thicker rival. That said, things like Google's software and superior cameras might pull me back. But perhaps the most impressive thing is that after just two generations, the Pixel Fold line has almost completely caught up to the latest Z Fold with the chance to pull ahead next week. And for anyone who's ever considering getting a foldable phone (or maybe even their second, third or fourth), that's exactly the kind of competition I like to see. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/pixel-9-pro-fold-one-year-later-how-google-caught-up-to-samsung-in-just-two-generations-130008722.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "This Anker 3-in-1 wireless charging station is on sale for 30 percent off", "url": "https://www.engadget.com/deals/this-anker-3-in-1-wireless-charging-station-is-on-sale-for-30-percent-off-145325028.html?src=rss", "id_key": "c7a72b7381ea1b399ad7e22d42d6470774dd5a155de0a56d08cba6c340189389", "summary": "Anker's 3-in-1 MagSafe charging station is on sale for a record low price of $63 — that works out to savings of 30 percent.The Qi2-certified charger wirelessly charges your compatible iPhone, Apple Watch, and AirPods on one compact and convenient dock. Qi2 boasts 15W of power, so you can take advantage of fast charging on compatible devices. This means the station can charge an iPhone 16 Pro Max to 20 percent in just 20 minutes and an Apple Watch Series 10 from zero to 100 percent in just over an hour. The magnetic stand for your iPhone is adjustable with 45 degrees of vertical rotation and 360 degrees of horizontal rotation, so you can always find the perfect angle for your phone while charging. Being able to wirelessly charge these three daily devices at once might remind you of Apple's wireless charging pad that never was, but Anker's 3-in-1 charging station offers an elegant solution. We tend to like Anker's charging products , and we’ve found they make some of the best charging stations on the market. Anker's products can be a bit pricey, though, which is why the best time to pick them up is during these sales. The company actually has a slew of its charging products on sale right now . Its 3-in-1 wireless charging cube is 31 percent off right now and down to $104. If you're a Prime member and have a Qi2-compatible iPhone, then you might also look at Anker's simple Qi2 charging pad , which is 35 percent off for a two-pack right now. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/this-anker-3-in-1-wireless-charging-station-is-on-sale-for-30-percent-off-145325028.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "Can-Am's first electric ATV can haul more than its gas models", "url": "https://www.engadget.com/transportation/can-ams-first-electric-atv-can-haul-more-than-its-gas-models-120021684.html?src=rss", "id_key": "451c57d3f04642f9b8c617f0283ab7364c30842ad8196e1f662680aa41e60d93", "summary": "Can-Am, part of the motorsports group BRP that recently introduced electric snowmobiles , has just launched its first electric all-terrain vehicle (ATV). The Outlander Electric is designed to be \"whisper quiet\" for chores like herding or hunting, but it can actually tow more than its gas-powered counterparts thanks to the high level of torque. Powered by BRP's modular Rotax E-Power drivetrain (also used in the company's electric snowmobiles and motorbikes), the Outlander Electric makes up to 47 hp and 53 lb-ft of torque, the latter of which is substantially more than any of the company's ICE-powered ATVs. As a result, the electric model offers 1,830 pounds of towing capacity, the most of any ATV, according to the company. BRP Inc. The 8.9 kWh battery offers about 50 miles (80 km) of range, around half of what a gasoline ATV will get depending on the model. It can be charged from 20 to 80 percent in around 50 minutes using a Level 2 charger. Other features include selectable ride modes (Normal, Sport and Work) depending on whether you're trail riding or towing items around your ranch, 12-inches of clearance and a two-speed transmission. However, the key benefit Can-Am is touting is the lack of noise due to the liquid-cooling system, optimized suspension and special tires. With that, the Outlander Electric is less likely to spook farm animals or wildlife, making it a good option for farmers, hunters and park rangers. The Can-Am Outlander Electric ATV is now available from deals and Can'Am's website starting at $12,999 . This article originally appeared on Engadget at https://www.engadget.com/transportation/can-ams-first-electric-atv-can-haul-more-than-its-gas-models-120021684.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:16Z", "source": "Engadget_All", "title": "Apple's MacBook Air M4 is on sale for a record-low price", "url": "https://www.engadget.com/deals/apples-macbook-air-m4-is-on-sale-for-a-record-low-price-123031171.html?src=rss", "id_key": "2fb5bee04aba384b5d5b95dcd96fbc8fad4bd306da541e5fca46c84a9addf29e", "summary": "If you've put off getting a new MacBook then today is your lucky day. Right now, the 2025 13- and 15-inch MacBook Air M4 are available on Amazon for record-low prices. The 13-inch model is our pick for best MacBook to buy this year, and it's one of the best laptops for college students going back to school soon as well. You can pick up the 13-inch MacBook Air M4 for $799, down from $999 — a 20 percent discount. This model comes with 16GB of RAM and a 256GB SSD. You can upgrade to 512GB SSD for $999 , down from $1,199, another all-time low price, or 24GB of RAM and a 512GB SSD for $1,199, down from $1,399. Then there's the 15-inch MacBook Air M4 , whose cheapest model is on sale for $999, dropping from $1,199. The 17 percent discount is the best deal we've seen since the pair debuted in March. As with the 13-inch model, the 16GB and 512GB SSD option is also a record-low price, dropping to $1,199 from $1,399. Then there's the 24GB upgrade , which is $1,399, down from $1,599. We're big fans of the MacBook Air M4, giving it a 92 in our review . Part of that comes from an already lower starting price for the MacBooks than their predecessors. The 2025 models also get a speed boost thanks to the M4 chip and are very thin with a 0.44-inch thickness. Neither the 13- or 15-inch will drag you down, weighing 2.7 pounds and 3.2 pounds, respectively. Plus, they both have excellent battery life, lasting over 18 hours while playing an HD video. The big differences in the 15-inch model mostly come down to size. The screen is obviously bigger, as is its trackpad. Other than that, it offers better speakers than its 13-inch sibling. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/apples-macbook-air-m4-is-on-sale-for-a-record-low-price-123031171.html?src=rss", "ingested_utc": "2025-08-18T13:51:16Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:24Z", "source": "TheStreet_Top", "title": "Fast-food burger chain opened in 1934, closes 200 restaurants", "url": "https://www.thestreet.com/restaurants/fast-food-burger-chain-opened-in-1934-closes-200-restaurants", "id_key": "9d996e83524b4428a8feb8c04ddcb38f95e18e187e075f8f73b915ed4cdd2f1c", "summary": "The long-lived national chain also dropped table service and adopted a Chick-fil-A-style business model.", "ingested_utc": "2025-08-18T13:51:24Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:24Z", "source": "TheStreet_Top", "title": "Veteran analyst names 30 AI stocks shaping future of technology", "url": "https://www.thestreet.com/technology/veteran-analyst-names-30-ai-stocks-that-could-shape-the-future-of-technology-", "id_key": "bfa52a5d4b6916bdfeec5802b49832c3de587b3d1bb82053ebdc6b6d41e95d6b", "summary": "Nvidia leads a new group of 30 AI stocks picked to define the future of technology.", "ingested_utc": "2025-08-18T13:51:24Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:24Z", "source": "TheStreet_Top", "title": "Aldi’s supermarket rival tries a new way to end theft, shoplifting", "url": "https://www.thestreet.com/retail/supermarket-chain-pays-customers-to-report-shoplifters-", "id_key": "4fa630d6326fa4ec4ec202d06b0f299f7bde6cec86aaf5fcb5257d9e316a7ccc", "summary": "Retail theft and shoplifting have increased dramatically, and one chain has a new idea as to how to stop it.", "ingested_utc": "2025-08-18T13:51:24Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:25Z", "source": "AlJazeera_All", "title": "Palestinian reporter’s remains discovered, weeks after her killing", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/18/palestinian-reporters-remains-discovered-weeks-after-her-killing?traffic_source=rss", "id_key": "68e2ecd56df6d1aa73cf9cee544370feb32befb52debb413112758083544bc53", "summary": "Journalist Marwa Musallam was buried alive by an Israeli air strike in Gaza, her remains were found 45 days later.", "ingested_utc": "2025-08-18T13:51:25Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:25Z", "source": "AlJazeera_All", "title": "Israel’s turn to ‘comply’: US envoy after Lebanon moves to disarm Hezbollah", "url": "https://www.aljazeera.com/news/2025/8/18/need-israel-to-comply-us-envoy-says-as-lebanon-moves-to-disarm-hezbollah?traffic_source=rss", "id_key": "498c7c803b296f2fc1f81a1637c9b9faf1649fee9385cf6c12ffed4f64b6e906", "summary": "Barrack said plan to disarm Hezbollah also 'requires Israel's cooperation' to keep up its end of the deal.", "ingested_utc": "2025-08-18T13:51:25Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:32Z", "source": "FinancialPost_Business", "title": "Hurricane Electric Expands Network in Toronto With New Point of Presence at Coloware YTZ-1", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/hurricane-electric-expands-network-in-toronto-with-new-point-of-presence-at-coloware-ytz-1", "id_key": "1650c0ed356b59718b3d3b766160498166f94f820df0eebf12a3f35975e50350", "summary": "Fifth Point of Presence in Toronto will provide additional connectivity options to enterprises throughout Ontario TORONTO — Hurricane Electric, the world’s largest IPv6-native Internet backbone announced today that it has deployed a new Point of Presence (PoP) in Coloware YTZ-1 data center. The new PoP is located at 151 Front Street, Suite 504, Toronto, ON, […]", "ingested_utc": "2025-08-18T13:51:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:32Z", "source": "FinancialPost_Business", "title": "China EV Sector Invests More Abroad Than at Home for First Time", "url": "https://financialpost.com/pmn/business-pmn/china-ev-sector-invests-more-abroad-than-at-home-for-first-time", "id_key": "b70d7420fffff1382c92cfbe436c4bc43ae16a2a38a08ca6ae4de216670845d5", "summary": "Chinese companies involved in the electric vehicle industry invested more overseas than domestically for the first time in 2024, although foreign projects face higher costs, delays and risks.", "ingested_utc": "2025-08-18T13:51:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:32Z", "source": "FinancialPost_Business", "title": "24/7 concierge: Zoom’s agentic AI and virtual agent now extends to Zoom Phone, helping businesses capture more calls and opportunities", "url": "https://financialpost.com/globe-newswire/24-7-concierge-zooms-agentic-ai-and-virtual-agent-now-extends-to-zoom-phone-helping-businesses-capture-more-calls-and-opportunities", "id_key": "836c57502045b4d1d9561cc4ebd6bf0dca94f8f722e25ba8bd0fe4962deff77b", "summary": "Zoom Virtual Agent expands to Zoom Phone, enabling a new concierge use case that delivers personalized support with agentic concierge capabilities to automate routine calls and streamline frontline service across departments Zoom AI Companion enhances agentic scheduling to coordinate meetings end-to-end, finding the best time, contacting attendees, tracking responses, and recommending next steps without the […]", "ingested_utc": "2025-08-18T13:51:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:32Z", "source": "FinancialPost_Business", "title": "ExxonMobil and Cerebre Sign Long-Term Agreement to Accelerate Foundational Digital Backbone", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/exxonmobil-and-cerebre-sign-long-term-agreement-to-accelerate-foundational-digital-backbone", "id_key": "03c38ba1f8050297a235d811e30332a4abd55ee76dea0901bd8d3ea16c521cd4", "summary": "HOUSTON — Cerebre, an industrial intelligence technology provider, and ExxonMobil, an industry leader in the energy sector, have signed a long-term agreement to accelerate and sustain ExxonMobil’s Foundational Digital Backbone. This strategic collaboration underscores ExxonMobil’s commitment to data and innovation targeted at driving enterprise operational efficiency. About Cerebre Cerebre delivers a live intelligence map of […]", "ingested_utc": "2025-08-18T13:51:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:32Z", "source": "FinancialPost_Business", "title": "Fubo and DAZN Bring Unmatched Live Sports Lineup to Canadian Fans", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/fubo-and-dazn-bring-unmatched-live-sports-lineup-to-canadian-fans", "id_key": "9299b222fa5861edc320ff69a1e3a5bd157aa36cb15ab1afa93119acb583f1fa", "summary": "DAZN and Fubo have announced a multi-year partnership in Canada, expanding on their U.S. distribution agreement. As part of the agreement, DAZN will carry Fubo Sports Network, Fubo’s owned and operated linear TV network, and Fubo will carry DAZN’s premium live sports offering. The partnership enables one of the most comprehensive sports streaming lineups in […]", "ingested_utc": "2025-08-18T13:51:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:32Z", "source": "FinancialPost_Business", "title": "Keepit and Leading B2B Platform Company Ingram Micro Announce Strategic Go-to-Market Relationship in Canada", "url": "https://financialpost.com/news/keepit-and-leading-b2b-platform-company-ingram-micro-announce-strategic-go-to-market-relationship-in-canada", "id_key": "7862f17f8692742f9496613379e87bebe0f21f0ea636bdb98e26ad172f5cc59a", "summary": "New Canadian alliance broadens the IT channel’s access to Keepit’s innovative SaaS data protection services COPENHAGEN, Denmark — Keepit, a global provider of a comprehensive cloud backup and recovery platforms, today announced that it has teamed with Ingram Micro, a leading business-to-business platform company for the global technology ecosystem, to strengthen its position in the […]", "ingested_utc": "2025-08-18T13:51:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:32Z", "source": "FinancialPost_Business", "title": "Agam Capital Launches AI Technology Hub", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/agam-capital-launches-ai-technology-hub", "id_key": "8739d9af78a41e9997257b9b5be0ee78daf3d12e83e157ba7ec7bf26752e19de", "summary": "Announces opening of Austin Office, led by Co-Founder Chak Raghunathan, to support accelerated investments in pALM analytical ecosystem Promotes Albert Cecchini to Partner with responsibility for all Risk Functions TEANECK, N.J. & AUSTIN, Texas & TORONTO — Agam Capital (“Agam”), an analytics driven platform strategically partnering with insurance companies to explore opportunities to enhance their […]", "ingested_utc": "2025-08-18T13:51:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:38Z", "source": "Nikkei_Asia_Top", "title": "Daiwa Securities eyes turning pepper farms into financial products", "url": "https://asia.nikkei.com/business/agriculture/daiwa-securities-eyes-turning-pepper-farms-into-financial-products", "id_key": "a044175d740d6b2b792e7d65f81e6c271f01092172267f7ee0fafb6aa9c7e839", "summary": "", "ingested_utc": "2025-08-18T13:51:38Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T13:51:46Z", "source": "HackerNews_Top", "title": "LLMs and coding agents are a security nightmare", "url": "https://garymarcus.substack.com/p/llms-coding-agents-security-nightmare", "id_key": "bc6ee7d6718fa5f06f41db35f53eb4395e222fd3aad97cea8d570587f1ce502a", "summary": "Comments", "ingested_utc": "2025-08-18T13:51:46Z"}
