{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:30:20Z", "source": "CryptoSlate", "title": "State Street issues $100M digital debt securities on JPMorgan’s proprietary blockchain", "url": "https://cryptoslate.com/state-street-issues-100m-digital-debt-securities-on-jpmorgans-proprietary-blockchain/", "id_key": "72f3d03dccf9eabd7bf6b56704b3aca868379658f6fbc615186606738341c467", "summary": "State Street launched its first digital debt securities using JPMorgan’s Digital Debt Service, executing a $100 million commercial paper transaction. According to an Aug. 21 statement, State Street Investment Management purchased the commercial paper for its Short Term Investment Fund. The debt securities are issued, settled, and serviced using blockchain technology, delivering streamlined institutional market […] The post State Street issues $100M digital debt securities on JPMorgan’s proprietary blockchain appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T21:30:20Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:32:25Z", "source": "NPR_Top", "title": "Vance touts tax cuts, Trump's domestic agenda in Georgia", "url": "https://www.npr.org/2025/08/21/nx-s1-5509924/vance-one-big-beautiful-bill-georgia", "id_key": "f6e35f8b951d21596d4126be8a7493657895e131bc84f69cc12ded53424adbd1", "summary": "The vice president spoke about the administration's domestic agenda enacted in a sweeping bill last month that will shift resources from social safety programs to immigration enforcement and tax cuts.", "ingested_utc": "2025-08-21T21:32:25Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:32:46Z", "source": "TheVerge_All", "title": "Microsoft&#8217;s new NFL deal could let you blame Copilot AI for terrible playcalls", "url": "https://www.theverge.com/news/763928/nfl-microsoft-copilot-surface-ai", "id_key": "1f9d2e23e132fafeb5ae8c23071f34aef537c3d6214f9b911fbd9980360a9bb8", "summary": "The NFL and Microsoft have extended their arrangement that makes Surface tablets a familiar fixture on gameday sidelines, but naturally, now there’s an AI-powered twist on top. While Tom Brady is no longer actively putting those slates in danger of destruction, they do have something to offer to coaches and players. Microsoft touts a GitHub […]", "ingested_utc": "2025-08-21T21:32:46Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:32:50Z", "source": "Engadget_All", "title": "Nonprofit search engine Ecosia offers $0 for control of Chrome", "url": "https://www.engadget.com/big-tech/nonprofit-search-engine-ecosia-offers-0-for-control-of-chrome-212158739.html?src=rss", "id_key": "3ab04ace62f8b1390baaf8e1de145e88ecc63cd104bc2b3a32cc2ee6dd3ecbdd", "summary": "Germany-based search engine and browser nonprofit Ecosia is the latest party to make an offer for Google's Chrome. Questions about Chrome's fate have been swirling since the news that the Department of Justice would push for Google to sell the browser after the ruling that the company's search engine business constituted a monopoly. Although Google is planning to appeal the decision, that hasn't stopped other big tech businesses from pitching themselves as potential owners of Chrome. Ecosia's proposal is different. Rather than selling off the valuable browser for an upfront windfall, this plan would see Google transforming Chrome into a foundation. Ecosia would assume operational responsibility for the browser for ten years, but Google would retain the ownership and intellectual property rights. Under the arrangement, Ecosia would devote about 60 percent of Chrome's profits toward climate and environmental projects. It wouldn't pay a cent upfront for the stewardship role, but the remaining 40 percent of Chrome's profits would be given back to Google. Considering Ecosia is projecting Chrome to generate $1 trillion over the next decade, that's no small potatoes. On the surface, this idea is pretty far-out. However, going the stewardship route would deepen an existing relationship between Google and Ecosia. Google already powers the environmentally-focused benefit corporation's search engine, and the two parties have an established revenue-sharing agreement. Putting Chrome in the hands of a nonprofit rather than a for-profit rival may actually be a positive for Google, both financially and in public opinion. This article originally appeared on Engadget at https://www.engadget.com/big-tech/nonprofit-search-engine-ecosia-offers-0-for-control-of-chrome-212158739.html?src=rss", "ingested_utc": "2025-08-21T21:32:50Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:32:58Z", "source": "TheStreet_Top", "title": "Veteran analyst predicts eye-popping AI spending", "url": "https://www.thestreet.com/technology/veteran-analyst-makes-staggering-ai-spending-prediction", "id_key": "c848d5f65a4ce280518677119f16591c3526c6b60629ea6464592bbc11cdbde2", "summary": "The long-time Wall Street analyst updates the amount data centers will spend on AI.", "ingested_utc": "2025-08-21T21:32:58Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:33:06Z", "source": "FinancialPost_Business", "title": "Cyber A.I. Group and Synergy Associates Form Strategic Joint Venture to Beta Test CyberAI Sentinel 2.0 Platform", "url": "https://financialpost.com/globe-newswire/cyber-a-i-group-and-synergy-associates-form-strategic-joint-venture-to-beta-test-cyberai-sentinel-2-0-platform", "id_key": "14a6b0aafebf7f3f3ae4dfd5ca521aaae9ccef518efae3aac7277281f31f008e", "summary": "Patent-Pending AI-Driven Technology to Undergo Six-Month Beta Program with Synergy’s Global Client Base MIAMI and NEW YORK and LONDON, Aug. 21, 2025 (GLOBE NEWSWIRE) — Cyber A.I. Group, Inc. (“CyberAI” or the “Company”), an emerging growth Cybersecurity, Artificial Intelligence and IT services company engaged in the development of next-generation market disruptive AI-driven Cybersecurity technology, today […]", "ingested_utc": "2025-08-21T21:33:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:33:06Z", "source": "FinancialPost_Business", "title": "Premier Health Reports 2025 Third Quarter Results", "url": "https://financialpost.com/globe-newswire/premier-health-reports-2025-third-quarter-results", "id_key": "621ce7445f40a51f6d3dcb04fe6efb94999b5b0bd5a034c22ec7564feae208d1", "summary": "MONTRÉAL, Aug. 21, 2025 (GLOBE NEWSWIRE) — Premier Health of America Inc. (TSXV: PHA) (the “Company”), a leading Canadian Healthtech company, announces it has filed its unaudited Quarterly Consolidated Financial Statements and MD&A for its third quarter ended on June 30, 2025. Highlights (in thousands of Canadian dollars) June 30, 2025(3 months ) June 30, […]", "ingested_utc": "2025-08-21T21:33:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:33:06Z", "source": "FinancialPost_Business", "title": "Northview Residential REIT Announces August Distribution", "url": "https://financialpost.com/globe-newswire/northview-residential-reit-announces-august-distribution-3", "id_key": "1e0bc0701ff10b5f6c791931506c2b42447ac0c753d66fdaafba633e19830484", "summary": "Not for distribution to U.S. newswire services or for dissemination in the United States. CALGARY, Alberta, Aug. 21, 2025 (GLOBE NEWSWIRE) — Northview Residential REIT (the “REIT”) today announced its August 2025 cash distribution amounts on its outstanding Class A Units, Class C Units and Class F Units (collectively, the “Units”) in the amount of […]", "ingested_utc": "2025-08-21T21:33:06Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:33:06Z", "source": "FinancialPost_Business", "title": "Mayfair Acquisition Corp. Announces It Will No Longer Make Takeover Bid for Gold Basin Resources Corporation and Canex Metals Inc.", "url": "https://financialpost.com/globe-newswire/mayfair-acquisition-corp-announces-it-will-no-longer-make-takeover-bid-for-gold-basin-resources-corporation-and-canex-metals-inc", "id_key": "83ec4e79d6c5fbb20357281e08077fa52eeae9d8373664e6bca00b84a8ddc914", "summary": "VANCOUVER, British Columbia, Aug. 21, 2025 (GLOBE NEWSWIRE) — Mayfair Acquisition Corp. (TSXV: MFA.P) (“Mayfair” or the “Company”) announces that it no longer intends to make a takeover bid for the outstanding securities of Gold Basin Resources Corporation (“Gold Basin”) and Canex Metals Inc. (“Canex“). The representatives of Discovery Group, being John Robins, Jim Paterson, […]", "ingested_utc": "2025-08-21T21:33:06Z"}
