{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T05:39:58Z", "source": "Guardian_World", "title": "PM deflects question about literal red carpet for Putin and says Trump ‘an advocate for peace’ in Ukraine – as it happened", "url": "https://www.theguardian.com/australia-news/live/2025/aug/17/australia-news-live-federal-politics-net-zero-victoria-protests-nsw-weather-sunday-ntwnfb", "id_key": "45671c696922d06f9d6484189d8d6e818073521b0f64acf90247e282073b815e", "summary": "This blog is now closed Tim Wilson sidesteps question about whether Coalition will dump support for net zero Finally, Wilson was asked about internal pressure within the Coalition to abandon support for any policies that might help Australia achieve net zero and to address the climate crisis. We should make sure that we have net zero outages, net zero price increases, and net zero emissions, because you need to have things in a position of balance of policy to make sure that we can grow the future of the Australian economy, because that’s also the basis of social licence to cut emissions as well. If you don’t have net zero outages and net zero price increases, public support for net zero emissions reduction is also going to fray. I’m going to work with my colleagues to make sure we drive them forward as part of a policy package to take to the next election. I’m absolutely committed to making sure we have simplification, to make it easier to employ more Australians, and to raise standards of living, and improve the number of Australians [getting jobs] and well-paid jobs. We’ve got big challenges coming ahead around [things] like artificial intelligence and making sure we make workplaces more productive, but also building out the capacity for small businesses to be successful as part of a dynamic economy. Continue reading...", "ingested_utc": "2025-08-17T05:39:58Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T05:39:58Z", "source": "Guardian_World", "title": "US state department stops issuing visas for Gaza’s children to get medical care after far-right campaign", "url": "https://www.theguardian.com/us-news/2025/aug/16/gaza-children-visas-medical-care-laura-loomer", "id_key": "0633f2948e1f0f4e62e7cf228ebf9e8baaa42ab85f2fb87861feec804d7db311", "summary": "Program providing key aid halted after complaints from Laura Loomer, the far-right influencer close to Trump The US state department announced on Saturday that it would stop issuing visas to children from Gaza in desperate need of medical care after an online pressure campaign from Laura Loomer , a far-right influencer close to Donald Trump who has described herself as “a proud Islamophobe”. “All visitor visas for individuals from Gaza are being stopped while we conduct a full and thorough review of the process and procedures used to issue a small number of temporary medical-humanitarian visas in recent days,” the state department said in a message posted on X, the social media platform formerly known as Twitter, from which Loomer was banned before it was purchased by Elon Musk. Continue reading...", "ingested_utc": "2025-08-17T05:39:58Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T05:40:18Z", "source": "CryptoSlate", "title": "The west has on-ramps, the rest gave drop-offs: what’s really pushing global crypto adoption", "url": "https://cryptoslate.com/the-west-has-on-ramps-the-rest-gave-drop-offs-whats-really-pushing-global-crypto-adoption/", "id_key": "b8d5e2389d0053b7d377bcb8942885f9c5ac662d1529c236281159803837a84b", "summary": "The following is a guest post and opinion from Konstantins Vasilenko, Co-Founder and Chief Business Development Officer at Paybis. There is a stark mismatch between the target and actual audience of crypto products. Crypto’s greatest upcomers rarely make an appearance in the news, nor do they enjoy the privilege of extensive localization and optimization efforts […] The post The west has on-ramps, the rest gave drop-offs: what’s really pushing global crypto adoption appeared first on CryptoSlate .", "ingested_utc": "2025-08-17T05:40:18Z"}
