{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:48:14Z", "source": "Guardian_World", "title": "‘Near-perfect landing’: hot air balloon guided down on to Bedford street", "url": "https://www.theguardian.com/uk-news/2025/aug/24/near-perfect-landing-hot-air-balloon-guided-down-on-to-bedford-street", "id_key": "d0425b52839e0a27cf116924093bfa940465adf68e4f17f27cbec0d9fd889152", "summary": "Bystanders jumped in to help balloon land on residential road on Saturday, narrowly missing houses and cars A hot air balloon made a dramatic landing in the middle of a street in Bedford on Saturday in front of shocked residents. Sam Coldham said he saw the balloon descending in Bower Street in the east of England town at about 9.30am, while he was out walking the dog with his partner, Sian King. Continue reading...", "ingested_utc": "2025-08-24T15:48:14Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:50:35Z", "source": "FT_Home", "title": "Private equity fundraising slides as sector’s downturn deepens", "url": "https://www.ft.com/content/f7387912-1079-43d4-a9a2-2308989400d4", "id_key": "7f613c8a3a76ca052b96b86f0d1edb62cdf91dee9825ba02b4db04eeedb3ba29", "summary": "Firms are struggling to raise money even as they offer discounts to attract new investors", "ingested_utc": "2025-08-24T15:50:35Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:50:36Z", "source": "FT_Markets", "title": "US food groups plead for relief from Trump’s tariffs", "url": "https://www.ft.com/content/e4ed107a-f4d4-42b8-abf4-3070fe58f69f", "id_key": "af578e9a7004f6ccc75beecd7dae12c0504d4d78157208934dddd5d99dc09701", "summary": "Piecemeal approach leaves seafood and produce sectors fighting to win individual carve-outs", "ingested_utc": "2025-08-24T15:50:36Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:50:55Z", "source": "Engadget_All", "title": "Get up to 35 percent off Anker wireless chargers ahead of Labor Day", "url": "https://www.engadget.com/deals/get-up-to-35-percent-off-anker-wireless-chargers-ahead-of-labor-day-145325615.html?src=rss", "id_key": "824f054ee581ab7cdb2ab8d23da9bf0d35f86a96aaff3efede636265a99a3169", "summary": "Anker makes some of our favorite charging gear, and now you can save on a bunch of wireless power accessories from the brand. Whether you're going back to school soon or want a new charging station that can power up a few devices at once, there are discounts here worth considering. One of the best is this 3-in-1 MagSafe charging station , on sale for a record low price of $63. The Qi2-certified charger wirelessly charges your compatible iPhone, Apple Watch, and AirPods on one compact and convenient dock. Qi2 boasts 15W of power, so you can take advantage of fast charging on compatible devices. This means the station can charge an iPhone 16 Pro Max to 20 percent in just 20 minutes and an Apple Watch Series 10 from zero to 100 percent in just over an hour. The magnetic stand for your iPhone is adjustable with 45 degrees of vertical rotation and 360 degrees of horizontal rotation, so you can always find the perfect angle for your phone while charging. Being able to wirelessly charge these three daily devices at once might remind you of Apple's wireless charging pad that never was, but Anker's 3-in-1 charging station offers an elegant solution. We tend to like Anker's charging products , and we’ve found they make some of the best charging stations on the market. Anker's products can be a bit pricey, though, which is why the best time to pick them up is during these sales. The company actually has a slew of its charging products on sale right now . Its 3-in-1 wireless charging cube is 31 percent off right now and down to $104. If you're a Prime member and have a Qi2-compatible iPhone, then you might also look at Anker's simple Qi2 charging pad , which is 35 percent off for a two-pack right now. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/get-up-to-35-percent-off-anker-wireless-chargers-ahead-of-labor-day-145325615.html?src=rss", "ingested_utc": "2025-08-24T15:50:55Z"}
