{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:49:48Z", "source": "Guardian_World", "title": "Israeli children refused access to leisure park in southern France", "url": "https://www.theguardian.com/world/2025/aug/22/israeli-children-refused-access-to-leisure-park-in-southern-france", "id_key": "249c6c5ba45829fd9ed3e56a309480586ccc86f2881e973fcf534b77e90c0b9c", "summary": "Manager of zipline facility detained for alleged religious discrimination after group of eight- to 18-year-olds turned away The manager of a leisure park in southern France has been detained for alleged religious discrimination after a group of Israeli children were refused access. The children, aged eight to 16, were on holiday in Spain and had made a reservation for Thursday to use the Parcours aérien Tyrovol zipline facility in Porté-Puymorens, near the Spanish border in the Pyrenees mountains, the Perpignan prosecutor’s office said. Continue reading...", "ingested_utc": "2025-08-22T20:49:48Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:49:48Z", "source": "Guardian_World", "title": "Ghislaine Maxwell transcripts: Epstein associate says she ‘never’ saw Trump receive a massage – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/22/donald-trump-administration-federal-reserve-republicans-democrats-us-politics-live", "id_key": "514403b520b5ff7681488196b1b964c5d05b4ae2166d39bde36e1b16a8b44816", "summary": "Transcripts and audio recordings from Maxwell’s interviews with deputy attorney general Todd Blanche released Ghislaine Maxwell interview transcript released by US justice department As we bring you more information about the reported FBI raid on John Bolton’s Maryland home , it’s worth pointing out that Bolton was stripped of his security clearance when Trump started his second term in office. The president also got rid of Bolton’s government detail, despite being the target of an assassination plot due to Bolton’s criticism of the Iranian regime. Bolton served as Trump’s third national security advis er in his first term in office, but has since become a vocal critic of the president . Less than an hour ago, a post from Bolton’s X account critiqued the state of negotiations between Russia and Ukraine. “Russia has not changed its goal: drag Ukraine into a new Russian Empire,” he wrote. “Meanwhile, meetings will continue because Trump wants a Nobel Peace Prize, but I don’t see these talks making any progress.” Continue reading...", "ingested_utc": "2025-08-22T20:49:48Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:49:48Z", "source": "Guardian_World", "title": "Ghislaine Maxwell never saw Trump in ‘any inappropriate setting’, transcript shows", "url": "https://www.theguardian.com/us-news/2025/aug/22/ghislaine-maxwell-interview-transcript-justice-department", "id_key": "f85820250151bd133630d799a822b9c3915746578fd91d9089687cfff3738ba0", "summary": "Newly released files from June DoJ interview shows Maxwell detailed Epstein-Trump social relationship The US Department of Justice has released the transcript and audio recording of an interview conducted by Todd Blanche, the deputy attorney general, with the convicted sex trafficker Ghislaine Maxwell. In a post on X , Blanche said the materials were being released “in the interest of transparency”, providing links to the transcript and to audio files . Continue reading...", "ingested_utc": "2025-08-22T20:49:48Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:52:07Z", "source": "NYTimes_Technology", "title": "Elon Musk’s X Agrees to Settlements With Thousands of Former Employees", "url": "https://www.nytimes.com/2025/08/22/technology/elon-musk-x-settlements.html", "id_key": "b0430aa6365988e258e3161a1059cfe0616cca3ddd1a4f2ba563d8183ddee8dd", "summary": "The settlements are an about-face for the billionaire, whose company fought with former workers over whether it owed them severance pay.", "ingested_utc": "2025-08-22T20:52:07Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:52:36Z", "source": "Engadget_All", "title": "The US government is taking a 10 percent stake in Intel", "url": "https://www.engadget.com/big-tech/the-us-government-is-taking-a-10-percent-stake-in-intel-205047622.html?src=rss", "id_key": "43b038a2c8fc5ff8ba76e31fa720798ed2cb3955942b03d8f5548628ac3f8f97", "summary": "President Donald Trump says the US government is taking a 10 percent stake in chip maker Intel. Trump shared the news during a press conference on Friday , though an official announcement is still forthcoming, Reuters reports . News of a plan to convert Intel's previously promised CHIPS Act funding into equity in the company was first reported earlier in August. A meeting between Intel CEO Lip-Bu Tan and Trump following the President's call for Tan to resign seems to be the source of the deal. \"He walked in wanting to keep his job and he ended up giving us 10 billion dollars for the United States. So we picked up 10 billion,\" Trump shared during the press conference. Based on Intel's current share price, a 10 percent stake would be worth around $10 billion, Reuters says. It's important to note that the government investing in Intel is not the same thing as receiving free money, it's the exact opposite. The government's stake in Intel will also be non-voting, according to earlier comments from US Commerce Secretary Howard Lutnick. Intel was supposed to receive up to $10.86 billion in federal funding to expand its chip manufacturing business in the US as part of the CHIPS Act. By agreeing to this deal, Tan is likely trying to make sure that funding still goes through, one of several drastic moves to keep Intel afloat. Tan assumed the title of CEO following Pat Gelsinger's sudden retirement in 2024 . Since taking over, he's already committed to cutting Intel's workforce by 20 percent. Even with lower costs and guaranteed investment, the company's future is still uncertain: Intel is reportedly struggling to make its next-gen Panther Lake chips at scale. The Trump administration says it won't seek similar equity deals with other recipients of CHIPS Act funding. That hasn't stopped them from making other equally unprecedented financial arrangements. NVIDIA and AMD reportedly struck a deal with the US government that gives the companies the ability to export products to China in exchange for 15 percent of their profits. This article originally appeared on Engadget at https://www.engadget.com/big-tech/the-us-government-is-taking-a-10-percent-stake-in-intel-205047622.html?src=rss", "ingested_utc": "2025-08-22T20:52:36Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:52:46Z", "source": "AlJazeera_All", "title": "This is the human tragedy caused by Israel’s famine in Gaza", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/22/this-is-the-human-tragedy-caused-by-israels-famine-in-gaza?traffic_source=rss", "id_key": "e46b7895cbef8477ef4466c10a8ccf774677681dbaa004c353b4f9d32149f009", "summary": "A UN-backed food security body has declared parts of Gaza are officially suffering from a famine created by Israel.", "ingested_utc": "2025-08-22T20:52:46Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T20:52:53Z", "source": "FinancialPost_Business", "title": "North Carolina Supreme Court says bar owners’ COVID-19 lawsuits can continue", "url": "https://financialpost.com/pmn/north-carolina-supreme-court-says-bar-owners-covid-19-lawsuits-can-continue", "id_key": "335f2f554e65fd20bbeee9bb9d15f1c08fce78d314885233732c7df5bd682429", "summary": "RALEIGH, N.C. (AP) — The North Carolina Supreme Court issued favorable rulings Friday for bars and their operators in litigation seeking monetary compensation from the state for COVID-19 restrictions first issued by then-Gov. Roy Cooper that shuttered their doors and, in their view, treated them unfairly compared to the way restaurants were regulated. The majority […]", "ingested_utc": "2025-08-22T20:52:53Z"}
