{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:49:21Z", "source": "Guardian_World", "title": "News live: Chalmers promises to act on ‘intergenerational fairness’ after reform summit; Australia condemns West Bank settlement plan", "url": "https://www.theguardian.com/australia-news/live/2025/aug/22/australia-news-live-penny-wong-gaza-israel-netanyahu-anthony-albanese-childcare-safety-education-database-ntwnfb", "id_key": "db8452e575adabe594d05556bc7ff3aa3c69f235ca92674d9f1b2f138481db10", "summary": "Treasurer declines to say if the government would consider changing the treatment of family trusts or reducing the capital gains discount. Follow today’s news live Get our breaking news email , free app or daily news podcast Roundtable agrees environmental laws review should be sped up Guardian Australia’s Tom McIlroy and Patrick Commins dug into some of Chalmer’s plans for reform, including a rapid overhaul of the country’s environmental laws. I’d say we’ve made a lot of progress in our economy the last few years and the best way to sustain that progress, to lift living standards, to make people better off over time is to make our economy more productive, more resilient and make our budget more sustainable. And those were the three major issues that we grappled with over the course of the last three days … One of the defining outcomes of this economic reform roundtable was building consensus and momentum around ensuring that intergenerational fairness is one of the defining principles of our country, but also of our government. And that’s certainly something that we will pick up and run. Continue reading...", "ingested_utc": "2025-08-21T21:49:21Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:49:21Z", "source": "Guardian_World", "title": "Trump departs White House to join military and police on patrol of Washington DC – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/21/texas-house-redrawn-electoral-map-republicans-us-politics-latest-updates-news", "id_key": "87334ff1b4ba915e03007002c37db179e7f9ca1d8385c1ea5d3b97c7f3e20897", "summary": "US president joined by attorney general Pam Bondi, aide Stephen Miller and chief of staff Susie Wiles Trump set to go on ride-along with troops in DC amid federal takeover The government lost its bid to unseal grand jury transcripts in the sex-trafficking case against Jeffrey Epstein . Richard Berman, a federal judge in New York , said the transcripts pale in comparison to the documents the government already has on Epstein and that disclosing them could harm victims. It’s kind of bizarre that we have a bunch of old, primarily white people who are out there protesting the policies that keep people safe when they’ve never felt danger in their entire lives. Continue reading...", "ingested_utc": "2025-08-21T21:49:21Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T21:49:21Z", "source": "Guardian_World", "title": "Trump set to go on ride-along with troops in DC amid federal takeover", "url": "https://www.theguardian.com/us-news/2025/aug/21/trump-ride-along-troops-dc-takeover", "id_key": "217469366ff9e24d0d36394177f9ac59018aa517fc78b6e5a251207cbbb83e12", "summary": "US president says he plans to join the police and military patrolling Washington DC’s streets Thursday evening Donald Trump is set to join federalized law enforcement officials on the streets of Washington DC on Thursday as his administration continues its extraordinary and forced takeover the local police force in the US capital amid the deployment of national guard troops. “I’m going to be going out tonight with the police and with the military, of course,” Trump said in an interview with talkshow host Todd Starnes. Continue reading...", "ingested_utc": "2025-08-21T21:49:21Z"}
