{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:25:43Z", "source": "BBC_World", "title": "Peruvian woman accused of smuggling drugs in sex toy in Bali", "url": "https://www.bbc.com/news/articles/cn92eywlwjlo?at_medium=RSS&at_campaign=rss", "id_key": "fbca64d923e0ec3622903162cd49a94246b6d9bd866db34438c6e5ea4b6c1044", "summary": "The 42-year-old allegedly also concealed drugs in her underwear, police said.", "ingested_utc": "2025-08-19T19:25:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:25:46Z", "source": "Guardian_World", "title": "Justice department reportedly investigating DC police for allegedly manipulating crime data – live", "url": "https://www.theguardian.com/us-news/live/2025/aug/19/texas-congressional-maps-democrats-republicans-donald-trump-us-politics-updates-news", "id_key": "d8cad981b6c8759433621390bf61c29fff7332defc865ef070f819224e2e3161", "summary": "US attorney for DC’s investigation comes after reports that Washington DC’s police commander was put on leave in May The Republican governors of Louisiana and Tennessee will send hundreds of their national guard troops to assist federal law enforcement in DC – to help assist the president’s “crime crackdown”. They join Mississippi, Ohio, West Virginia and South Carolina – who have all sent national guard troops to DC. Continue reading...", "ingested_utc": "2025-08-19T19:25:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:25:46Z", "source": "Guardian_World", "title": "Republicans sue to block Newsom’s fast-track California redistricting plan", "url": "https://www.theguardian.com/us-news/2025/aug/19/california-gavin-newsom-redistricting-republicans", "id_key": "4de5c7c4b0a08923a62f8f8846fa429e5381d9e5295c543c9391ad8ca9e0fe97", "summary": "GOP lawmakers say the move to counter Texas maps bypasses voters and violates rules on how legislation must be introduced US politics live – latest updates Republican state legislators in California filed suit on Tuesday to block a mid-year redistricting plan meant to counter Texas’s effort to redraw congressional district lines. The emergency petition argues that the process being used in the California assembly violates laws requiring a 30-day period between the introduction of legislation and voting on it. Continue reading...", "ingested_utc": "2025-08-19T19:25:46Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:28:32Z", "source": "Guardian_World", "title": "Peruvian woman accused of trying to smuggle cocaine into Bali using sex toy", "url": "https://www.theguardian.com/world/2025/aug/19/peruvian-woman-bali-cocaine-smuggling", "id_key": "d0c303e31eb17b07ff5f67edd9f3bb731edd4160c23beef81c9d31c9cd7f86d0", "summary": "Officers say they found 1.4kg of drug inside toy in woman’s underwear and also accused her of hiding ecstasy pills A Peruvian woman has been arrested in Bali after allegedly trying to smuggle cocaine into the Indonesian resort island using a sex toy and hiding drugs in her underwear, police said. The 42-year-old, identified only by her initials NS, arrived at Bali’s international airport from Qatar on 12 August when authorities became suspicious. Continue reading...", "ingested_utc": "2025-08-19T19:28:32Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:28:43Z", "source": "MarketWatch_Bulletins", "title": "Stocks lower in final hour as Big Tech drags down Nasdaq, S&P 500 — follow live", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=6c8e6bf0-7d99-42a5-a0ff-e93a945b9d19&mod=mw_rss_bulletins", "id_key": "5b7cc7009421b6fdfcf7ed98794af68c4d1cb5269192d5de0091da9d5f0339e7", "summary": "", "ingested_utc": "2025-08-19T19:28:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:28:51Z", "source": "NYTimes_Business", "title": "Richard Lee, Activist Who Founded a Pot ‘University,’ Dies at 62", "url": "https://www.nytimes.com/2025/08/19/us/richard-lee-dead.html", "id_key": "e66574ae0003b36ca22a70780001e2369406cbe009640011599303b7e41ed249", "summary": "After he was paralyzed in an accident, his use of marijuana for medical purposes led him to become one of the nation’s most influential cannabis activists.", "ingested_utc": "2025-08-19T19:28:51Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:28:52Z", "source": "NYTimes_World", "title": "A ‘Dexter’ Obsessed Man Highlights a Gap in British Law", "url": "https://www.nytimes.com/2025/08/19/world/europe/jacob-power-dexter-murder-plans-uk-laws.html", "id_key": "cc178b17110b7679ae3019260d570f618acd08f3e93e826757552a82c4d9f8f7", "summary": "Inspired by the TV serial killer, Jacob Power wrote out detailed murder plans and dug graves. Still, prosecutors could not charge him with attempted murder.", "ingested_utc": "2025-08-19T19:28:52Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:04Z", "source": "FT_Home", "title": "Trump says US could play role ‘by air’ in Ukraine security guarantee", "url": "https://www.ft.com/content/591a8788-c553-4886-858f-b7c7854cbcfd", "id_key": "9bc482c9fa630e66b354a4485b7ce637d4ce202e275eea95e0077ef82c55a154", "summary": "President warns Putin will face ‘rough situation’ if Russian president does not co-operate on a peace deal", "ingested_utc": "2025-08-19T19:29:04Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:04Z", "source": "FT_Home", "title": "US in talks for a 10% Intel stake, White House says", "url": "https://www.ft.com/content/036bb89c-b0ab-4e28-963a-1049d9ef5da7", "id_key": "4fa19aaf11d75d96242edf07ef3ff14fede709e84b991d67f5e7518eb7cb6d0c", "summary": "Commerce secretary Howard Lutnick ‘ironing out the details’ of a deal, according to Trump’s spokesperson", "ingested_utc": "2025-08-19T19:29:04Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:04Z", "source": "FT_Home", "title": "UK fails to stop removal of asylum seekers from Essex hotel at centre of immigration debate", "url": "https://www.ft.com/content/f7427675-1514-480d-9dd3-67891641dc88", "id_key": "db5ddab89a7d73b928358e06610cabcde2c646f24436e0318cdc626d9ecec038", "summary": "Local authority injunction ruling may lead to more councils seeking to shut down hotels that house migrants", "ingested_utc": "2025-08-19T19:29:04Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:24Z", "source": "TechCrunch_All", "title": "Made by Google 2025: How to watch Google debut the Pixel 10, Pixel Watch 4, and more", "url": "https://techcrunch.com/2025/08/19/made-by-google-2025-how-to-watch-google-debut-the-pixel-10-pixel-watch-4-and-more/", "id_key": "f5f819305749dc27dd3f05de31cadb99aacb9c83d98f1994459067b4292b5bd4", "summary": "Google is hosting its Pixel 10 event next week. Learn how to watch the tech giant reveal its new mobile devices and what else you can expect.", "ingested_utc": "2025-08-19T19:29:24Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:25Z", "source": "ArsTechnica_All", "title": "Ancient teeth show people were getting high off betel nuts 4,000 years ago", "url": "https://arstechnica.com/science/2025/08/ancient-teeth-show-people-were-getting-high-off-betel-nuts-4000-years-ago/", "id_key": "e55d196d5861a7713bc09a7623f223c3432d6634c4742b14e9241383965abb42", "summary": "Ancient teeth reveal that a stimulant has been used since the Bronze Age.", "ingested_utc": "2025-08-19T19:29:25Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:30Z", "source": "Engadget_All", "title": "Beyerdynamic launches two new wireless headsets at Gamescom", "url": "https://www.engadget.com/audio/headphones/beyerdynamic-launches-two-new-wireless-headsets-at-gamescom-191011123.html?src=rss", "id_key": "195eae48d61f57406f4fcffe0bd3f15b50c8166ba2f3e680f76b1a7d8de1c1d4", "summary": "Beyerdynamic has announced two new wireless gaming headsets at Gamescom 2025 . The MMX 150 and MMX 230 are the latest entries in the company's MMX gaming lineup . The new headsets will be available exclusively in Europe and Canada, and are displayed in Cologne for gamescom attendees. The MMX 150 wireless is intended for casual gaming as well as everyday listening. It carries up to 50 hours of battery life and offers an EQ via the beyerdynamic app. It comes with a detachable voice microphone with sidetone, letting users hear themselves while gaming. The headset is powered by 40mm drivers. The MMX 150 features plug-and-play compatibility so gamers can use it seamlessly across console, mobile or PC. The MMX 230 wireless is the new flagship model, and it’s the first Beyerdynamic gaming headset with a user-replaceable battery. The battery pack offers up to 60 hours of listening between charges. The 230 features Bluetooth 6.0 for low-latency connections, as well as a microphone with environmental noise cancellation for clear communications. The headset's 40mm drivers are tuned for spatial sound, helping gamers hear directional cues. Both the MMX 150 and MMX 230 will be available in black or white. Each model will ship with a low-latency USB-C dongle, a USB-A adapter and a 1.8-meter USB-C to 3.5mm cable. The MMX 150 will sell for $250 CAD while the MMX 230 comes in at $350 CAD. The headsets will be for sale via Beyerdynamic's online store in Q4 of 2025. It's not entirely clear at this point if they will be available in the United States. This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/beyerdynamic-launches-two-new-wireless-headsets-at-gamescom-191011123.html?src=rss", "ingested_utc": "2025-08-19T19:29:30Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:30Z", "source": "Engadget_All", "title": "Google Pixel 10 launch event: Here's how to watch Made by Google on August 20", "url": "https://www.engadget.com/mobile/smartphones/google-pixel-10-launch-event-heres-how-to-watch-made-by-google-on-august-20-163933479.html?src=rss", "id_key": "4ca552a2a7f21121824548ee9584a7f37c0f6bf28d78ba84d7a997e38e04930f", "summary": "Believe it or not, Big Tech's fall hardware events are already upon us. (Heck, Samsung already got a jump on things in July.) Up next: Google's big Pixel shindig. You can learn all about the new Pixel 10 lineup , along with new watches and earbuds, on August 20. Google's new hardware has leaked far and wide. But that doesn't mean there couldn't be a few surprises. If you want to be the first to hear the official scoop, you can tune into the Made by Google YouTube channel (or right here!) to catch Google's event, which will be hosted by Jimmy Fallon and also include other celebrities like Stephen Curry, Lando Norris and the Jonas Brothers. The event kicks off at 1PM ET on August 20 — get ready for some awkward celebrity cameos! Sam Rutherford for Engadget What's on tap? You can expect a more power-efficient Tensor G5 processor in all the new Pixel 10 phones. (That could help power new Gemini AI features , too.) The base-level Pixel 10 should get a big camera upgrade: a 5x telephoto lens. Before this generation, you had to splurge on a Pro or Fold model to get optical zoom. Cameras will be higher-res across the board, too. In other areas, Qi2 magnetic charging is expected to come to the new Pixels. Expect a new accessory ecosystem, a la Apple's MagSafe , dubbed \"Pixelsnap.\" We'll also likely see the Pixel Watch 4 with a larger battery and smaller bezels . And the Pixel Buds 2a could bring refinements to the company's budget earbuds . Engadget's Pixel 10 roundup will give you a much more detailed dive into the leaks . You can head back here on August 20 at 1PM ET to watch live. Live from NYC, it's #MadeByGoogle '25! Tune in on August 20th at 1pm ET to catch our latest products and celebrate 10 generations of Pixel with all these special guests & more 👀 Are you ready to get outside your comfort phone? https://t.co/3qmNQCXzzo pic.twitter.com/9IA1pO9G6F — Made by Google (@madebygoogle) August 15, 2025 This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/google-pixel-10-launch-event-heres-how-to-watch-made-by-google-on-august-20-163933479.html?src=rss", "ingested_utc": "2025-08-19T19:29:30Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:30Z", "source": "Engadget_All", "title": "Former Gears of War and Diablo head Rod Fergusson is now in charge of BioShock", "url": "https://www.engadget.com/gaming/former-gears-of-war-and-diablo-head-rod-fergusson-is-now-in-charge-of-bioshock-185630691.html?src=rss", "id_key": "39a81efa9938381443368921a10ae14997ac09c17c90f792f65976be0ae7e121", "summary": "Rod Fergusson, the head of the Diablo franchise for the last five years, is joining 2K Games to lead up the BioShock franchise. This is happening just a couple of weeks after Fergusson announced he was leaving Blizzard . He was also the studio head at Coalition once upon a time, where he oversaw the Gears of War franchise. Fergusson wrote on X that he will be \"overseeing development of the next BioShock game\" and will even have a say in that upcoming film adaptation for Netflix . The franchise is in dire need of a new steward, as it was reported earlier this month that 2K executives were unhappy with the direction of the upcoming sequel. The newly-hired franchise head says that he is \"deeply grateful for the work done so far\" and that he's \"committed to building a BioShock game we’ll be proud of.\" Would you kindly allow me to share some news? Some of you guessed it, I’m returning to 2K to lead a series that means a lot to me as the new Head of the BioShock Franchise. I’ll be heading up Cloud Chamber and overseeing development of the next BioShock game, along with… — Rod Fergusson (@RodFergusson) August 19, 2025 The fourth BioShock isn't the only game in the series that has faced some serious hurdles. Recent reporting has indicated that a remake of the original game was shelved by 2K earlier this year . This remaster was set to support modern frame rates and higher resolutions than the original title. In other words, there's a lot riding on this upcoming sequel. BioShock Infinite is over 12 years old at this point and the franchise has been mostly dormant in that time. Here's hoping that Fergusson can reinvigorate the series. This article originally appeared on Engadget at https://www.engadget.com/gaming/former-gears-of-war-and-diablo-head-rod-fergusson-is-now-in-charge-of-bioshock-185630691.html?src=rss", "ingested_utc": "2025-08-19T19:29:30Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:30Z", "source": "Engadget_All", "title": "FromSoft's Sekiro: Shadows Die Twice is becoming an anime", "url": "https://www.engadget.com/entertainment/tv-movies/fromsofts-sekiro-shadows-die-twice-is-becoming-an-anime-185050564.html?src=rss", "id_key": "a6366b1248f7f727e273794e383039706af86d39c0df4db3b46379530466ff68", "summary": "Adaptations of video games continue to be big business. During Opening Night Live at Gamescom 2025, we learned that the punishing Sekiro: Shadows Die Twice by FromSoftware will be turning into an anime show. Sekiro: No Defeat will be available exclusively on Crunchyroll some time during 2026. The show will be directed by Kenichi Kutsuna, who previously worked as an animator on the One Punch Man and Naruto: Shippuden series. The vibe in the No Defeat trailer does feel distinct from its source material, with a hand-drawn aesthetic that's a little more vibrant than the muted and immersive world of Shadows Die Twice. But the violence is unchanged, with a couple pretty grisly attacks that point to the anime maintaining the \"kill ingeniously\" tagline from the game. This article originally appeared on Engadget at https://www.engadget.com/entertainment/tv-movies/fromsofts-sekiro-shadows-die-twice-is-becoming-an-anime-185050564.html?src=rss", "ingested_utc": "2025-08-19T19:29:30Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:40Z", "source": "TheStreet_Top", "title": "Defense accuses Ford of retaliation in messy RICO lawsuit", "url": "https://www.thestreet.com/automotive/defense-accuses-ford-retaliation-rico-lawsuit", "id_key": "2cdbebb39e4878281ea0ae41116751ce12c162508561bad45f1172ab3df8037c", "summary": "Ford filed a lawsuit against a group of lemon-law firms alleging coordinated campaigns against the carmaker.", "ingested_utc": "2025-08-19T19:29:40Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T19:29:48Z", "source": "FinancialPost_Business", "title": "Cooler inflation could set stage for Bank of Canada rate cut", "url": "https://financialpost.com/news/economy/cooler-inflation-set-stage-bank-of-canada-rate-cut", "id_key": "de5fbbbc5f2c20b39464e324cd5608c3f7dfc245fcac7c8c284f9ce78418b8e9", "summary": "Watch: Economists say there are signs that core inflation is losing upward momentum", "ingested_utc": "2025-08-19T19:29:48Z"}
