{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:31:56Z", "source": "BBC_World", "title": "New bodies found near site of Kenya's starvation cult burials", "url": "https://www.bbc.com/news/articles/cdrkpjk0346o?at_medium=RSS&at_campaign=rss", "id_key": "29c1b2cd908b12311a8a8be49f9287d19d41f2dc063d8dff9d04463522737eca", "summary": "Nine bodies have been found in fresh graves near the site of the \"Shakahola Forest Massacre\".", "ingested_utc": "2025-08-22T15:31:56Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:31:57Z", "source": "BBC_Business", "title": "Royal Mail and DHL halt US deliveries over tariffs", "url": "https://www.bbc.com/news/articles/cx2p17xypgko?at_medium=RSS&at_campaign=rss", "id_key": "31b1c82647250746f8f9b2956c876a277cb627fef4764c50653b8597486ea01e", "summary": "Services including Royal Mail and DHL say they are suspending deliveries until they have proper systems in place.", "ingested_utc": "2025-08-22T15:31:57Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:31:57Z", "source": "BBC_Business", "title": "What are Rachel Reeves' options on property tax?", "url": "https://www.bbc.com/news/articles/cm2k1m56xgjo?at_medium=RSS&at_campaign=rss", "id_key": "39c006771120ab4cdf9aeeed5ec8fa63cca1f12a236f9bfce988721a58122789", "summary": "Reports suggest the government is considering shaking up the property tax system to raise revenue.", "ingested_utc": "2025-08-22T15:31:57Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:31:59Z", "source": "Guardian_Business", "title": "Fed chair Jerome Powell signals interest rate cuts amid Trump attacks", "url": "https://www.theguardian.com/business/2025/aug/22/jerome-powell-speech-jackson-hole", "id_key": "cec0d7093e0261eb9b45a80e33a87e7ee49d010f2b659ba0954c90c3c66dda1d", "summary": "Jerome Powell – who Trump has urged to resign – addressed ‘challenging’ dichotomy of economic risks, including tariffs The Federal Reserve is gearing up to resume cuts to interest rates, its chair, Jerome Powell has signaled, as he warned Donald Trump ’s tariffs and immigration crackdown had roiled the global economy and hit the US workforce. For months, Powell has ignored demands from the president to cut interest rates and defied the US president’s calls to resign. But as Trump ramps up his extraordinary attack on the Fed’s independence, Powell suggested on Friday that Fed officials are considering a rate cut. Continue reading...", "ingested_utc": "2025-08-22T15:31:59Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:31:59Z", "source": "Guardian_World", "title": "Eswatini government faces court challenge over men deported by US", "url": "https://www.theguardian.com/world/2025/aug/22/court-case-challenging-eswatini-us-immigrant-deportation-deal-postponed", "id_key": "661e4acb4e0bef2925b83284204a77a8389650e378f3970c6663729ad9a56095", "summary": "Group of NGOs claim deal was unconstitutional and violated the imprisoned men’s human rights A group of NGOs is challenging Eswatini’s acceptance of five people deported by the US, arguing the deal was unconstitutional and violated the imprisoned men’s human rights. The men from Vietnam, Jamaica, Laos, Yemen and Cuba, who the US said were dangerous criminals, were flown to the small southern African country in July, as the Trump administration attempts to deport millions of migrants and asylum seekers. Continue reading...", "ingested_utc": "2025-08-22T15:31:59Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:31:59Z", "source": "Guardian_World", "title": "UN agency says Gaza famine is direct result of Israel’s actions and may amount to war crime – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/22/famine-benjamin-netanyahu-palestine-gaza-israel-war-latest-updates", "id_key": "5cbecd03e9d31b0000551eebdc5927d63e4bc631f5d82f96fd76d480e0908279", "summary": "A report by Forensic Architecture and the World Peace Foundation says Israel has dismantled the proven model of aid distribution Mothers in Gaza have resorted to using legume water and herbs as alternative to infant milk amid Famine , charity warns Dr. Ra’ed Al-Baba, who works at Al Awda Hospital run by ActionAid’s partner Al-Awda, said usage of alternatives to infant milk had “catastrophic” consequences. There are mothers who resort to using legume water, herbs, and other alternatives to infant milk because of the severe shortage. These methods carry catastrophic risks, causing gastroenteritis, food poisoning, delayed growth, severe anaemia, and even the inability to move. We have seen cases of extreme dehydration from polluted water mixed with these substitutes. This is not survival, this is slow death.” Continue reading...", "ingested_utc": "2025-08-22T15:31:59Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:00Z", "source": "Guardian_World", "title": "Royal Mail still missing delivery targets after sale to Czech tycoon Křetínský", "url": "https://www.theguardian.com/business/2025/aug/22/royal-mail-missing-delivery-targets-sale-kretinsky-ep-group", "id_key": "137267c3f3a0ed72636b9eb79abce3cb52ae46530c350eeb1bcc23c8356f2f1a", "summary": "Both first and second class mail lag behind Ofcom’s target in quarterly update after EP Group’s takeover Royal Mail missed its targets by delivering nearly a quarter of first class mail late in the first update since its parent company was bought by a Czech billionaire, figures show. The company said on Friday it had delivered 75.9% of first class mail within one working day of collection in the three months to 29 June, up from 74.2% the previous quarter but well behind the 93% target set by the regulator, Ofcom. Continue reading...", "ingested_utc": "2025-08-22T15:32:00Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:00Z", "source": "Guardian_World", "title": "Government to appeal against court ruling blocking asylum seekers being housed at Epping hotel – as it happened", "url": "https://www.theguardian.com/uk-news/live/2025/aug/22/asylum-hotels-labour-immigration-protests-conservatives-kemi-badenoch-keir-starmer-uk-politics-live", "id_key": "87d690e2d65b3c6e9905fc08d2a7c3fad362088f2dd511a6a5dc30e06c407f3c", "summary": "This blog is now closed In an interview on BBC Radio Scotland’s Good Morning Scotland programme on Friday, MSP Jeremy Balfour who has resigned from the Scottish Conservatives ( see 9.13am BST ), said he feels the party has “lost its way in Scotland” and “I don’t think it represents true Conservative values”. According to the PA news agency, when asked if Scottish Tory leader Russell Findlay is the right person for the job and whether he should stay in the post, he said: Clearly I’m no longer a member of the party so that’s no longer a decision for me to make. I get on very well as an individual with Russell, I think he’s a good individual. Whether he’s the person to lead the Scottish Conservatives is obviously for MSPs, for the membership, to decide. What I’m very clear about is that those with disabilities, other minorities and the people of Lothian need a voice for people to hear what we require within our country. I’m not sure any party is actually offering that at the moment but whether I stand or not I’ll come to a view in the next few weeks. It’s the party that’s moved, not me. We are disappointed to read these comments but grateful for Jeremy’s service and wish him well. The Scottish Conservatives, under Russell Findlay’s leadership, recognise that many people feel completely disconnected from politics. It is absolutely critical that our party continues to champion commonsense Conservative values and policies that focus on the issues of concern to hard-working Scots. Continue reading...", "ingested_utc": "2025-08-22T15:32:00Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:00Z", "source": "Guardian_World", "title": "BA flight attendant on US-London route found ‘naked and high on drugs’ in toilet", "url": "https://www.theguardian.com/uk-news/2025/aug/22/ba-flight-attendant-on-us-london-route-found-naked-and-high-on-drugs-in-toilet", "id_key": "9a814836960607e3956c49a757aa99558bdfa7ac463f7f736a816f0c8d2d9e85", "summary": "Haden Pentecost pleads guilty in magistrates court to performing an aviation function while impaired by drugs A British Airways flight attendant was found high on drugs and completely naked in an onboard toilet during a flight from California to London, a court heard. Haden Pentecost, who was described as agitated, sweating and babbling, had to be stood down by the flight’s manager when he failed to help with any pre-flight safety checks. Continue reading...", "ingested_utc": "2025-08-22T15:32:00Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:00Z", "source": "Guardian_World", "title": "Hurricane Erin intensified at a near-record rate. Is Florida ready for the next big storm?", "url": "https://www.theguardian.com/us-news/2025/aug/22/hurricane-erin-analysis-florida", "id_key": "7df15d981cebfba2544eefd799619e02b9010a9bb4917f7a97bbb54391580722", "summary": "Erin went from a tropical storm to a category 5 in about 24 hours, underscoring the danger of hurricane season amid a diminished Fema and National Weather Service This season’s first hurricane – and the first of the Trump administration’s new era of meteorological austerity – has been making its closest pass to the US this week. On Friday morning, weaker than days earlier, it is still a large storm, heading north-east, and impacting the US east coast with threats of coastal flooding. Eric Holthaus is a meteorologist and climate journalist based in Minnesota Continue reading...", "ingested_utc": "2025-08-22T15:32:00Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:22Z", "source": "CryptoSlate", "title": "Pennsylvania bill could jail officials who hold crypto after 90 days", "url": "https://cryptoslate.com/pennsylvania-bill-could-jail-officials-who-hold-crypto-after-90-days/", "id_key": "2532b3b5c53eed40ffbccb1f8a2ea2ae33dcb74804c9f1360ccb9c682b90cc58", "summary": "Pennsylvania lawmaker Ben Waxman, a Democrat, has introduced a bill that would prevent public officials from owning or transacting in digital assets while in office. The proposal, known as the House Bill 1812 (HB1812), aims to amend the state’s ethics and financial disclosure laws and extend those restrictions to officials’ immediate families. The legislation covers […] The post Pennsylvania bill could jail officials who hold crypto after 90 days appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T15:32:22Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:23Z", "source": "CryptoBriefing", "title": "Bitcoin reclaims $116K, Ether, XRP push higher after Fed’s Powell hints at possible rate cuts", "url": "https://cryptobriefing.com/bitcoin-rally-fed-rate-cut/", "id_key": "b08e11d49ca4b4f9bc012aef13cea139b48a7c1a0542021a0b6c67ee6d2cda39", "summary": "Crypto market optimism surges, potentially signaling increased investment and economic shifts as monetary policy hints at future rate adjustments. The post Bitcoin reclaims $116K, Ether, XRP push higher after Fed’s Powell hints at possible rate cuts appeared first on Crypto Briefing .", "ingested_utc": "2025-08-22T15:32:23Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:26Z", "source": "CryptoNews", "title": "Mantle Back In the Spotlight? MNT Price Pumps 17% This Week, What is Going On", "url": "https://cryptonews.com/news/mantle-back-in-the-spotlight-mnt-price-pumps-17-this-week-what-is-going-on/", "id_key": "157aa797b11900c89e415ded85daac1a45848a2b97ccecb7b86273f50aad1206", "summary": "Mantle governance token MNT surges 17% weekly and 50% in August to $1.24 with $4.17B market cap as Layer 2 network benefits from strategic Bybit exchange integration, expanding utility across platform services, while stablecoin supply achieves a new peak of $713.8, marking a 210% year-over-year increase. The post Mantle Back In the Spotlight? MNT Price Pumps 17% This Week, What is Going On appeared first on Cryptonews .", "ingested_utc": "2025-08-22T15:32:26Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:32:43Z", "source": "CoinMetrics_Blog", "title": "USDC Ticker Update for Network Data Pro and Atlas", "url": "https://coinmetrics.io/company-news/usdc-ticker-update-ndp-atlas/", "id_key": "daa87097725dc80c9f6c56c7dfdee4a458e78760a0e6442329f1c7247a2da215", "summary": "As a follow-up to our initial announcement on March 5, 2025, we are writing to confirm an upcoming change to the way we handle the USDC ticker in Network Data Pro (NDP) and Atlas. Please be aware that this upcoming change will not impact our Reference Rates, Market Data Feed or Indexes. This change will […] The post USDC Ticker Update for Network Data Pro and Atlas appeared first on Coin Metrics .", "ingested_utc": "2025-08-22T15:32:43Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:22Z", "source": "NYTimes_Business", "title": "Trump Threatens to Fire Fed Governor Lisa Cook If She Does Not Resign", "url": "https://www.nytimes.com/2025/08/22/us/politics/trump-lisa-cook-federal-reserve-governor.html", "id_key": "51ee5d3c314ac37bbf74e1a93d39d63079dbe272e6f5fa4e4876bcd6bc386022", "summary": "President Trump said he would fire Lisa Cook, a Federal Reserve governor, if she did not resign. But his ability to fire a Fed governor is limited.", "ingested_utc": "2025-08-22T15:34:22Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:23Z", "source": "NYTimes_World", "title": "Has Russia Advanced? Ukrainians Use This Online Map to Check Every Morning.", "url": "https://www.nytimes.com/2025/08/22/world/europe/ukraine-russia-deepstate-war-map.html", "id_key": "1fe7b0a82a4b46f769ad955c75e735de6a154793db5c0867d8080a449f7cca41", "summary": "The online DeepState map, based on geolocated combat footage and tips from Ukrainian Army sources, draws 900,000 views each day and acts as a counterbalance to the military’s omissions.", "ingested_utc": "2025-08-22T15:34:23Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:30Z", "source": "NPR_Top", "title": "She's bracing and saving to pay $2,800 a month for ACA health insurance next year", "url": "https://www.npr.org/sections/shots-health-news/2025/08/22/nx-s1-5511182/aca-tax-credits-health-insurance-open-enrollment", "id_key": "0a2305b22cc5cd49d87881335535c37fa9f3c9a16563a3befae77205d53749e0", "summary": "Raiding retirement savings. Pondering job changes or even marriage. People who buy their own health insurance are strategizing ahead of major price hikes in 2026. Open enrollment starts Nov. 1.", "ingested_utc": "2025-08-22T15:34:30Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:34Z", "source": "FT_Home", "title": "Powell says ‘shifting’ economic risks strengthen case for Fed rate cut", "url": "https://www.ft.com/content/cdd1dd0f-f0ba-41f3-be97-e598785676f5", "id_key": "146636eb35772b6d91dae45d142b0e9b775197d9f3c9fe15720e4287f732c76f", "summary": "Central bank chair warns of ‘challenging situation’ with tariffs pushing up inflation and jobs market cooling", "ingested_utc": "2025-08-22T15:34:34Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:34Z", "source": "FT_Home", "title": "Zelenskyy rebukes Russia’s demand to be involved in security guarantees", "url": "https://www.ft.com/content/248b7da4-ce67-4f02-b9d1-d78af0e15c26", "id_key": "455b26aa6946bb92b8a510f5e00bbb3d7dfced4c276eb79e44aadc37b91aa3b5", "summary": "Ukrainian president says he does not ‘quite understand what guarantees the aggressor needs’", "ingested_utc": "2025-08-22T15:34:34Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:50Z", "source": "TechCrunch_All", "title": "X pulls the ability to like and follow from its developer API’s free tier", "url": "https://techcrunch.com/2025/08/22/x-pulls-the-ability-to-like-and-follow-from-its-developer-apis-free-tier/", "id_key": "9e48cc0a63d81b94229ef62657943ffebf2a6407fd53b5b155bd7f047b339a97", "summary": "X is making it harder for spammers with these API changes.", "ingested_utc": "2025-08-22T15:34:50Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:52Z", "source": "WIRED_All", "title": "Astronomer’s New CEO Speaks—Yes, About That", "url": "https://www.wired.com/story/astronomers-new-ceo-speaks-coldplay/", "id_key": "d3f7a3d68290b9dbdb1589a17aaa7ffa9ee5660e112a0072791b492ea020b221", "summary": "The viral kiss-cam moment could be the best thing that’s ever happened to Astronomer. But its new CEO won’t say that.", "ingested_utc": "2025-08-22T15:34:52Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:53Z", "source": "Engadget_All", "title": "Ooni's Labor Day sale includes 30 percent off the Volt 12 pizza oven", "url": "https://www.engadget.com/deals/oonis-labor-day-sale-includes-30-percent-off-the-volt-12-pizza-oven-150908932.html?src=rss", "id_key": "df00d61db0b6464dee807dfaa93c63a88c511d52c089dd6349019f5e44914f3b", "summary": "Ooni is currently running a nice little Labor Day sale , which includes discounts on a number of pizza ovens and related products. The highlight here is likely the Volt 12 indoor pizza oven , which has been slashed by 30 percent. That brings the price down to $629. The Volt 12 is an electric pizza oven that operates indoors, a first for the company. We praised the unit in our official review , saying that it \"works just as well\" as the company's indoor models. It preheats quickly and the interior is spacious. It can hit 850 degrees, which cooks a pizza in 90 seconds. The oven also requires little-to-no supervision during use. It's pretty much a set it and forget it type appliance. This operates in stark contrast with the company's outdoor models, which demands that folks pay attention to the fire during use. The Volt 12 made our list of the best pizza ovens , and it's absolutely the finest indoor model available right now. The only major downside is the price. It's tough to recommend any indoor kitchen doodad at $900, but it's easier to do so at $629. This isn't the only interesting item on sale right now at Ooni. The company's selling the Koda 2 Max outdoor pizza oven for $1,039 , which is a discount of $270. This extra-large gas-powered oven can handle multiple pizzas at once. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/oonis-labor-day-sale-includes-30-percent-off-the-volt-12-pizza-oven-150908932.html?src=rss", "ingested_utc": "2025-08-22T15:34:53Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:53Z", "source": "Engadget_All", "title": "Sonos headphones and speakers are up to 25 percent off for the back-to-school season", "url": "https://www.engadget.com/deals/sonos-headphones-and-speakers-are-up-to-25-percent-off-for-the-back-to-school-season-125211683.html?src=rss", "id_key": "40df49349564041a404a6e370e5168c74186bc44fd88931c5b32a62ae1f3e414", "summary": "No matter how old you get, the back-to-school season will always bring a desire to shop. So, sales at this time of year are always more than welcome — especially when they're on some of our favorite devices. Such is the case with the 10 percent discount currently available on the Sonos Era 100 . Our choice for midrange smart speaker is down to $179 from $199 as part of a larger sale on the Sonos website . The same price is available on Amazon , as are some more deals on Sonos products . Sonos debuted the Era 100 speaker in 2023 as a replacement for the Sonos One. It offers great sound quality and has built-in mics for Trueplay tuning and voice control. It's worth mentioning that the Sonos Ace headphones are also on sale for $299, down from $399 — a 25 percent discount. The headphones have come a long way since they first launched, including the introduction of TrueCinema, which works with a Sonos soundbar to create the best spatial audio experience. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/sonos-headphones-and-speakers-are-up-to-25-percent-off-for-the-back-to-school-season-125211683.html?src=rss", "ingested_utc": "2025-08-22T15:34:53Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:34:53Z", "source": "Engadget_All", "title": "Netflix's Splinter Cell: Deathwatch animated series arrives on October 14", "url": "https://www.engadget.com/entertainment/streaming/netflixs-splinter-cell-deathwatch-animated-series-arrives-on-october-14-145632934.html?src=rss", "id_key": "ac8db017576db35f44affe1717440230f6a9329e3fb49c42ddceabff472e6c5a", "summary": "Ubisoft still isn’t giving us a new Splinter Cell game, but Sam Fisher fans are at least getting an animated TV adaptation very soon. At this week’s Anime NYC convention, Netflix revealed a new teaser trailer for the upcoming Splinter Cell: Deathwatch and confirmed that the series will come to the service on October 14. Written by John Wick creator Derek Kolstad and starring Liev Schreiber as an older — but still decidedly badass — Sam Fisher, Splinter Cell: Deathwatch was first announced back in 2020, but we hadn’t learned much more until now. In the brief trailer, we see the National Security Agency’s most reliable stealth operative doing a fair bit of his trademark sneaking around in the shadows, after returning to the field for what he calls a \"personal\" mission. I also quite like how liberally the iconic Splinter Cell night vision goggles sound is used in the trailer. The voice cast also includes The Sandman ’s Kirby Howell-Baptise as Zinnia McKenna, an original character, and Janet Garvey as Anna Grimsdottir, a fellow agent who provided tech support to Fisher in the Splinter Cell games. The trailer itself doesn’t give much away about the plot, but we do see the grave of Douglas Shetland, a close friend of Fisher who he was ordered to eliminate in fan favorite game entry, Splinter Cell: Chaos Theory . Ubisoft is doing some interesting things in the adult animation space. The completely bonkers Captain Laserhawk: A Blood Dragon Remix reimagined Rayman as a foul-mouthed TV host and is littered with deep cut Ubisoft references. And somewhat inevitably, an animated Assassin’s Creed show is also currently in development, though we don’t have a date for that one yet. This article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/netflixs-splinter-cell-deathwatch-animated-series-arrives-on-october-14-145632934.html?src=rss", "ingested_utc": "2025-08-22T15:34:53Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:35:02Z", "source": "TheStreet_Top", "title": "Powell drops hints about Fed interest rate cuts; stocks surge", "url": "https://www.thestreet.com/fed/powell-drops-hints-about-fed-interest-rate-cuts", "id_key": "28fb80d54420738b80b46d7307d4cbc3e8e8b8c5346cea209e24d07da703a0dd", "summary": "With tariff inflation rising and job growth nearly stalling, the Federal Reserve chair gives his final Jackson Hole remarks.", "ingested_utc": "2025-08-22T15:35:02Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:35:09Z", "source": "FinancialPost_Business", "title": "Brompton Wellington Square AAA CLO ETF Declares Distributions", "url": "https://financialpost.com/globe-newswire/brompton-wellington-square-aaa-clo-etf-declares-distributions-2", "id_key": "b8ccc728fda5911b2762bc94710b1f089b2b428f4a653d09fe08632988556ede", "summary": "TORONTO, Aug. 22, 2025 (GLOBE NEWSWIRE) — (TSX: BAAA, BAAA.U) Brompton Wellington Square AAA CLO ETF announces distributions payable on September 15, 2025 to unitholders of record at the close of business on August 29, 2025 as follows: Ticker Amount Per Unit BAAA Cdn$0.0910 BAAA.U US$0.0915 About Brompton FundsFounded in […]", "ingested_utc": "2025-08-22T15:35:09Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:35:09Z", "source": "FinancialPost_Business", "title": "Canada to Drop Many Retaliatory Tariffs in Olive Branch to Trump", "url": "https://financialpost.com/pmn/business-pmn/canada-to-drop-many-retaliatory-tariffs-in-olive-branch-to-trump", "id_key": "f1918711f3761417f5573c874c1db6fa7b382a9d282f543cab28a0a4155dd45b", "summary": "Canada will remove its retaliatory tariffs on a long list of US products that comply with the existing North American trade deal, seeking to lower tensions with the White House.", "ingested_utc": "2025-08-22T15:35:09Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:35:09Z", "source": "FinancialPost_Business", "title": "Harvest ETFs extends success of category-leading Harvest Diversified High Income Shares ETF (TSX: HHIS) with Launch of Harvest Canadian High Income Shares ETF (TSX:HHIC)", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/harvest-etfs-extends-success-of-category-leading-harvest-diversified-high-income-shares-etf-tsx-hhis-with-launch-of-harvest-canadian-high-income-shares-etf-tsxhhic", "id_key": "ba4c3f46bbd6e73eeab0758fac8f2410d323aeba890ecc7ac099ab6c427114ce", "summary": "OAKVILLE, Ontario — Harvest Portfolios Group Inc. (“Harvest” “Harvest ETFs”) is pleased to announce the expansion of its High Income Shares™ suite with the launch of Harvest Canadian High Income Shares ETF (TSX: HHIC), and 10 new Canadian single-stock High Income Shares ETFs. This new offering brings the same winning formula—modest leverage, active covered […]", "ingested_utc": "2025-08-22T15:35:09Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T15:35:09Z", "source": "FinancialPost_Business", "title": "Mount Logan Capital Inc. Announces Adjournment of its Special Meeting of Shareholders to August 29, 2025", "url": "https://financialpost.com/globe-newswire/mount-logan-capital-inc-announces-adjournment-of-its-special-meeting-of-shareholders-to-august-29-2025", "id_key": "b55aeda04efc3add86d56362a96f0bb38f10fdc29e02e2649448c10cb11e7d3a", "summary": "TORONTO, Aug. 22, 2025 (GLOBE NEWSWIRE) — Mount Logan Capital Inc. (Cboe Canada: MLC) (“Mount Logan” or the “Company”) announced today that, at the special meeting of shareholders of the Company convened on Friday, August 22, 2025 at 10:00 a.m. (Eastern Time) via live audio webcast (the “Meeting”) and called for the purpose of considering […]", "ingested_utc": "2025-08-22T15:35:09Z"}
