{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:31:57Z", "source": "BBC_World", "title": "Zelensky leaves White House unscathed as he buys more time", "url": "https://www.bbc.com/news/articles/c80djre5m5vo?at_medium=RSS&at_campaign=rss", "id_key": "32b7a5a6a8b0212ca62759e4dcb70c21bb1404f636b4630c74047b6b9089f4be", "summary": "Unlike February's row, Trump and Zelensky struck a more diplomatic tone despite their remaining differences.", "ingested_utc": "2025-08-19T07:31:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:31:57Z", "source": "BBC_World", "title": "Japan chain stops rice ball sales after staff fake expiry dates", "url": "https://www.bbc.com/news/articles/c7vlj3njzlpo?at_medium=RSS&at_campaign=rss", "id_key": "9511525b8370500c8304c8d87a4e472f7cff8e081729828d3a9a5edae57998e6", "summary": "Ministop has apologised for 'significant inconvenience' as it suspended deli sales in 1,600 outlets.", "ingested_utc": "2025-08-19T07:31:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:32:00Z", "source": "Guardian_World", "title": "Intel secures $2bn lifeline from Japan’s SoftBank", "url": "https://www.theguardian.com/technology/2025/aug/19/intel-japan-softbank-us-government", "id_key": "c104689ed717567b216e3cc78d5446c2cc64ca2267c94336eb2d7eb3f910b253", "summary": "Shares in chip maker rise amid reports US government is also considering taking a stake Business live – latest updates SoftBank has agreed to invest $2bn (£1.5bn) in Intel, amid reports that Donald Trump’s administration is also considering a stake in the struggling US chip maker. The Japanese technology investor announced the multibillion-dollar deal on Tuesday, in a move expected to give it a 2% stake in the business. Continue reading...", "ingested_utc": "2025-08-19T07:32:00Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:16Z", "source": "NYTimes_World", "title": "Vietnamese Are Helping Cuba With 38-Cent Donations. A Lot of Them.", "url": "https://www.nytimes.com/2025/08/19/world/asia/vietnam-cuba-fundraising.html", "id_key": "e1dc46ba1a6c2736a72d0daec1f80df42cd14c51f23bd8f5ac404fd06ce568b1", "summary": "Cuba sent doctors and food to Vietnam during the war. Now ordinary Vietnamese are sending cash to struggling Cubans.", "ingested_utc": "2025-08-19T07:34:16Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:23Z", "source": "NPR_Top", "title": "A record number of aid workers were killed in global hotspots in 2024, the U.N. says", "url": "https://www.npr.org/2025/08/19/nx-s1-5506773/record-aid-workers-killed-2024-un", "id_key": "cc6f37bfd1ebc07a0769b46ecd425e4fbe7e5cc58b19c88567e9705392e42f47", "summary": "The Aid Worker Security Database, which has compiled reports since 1997, said the number of killings rose from 293 in 2023 to 383 in 2024, including over 180 in Gaza.", "ingested_utc": "2025-08-19T07:34:23Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:24Z", "source": "NPR_Business", "title": "Newsmax pays $67 million to settle defamation case linked to 2020 election coverage", "url": "https://www.npr.org/2025/08/18/nx-s1-5506062/newsmax-pays-67-million-to-settle-defamation-case-linked-to-2020-election-coverage", "id_key": "7a3565888748bdd8452775758c0b71110e4454ccfcf66463b66d1c18a90c32aa", "summary": "The right-wing news channel Newsmax has agreed to pay $67 million to Dominion Voting Systems over its coverage of the 2020 presidential election. A trial had been scheduled for October.", "ingested_utc": "2025-08-19T07:34:24Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:26Z", "source": "NPR_Technology", "title": "Class-action suit claims Otter AI secretly records private work conversations", "url": "https://www.npr.org/2025/08/15/g-s1-83087/otter-ai-transcription-class-action-lawsuit", "id_key": "2dfc3540fe37f30f0b74423b76a1491f100f9c4483dd80e49efefe486f81c239", "summary": "The suit claims the popular service may be recording and processing millions of users' private conversations without consent.", "ingested_utc": "2025-08-19T07:34:26Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:27Z", "source": "FT_Home", "title": "Ukraine offers Trump $100bn weapons deal to win security guarantees", "url": "https://www.ft.com/content/8dad9c67-59da-4f38-b43a-3d6ba5f1df57", "id_key": "c72944675ece840d97e9280a95bb48afdf8f946256dade2a33ce4b3ff9840ae7", "summary": "Document seen by FT lays out Kyiv’s proposals to US president at crucial White House meeting", "ingested_utc": "2025-08-19T07:34:27Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:47Z", "source": "Engadget_All", "title": "The best gaming handhelds for 2025", "url": "https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss", "id_key": "68cc05f52fd17ae3e569a9ca4c8e02a31e3a96781b0c692885bff0963d036fb5", "summary": "Handheld gaming systems are having a moment. While people have been gaming on the go since the halcyon days of the Game Boy, recent years have brought an avalanche of devices that let you play all sorts of games anywhere you want. But new machines seem to arrive every week, and figuring out which ones are actually worth buying can be overwhelming. Depending on your tastes, the right handheld could be a $70 emulator or an $800 portable PC. To help you narrow things down, we’ve spent months researching the best handheld gaming consoles and testing several top contenders. Here are the ones we like the most right now. Editor’s note (8/19/25) : This is a somewhat awkward time to buy a gaming handheld, as new machines based on AMD’s Ryzen Z2 Extreme chip are on the way, including two new Xbox handhelds developed by Microsoft and ASUS. Those Xbox devices will bring an overhauled Windows UI that could address many of our longstanding issues with the OS. Beyond that, the Trump administration’s tariff policy and proposed repeal of the “ de minimis ” exemption continues to loom over the handheld market, potentially hiking the prices of retro handhelds built by Chinese companies in particular (among many other goods). Nevertheless, we’ve updated this guide with a new pick and stand by our current recommendations for those looking to buy a new gaming handheld today. Table of contents Best handheld gaming devices for 2025 What about the Nintendo Switch 2? Other gaming handhelds we've tested What to know about the gaming handheld market Best handheld gaming devices for 2025 What about the Nintendo Switch 2? Sam Rutherford for Engadget Read our full Nintendo Switch 2 review The new Nintendo Switch 2 is already more popular than any of the handhelds above, but we haven’t made it a formal pick in this guide since it exists in its own world. As one of the newest devices from the big three console manufacturers, most people aren’t choosing between it and the handheld PCs or emulation devices above. The main reason to buy a Switch 2 is to play new Nintendo games, and no other device can (legally) offer that. Likewise, the Switch 2 doesn’t even try to offer the flexibility of a Steam Deck, ROG Ally X or even the Retroid Pocket 5. That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7.9-inch display, magnetic Joy-Con controllers and more storage. It’s a wholly more polished take on the Switch 1’s ideas. Does that make it a must-buy right now? Unless you’re worried about a tariff-induced price hike — which may not be the most outlandish fear — not really. Donkey Kong Bananza is a joy, Mario Kart World is fun enough and playing Cyberpunk 2077 on a Nintendo console is kind of surreal, but the list of true must-plays that are exclusive to the Switch 2 is still very limited. That’s OK — it’s only been two months. But don’t feel the need to rush out and splash the cash today unless you have a serious case of Donkey Kong -induced FOMO. Other gaming handhelds we've tested The MSI Claw 8 AI+. Sam Rutherford for Engadget Note: This is a selection of noteworthy gaming handhelds we’ve tested, not a comprehensive list of everything we've ever tried. MSI Claw 8 AI+ The original MSI Claw was a flop , but the newer Claw 8 AI+ is much more appealing if you’re willing to pay for a larger and slightly more powerful alternative to the ASUS ROG Ally X. With its Intel Core Ultra 7-258V chip and 32GB of RAM, it typically pumped out 10 to 15 percent higher frame rates than other high-end models like the Ally X and Lenovo Legion Go in our testing. Battery life is relatively strong, while its 8-inch 120Hz IPS display is plenty bright and supports VRR. There are smooth Hall effect thumbsticks and triggers, two Thunderbolt 4 ports and a built-in fingerprint sensor beyond that. The Claw’s main issue is its price: At $1,000 after a recent price hike, it’s hard to justify over the ROG Ally X, which is already too expensive for most people. ASUS' handheld is smaller, lighter and generally more portable on top of that— though the Claw is thinner — and its Armoury Crate software, while far from perfect, is still a bit more polished than MSI’s Center M hub. There's also a smaller 7-inch version of this handheld for $900, but we haven’t tested that one. The Lenovo Legion Go. Photo by Sam Rutherford/Engadget Lenovo Legion Go The Lenovo Legion Go is another capable alternative to the ASUS ROG Ally X with an even larger display. It runs on the same Ryzen Z1 Extreme chip and offers a similar set of performance modes, but it has a mondo-sized 8.8-inch panel with a sharper 2,560 x 1,600 resolution and a higher 144Hz refresh rate. It also borrows some ideas from the Switch, including detachable controllers and a built-in kickstand for playing games in a tabletop mode. Those controllers have touchpads to make navigating Windows a little easier, something the ROG Ally X lacks. But it’s still a Windows handheld, and Lenovo’s software tweaks aren’t as intuitive as what ASUS has done with Armoury Crate, so the UX can feel half-baked by comparison. The jumbo design is bulkier and heavier than the ROG Ally X, so some will find it too fatiguing to hold. Its fans are louder as well, plus the display lacks VRR. Lenovo teased a Legion Go 2 at CES earlier this year, which looks promising and should arrive in the coming months. The Lenovo Legion Go S. Sam Rutherford for Engadget Lenovo Legion Go S (Windows, Z2 Go chip) The Windows 11 version of the Lenovo Legion Go S has the same relatively comfortable design and commendable 8-inch 120Hz display as the SteamOS model we highlight above. With the Z2 Go model we tested, though, its performance lags too far behind the ROG Ally X, Claw 8 AI+ and original Legion Go for something priced at $730. Windows is still clunky, too. The Ayaneo Flip DS. Photo by Jeff Dunn / Engadget Ayaneo Flip DS The Ayaneo Flip DS is a cool concept: a powerful Windows machine with a clamshell design and dual displays, sort of like a supercharged Nintendo DS. It feels sturdy, it performs roughly on par with the other Ryzen 7 7840U (or 8840U) handhelds in this guide, and its 7-inch top display is sharp, fast and bright. The second screen makes it a natural fit for emulating Wii U or 3DS games, but you could also, say, look up a guide or play a YouTube video without having to close whatever you’re playing. Unfortunately, this is more of a neat idea than a fully thought-out product. The folding design means that the joysticks have to be short and recessed, while the face buttons and d-pad are uncomfortably flat. The whole thing is overly thick and heavy, plus it runs very hot. Battery life tops out around two hours, and actually managing two displays on a Windows handheld is about as clunky as you'd expect. With prices now starting above $1,000, the Flip DS is hard to recommend unless you’re (oddly) desperate for a handheld Wii U emulator. We're always happy to see more weird hardware, though. The Ayaneo Kun. Photo by James Trew / Engadget Ayaneo Kun The Ayaneo Kun is among the most decadent Windows handhelds we’ve tested. With a sharp 8.4-inch display, a Ryzen 7 8840U chip, up to 64GB of RAM, up to 4TB of storage, a sizable 75Whr battery and a 54W max TDP, it’s both a capable gaming device and a feasible replacement for a desktop PC. But it now starts at a pricey $999, it’s huge and it suffers from the usual Windows-related issues. It also lacks VRR. It’s still a fine device if money is truly no object, but it’s more handheld than most need. The ROG Ally X is a much better value. This is technically an older model for Ayaneo, too, as the company seems to launch a new handheld every other hour these days. Ayaneo 2S The Ayaneo 2S is another high-power Windows handheld with a sharper display and higher configuration options than the ROG Ally X. It also uses the same chip as the Kun above. But it’s limited to a 60Hz refresh rate and costs a few hundred dollars extra. Ayaneo announced a decked-out successor called the Ayaneo 3 toward the end of 2024; we'll try to test that one out in the future. The Retroid Pocket Mini (bottom) and Retroid Pocket 5. Jeff Dunn for Engadget Retroid Pocket Mini The Retroid Pocket Mini is essentially a smaller version of the Retroid Pocket 5. It runs on the same Snapdragon 865 chip and feels just as sturdy, but it has a smaller 3.92-inch display with a 4:3 aspect ratio. This makes it a more natural fit for older retro consoles, as you won’t get the black boxes you’d see on a 16:9 display like the one on the Pocket 5. If you mainly want to emulate systems like the SNES, Sega Genesis or Game Boy Color and don’t mind paying extra for a rich OLED display, it’s a good little device. But the tiny screen is limiting if you ever want to play newer games, and we wish there wasn't so much empty space around the display. This device had also generated some controversy within the retro gaming community for having persistent issues with inaccurate shaders (and for the slapdash way Retroid handled the matter). The company replaced the original model with a \"V2\" iteration that addresses those concerns, however. Retroid Pocket 4 Pro and Retroid Pocket 4 The 4.7-inch Retroid Pocket 4 Pro is the predecessor to the Pocket 5. Its performance isn’t significantly far off the newer model, so it remains a nice value if you’re determined to spend less than $200 on an emulation device. It misses out on the larger OLED display and more ergonomically-friendly design of its follow-up, however. The base Pocket 4 may also be worth a look if you want to stay under $150, but its weaker chip makes it less adept at emulating games from the PS2, GameCube and up. The Anbernic RG35XX Plus. Photo by Jeff Dunn / Engadget Miyoo Mini Plus The Miyoo Mini Plus is a highly affordable handheld with a well-built, Game Boy-style form factor that fits nicely with older games. Its 3.5-inch display really pops for something in the $60 to $80 range, its battery lasts as long as it needs to and it can emulate consoles up to the original PlayStation without much issue. Its Linux-based software is extensively customizable , though it requires some tinkering to get it working optimally. Like many cheapo handhelds, it also lacks fast charging. Still, of the many Game Boy-like emulation devices floating around the budget end of the market, it’s the one we’d recommend first. Since it’s from a smaller Chinese firm and isn’t available at major retailers, however, it can be difficult to actually buy. Anbernic RG35XX Plus The Anbernic RG35XX Plus is another wallet-friendly vertical handheld — or at least, it was before Anbernic paused shipments to the US. For about the same price as the Miyoo Mini Plus, it offers a faster chipset, more RAM and a bigger battery alongside a similarly impressive design. Its stock OS is overly sloppy and cheap-looking, however, and while the stronger processor is nice, the small screen and lack of analog sticks means you won’t want to emulate much beyond the PS1 anyway. The Anbernic RG35XXSP. Jeff Dunn for Engadget Anbernic RG35XXSP The Anbernic RG35XXSP is a variant of the RG35XX Plus based on the same internals, only it apes the clamshell form factor of the old Game Boy Advance SP . That’s a great design to rip off if you must pick one, and the hardware doesn’t feel nearly as cheap as its (pre-tariff) price tag of $60 or so would suggest. But the software issues noted above still apply (both here and with the many other devices in the same RGXX family). We’ve also seen several user reports of quality control issues with the RG35XXSP’s battery, which is automatically disqualifying. Anbernic RG405M The Anbernic RG405M is another 4:3 handheld with a 4-inch display and a pleasing metal frame. It's an OK alternative to the Retroid Pocket Mini if you want a little more screen space for less cash, but it’s slower, and it lacks the Mini’s OLED display. We find the Retroid’s grooved back to be comfier to hold over time as well. And again, Anbernic has paused handheld shipments to America as of this writing. The PlayStation Portal. Photo by Devindra Hardawar/Engadget PlayStation Portal The PlayStation Portal is an odd accessory that’s designed to stream games from a PlayStation 5. It lacks built-in apps, so it doesn’t support traditional emulation. Because it’s entirely dependent on the quality of your home Wi-Fi, we can’t guarantee how well it’ll actually perform. It doesn’t work with Bluetooth earbuds either. The 8-inch display is fine and the DualSense-style controls are great, so PlayStation diehards who want a second screen for local PS5 streaming may see the appeal. Sony recently added the ability to stream a selection of games via the cloud , which is a step in the right direction, but you need an expensive PlayStation Plus Premium subscription to take advantage. In general, there’s little here that you can’t do with a smartphone and mobile game controller , so most people are better off saving their $200. Logitech G Cloud The Logitech G Cloud would’ve been a great Android pick when it launched if it cost about $150 less. Its 7-inch 1080p display is bright, vibrant and generally more pleasing to look at than the panel on the AYN Odin 2, its battery lasts a good 10 to 12 hours per charge and its design is comfy to hold for hours at a time. Alas, the G Cloud still tends to cost between $260 and $300, which is just too much when the Retroid Pocket 5 offers more power at a lower price. What to know about the gaming handheld market Jeff Dunn / Engadget You can break down the gaming handheld market into three broad tiers. At the top, you have x86-based portable gaming PCs like the Steam Deck or ASUS ROG Ally X . These are the most powerful handhelds you can buy, as they seek to replicate the experience of a moderately specced gaming desktop. The Steam Deck runs on the Linux operating system, but most others use Windows. If you want to play modern, recently released PC games on the go (and need something stronger than a Switch), this is the type of device you’d get. They can also emulate the widest range of retro consoles. They’re typically the largest and most cumbersome devices to hold, however, and their battery life can be short. Naturally, they’re also the most expensive, costing anywhere from $400 to more than $1,000. Further down on the price spectrum are \"mobile handhelds\" like the Logitech G Cloud or Retroid Pocket . These devices often run Android or Linux and can range from under $50 to $400-ish (before tariffs). They aren’t equipped to play modern console or PC titles, but they’re usually more compact than a portable PC, and you can still use them for mobile games and cloud streaming. While most are marketed toward those ends, many gamers actually buy them to emulate classic games through software like RetroArch . Getting emulators to work can be complicated , and accessing the BIOS and ROM files required to play games this way is legally murky . One lawsuit from Nintendo led to the shutdown of the most prominent Switch and 3DS emulators , for instance. (Engadget does not condone piracy.) Backing up files of games you already own for personal use only is considered more defensible, though, so for that a mobile handheld can be a more user- and wallet-friendly way to play the classics — provided you don’t want to just use your phone . We’ll call the last tier “handhelds that do their own thing.” This is a catch-all for things like the Switch 2 or Playdate : portable devices that run heavily customized software and aim to provide a unique gaming experience. They aren’t necessarily ideal for emulation or playing the latest multiplatform titles; instead, they often have distinct game libraries. They might not have the widest appeal as a result (Switch excluded), but they’re often easier for less tech-literate folks to just pick up and use. Recent updates August 2025 : We’ve added the SteamOS version of the Lenovo Legion Go S as a new recommendation and updated our top Windows pick to reflect the upcoming release of ASUS’ and Microsoft’s ROG Xbox Ally devices , which will feature an overhauled Windows UI. We’ve also added a note on the recently released Nintendo Switch 2. We’ll include testing notes on the Retroid Pocket Classic , TrimUI Brick and ModRetro Chromatic in the near future. (Note: Yours truly went on paternity leave after our last update — apologies for the delay!) May 2025 : We’ve tested the Retroid Pocket Flip 2 and recommended it as an alternative to the Retroid Pocket 5. We’re also watching out for the first third-party devices that run SteamOS, starting with the new Lenovo Legion Go S , and the next ASUS ROG Ally device, which seems to be arriving soon based on recent leaks . March 2025 : We’ve edited this guide for clarity and added testing notes for the MSI Claw 8 AI+ and Lenovo Legion Go S (Windows version). Our main picks are unchanged. Looking ahead, we’re keeping an eye on upcoming Windows handhelds from Acer and Ayaneo , a pair of new emulation devices from Retroid, the first third-party devices to ship with SteamOS and more machines that run on AMD’s Ryzen Z2 chips , among others. January 2025 : We have a new top pick among emulation-focused handhelds: the Retroid Pocket 5. Beyond that, we’ve added notes on a few other devices we’ve tested, including the Retroid Pocket Mini and Anbernic RG35XXSP; lightly edited other blurbs to reflect changes in the market; and removed a couple write-ups for products that’ve been discontinued. We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo . August 2024 : We’ve replaced the ASUS ROG Ally, our prior pick for the best Windows gaming handheld, with the new and improved ROG Ally X. We’ve also checked to make sure all availability and pricing details noted throughout the guide are accurate. June 2024 : We’ve updated this guide to ensure all of our recommendations are up to date, adding a note on ASUS’ upcoming ROG Ally X in the process. We’ve also included details on two new handhelds we’ve tested since our previous update: the MSI Claw and Ayaneo Flip DS . Staying on top of this market is a tall task, but we’re currently looking at recent noteworthy releases like the PSP-esque AYN Odin 2 Mini and the GBA-style Anbernic RG35XXSP as well. This article originally appeared on Engadget at https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss", "ingested_utc": "2025-08-19T07:34:47Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:55Z", "source": "TheStreet_Top", "title": "Jean Chatzky dials wake-up call on Social Security, Medicare, IRAs", "url": "https://www.thestreet.com/retirement/jean-chatzky-dials-wake-up-call-on-social-security-medicare-ira-401k", "id_key": "f416447a15da905530ce8429058a99296547161807bc106b55022666abb4bd49", "summary": "The AARP personal finance ambassador warns Americans about retirement savings.", "ingested_utc": "2025-08-19T07:34:55Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T07:34:56Z", "source": "AlJazeera_All", "title": "Wildfires rage across Spain and Portugal as record area of land burned", "url": "https://www.aljazeera.com/gallery/2025/8/19/wildfires-rage-across-spain-and-portugal-as-record-area-of-land-burnt?traffic_source=rss", "id_key": "6cd83c4467d68e69cdb8b4638df384f91f9bc126cc50c176834101056c006f51", "summary": "Wildfires in Spain and Portugal burn record land and force evacuations as heatwave and drought spur the flames.", "ingested_utc": "2025-08-19T07:34:56Z"}
