{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T17:34:54Z", "source": "Guardian_World", "title": "Ukrainian mood hardens as MPs insist country should not be forced to surrender", "url": "https://www.theguardian.com/world/2025/aug/17/ukrainian-politicians-condemn-idea-of-ceding-territory-to-russia", "id_key": "fe451cd240860e68e76705e165d87c7bc77fab1bc58b8447b5847036cd87fbaa", "summary": "Ridicule of Trump-Putin summit turns to frustration at suggestion Ukraine could give up unoccupied land for peace A string of Ukrainian politicians and public figures condemned the idea of handing over unoccupied land to Russia for peace on Sunday, arguing that their country had not been defeated and should not be forced into a surrender. The hardening of the mood came at the end of a weekend where there was first ridicule and disgust in Ukraine at the red-carpet treatment of Vladimir Putin by Donald Trump at their summit in Alaska, followed by frustration as it appeared that Trump was siding with the Russian leader. Continue reading...", "ingested_utc": "2025-08-17T17:34:54Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T17:34:54Z", "source": "Guardian_World", "title": "Scottish ministers face legal action over policies ‘inconsistent’ with UK gender ruling", "url": "https://www.theguardian.com/uk-news/2025/aug/17/scotland-government-legal-action-uk-supreme-court-gender-ruling", "id_key": "f7b187858487beeecb567132eb45b6774915ba8e6c79f44cf259ad0d0b0e429b", "summary": "Campaign group that won supreme court case brings challenge over transgender guidance in schools and prisons A campaign group that won a legal victory on the definition of gender is taking action against the Scottish government over policies it says are “inconsistent” with the ruling. For Women Scotland’s legal battle with Scottish ministers over the definition of a woman ended in the UK’s supreme court, which ruled in April that the words “woman” and “sex” in the Equality Act 2010 referred to a biological woman and biological sex. Continue reading...", "ingested_utc": "2025-08-17T17:34:54Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T17:34:54Z", "source": "Guardian_World", "title": "Jack Straw urges Labour not to panic about threat of Nigel Farage", "url": "https://www.theguardian.com/politics/2025/aug/17/jack-straw-urges-labour-not-panic-threat-nigel-farage-reform", "id_key": "a67293f3e81cbb9b169e36276d9ce820f09078e0ec7b472c51daab532dcbe21f", "summary": "Former home secretary praises Keir Starmer’s success on world stage and says PM can win over sceptical UK public Keir Starmer and his ministers must not “panic” about the threat of Nigel Farage, the former home secretary Jack Straw has said, adding that the prime minister had impressed on the world stage and should show more of that side of himself at home. In an interview with the Guardian, he praised Starmer’s intention to recognise a Palestinian state after an ultimatum to Israel – but defended the home secretary, Yvette Cooper, saying he would also have proscribed the direct action group Palestine Action. Continue reading...", "ingested_utc": "2025-08-17T17:34:54Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T17:35:16Z", "source": "CryptoSlate", "title": "100 days over $100k and nobody cares: Why Bitcoin’s bull run feels lonely", "url": "https://cryptoslate.com/100-days-over-100k-and-nobody-cares-why-bitcoins-bull-run-feels-lonely/", "id_key": "db596fdf3840294a650201a38caa94d4be0595d0c2d291aa4671c229726eb6fe", "summary": "The latest Bitcoin bull run feels different. Scratch that. Every bitcoin bull run feels different, as each cycle brings with it fresh narratives and new blood. But there’s one element that’s always been consistent throughout Bitcoin’s history, and that’s retail interest in buying into freedom tech and f**k you money. Well, Bitcoin to the moon […] The post 100 days over $100k and nobody cares: Why Bitcoin’s bull run feels lonely appeared first on CryptoSlate .", "ingested_utc": "2025-08-17T17:35:16Z"}
