{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "UK gender pay gap underestimated for two decades, report says", "url": "https://www.theguardian.com/world/2025/aug/25/uk-gender-pay-gap-underestimated-for-two-decades-report-says", "id_key": "fae1da7387ca3582b1ace10048a07cdecc7aad1b3027193560e092bb45cda1aa", "summary": "Findings suggest since 2004 ONS failed to properly account for fact it received more data from larger employers The UK’s gender pay gap has been underestimated for more than 20 years, according to research that could raise fresh questions about the quality of data used to inform key pay decisions across the UK. The findings, released in the British Journal of Industrial Relations on Monday, suggest that, since 2004, the Office for National Statistics (ONS) had failed to properly account for the fact that it received more data from larger employers, when it reported its annual survey of hours and earnings (Ashe). Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Mounjaro users in UK warned against bulk buying before autumn price rise", "url": "https://www.theguardian.com/uk-news/2025/aug/25/mounjaro-users-in-uk-warned-against-bulk-buying-before-autumn-price-rise", "id_key": "e84098f9a4e6c5359813d8187fe663c98012b7ca173e8f123d5a33f05485159a", "summary": "Cost may increase as much as 170% from September, but patients warned against a quick switch to Wegovy ‘Gutted’: UK users of weight loss jab Mounjaro devastated by planned price hike People using the weight loss jab Mounjaro have been warned against switching to black market sellers or bulk buying after its manufacturer announced the UK will get a significant price rise this autumn. The US pharmaceutical company Eli Lilly, which makes Mounjaro, recently announced plans to increase the price of the medication in the UK by as much as 170% from September. The move follows pressure from the US president, Donald Trump, to cut medication prices for Americans. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Wes Streeting criticises ‘shortsighted’ drug firms for rejecting pricing offer", "url": "https://www.theguardian.com/politics/2025/aug/25/wes-streeting-criticises-shortsighted-drug-firms-for-rejecting-pricing-offer", "id_key": "8dace07199325d3ac6bcc70ab9e954a1d28a145a9c398efee3112f485f2a6901", "summary": "Exclusive: Health secretary says he will not let patients be ‘ripped off’ by pharmaceutical companies amid standoff What is the row between Wes Streeting and pharmaceutical companies about? Wes Streeting has intensified his battle with drug companies over the price of their products, saying he will not let the industry rip off British patients or taxpayers by signing up to their demands. The health secretary on Sunday accused pharmaceutical companies of being “shortsighted” and undermining their relationships with the government after the two sides failed to come to an agreement last week . Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Japan has opened its first osmotic power plant – so what is it and how does it work?", "url": "https://www.theguardian.com/world/2025/aug/25/japan-osmotic-power-plant-fukuoka", "id_key": "cb858f48e0e12492dd47fcb465349d67f860ce3406d0b211a38e7d71c6f2b436", "summary": "The site in Fukuoka is only the second power plant of its type in the world, harnessing the power of osmosis to run a desalination plant in the city Japan has opened its first osmotic power plant, in the south-western city of Fukuoka. Only the second power plant of its type in the world, it is expected to generate about 880,000 kilowatt hours of electricity each year – enough to help power a desalination plant that supplies fresh water to the city and neighbouring areas. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "With tax speculation festering, Rachel Reeves needs to show her hand | Richard Partington", "url": "https://www.theguardian.com/business/2025/aug/24/tax-speculation-festering-rachel-reeves-show-her-hand", "id_key": "0f4a62107a58883f0d1db1632ee2aa1a8d82499b1f3145b430471b2e5f10c8e5", "summary": "The chancellor seems to be waiting for a clearer economic picture to emerge but that is not how government works The cruel summer of speculation is here. Barely a day passes without the chancellor, Rachel Reeves, waking to another newspaper headline about possible tax-raising options for her autumn budget. After the bonanza of June’s spending review, Reeves had been warned that uncertainty about the public finances would set tongues wagging. Britain’s economy has far from shot the lights out since, the global backdrop remains fairly bleak, borrowing costs are high, and inflationary pressures are building. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "The Guardian view on build-to-rent: hardly a solution to the housing crisis | Editorial", "url": "https://www.theguardian.com/commentisfree/2025/aug/24/the-guardian-view-on-build-to-rent-hardly-a-solution-to-the-housing-crisis", "id_key": "ddf90acc926fa79940f3b7226b12c04d7df00517e9fb260c34abf509e9fc6d2e", "summary": "Labour is hoping that big investors will build more homes. But there’s no guarantee they will be genuinely affordable To an outside eye, English cities might seem deliberately designed to foment a housing crisis. Unconstrained by craggy topography or fortified ramparts, their Victorian developers built endless streets of low-rise terraces. Cities that expanded during the Industrial Revolution are less dense than their European equivalents and have far fewer flats. Their private rental sectors are fragmented, dominated by small-time landlords for whom property ownership is often a second career. In recent years, large investors have begun bankrolling high-rise apartment blocks that promise to create the type of housing that English cities need. These “build-to-rent” developments are transforming the skylines of Manchester and London, and have added about 14,000 new homes each year since 2020. For a Labour government that hopes to build 1.5m homes , the sector’s growth looks like a blessing. Clive Betts, the Labour MP who chairs a build-to-rent taskforce, has described such developments as “good-quality housing with a real future”. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "The emblem of modern Ireland? Not fiddles and Guinness but a soulless shopping plaza | Emer McHugh", "url": "https://www.theguardian.com/commentisfree/2025/aug/25/the-emblem-of-modern-ireland-not-fiddles-and-guinness-but-a-soulless-shopping-plaza", "id_key": "51d1fda8b2f9f807b9f68612aafb75fa04409eb7b98a99873bf4a6032deef783", "summary": "The singer CMAT dances around a retail centre in a video for her new album. It is the elegy those of us who grew up in the post-Celtic tiger recession have been craving You wouldn’t know it to look at the tourist board ads, but the emblem of modern Ireland is probably a shopping centre. And now that emblem has found its bard, in the form of Ciara Mary-Alice Thompson, the Irish pop star and songwriter better known as CMAT. She is a woman wielding a creative energy that is completely her own, but which is also profoundly shaped by her experiences coming of age in a post-Celtic tiger, recession-era Ireland. This has never been clearer than on her new single, Euro-Country, from the forthcoming album of the same name – a project that reminds us that pop culture has the power to illuminate political and social realities that are otherwise being ignored. It is the elegy that we, Ireland’s post-recession generation, needed – and it references at least two shopping centres. The Euro-Country album artwork is a send-up of Jean-Léon Gérôme’s painting Truth Coming Out of Her Well, with CMAT emerging from the fountain in Blanchardstown shopping centre, beside a giant euro coin. In an interview with the Guardian before her spectacular Glastonbury performance in June, Thompson observed that while Ireland is “a little more fetishised and trendy than it’s ever been”, it’s also “a really hard place to live, a really hard place to grow up, unless you have money, which we didn’t. So yeah, magical, beautiful, mystical Ireland: it’s a shopping centre – that’s what I grew up with.” Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "The Guardian view on rural China: urbanites contemplate an escape to the country | Editorial", "url": "https://www.theguardian.com/commentisfree/2025/aug/24/the-guardian-view-on-rural-china-urbanites-contemplate-an-escape-to-the-country", "id_key": "f2091b351942fcbc86b93950e0497537c490b1f1a3b7cdf8a2594a4e5d3b7c0e", "summary": "Disenchantment with city life, as well as improved infrastructure nationwide, has made the villages look more attractive “People gone; buildings empty: this is the fact of daily life in the countryside,” lamented the author Liang Hong in her bestselling account China in One Village. It was a grim portrait of her home town – its vitality ebbing as the forces of modern life drained it of young people, polluted its water, exploited its resources and even turned the local school into a pigsty. Its quarter of a million sales reflected not just her distinctive writing, but the familiarity of the story. As urban China prospered with the Communist party’s turn to the market, 350 million villagers migrated to the cities, leaving behind increasingly desolate settlements. Now Beijing is promoting “rural revitalisation”. State media run a steady stream of articles lauding city dwellers who have returned to their home towns to set up cafes or run home-stays. The expansion of transport and telecommunications infrastructure has allowed rural inhabitants to expand their horizons. First came the “Taobao villages” , where at least a 10th of households were using Alibaba’s e-commerce platform. More recently, farmers have taken to livestreaming – selling fruit or flowers direct to urbanites. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Is behaviour at work getting worse – or are we just becoming oversensitive snowflakes? | Emma Beddington", "url": "https://www.theguardian.com/society/commentisfree/2025/aug/24/is-behaviour-at-work-getting-worse-or-are-we-just-becoming-oversensitive-snowflakes", "id_key": "7f54d43532b78d0188beb0e79bc46566db773249f071fa666e4c14ecca0ccdb1", "summary": "Judging by the minor complaints being put to employment tribunals, workplace etiquette appears to be breaking down. But the headlines rarely tell the full story I would hate to be in human resources at the moment. Admittedly, as someone with no discernible people skills, I would always hate it, but I’ve been imagining the awkward HR meetings behind the scenes of the recent wave of “what is acceptable workplace behaviour” rulings from UK employment tribunals recently, and … oof! I’m thinking, particularly, of last week’s ruling on whether younger chatty workers disturbing an older colleague constitutes age discrimination (it didn’t), but there are many more. Comparing a colleague to Darth Vader in an online personality test resulted in a £30,000 compensation award. Leaving someone out of the tea round could contribute to unfair constructive dismissal. Sighing at a colleague could be discriminatory. An air kiss wasn’t harassment and neither was telling a manager his work was messy . Allocating a senior employee a “ low-status desk ” can be seen as a demotion. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Don’t let Donald Trump undermine your faith in the climate fight | Gina McCarthy", "url": "https://www.theguardian.com/commentisfree/2025/aug/24/trump-climate-crisis-gina-mccarthy", "id_key": "507cd98b5175f9593a9c35c44b21a07b005c7bbf5a54a8e2f27cd215d90c8458", "summary": "The president’s fossil-fuel obsession can’t stop global progress, writes the former Environmental Protection Agency head Over the past decade, the United States has turned technologies into tools that strengthened our economy, delivered good-paying union jobs, cleaned up our air and water, conserved our precious natural resources, and saved families money all across our country. Yet now the country is choosing to cede that leadership, letting China dominate and control the clean-energy market across the world. It’s no surprise that people are scratching their heads, wondering what happened. Our president is obsessed with fossil fuels . He wants to resuscitate what everyone knows is a dying coal sector while turning a blind eye to the health, environmental, and economic downsides of the climate crisis . Coupled with inconsistent threats of increased tariffs against virtually all our allies, he has isolated the US and amplified threats to global security. Gina McCarthy is the managing co-chair of America Is All In, former White House national climate adviser and 13th US EPA administrator Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "‘Now I’m classed as a thief’: O2 mobile user hit by double-edged scam", "url": "https://www.theguardian.com/money/2025/aug/25/o2-mobile-user-scam-deal-contract-phone", "id_key": "735c4d07041d0ec9295452ebd37bd77d943504c6e01fa9bfe8983fd74490a937", "summary": "A man was called by fraudsters offering a deal on a new contract – but ended up being told he had to pay for a £1,072 phone The call was unexpected but it brought good news: Bruce Stanwyck* was told that the monthly payments for his O2 phone contract would be reduced from £19 to £12 if he switched to a new deal. Stanwyck, a pensioner, accepted the offer there and then. That was the start of an elaborate scam that nearly cost him his savings. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "UK mothers earn £302 a week less than fathers, analysis shows", "url": "https://www.theguardian.com/society/2025/aug/25/uk-mothers-earn-302-a-week-less-than-fathers-analysis-shows", "id_key": "320b1c7a76e28861ad29c8f4b7beec1d662cf5b7b2916b14af024209b477f702", "summary": "ONS data shows they are working for free from 1 September, almost three months earlier than Equal Pay Day for all women Women with children earn £302 less every week than men with children: one-third less per week and almost 20% less per hour, according to analysis based on ONS data. This means that Mums’ Equal Pay Day falls on 1 September this year, almost three months earlier than Equal Pay Day for all women. From this date, mothers are working for free for the rest of the year compared with fathers. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "UK faces ‘acute challenge’ from weak growth and shrinking workforce, says Andrew Bailey", "url": "https://www.theguardian.com/business/2025/aug/24/britain-acute-challenges-andrew-bailey-jackson-hole", "id_key": "8800701d3eef4c309d7cede0ef2d7a2547da9dd6ea0fdd618d89c362c3f37ac1", "summary": "Bank of England governor tells Jackson Hole summit that ageing population is adding to the squeeze Britain faces an “acute challenge” from its weak underlying economic growth and a drop in the number of workers since the pandemic, according to the Bank of England governor, Andrew Bailey. A rise in the number of people defined as long-term sick and a big drop in young people in work – factors that he suggested might be intertwined – added to the squeeze created by an ageing population. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Former Wiggles CEO sues children’s entertainment group over alleged bonus and fair work breaches", "url": "https://www.theguardian.com/australia-news/2025/aug/25/former-wiggles-ceo-luke-oneill-suing-group-federal-court-ntwnfb", "id_key": "a32a7fe0d3ab5faf629a2f4d1bdd29a12a17918f3b30f4e4e0998961927749c1", "summary": "Luke O’Neill claims blue Wiggle Anthony Field ‘undermined him’ and was responsible for ‘unnecessary costs’ and budget overruns Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The former Wiggles CEO has claimed in federal court documents that the blue Wiggle “undermined him” in front of other staff and excluded him from a meeting with Kmart to discuss selling their toys. According to documents provided by the court to Guardian Australia, the former CEO Luke O’Neill is suing Wiggles Holdings Pty Ltd, blue Wiggle Anthony Field and general counsel Matthew Salgo for not being paid a bonus relating to his work and for multiple alleged breaches of the Fair Work Act. Sign up for Guardian Australia’s Breaking News email Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "‘I’ll be Poirot’: the Orient Express is back – but what is it like to ride?", "url": "https://www.theguardian.com/travel/2025/aug/25/orient-express-luxury-train-italy-sicily-to-rome", "id_key": "499e9fec827f9c8a9761e624a287bc657c23454ceb410b6f52c5244861be86e2", "summary": "It comes at a steep price, but the remodelled luxury train from Sicily to Rome immerses passengers in the country’s culture as well as passing through stunning scenery ‘If anyone mysteriously vanishes, I can be Poirot,” said the passenger from India, twirling his moustache. It felt as though the spirit of Agatha Christie’s most famous character – best known for solving the Murder on the Orient Express – was lingering in the breeze at Palermo’s sublime botanical garden , which had been transformed into a makeshift waiting room for the 40 or so travellers about to board an Italian replica of the fabled train. Sipping espresso and sampling cannol i , the classic Sicilian pastry, the curiosity and suspicion for which Poirot is famous was palpable as the passengers subtly sized each other up. But the only mystery waiting to be unravelled over the next couple of days was whether their Rome-bound journey on La Dolce Vita Orient Express would live up to their dreamy expectations. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "‘Reinvention is the secret ingredient’: food brands harness 90s nostalgia with retro revamps", "url": "https://www.theguardian.com/business/2025/aug/25/food-brands-90s-nostalgia-walkers-nik-naks-bacardi", "id_key": "b5fb4276db524a342024abee1327f12773407a90fe9eba60ca2f7a26f272d836", "summary": "Millennial childhood staples such as Walkers and Nik Naks introduce new flavours amid pressure for brands to stay relevant Nostalgia for the 1990s might have reached its peak with Oasis back on tour this summer , but several of Britain’s best-known brands are also trying to make a comeback, reinventing themselves with new flavours, packaging or names. Walkers, Nik Naks and Bacardi Breezer are among some of the brands that are adapting to try to stand out in the food and drink market. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "The ‘closing down sale’ scam: when bargains are too good to be true", "url": "https://www.theguardian.com/money/2025/aug/24/the-closing-down-sale-scam-bargains-fake-ads-facebook-instagram-deals", "id_key": "9f872d876f9a0a388acdb2338a5c4f58438ef446b02f5db199e540485a3e4359", "summary": "Fake ads on Facebook and Instagram about stock clearance deals use a sense of urgency to draw people in After 40 years, an elderly couple have decided to retire and close their business. Or a clothes retailer says that it is with sadness he has decided to shut up shop and needs to get rid of his remaining stock. But the “sadness” of a business closing also brings an opportunity to bag a bargain – perhaps a cut-price leather jacket, or 50% off the last merino wool sweaters in the warehouse. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Sleeper hit: how Europe is revelling in the return of the night train", "url": "https://www.theguardian.com/travel/2025/aug/23/sleeper-hit-how-europe-is-revelling-in-the-return-of-the-night-train", "id_key": "91ea96306ca1a4fa3f98b25e7f26ae5b400a135ea4d8f2d7d7807c615a4660e6", "summary": "With a bucket list of journeys that would take her from Palermo to Trondheim and Istanbul, our writer rekindles her love affair with long-distance train journeys Snug, I stretched in the darkness, waking as the thump of wheels slowed to the tempo of a heartbeat. I could sense that the train was approaching our destination, so shuffled down the berth, easing up the blind to find a ruby necklace of brake lights running parallel with the tracks. It had rained overnight and the road was slick, the sky a midnight blue, a D-shaped moon fading in the corner. Dawn was minutes away, and I could just make out the jumble of houses on hills, lights flicking on as though fireflies lay between their folds. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "‘A nuisance and an eyesore’: hire ebikes accumulate at London border between rival firms", "url": "https://www.theguardian.com/uk-news/2025/aug/22/hire-ebikes-accumulate-london-border-rival-firms", "id_key": "04eaab7639793bbe9e328373d858b5b7075fb2d90ac00a6d01d46aa89fb0936c", "summary": "Chiswick Bridge now a frontline in turf war as Richmond and Hounslow councils have licensed different operators Scattered across pavements, propped against trees and toppled over in bushes, dozens of electric Lime bikes have begun to dominate a 200-metre stretch of road just south of Chiswick Bridge. This is the point where the motors on the hired bikes abruptly stop functioning as they cross the boundary between Richmond and Hounslow, a frontline in what residents describe as a turf war between rival companies. While ebikes for hire have become an increasingly popular mode of transport in London, fractured regulation means customers can ride them through some boroughs with ease but find that in others they cannot ride or park them. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "‘Hopelessly insolvent’: how ‘saviour of steel’ Sanjeev Gupta’s global empire unravelled", "url": "https://www.theguardian.com/business/2025/aug/22/from-yorkshire-to-australia-sanjeev-gupta-steel-empire-unravelled", "id_key": "c4450840614855062e70942c4109026005aa6da16468bd562638b6e9c60f0e37", "summary": "This week’s collapse of the tycoon’s Yorkshire operations brought relief for some. It echoes insolvency steps at 15 of his companies Government takes over Liberty Steel’s South Yorkshire plants to protect 1,450 jobs A disparate collection of steelworks in Australia, the UK, Romania and the Czech Republic at the start of the year had two things in common: they were part of the metals empire of Sanjeev Gupta, and they had fallen silent. The idling plants were emblematic of the tycoon’s struggles. Born in India before starting a commodities trading business at university, Gupta was once nicknamed the “saviour of steel” for his plans to turn around struggling plants. Yet things looked very different this week, as he finally lost control of one of his key UK businesses . Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "The ‘Nerd Reich’: how tech billionaires infiltrated the White House – podcast", "url": "https://www.theguardian.com/politics/audio/2025/aug/22/the-nerd-reich-how-tech-billionaires-infiltrated-trumps-white-house-podcast", "id_key": "450ffc91f07a490e86a7b0e7c87c12ee7c2c3967259d8e1487e6a2fac34b5fcc", "summary": "This week, Jonathan Freedland speaks to the journalist Gil Duran about his upcoming book The Nerd Reich : Silicon Valley Fascism and the War on Global Democracy Archive: 10 News, All in Podcast, Bloomberg, CNN, Fox 5 San Diego, Hoover Institution, Jack Murphy Live, Megyn Kelly, PBS NewsHour, Yahoo Finance Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Why can’t the world get its act together on plastics? – podcast", "url": "https://www.theguardian.com/science/audio/2025/aug/19/why-cant-the-world-get-its-act-together-on-plastics-podcast", "id_key": "de5e1c41e79eb12ff93869dd07bcb3a5a3c3014f6a088702504eaf151e0a95c1", "summary": "After three years of negotiating, talks over a global plastics treaty came to an end in Geneva last week with no agreement in place. So why has it been so difficult to get countries to agree to cut plastic production? Madeleine Finlay hears from Karen McVeigh, a senior reporter for Guardian Seascapes, about a particularly damaging form of plastic pollution causing devastation off the coast of Kerala, and where we go now that countries have failed to reach a deal Clips: Fox News, BBC, 7News Australia, France 24, DW News, CNA Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "A car-free tour of Devon? Just the train journey there would be an adventure | Letter", "url": "https://www.theguardian.com/money/2025/aug/22/a-car-free-tour-of-devon-just-the-train-journey-there-would-be-an-adventure", "id_key": "1cc73fcbe720d05c3b8212e105fb122da1efe1a4c10f11158a0b98ba3ff3345a", "summary": "Briony Mason researches the alternative to visiting the south-west in a car from Lincolnshire Re Phoebe Taplin’s article ( Coves, caves and Agatha Christie – a car-free tour along the English Riviera in Devon, 19 August ), my in-laws live in Devon and we visit often from our home in the East Midlands. It is a long drive, with little to look at along the M6/M5, and Phoebe’s trip sounded so charming that I thought perhaps the train would provide us with an alternative. A quick look on a tickets app advises me that for the bargain price of £450 the four of us could travel to Torquay in seven hours and six minutes with four changes (each way), which would probably be an adventure in itself, possibly with fewer charming spots and seafood snacks. I could read an entire Christie novel in that time, however, provided the kids’ electronics stayed charged for long enough. Briony Mason Rowston, Lincolnshire Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Rail fares in England on path to rise by 5.8% next year on back of inflation data", "url": "https://www.theguardian.com/money/2025/aug/20/rail-fares-in-england-rise-next-year", "id_key": "bac88d89c6bea6d506db5f46a8775012b1878d368e98e17110cdb498483cdb84", "summary": "Concern among passengers as index reading that dictates regulated ticket prices comes in higher than forecast UK inflation rises by more than expected to 3.8% Train fares in England are now expected to rise by a higher-than-expected 5.8% next year, prompting concern among passenger groups. Rail ticket increases are usually calculated by adding one percentage point to July’s inflation reading on the retail prices index (RPI), which came in 0.2 points above forecasts on Wednesday at 4.8%. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:32Z", "source": "Guardian_Business", "title": "Buy uniform early and save now for trips: how to save money before school starts in the UK", "url": "https://www.theguardian.com/money/2025/aug/20/buy-uniform-early-and-save-now-for-trips-how-to-save-money-before-school-starts-in-the-uk", "id_key": "d8a0d2785fc128afe45647571568ae40bcf3c4e55fa7dbca7273d23308f8ba47", "summary": "From sorting out travel to maximising the offers available, it pays to get ready for school early To get your children’s uniforms sorted in time, and at a good price, you need to start early – you will avoid long queues and have plenty of choice of style, size and price point. Continue reading...", "ingested_utc": "2025-08-25T20:36:32Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:33Z", "source": "Guardian_World", "title": "‘Wall of blowing dust’ sweeps through Burning Man festival upending camps", "url": "https://www.theguardian.com/culture/2025/aug/25/burning-man-weather-dust-storm", "id_key": "db5454e70326446cd0047d7bd29928e21d126596a9c86f080647953cee6dc1d9", "summary": "Wing gusts with speeds in excess of 45mph tore through Black Rock City, temporarily halting all activity Burning Man festival temporarily ground to a halt over the weekend due to dust storms and high winds that sent tents flying and plunged visibility to near zero. On Monday, organizers of the Nevada festival said the Black Rock City airport and the festival gates had reopened as the festival officially got underway. Continue reading...", "ingested_utc": "2025-08-25T20:36:33Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:55Z", "source": "CryptoSlate", "title": "Hyperliquid surpasses Robinhood in monthly trading volume for the third consecutive month", "url": "https://cryptoslate.com/hyperliquid-surpasses-robinhood-in-monthly-trading-volume-for-the-third-consecutive-month/", "id_key": "ace9c27724f4cd2c93d452d8a35928dd2bfe3cf02e0017f25a4676cfc3e7edae", "summary": "Hyperliquid registered more trading volume than Robinhood for the third consecutive month, with July marking the largest gap between platforms at 39.1%. DefiLlama data shows the decentralized derivatives exchange traded $330.8 billion in combined spot and perpetual volume during July, while Robinhood processed $237.8 billion across all products. Robinhood’s July volume was made up of […] The post Hyperliquid surpasses Robinhood in monthly trading volume for the third consecutive month appeared first on CryptoSlate .", "ingested_utc": "2025-08-25T20:36:55Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:59Z", "source": "CryptoNews", "title": "Citi Executive Warns Stablecoin Interest Payments Could Drain Bank Deposits Like the 1980s Crisis", "url": "https://cryptonews.com/news/citi-executive-warns-stablecoin-interest-payments-could-drain-bank-deposits-like-the-1980s-crisis/", "id_key": "589590e9887992bc431ce4bbb9415734248ba2f11fb78ebc483f73db0c820e73", "summary": "Concerns over stablecoins offering interest returns have echoed the 1980s deposit flight, with Treasury data suggesting up to $6.6T in outflows. Banks have lobbied Congress on GENIUS Act gaps, while Citi has examined a digital token and crypto platforms continue to provide rewards to holders. The post Citi Executive Warns Stablecoin Interest Payments Could Drain Bank Deposits Like the 1980s Crisis appeared first on Cryptonews .", "ingested_utc": "2025-08-25T20:36:59Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:36:59Z", "source": "CryptoNews", "title": "Sharps Tech Skyrockets 70% After Inking Massive $400M Solana Treasury Deal – $1.5B in One Day", "url": "https://cryptonews.com/news/sharps-tech-skyrockets-70-after-inking-massive-400m-solana-treasury-deal/", "id_key": "da90f047dde2dc2585423f375d519f0e4093a2361d4eaba99ed6685c2b2178bb", "summary": "Sharps Technology has closed a $400M financing round to launch a solana treasury, with ParaFi, Pantera, and Monarq among its backers. The move reflects institutional confidence in blockchain finance as Solana gains momentum in revenue, adoption, and large-scale treasury accumulation. The post Sharps Tech Skyrockets 70% After Inking Massive $400M Solana Treasury Deal – $1.5B in One Day appeared first on Cryptonews .", "ingested_utc": "2025-08-25T20:36:59Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:38:43Z", "source": "MarketWatch_Bulletins", "title": "Dow sheds nearly 350 points, Nasdaq gives up gains as U.S. stocks close lower", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=4a4d8830-4f3b-4b99-abb4-eb0b5e23dde8&mod=mw_rss_bulletins", "id_key": "d15d201f42bd08061a17d035a090e7877ba4f3ab775e9c67ab63a865783581eb", "summary": "", "ingested_utc": "2025-08-25T20:38:43Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:38:50Z", "source": "NYTimes_Business", "title": "French Prime Minister Calls Special Parliamentary Session to Address Ballooning Debt", "url": "https://www.nytimes.com/2025/08/25/world/europe/france-debt-parliament-vote.html", "id_key": "919e32e13661dfc16070ad8ab0ec82bdc00ac37059b64519dba179aa2f1f9f40", "summary": "Prime Minister François Bayrou called a parliamentary session to address the “gravity” of the situation. An analyst said his move was “political suicide,” as some opponents vowed to bring down the government.", "ingested_utc": "2025-08-25T20:38:50Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:27Z", "source": "ArsTechnica_All", "title": "Senator castigates federal judiciary for ignoring “basic cybersecurity”", "url": "https://arstechnica.com/security/2025/08/senator-to-supreme-court-justice-federal-court-hacks-threaten-us-security/", "id_key": "1f19afdaec36e70bd2d0be54d495a535ef8bf474a3bb8709757d37f377931038", "summary": "Breaches in 2020 and 2025, reportedly by foreign adversaries, exposed confidential files.", "ingested_utc": "2025-08-25T20:39:27Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:27Z", "source": "ArsTechnica_All", "title": "Blade Runner makes its live-action return next year", "url": "https://arstechnica.com/culture/2025/08/sequel-series-blade-runner-2099-set-to-premiere-in-2026/", "id_key": "519d9ba42c950e60e46763f26fbe302a24795acada0a93d71fc556908e042e6d", "summary": "New series will star Michelle Yeoh and take place 50 years after the 2017 film.", "ingested_utc": "2025-08-25T20:39:27Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:38Z", "source": "AlJazeera_All", "title": "Polish veto risks Ukraine’s crucial Starlink access amid refugee aid row", "url": "https://www.aljazeera.com/news/2025/8/25/polish-veto-risks-ukraines-crucial-starlink-access-amid-refugee-aid-row?traffic_source=rss", "id_key": "c3715510ec967e75722ea96c172601019db8dd49634e6990093e5e670d0f6282", "summary": "Neighbour Poland has been one of Ukraine's staunchest backers since Russia invaded Ukraine in 2022.", "ingested_utc": "2025-08-25T20:39:38Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:44Z", "source": "FinancialPost_Business", "title": "CACI Protects Canadian Armed Forces Through New C-UAS Technology Contract", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/caci-protects-canadian-armed-forces-through-new-c-uas-technology-contract", "id_key": "c0db57c5fd0178a92dc3378e4a2376f565bf47d073c9261d98c42f91fe012002", "summary": "RESTON, Va. — CACI International Inc ( NYSE: CACI) announced today that it was awarded two contracts with the Canadian Armed Forces (CAF) as part of the second phase of the Counter Uncrewed Aircraft System (C-UAS) Urgent Operational Requirement (UOR). During phase two, CACI will provide a light-armored tactical C-UAS vehicle platform, and support for […]", "ingested_utc": "2025-08-25T20:39:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:44Z", "source": "FinancialPost_Business", "title": "How young content creators plan to balance their social media success and campus life", "url": "https://financialpost.com/pmn/how-young-content-creators-plan-to-balance-their-social-media-success-and-campus-life", "id_key": "8d5386419b1b707bfd4a41cfb5b790c2c75a3171195c55cf03430566dd44b746", "summary": "Growing up, Sofia DelGiudice never imagined her father’s annual back-to-school tradition would be a pivotal moment in her social media career. Before starting university two years ago, the 19-year-old content creator from Toronto had the idea to stitch together all the videos her dad filmed of her descending the stairs in the family’s home on […]", "ingested_utc": "2025-08-25T20:39:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:44Z", "source": "FinancialPost_Business", "title": "Amlan® to Present on Biotoxin Control and Antibiotic-Free Poultry Production at Malaysia Livestock 2025", "url": "https://financialpost.com/globe-newswire/amlan-to-present-on-biotoxin-control-and-antibiotic-free-poultry-production-at-malaysia-livestock-2025", "id_key": "c9fe44b36cdd7a8fec50aa2066b2f9ccba199b71cd4907702f7752cb4ba59cf2", "summary": "CHICAGO, Aug. 25, 2025 (GLOBE NEWSWIRE) — Amlan International, the animal health business of Oil-Dri® Corporation of America and a global leader in natural feed additives, will participate in Malaysia Livestock 2025 at the Kuala Lumpur Convention Centre from August 27–29. The event brings together industry leaders, producers, and innovators to address the most pressing […]", "ingested_utc": "2025-08-25T20:39:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:44Z", "source": "FinancialPost_Business", "title": "Trump to Halt Development of Another Offshore Wind Farm", "url": "https://financialpost.com/pmn/business-pmn/trump-plans-to-block-development-of-another-offshore-wind-farm", "id_key": "0064dbd2ca93e1f9b083a6a298d0d2d2e12bd26947d99da6792ac5d6797632ec", "summary": "The Trump administration is working to halt development of an offshore wind project planned near Maryland, in the latest escalation of the White House’s war on the clean energy source loathed by the president.", "ingested_utc": "2025-08-25T20:39:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:44Z", "source": "FinancialPost_Business", "title": "Air travellers face lengthy backlog in resolving complaints through CTA", "url": "https://financialpost.com/pmn/air-travellers-face-lengthy-backlog-in-resolving-complaints-through-cta", "id_key": "7800e98f489cf6fc0bfec5f23ee704ad81635884d9b30be63872e1eee5cb64ba", "summary": "Air Canada customers looking to lodge a complaint with the regulator over their experience during the recent flight attendants’ strike should prepare for a wait. The Canadian Transportation Agency said its backlog of air travel complaints stood at about 85,000 as of Aug. 14, two days before the strike started. The agency had received nearly […]", "ingested_utc": "2025-08-25T20:39:44Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:51Z", "source": "Nikkei_Asia_Top", "title": "Osaka Expo jumps on stablecoin trend with digital wallet support", "url": "https://asia.nikkei.com/spotlight/cryptocurrencies/osaka-expo-jumps-on-stablecoin-trend-with-digital-wallet-support", "id_key": "38ff8ba8136f20ccd82ad97ded8ad1adfc153758ac66b00914c9ff40d1bba59a", "summary": "", "ingested_utc": "2025-08-25T20:39:51Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T20:39:59Z", "source": "HackerNews_Top", "title": "DeepWiki: Understand Any Codebase", "url": "https://www.aitidbits.ai/p/deepwiki", "id_key": "af996de14552643c07e43ccf43c59a6799017278d006960c11a8e07240b929f6", "summary": "Comments", "ingested_utc": "2025-08-25T20:39:59Z"}
