{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T18:46:32Z", "source": "Engadget_All", "title": "Apple claims an ex-employee stole Apple Watch trade secrets for Oppo", "url": "https://www.engadget.com/big-tech/apple-claims-an-ex-employee-stole-apple-watch-trade-secrets-for-oppo-182636187.html?src=rss", "id_key": "37328bb56e47cffa9d6a3ba86ffbbdcade97098b88ddedda1047e4b9205fe4ed", "summary": "Apple is going after another one of its previous employees for allegedly sharing trade secrets with a new employer. Apple's lawsuit listed Chen Shi, a former employee who worked on the Apple Watch team, along with Oppo , as defendants, claiming they \"conspired to steal Apple’s trade secrets.\" According to the lawsuit, Shi worked as a Sensor System Architect for the Apple Watch from January 2020 to June 2025, but was seeking employment with Oppo as early as April 2025. Apple claimed that its former employee didn't disclose that he was leaving to join Oppo and instead said he was going back to China to look after his elderly parents and didn't have any plans to find a new job. However, the lawsuit said that Shi \"set up and attended dozens of one-on-one meetings\" with Apple Watch team members to learn about their work on \"optical sensors, temperature sensors, and ECG sensors.\" In the lawsuit, Shi allegedly downloaded 63 files from one of Apple's protected folders and transferred the material to a USB drive before searching the internet for \"how to wipe out [a] macbook\" and \"can somebody see if I’ve opened a file on a shared drive?” Along with these claims, Apple said in the lawsuit that Shi sent a message to his future Oppo employers that he would \"collect as much information as possible\" about Apple's health-sensing technologies. Oppo has since provided a statement to MacRumors about Apple's lawsuit, claiming that it has \"found no evidence establishing any connection between these allegations and the employee's conduct during his employment at OPPO.\" The company statement also said that OPPO has not \"misappropriated Apple's trade secrets.\" It's not the first time that Apple has taken legal action against one of its former employees. Earlier this summer, the company sued a design engineer, alleging that he stole trade secrets about the Vision Pro and shared them with his new employer, Snap. This article originally appeared on Engadget at https://www.engadget.com/big-tech/apple-claims-an-ex-employee-stole-apple-watch-trade-secrets-for-oppo-182636187.html?src=rss", "ingested_utc": "2025-08-23T18:46:32Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T18:46:48Z", "source": "FinancialPost_Business", "title": "Immigration boosted Europe’s economy after pandemic, ECB’s Lagarde says", "url": "https://financialpost.com/pmn/immigration-boosted-europes-economy-after-pandemic-ecbs-lagarde-says", "id_key": "4e9b1ba7a1b564cd0d088997310546d58bfadd54bdf9e2bd84ad9435dee80f09", "summary": "JACKSON HOLE, Wyo. (AP) — A jump in the share of foreign-born workers after the pandemic helped Europe bring inflation down without sharply slower growth, European Central Bank President Christine Lagarde said Saturday. A key factor “has been the rise in both the number and participation rate of foreign workers,” Lagarde said in a speech […]", "ingested_utc": "2025-08-23T18:46:48Z"}
