{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:42:06Z", "source": "BBC_World", "title": "European leaders rush to US to help Ukraine avoid 'capitulation'", "url": "https://www.bbc.com/news/articles/c9d0v8ljw3no?at_medium=RSS&at_campaign=rss", "id_key": "4d7dba261c7dd65d00c3db7356c4dd72e41f9759778440e3e311e46f221cd7f3", "summary": "The heads of state hope to stop Trump from threatening long-term European security, writes James Landale.", "ingested_utc": "2025-08-18T15:42:06Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:42:06Z", "source": "BBC_World", "title": "Hamas agrees to latest Gaza ceasefire proposal, source in group says", "url": "https://www.bbc.com/news/articles/ckgjye15zdlo?at_medium=RSS&at_campaign=rss", "id_key": "9a24455740240babd0235ec90b4fa6580516c1b78da14b45d700fff386e916a5", "summary": "The proposal from regional mediators would see Israeli hostages released in two batches during a 60-day truce, according to a Palestinian official.", "ingested_utc": "2025-08-18T15:42:06Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:42:06Z", "source": "BBC_Business", "title": "Bioethanol plant begins shut-down process", "url": "https://www.bbc.com/news/articles/c3v3ey0n71xo?at_medium=RSS&at_campaign=rss", "id_key": "d5c6edd5d0e79a78c430d6a157e4d3488af2bbcad74516a081e543811c314d2a", "summary": "Hull-based Vivergo says all staff will have left and the site will be ready for demolition by the end of the year.", "ingested_utc": "2025-08-18T15:42:06Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:42:30Z", "source": "Protos", "title": "The great MSTR Ponzi scheme debate", "url": "https://protos.com/the-great-mstr-ponzi-scheme-debate/", "id_key": "58c9d1cdcccd94a8697f6d8e11c7387a1be47780e4e8971c85fd4d92e559003c", "summary": "Tensions are escalating in a spirited debate between MicroStrategy (MSTR) investors and skeptics about whether the stock is a Ponzi scheme. The post The great MSTR Ponzi scheme debate appeared first on Protos .", "ingested_utc": "2025-08-18T15:42:30Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:42:31Z", "source": "CryptoNews", "title": "Short-Lived NFT Market Recovery Ends With $1.2 Billion Weekly Decline", "url": "https://cryptonews.com/news/short-lived-nft-market-recovery-ends-with-1-2-billion-weekly-decline/", "id_key": "ed90a22b3394cf49f9e99731997224c004c954d652de4ff49f1a74c88e4428e5", "summary": "NFT market recovery ends abruptly with $1.2B weekly decline shedding value from $9.3B to $8.1B as CryptoPunks loses $300M amid Ethereum's 9% pullback. The post Short-Lived NFT Market Recovery Ends With $1.2 Billion Weekly Decline appeared first on Cryptonews .", "ingested_utc": "2025-08-18T15:42:31Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:42:31Z", "source": "CryptoNews", "title": "Michael Saylor’s Strategy Adds 430 BTC, Holdings Hit 629,376 – What’s the Catch?", "url": "https://cryptonews.com/news/michael-saylors-strategy-adds-430-btc-holdings-629376/", "id_key": "cbe2153ac9451786638272f24139960da5ae56fb8cbbdb1ee0aa3b3c207d9899", "summary": "Michael Saylor’s Strategy has disclosed a 430 BTC buy for $51.4M at ~$119,666, taking holdings to 629,376 BTC. The firm has outlined aggregate cost of $46.15B (avg $73,320) and refined ATM rules below 2.5× mNAV to manage debt service, dividends, and selective treasury deployment. The post Michael Saylor’s Strategy Adds 430 BTC, Holdings Hit 629,376 – What’s the Catch? appeared first on Cryptonews .", "ingested_utc": "2025-08-18T15:42:31Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:44:24Z", "source": "NYTimes_Business", "title": "Oil and Gas Prices Are Falling, a Boon for Drivers, and Trump", "url": "https://www.nytimes.com/2025/08/18/business/energy-environment/oil-gasoline-prices-trump.html", "id_key": "9ed80e5f4ef3e312246e92798e3a52e06ce44159c6ff321ebcf4a2e89d202061", "summary": "Plentiful supply and weak demand has helped bring down fuel prices, which President Trump has often cited as a measure of his success.", "ingested_utc": "2025-08-18T15:44:24Z"}
{"published_utc": "2025-08-12", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:44:26Z", "source": "NYTimes_Technology", "title": "Do Kwon, Crypto Founder Who Caused 2022 Market Crash, Pleads Guilty to Fraud", "url": "https://www.nytimes.com/2025/08/12/technology/do-kwon-crypto-fraud-guilty-plea.html", "id_key": "0774b4a741df0292bd9ceebbee4af86d6653db84124aa42c85d9e8da106b23d2", "summary": "Do Kwon, who created the Luna and TerraUSD cryptocurrencies that collapsed in 2022, pleaded guilty to two counts of fraud, capping a spectacular fall from grace.", "ingested_utc": "2025-08-18T15:44:26Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:44:32Z", "source": "NPR_Business", "title": "Three innovations pushing the medical field forward", "url": "https://www.npr.org/2025/08/18/nx-s1-5503741/three-innovations-pushing-the-medical-field-forward", "id_key": "1417efd3306b7fc2563be43deeb0026501aca2c4fc68ecaab0d9bb4f8c885014", "summary": "Innovation is crucial for long-term economic prosperity. One area where that’s happening aplenty: medical technology. From a cancer vaccine to an Alzheimer’s blood test to a life-changing exoskeleton, we take you on a tour of the economics of health technology. Related episodes: The hidden costs of healthcare churn ( Apple / Spotify ) More for Palantir, less for mRNA, and a disaster database redemption arc ( Apple / Spotify ) It's actually really hard to make a robot, guys ( Apple / Spotify ) For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Fact-checking by Sierra Juarez . Voice-over by Greg Hardes. Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter .", "ingested_utc": "2025-08-18T15:44:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:44:52Z", "source": "TheVerge_All", "title": "How the head of Obsidian went from superfan to CEO", "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/760522/obsidian-ceo-steph-ango-kepano-productivity-software-notes-app", "id_key": "8fc544b74083605ee4cb5e8316d0a7db96c98acee132a756b19a580b226c561d", "summary": "Welcome to Decoder! This is Casey Newton, founder and editor of Platformer and cohost of the Hard Fork podcast. I’ve had a lot of fun guest-hosting a few episodes of Decoder while Nilay is out on parental leave this summer. If you listened to the last couple of Monday shows, you know I’ve been doing […]", "ingested_utc": "2025-08-18T15:44:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:44:52Z", "source": "TheVerge_All", "title": "The best Bluetooth trackers for Apple and Android phones", "url": "https://www.theverge.com/23769840/best-bluetooth-trackers", "id_key": "1df4efd1c9475f3fcd2bfc775b60684df6dde1e4303501846d5650df6e7b58e2", "summary": "Some people rarely lose things. Wallets are always exactly where they’re supposed to be, keys never go missing, and remotes never slip between the couch cushions. And then there’s the rest of us — the folks who can’t ever seem to find the thing that was right there a few seconds ago. For us, there […]", "ingested_utc": "2025-08-18T15:44:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:44:52Z", "source": "TheVerge_All", "title": "The Apple Watch Ultra is on sale for a record low of $650", "url": "https://www.theverge.com/tech/760602/apple-watch-ultra-2-soundcore-select-4-go-speaker-deal-sale", "id_key": "3bb221810f20461575353e6a55b893bb1f16ef763f97ab8264be2a278e59e068", "summary": "If you’re interested in a long-lasting smartwatch, and like to stay within Apple’s hardware ecosystem, the Apple Watch Ultra 2 is the best choice. It’s Apple’s most durable, longest-lasting smartwatch, and it’s currently on sale for $649.99 ($150 off), an all-time low price at Amazon and Best Buy. The Apple Watch Ultra 2 comes in […]", "ingested_utc": "2025-08-18T15:44:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:44:55Z", "source": "Engadget_All", "title": "The best deals on MacBooks, AirPods, iPads and other Apple gear you can get right now", "url": "https://www.engadget.com/deals/best-apple-deals-150020110.html?src=rss", "id_key": "a942b6cc793a68501d4f378b488746589e05e6a4a5d0893ffef2000d62c557fb", "summary": "It's no secret that Apple devices tend to be in particularly high demand. Unfortunately, that demand can make finding big discounts on Apple gadgets a bit harder than usual. To make things easier, we're keeping a running list of the best Apple deals you can shop right now on AirPods, MacBooks, iPads and more. Just note that you’ll almost always find the best Apple deals from third-party retailers like Amazon , Best Buy , Walmart , Target and the like, not from Apple's own online store. Unless you shop refurbished , you’ll usually pay top dollar buying direct (though for some items like iPhones, that might be the best route to take). Best Mac deals Apple MacBook Air (15-inch, M4) for $999 ($200 off) : The 15-inch MacBook Air is nearly identical to the smaller version but features more robust speakers and a more spacious trackpad alongside its roomier display. $999 is the lowest price we've tracked. Apple MacBook Air (15-inch, M3, 24GB RAM) for $1,199 ($500 off) : The last-gen M3 MacBook Air has officially been discontinued, but it remains a superb laptop while stock remains available. We gave this 15-inch model a score of 90 in our review — outside of its slower chip (which is still plenty fast for everyday use), marginally improved camera and inability to power two external displays with the lid open, it's virtually identical to the newer version. This deal applies to the model with 24GB of memory. The 13-inch version , meanwhile, is down to $999 at Best Buy. Apple MacBook Pro (14-inch, M4 Pro) for $1,699 ($300 off) : The MacBook Pro goes beyond most people’s needs, but it remains a powerhouse for coders, media editors or anyone else with especially demanding workloads. We gave it a score of 92 last November. Just keep in mind that it’s heavier than the MacBook Air and that it still lacks a standard USB-A port. Also at Best Buy . Apple Mac mini (M4) for $499 ($100 off) : The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard (finally), two front-facing USB-C ports (finally!), an extra Thunderbolt 4 port and the ability to drive three external displays. It lacks USB-A ports, however. We gave the M4 Pro model a review score of 90 . This deal is for the entry-level version with a base M4 chip, 16GB of RAM and a 256GB SSD — we’ve seen it fall as low as $469 in the past, but this is still a decent savings compared to buying direct from Apple. Also at Best Buy . Best AirPods deals Apple AirPods Pro 2 for $169 ($80 off) : The AirPods Pro 2 are Apple’s best set of wireless earbuds for now, as they offer the full set of Apple-focused features, strong ANC, onboard volume controls, a comfy in-ear design and a warm sound profile that most should find agreeable. They can even work as a hearing aid , though their six-hour battery life still isn’t the best, and you should only get them if you’re all-in on Apple hardware. But if that’s the case, we consider them the best wireless earbuds for iPhone owners. This deal is $20 off the all-time low we saw last month, but it's still a ways below the set's usual going rate. Also at Walmart and Best Buy . Exercise caution, though: If you're not in a rush, this is another Apple device that may see a refresh within the next couple of months. Best iPad deals Apple iPad Pro 11-inch (M4) for $896 ($104 off) : The iPad Pro is much more tablet than most people need, but it’s the ultimate iPad for those who can stomach its price tag. It’s wonderfully thin, its OLED display is one of the best we’ve seen on a consumer device and its M4 chip can handle virtually anything you’d ever do on an iPad. It’s also the only Apple tablet with Face ID, plus it has a better speaker setup than the iPad Air. We gave it a score of 84 in our review, with the only real drawback being its price. Also at BJ's for $50 less, if you have a membership there. Best Apple Watch deals Apple Watch Ultra 2 for $650 ($149 off) : Apple’s most premium smartwatch, the Ultra 2 has a killer 36-hour battery life, a handy Low Power mode for extended use and cellular connectivity by default. It also has a compass app, water temperature gauge and a loud onboard siren that you can trigger in emergencies. This discount marks the lowest price we've tracked. But again, we wouldn't be surprised if Apple introduced an updated model in the coming weeks. Apple Watch SE (GPS, 40mm) for $169 ($80 off) : As with the more premium models, we wouldn’t be surprised to see an update to Apple’s budget smartwatch sometime soon (and we have a few suggestions on the matter). But thanks to some serious discounts, the Apple Watch SE has turned out to be the most affordable way to get an iPhone companion for your wrist. Despite a lackluster screen and limited extra features, it handles the basics well. Also at Target . Best Apple accessories deals Apple Pencil (USB-C) for $69 ($10 off) : This more affordable Apple Pencil doesn’t support pressure sensitivity, but it still makes for a useful stylus for the basics. If you’re a casual note-taker and can live without wireless charging, you’ll save a few bucks by picking this one up. Also at Walmart . Read more Apple coverage : The best AirPods The best Apple Watches The best MacBooks The best iPhones The best iPads Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/best-apple-deals-150020110.html?src=rss", "ingested_utc": "2025-08-18T15:44:55Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:45:04Z", "source": "TheStreet_Top", "title": "Famed fast-food burger chain closed 200 restaurants, no bankruptcy", "url": "https://www.thestreet.com/restaurants/fast-food-burger-chain-opened-in-1934-closes-200-restaurants", "id_key": "e2627ec9f87337a8a3f3ceff63a38260ad4894434cbe004562687b8082f2d935", "summary": "The long-lived national chain also dropped table service and adopted a Chick-fil-A-style business model.", "ingested_utc": "2025-08-18T15:45:04Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:45:04Z", "source": "TheStreet_Top", "title": "Aldi’s supermarket rival tries new way to end theft, shoplifting", "url": "https://www.thestreet.com/retail/supermarket-chain-pays-customers-to-report-shoplifters-", "id_key": "d72167e1d1a8d26186c19079e4c82aafc41e26131c9dc18eb68c100b422d091d", "summary": "Retail theft and shoplifting have increased dramatically, and one chain has a new idea as to how to stop it.", "ingested_utc": "2025-08-18T15:45:04Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:45:11Z", "source": "FinancialPost_Business", "title": "U.S. trade, tariffs on the agenda as Carney, Ford meet", "url": "https://financialpost.com/news/us-trade-tariffs-agenda-carney-ford-meet", "id_key": "76d209ff88d340affafbc73635d3b9914faad19c1d958f1d0e978a479de2f457", "summary": "Ford is in Ottawa for a conference that runs until Wednesday", "ingested_utc": "2025-08-18T15:45:11Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:45:11Z", "source": "FinancialPost_Business", "title": "WEBTOON Entertainment Brings Webcomics to Life with Video Episodes", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/webtoon-entertainment-brings-webcomics-to-life-with-video-episodes", "id_key": "f4fbe70eeace0d37714b151699de69a851ef5bc1c7cd8d4b8cb075dcc7eb6f6a", "summary": "WEBTOON is officially launching short-form videos, expanding the WEBTOON experience from reading to watching, and giving users a new way to fall in love with some of the world’s best webcomics Hit titles like “The Mafia Nanny,” “Star Catcher,” and “Osora” are among the first “Video Episode” series LOS ANGELES — WEBTOON Entertainment Inc. (Nasdaq: […]", "ingested_utc": "2025-08-18T15:45:11Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T15:45:11Z", "source": "FinancialPost_Business", "title": "Mercedes-Benz USA Appoints Greg Gates as Vice President of Network Development", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/mercedes-benz-usa-appoints-greg-gates-as-vice-president-of-network-development", "id_key": "fa272e1d0e373f79670077cc1f6cc888ad24f32de4a2868a0144e2bf5dd0fd7a", "summary": "ATLANTA — Mercedes-Benz USA (MBUSA) today announced the appointment of Greg Gates as Vice President of Network Development, effective September 2. Gates succeeds Frank Diertl, who recently retired from the company, and will join the MBUSA executive team at the North American headquarters in Atlanta, Georgia. “We are pleased to welcome Greg back to Mercedes-Benz […]", "ingested_utc": "2025-08-18T15:45:11Z"}
