{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Oil and stocks slip before Zelenskyy-Trump meeting in Washington, UK house prices fall in August - business live", "url": "https://www.theguardian.com/business/live/2025/aug/18/stocks-oil-rise-zelenskyy-trump-european-leaders-meeting-washington-jackson-hole-uk-house-prices-fall-in-august-business-live", "id_key": "2b4a9c1219884a0e89bd5f7fe75ffd2c042e0e34a149dc1c109a5875708a0cdd", "summary": "Asian stocks rise while European shares turn negative ahead of crucial talks between US president, Ukrainian president and European leaders King Charles ’s personal shirtmaker. The world’s oldest hatters, who designed fitments for Queen Elizabeth II’s coronation crown and boast fans including Winston Churchill . A luxury sports brand with a “spy-ready” ski-suit. Has James Bond assembled a crack team that can successfully take on his latest adversary? Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Soho House ‘close to reaching a $1.8bn deal to take it private", "url": "https://www.theguardian.com/business/2025/aug/18/soho-house-members-club-deal-private-mcr-hotels-nyse", "id_key": "6c72a579c5d6ad52ab4f69309e67d400d2b05c46590d663f245cd044a8e426bb", "summary": "US-based MCR Hotels to lead new equity investors in club chain after four years on New York stock exchange Business live – latest updates The private members’ club Soho House is reportedly close to reaching a $1.8bn (£1.3bn) deal to take it private after a tricky four years listed on the New York stock exchange. New York-based MCR Hotels is poised to lead new equity investors in the chain of clubs as part of a deal that would involve it ditching its stock market listing, the Wall Street Journal first reported. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "From royal hatters to top tailors: James Bond lawyers line up trademark fight team", "url": "https://www.theguardian.com/film/2025/aug/17/royal-hatters-top-tailors-james-bond-lawyers-trademark-fight-team", "id_key": "1d31002296d8d5ea0bfd9c1457230beb7e26551ae3303a3b932ac9d9e559ba79", "summary": "How the company that controls 007 merchandising is taking on the Austrian challenging for ownership King Charles’s personal shirtmaker. The world’s oldest hatters, who designed fitments for Queen Elizabeth II’s coronation crown and boast fans including Winston Churchill. A luxury sports brand with a “spy-ready” ski-suit. Has James Bond assembled a crack team that can successfully take on his latest adversary? Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Ex-defence secretary Shapps criticised as he is cleared to join missiles start-up", "url": "https://www.theguardian.com/politics/2025/aug/18/watchdog-condemned-for-clearing-grant-shapps-to-join-defence-startup", "id_key": "ed134c747eb0d39d4cc80d41999e9faf3060795ea8797acac9e2045420468c3b", "summary": "Former defence secretary allowed to take role as chair of Cambridge Aerospace, as long as he avoids defence matters The parliamentary standards body has been criticised for clearing Grant Shapps, a former Conservative defence secretary, to join a defence startup as long as he promises not to work on defence matters. In a ruling that drew scorn from political ethics experts, the Advisory Committee on Business Appointments (Acoba), which monitors and advises on the revolving door between Westminster and the business sector, gave Shapps the green light to become the chair of Cambridge Aerospace. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Sanjeev Gupta readies last-ditch plan to save UK speciality arm of Liberty Steel", "url": "https://www.theguardian.com/business/2025/aug/17/sanjeev-gupta-readies-last-ditch-plan-to-save-specialty-arm-of-liberty-steel", "id_key": "1fe473f98b72b274d951d4665fcaad3ec373ef841e6acb9ae62bfc2a777f80d0", "summary": "Attempt to secure pre-pack administration deal comes as government officials step up planning for its collapse Sanjeev Gupta is preparing a last-ditch attempt to save the remaining arm of his Liberty Steel business as government officials step up planning for a collapse of the business within days. Gupta is understood to have spent the weekend planning an 11th-hour rescue deal to save the company’s Speciality Steel UK (SSUK) division days before a courtroom showdown with its creditors on Wednesday. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Record number of EVs registered in western Europe across last quarter", "url": "https://www.theguardian.com/environment/2025/aug/17/record-number-of-evs-registered-in-western-europe-across-last-quarter", "id_key": "c5125b5c1c2f7bd1fdca5682a86d5bb121d9e2c78229d3cf38db17cced45433d", "summary": "Nearly 600,000 BEVs hit the road as carmakers such as Renault and Stellantis attract more price-sensitive buyers A record number of electric cars were registered in western Europe between April and June, as more affordable battery-powered cars came to market, according to new research. Nearly 600,000 battery electric vehicles (BEV) hit the roads in the last quarter in a boost to sales that had been rising more slowly than previously forecast in the last year. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Supermarkets suspend supplies from Lincolnshire pig farm over animal abuse footage", "url": "https://www.theguardian.com/world/2025/aug/17/supermarkets-suspend-supplies-from-lincolnshire-pig-farm-after-covert-filming-of-animal-abuse", "id_key": "91ff1748f7857ab41636fb2e485e10c3a264954fcd98b8cfa98873a6499fc1b1", "summary": "Tesco, Asda, Sainsbury’s and Morrisons said they had ‘immediately’ suspended supplies from Somerby Top Farm after piglets kicked by workers Three of the UK’s biggest supermarkets have suspended supplies from a Lincolnshire pig farm after footage filmed covertly by an animal rights organisation appeared to show workers kicking piglets and hitting them with boards and paddles. The footage also suggested the injured pigs with open wounds were packed into pens covered in faeces, with some left lame and writhing in pain. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Waterstones opens 10 new stores a year as younger adults embrace reading", "url": "https://www.theguardian.com/books/2025/aug/17/waterstones-strong-sales-younger-adults-book-buying", "id_key": "649e5d1fa6dd3441bdf49135d6c9f601f02206fa40467d4cf98b02496d7916c3", "summary": "Bookshop chain says people are keen to escape their screens and says rise in sales is partly down to BookTok Times may be tough on the high street but the bookseller Waterstones is enjoying strong sales as younger adults embrace reading as an escape from their screens and as online competition eases. “People have come back to reading and buying books in bookshops as we have made a place which is an enjoyable and effective way to buy books,” says James Daunt, the CEO of the British retailer, which has 320 UK bookshops and owns the Foyles , Hatchards and Blackwell’s names, and whose parent group also owns Barnes & Noble, the US’s largest bookstore chain. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "As summers of extreme heat become more common, the UK must protect its workers | John Harris", "url": "https://www.theguardian.com/commentisfree/2025/aug/18/outdoor-workers-extreme-heat-risk-lives-politicians-spain-street-cleaner", "id_key": "c72667bdcf265bbad11a2072dba1aeb1ca27d857b3276e20af804f21371cb48e", "summary": "There’s been fury in Spain over the tragic death of a street cleaner. It’s not hard to imagine something similar playing out in the UK Montse Aguilar was only 51 when she died . She lived in the El Poble-sec area of Barcelona – it translates from Catalan as “the dry village” – where she cared for her 85-year-old mother and sang in a local choir. For three years, she had worked as a city street cleaner for an outsourcing company, wearing a lime-green uniform – made, her family later said, from “100% polyester … a material used to make coats”. On 28 June, her shift in the city’s Gothic Quarter began at 2.30pm and ended seven hours later. The temperature that day had reached more than 35C, which left workers like her exposed: Spain has a clearer system of regulations covering heat and work than a lot of other countries, but it is still full of gaps. John Harris is a Guardian columnist Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Could a wealth tax work in the UK? A visual guide", "url": "https://www.theguardian.com/politics/ng-interactive/2025/aug/16/could-wealth-tax-work-in-the-uk-visual-guide", "id_key": "7da7d0b00594addd4c37161293715e146ce64f58aadf33808d4e4fff55425e9a", "summary": "Rachel Reeves is under pressure to consider a new levy to help balance the books. We look at her options How Spain put up wealth taxes - without chasing away the billionaires A rise in taxation at the autumn budget looks inevitable, as Rachel Reeves grapples with £40bn hole in the public finances. That figure comes from a recent report by the National Institute of Economic and Social Research (NIESR), which blames the deficit on higher-than-expected borrowing levels and a weaker growth outlook for the UK economy. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Construction should be a career that you can build a life on | Letters", "url": "https://www.theguardian.com/business/2025/aug/17/construction-should-be-a-career-that-you-can-build-a-life-on", "id_key": "b92860d06e9a913a0cec9605b30c39473f9de623cda7bcda13c2c394d6792ece", "summary": "Matthew Ord says pay insecurity pushes many skilled people out of construction entirely, while Stuart Green notes that career paths only exist in sheltered pockets. Plus a letter from Mark Stringer Re your editorial ( The Guardian view on construction workers: the country needs more of them, fast, 13 August ), as a bricklayer with decades of experience, I see the skills shortage in the construction industry as the result of years of neglect. The problem is not only attracting new people, but keeping them in the trade once they see the reality of working conditions. Most site bricklayers are self-employed subcontractors. We don’t get pensions, holiday pay, or sick pay. If you’re ill or injured, you simply don’t earn. That insecurity pushes many skilled people out of construction entirely. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Better design could make new homes cooler | Letters", "url": "https://www.theguardian.com/environment/2025/aug/17/better-design-could-make-new-homes-cooler", "id_key": "ddaa85c127cbe8aca60accaa9e8f322e5d7a441325e5b3c0eff633e5cbee3e48", "summary": "The climatic situation we find ourselves in requires a shift in the very basics of building design, says Chris Halligan There are two main issues driving the problem of overheating in modern housing ( Overheated homes: why UK housing is dangerously unprepared for impact of climate crisis, 10 August ). First, in order to maximise profit, developers often do the bare minimum required by legislation, without any consideration of the building’s performance in use over its lifespan. This desire for economy also often leads to the reduction of natural elements (such as tree planting in urban areas), which may otherwise assist in tempering heat buildup. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Qantas fined $90m for illegally sacking ground staff as judge describes airline as ‘the wrong kind of sorry’", "url": "https://www.theguardian.com/australia-news/2025/aug/18/qantas-fine-90m-illegally-sacking-ground-staff-transport-workers-union-covid-federal-court", "id_key": "cac3c74a26e596a31cf4ff8ebf3171b099a66c14963c5454f019f1f646fc1eb2", "summary": "Lawyer for Transport Workers’ Union calls record penalty the ‘darkest day’ in airline’s 105-year history Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Qantas has been fined a record $90m for illegally firing 1,820 baggage handlers and other ground staff in 2020, taking the cost of its controversial outsourcing decision to more than $200m. Justice Michael Lee on Monday handed down his decision on the penalty, nine months after Qantas and the Transport Workers’ Union agreed the airline would pay $120m in compensation to the sacked workers. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Air Canada flight attendants to defy back-to-work order and remain on strike", "url": "https://www.theguardian.com/world/2025/aug/17/government-orders-striking-air-canada-flight-attendants-return-work", "id_key": "0559fb8faeb1d326fb1ba79061012e5aad42fd4e416ebfddefec691a200cb4fe", "summary": "Union to challenge order issued less than 12 hours after start of action that has left more than 100,000 travellers stranded Air Canada’s flight attendants plan to remain on strike, their union has said, defying government efforts to force them back to work and into binding arbitration over a dispute that has left more than 100,000 travellers stranded around the world during the peak summer travel season. About 10,000 flight attendants who work for Canada’s largest airline walked out on the job early on Saturday amid a bitter dispute over what the union has described as “poverty wages” and unpaid labour. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Thieves steal $2m in jewelry in under two minutes at Seattle store", "url": "https://www.theguardian.com/us-news/2025/aug/16/seattle-jewelry-store-robbery", "id_key": "68811ba6ccb9f4a5c6881f7d43ca92b0017284dc5bf7b792231cb81a24d8a6bb", "summary": "Brazen daytime robbery involved four masked suspects taking diamonds, luxury watches and gold, police say Smash-and-grab thieves in Seattle made off with an estimated $2m in diamonds, luxury watches, gold and other items in a daring midday jewelry store robbery that took just about 90 seconds, police said on Friday. Video from the west Seattle store’s surveillance cameras shows four masked suspects shattering the locked glass front door with hammers and then ransacking six display cases on Thursday. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Cyprus welcomes resignation of UK trade envoy after visit to occupied north", "url": "https://www.theguardian.com/world/2025/aug/16/no-room-for-tolerance-cyprus-greets-resignation-of-uk-trade-envoy-after-visit-to-breakaway-north", "id_key": "78206ce1730bddd1ae8dbe6f4f59f2de0241c7a73fdd1553098fc9ea728d7a07", "summary": "Afzal Khan had said visit to Turkish-occupied northern Cyprus was in personal capacity but resigned after furore Cyprus has welcomed the resignation of the UK’s trade envoy to Turkey, Afzal Khan, saying it sends “a resounding message” amid widespread criticism of the Labour MP’s recent visit to the island’s breakaway Turkish-occupied north. Khan had defended his trip on 8 August in a letter to the British prime minister, Keir Starmer, claiming it was conducted “in a personal capacity during the parliamentary recess”. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "The ugly truth: have Trump’s tariffs finally put an end to Crocs’ 19-year reign?", "url": "https://www.theguardian.com/fashion/2025/aug/17/the-ugly-truth-have-trumps-tariffs-finally-put-an-end-to-crocs-19-year-reign", "id_key": "600c3294138a9927c4f4a08c01111808cb7dbe65c6577a77a6c334d2f8ca1519", "summary": "The Guardian’s Crocs correspondent traces the highs and lows of the rubbery perforated clogs that divide opinion I’ve been the Guardian’s Crocs correspondent for 19 years now, and get wheeled out for highs and lows. This is a definite low for the rubbery perforated clogs: the share price is down nearly 30% – its lowest level for three years – and revenues are expected to drop by between 9% and 11% in the current quarter. To blame? Donald Trump mostly, and his tariffs. It’s not the first time Crocs have suffered at the hands – or feet – of a Republican US president, as it happens. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "How can England possibly be running out of water?", "url": "https://www.theguardian.com/news/ng-interactive/2025/aug/17/how-can-england-possibly-be-running-out-of-water", "id_key": "a9280e5a0441684df94b34f85735de375fc252db5f6abf95af7467d267274bfb", "summary": "While famously rainswept, climate crisis, population growth and profligacy mean the once unthinkable could be possible During the drought of 2022 , London came perilously close to running out of water. Water companies and the government prayed desperately for rain as reservoirs ran low and the groundwater was slowly drained off. Contingency plans were drafted to ban businesses from using water; hotel swimming pools would have been drained, ponds allowed to dry up, offices to go uncleaned. If the lack of rainfall had continued for another year, it was possible that taps could have run dry. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "‘People have a right to be happy’: the former Waitrose boss on how the UK can boost productivity", "url": "https://www.theguardian.com/money/2025/aug/16/right-to-be-happy-former-waitrose-boss-mark-price-uk-productivity", "id_key": "2a7aa08e20a2be067753de0ad131e6b23050ff8fede8cc0aabd14bd505a451d1", "summary": "Mark Price says solving worker misery will get people back into the labour market and spur the growth the government seeks Is being happy at work the key to the UK government’s goal of boosting productivity and economic growth? The former Waitrose boss turned big company adviser Mark Price certainly thinks so. Solving widespread worker unhappiness would be good for the UK’s army of workers and getting people back into the workforce, as well as being the answer to many of Britain’s economic woes, he says. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Farmers in US midwest squeezed by Trump tariffs and climate crisis", "url": "https://www.theguardian.com/us-news/2025/aug/16/farmers-trump-tariffs-climate-change", "id_key": "243b0230a6ee99c8cad7e4f1022c42ebbb21c135646b39534054206fa886a518", "summary": "Excess rainfall has fueled disease and pest pressure in Ohio’s soybean fields as a trade war with China puts farmers’ biggest export market in doubt Seventh-generation farmer Brian Harbage grows corn, soybeans and grass, and runs a cattle operation across five counties in western Ohio. In the world of agriculture, his work makes up a large business. And still, the past two years have been immensely challenging amid the twin threats of the climate crisis and the Trump administration . Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "‘Quite a project’: refurbishing the chains of Clifton Suspension Bridge", "url": "https://www.theguardian.com/uk-news/2025/aug/16/refurbishment-clifton-suspension-bridge-bristol", "id_key": "582bc560f4e8dca1908f4be9888137ae150efdd23cd9e1ca2a8c7ec30fe0b1fe", "summary": "Isambard Kingdom Brunel’s 1864 structure still has 99% of its original ironwork but needs preserving and sprucing up It is a bit like that awkward job of painting behind a radiator – but on a vast scale and while perched high above a river gorge atop gently swaying scaffolding. The challenging task of preserving and sprucing up Clifton Suspension Bridge ’s wrought-iron chains, which needs to be done every 25 years, is in full swing. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "The never-ending drama of dealing with errant energy companies", "url": "https://www.theguardian.com/money/2025/aug/18/the-never-ending-drama-of-dealing-with-errant-energy-companies", "id_key": "eb2ae38df718e896612f4550e47fc7c4e2b1a4b1a05db019f5dbfa763bd6d89b", "summary": "Three horror stories with familiar plots, dramatic twists and farcical surprises Energy companies are never far from drama. Always creating new plots with twists and surprises, they have been gaslighting cowering customers for years. Here are three acts that should keep you on the edge of your seat. Act I Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "These exercise apps reward steps with freebies – but which ones are worth the effort?", "url": "https://www.theguardian.com/money/2025/aug/16/exercise-apps-reward-steps-freebies-which-ones-worth-the-effort-paace-betterpoints-sweatcoin", "id_key": "48132125a0ba70097e294d54e6faa40ead42cf4e422dcd8af66bbc74842b11cc", "summary": "The walk to work could earn you rewards such as cheaper coffee or Amazon discounts. We put the apps through their paces Getting your steps in could do more than just lift your mood: walking is linked to lower rates of depression and anxiety; better cardiovascular health; and improved memory. The NHS says just 10 minutes of brisk walking a day is enough to make a difference. And alongside health benefits, your steps could also earn you rewards such as coffee and other small treats, thanks to a growing number of apps that turn your footsteps into freebies. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:32Z", "source": "Guardian_Business", "title": "Warm home discount: why you must check your name is on your energy bill", "url": "https://www.theguardian.com/money/2025/aug/16/warm-home-discount-why-you-must-check-your-name-is-on-your-energy-bill", "id_key": "5014769ff8afd005b3986d6498b154399f324df38b1b0a92c3c45e015f429518", "summary": "The government is urging people to act before 24 August after it expanded eligibility for the £150 discount The government is urging people who qualify for the warm home discount to check they are named on their energy bills so that this winter’s price cut can be made automatically. The annual scheme gives households on low incomes £150 off their electricity bill, and is applied by the energy companies rather than sent out to customers. To qualify, you or your partner need to receive one of a list of benefits. These include housing benefit, income-based jobseeker’s allowance and pension credit. Continue reading...", "ingested_utc": "2025-08-18T08:55:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:33Z", "source": "Guardian_World", "title": "Two decades of leftwing dominance end in Bolivia as rightwingers head to election runoff", "url": "https://www.theguardian.com/world/2025/aug/18/bolivia-presidential-election-preliminary-results", "id_key": "4c673cc98b4c4c6f570cf3194fb52404a0dbdab6008ae9bd1fe23507dba31065", "summary": "Movimiento al Socialismo’s time runs out as economic crisis grips country Bolivia’s presidential election will go to a runoff for the first time, with two rightwing candidates competing for the presidency – marking the end of nearly 20 years of dominance by the leftist Movimiento al Socialismo (Mas). The candidate with the most votes, however, turned out to be a surprise: centre-right senator Rodrigo Paz Pereira, 57, who had started the campaign with just 3% support in opinion polls. Continue reading...", "ingested_utc": "2025-08-18T08:55:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:33Z", "source": "Guardian_World", "title": "Outback Wrangler star asked colleague to take paralysed pilot’s phone from hospital after fatal crash, court told", "url": "https://www.theguardian.com/australia-news/2025/aug/18/outback-wrangler-court-helicopter-pilot-ntwnfb", "id_key": "dc15dd3d4053f8067e8fd86b68d526fcf3bf5cf2bf396e375026991386d82c03", "summary": "Reality TV star Matt Wright has pleaded not guilty to three charges of attempting to pervert the course of justice Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Reality TV star Matt Wright told an associate to collect the phone of a severely injured pilot following a fatal helicopter crash, a jury has heard. The Outback Wrangler star has pleaded not guilty to three counts of attempting to pervert the course of justice in the Northern Territory supreme court in Darwin. Continue reading...", "ingested_utc": "2025-08-18T08:55:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:33Z", "source": "Guardian_World", "title": "Andrew Leigh backs cancellation of Israeli MP’s visa – as it happened", "url": "https://www.theguardian.com/australia-news/live/2025/aug/18/politics-ebikes-qantas-lambie-gaza-palestine-danielle-wood-productivity-tax-reform-roundtable-anthony-albanese-jim-chalmers-ntwnfb", "id_key": "259c87addf066ca69a26e5a173c668302874252818d4ec505652f1b7ba99033f", "summary": "This blog is now closed Get our breaking news email , free app or daily news podcast Shadow education minister says childcare safety reforms should come more quickly Jonno Duniam , the shadow minister for education, said governments on both sides of the spectrum had failed for years to institute reforms on the childcare sector, issuing calls for the Labor government and states to act quickly to make such changes. Both governments of all persuasions have dropped the ball. The government I was a part of dropped the ball. We should have acted on that at the time. The fact that we didn’t and the fact that we are now hearing these stories means we failed. But regardless of who was in power and who didn’t do what, here we are today and we need to act. With the resources of eight states and territories and the commonwealth combined, I would be absolutely stunned if we could not get this thing off the ground in the next few weeks. So I hope that things do speed up. I hope that the end result is a national system. Continue reading...", "ingested_utc": "2025-08-18T08:55:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:33Z", "source": "Guardian_World", "title": "Trump piles pressure on Zelenskyy before European leaders arrive in Washington", "url": "https://www.theguardian.com/world/2025/aug/18/trump-ukraine-crimea-nato-zelesnkyy-washington-meeting", "id_key": "46e7e07d4ac2d9f268f30a4831099aea4e639e8040f5d68f5ba6cb61e3c07c50", "summary": "US president tells Ukraine leader to give up Nato and Crimea ambitions in run-up to White House talks Russia-Ukraine war – latest news updates Donald Trump has put pressure on Volodymyr Zelenskyy before talks in Washington with European leaders on Monday, saying the Ukrainian leader could end the war “almost immediately” if he wanted to. The US president also ruled out allowing Ukraine to join Nato or retake Russian-occupied Crimea as part of negotiations with Moscow. Trump posted the remarks on his Truth Social platform on Sunday night, hours before he was due to meet the leaders of Britain, Finland, France, Germany, Italy, the EU and Nato at the Oval Office, amid fears the US president could try to pressure Kyiv into accepting a settlement favourable to Moscow. Continue reading...", "ingested_utc": "2025-08-18T08:55:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:33Z", "source": "Guardian_World", "title": "Protests in Israel as government prepares for new offensive on Gaza City – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/18/israel-protests-government-new-offensive-gaza-city-middle-east-latest-updates-news", "id_key": "849c86b5ab7a859defb8421d1f1360447944ed32408de31d49809e180059f949", "summary": "Estimated 500,000 people gather in Tel Aviv to demand end to war and release of hostages; Amnesty International accuses Israel of enacting ‘deliberate policy’ of starvation in Gaza The first time I met Al Jazeera’s Gaza team lead, Tamer Almisshal, was in July last year. His team had already buried two journalists , Hamza al-Dahdouh and Samer Abu Daqqa. The rest, he told me, were hungry. They were also dealing with trying to get hold of protective gear, threats from the Israel Defense Forces (IDF) and the killing of family members. Ismail al-Ghoul hadn’t seen his wife and child in months and was missing them intensely. Hossam Shabat , Mohammed Qraiqea and Anas al-Sharif were asking for time to secure food in the morning before they could start reporting. Today, they are all dead. I spoke with various members of the Gaza team while writing a profile of Gaza’s veteran reporter Wael al-Dahdouh, who lost his wife, three of his children and grandson. All spoke of their work as a duty that needed to be carried out despite the risks. Three members of that team have since been killed in a chain of assassinations. Each time I sent condolences, the response was always that the coverage would not cease. “We are continuing,” the Gaza editor told me last week, after he lost his entire Gaza City team in the targeted strike that claimed the lives of Sharif, Mohammed Nofal, Ibrahim Thaher and Qraiqea. “We will not betray their message, or their last wishes.” Continue reading...", "ingested_utc": "2025-08-18T08:55:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:33Z", "source": "Guardian_World", "title": "Labour needs to ‘pick things up’ after a ‘tough’ first year, says Sadiq Khan – UK politics live", "url": "https://www.theguardian.com/politics/live/2025/aug/18/uk-politics-live-news-updates-labour-sadiq-khan-conservatives", "id_key": "7ad2dfda66e2df8ef2199a86b63eeb0c25f9d1dfd80ec50c619a784cf4dbc05b", "summary": "London mayor says he has ‘confidence we will turn it round’ as he addresses audience at Edinburgh fringe The former home secretary Jack Straw has urged Labour not to panic about the threat of Reform, who are riding high in the polls as Nigel Farage capitalises on the “small boats” and asylum backlog issue. Here is an extract from the write up of the interview he gave to the Guardian’s deputy political editor, Jessica Elgot : In an interview with the Guardian, he praised Starmer’s intention to recognise a Palestinian state after an ultimatum to Israel – but defended the home secretary, Yvette Cooper, saying he would also have proscribed the direct action group Palestine Action. The British political veteran said he believed Starmer and his cabinet were “head and shoulders” above opposition politicians and would reap the rewards of a gradual improvement in the economy and public services, which would not come immediately. Continue reading...", "ingested_utc": "2025-08-18T08:55:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:33Z", "source": "Guardian_World", "title": "Labour 2-0 down but has time to turn things around, says Sadiq Khan", "url": "https://www.theguardian.com/politics/2025/aug/18/labour-sadiq-khan", "id_key": "14225dc7988cc2082ba539479e4a7465d31dee0c7648f3afe85fa70675b93d03", "summary": "London mayor says party supporters would be ‘delusional’ if they did not recognise difficulties party has had Labour would be 2-0 down were its time in government a football match, one of the party’s most senior figures has said, as he admitted its first year in office has been difficult. But Sadiq Khan stressed Labour still had plenty of time to win round the public. Speaking at the Edinburgh festival fringe, the London mayor said Labour supporters would be “delusional” if they did not recognise the difficulties the party had had since winning power in July 2024. Continue reading...", "ingested_utc": "2025-08-18T08:55:33Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:52Z", "source": "CryptoSlate", "title": "Solana smashes 107,000 TPS milestone sparking questions about real world use", "url": "https://cryptoslate.com/solana-smashes-107000-tps-milestone-sparking-questions-about-real-world-use/", "id_key": "4ad9b0c38a432cbdb2d45e242b506c78a887293af5578d31d887a80efcc2a7bb", "summary": "Solana processed more than 100,000 transactions per second during a recent stress test, marking a new milestone in the network’s scaling efforts. The mainnet block briefly peaked at 107,540 TPS through high-load “noop” program calls, according to data shared over the weekend, showing the upper bound of Solana’s current infrastructure. Developers clarified that the test […] The post Solana smashes 107,000 TPS milestone sparking questions about real world use appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T08:55:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:52Z", "source": "CryptoSlate", "title": "Bitcoin risks further slide toward $112,000 after surprise market correction", "url": "https://cryptoslate.com/bitcoin-risks-further-slide-toward-112000-after-surprise-market-correction/", "id_key": "547339ae0bcadef49265c4f2eb18b30a93fa4f8b9b280d5665689fdcbc550e54", "summary": "Bitcoin (BTC) and Ethereum (ETH) opened the week with notable losses, as the two leading cryptocurrencies retreated from their recent highs. According to CryptoSlate’s data, Bitcoin fell more than 3% over the past 24 hours, slipping from above $118,000 to around $115,303 at the time of writing. Ethereum followed suit, dropping roughly 4% to $4,270 […] The post Bitcoin risks further slide toward $112,000 after surprise market correction appeared first on CryptoSlate .", "ingested_utc": "2025-08-18T08:55:52Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:55:56Z", "source": "CoinJournal", "title": "Metaplanet adds 775 Bitcoin to treasury amid market pullback", "url": "https://coinjournal.net/news/metaplanet-adds-775-bitcoin-to-treasury-amid-market-pullback/", "id_key": "cc66177bd129fdcc8ed8a27362d4936e13d9c914070ded8b49f3703a28f05840", "summary": "Simon Gerovich said the company acquired the bitcoins at an average cost of $120,006 each. Metaplanet began implementing its Bitcoin accumulation strategy in April 2024. With the latest purchase, Metaplanet’s total bitcoin holdings have risen to 18,888 BTC, valued at about $1.94 billion. Metaplanet, a Japanese Bitcoin treasury company, has purchased an additional 775 BTC […] The post Metaplanet adds 775 Bitcoin to treasury amid market pullback appeared first on CoinJournal .", "ingested_utc": "2025-08-18T08:55:56Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:57:44Z", "source": "NYTimes_World", "title": "At China’s Humanoid Robot Games, Athletes Fell Down a Lot", "url": "https://www.nytimes.com/2025/08/18/world/asia/china-humanoid-robot-games.html", "id_key": "8b568e6dfaaa122e5bda0b2242309bb41a7dfd7a316752892edd9b0122a072c8", "summary": "The Humanoid Robot Games in Beijing — featuring running, kickboxing and soccer — highlighted advancements in robotics. Limitations, too.", "ingested_utc": "2025-08-18T08:57:44Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:58:32Z", "source": "FinancialPost_Business", "title": "1.4M consumers missed a credit payment in second quarter: Equifax report", "url": "https://financialpost.com/pmn/1-4m-consumers-missed-a-credit-payment-in-second-quarter-equifax-report", "id_key": "2ef0f783b1ccf02f34ee2cb0acccc2f471c52d7c98cb47ba2120e113783137d4", "summary": "TORONTO — There’s a deepening divide among consumers, even as the rate of missed credit payments dipped, a new Equifax Canada report shows. It shows 1.4 million Canadians missed a credit payment in the second quarter. While that’s up by 118,000 compared with the same time last year, it’s down slightly from the first quarter. […]", "ingested_utc": "2025-08-18T08:58:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:58:32Z", "source": "FinancialPost_Business", "title": "International Petroleum Corporation Announces Results of Normal Course Issuer Bid", "url": "https://financialpost.com/globe-newswire/international-petroleum-corporation-announces-results-of-normal-course-issuer-bid-90", "id_key": "bc4716c584449054de846305a6b05e880152b66d9618436c34b76a75c733fb71", "summary": "TORONTO, Aug. 18, 2025 (GLOBE NEWSWIRE) — International Petroleum Corporation (IPC or the Corporation) (TSX, Nasdaq Stockholm: IPCO) is pleased to announce that IPC repurchased a total of 144,952 IPC common shares (ISIN: CA46016U1084) during the period of August 11 to 15, 2025 under IPC’s normal course issuer bid / share repurchase program (NCIB). IPC’s […]", "ingested_utc": "2025-08-18T08:58:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T08:58:32Z", "source": "FinancialPost_Business", "title": "European Gas Falls to New 2025 Low Before Zelenskiy-Trump Talks", "url": "https://financialpost.com/pmn/business-pmn/european-gas-falls-further-ahead-of-zelenskiy-trump-meeting", "id_key": "42ea72c55425eb92bf825fbb9c92ab74689ef75d18487220fc95eb0e429cfbca", "summary": "European natural gas prices fell to a fresh 2025 low ahead of US President Donald Trump’s meeting with Ukraine’s Volodymyr Zelenskiy, who faces pressure to reach a peace deal with Russia that involves ceding territory.", "ingested_utc": "2025-08-18T08:58:32Z"}
