{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:30Z", "source": "BBC_Business", "title": "Why is UK inflation still rising?", "url": "https://www.bbc.com/news/articles/c17rgd8e9gjo?at_medium=RSS&at_campaign=rss", "id_key": "b2099f0fdcb6e1f9d7a04c2371fd882af4e698e3c1fa267f18bd51a649999e81", "summary": "UK Inflation has fallen from record highs but remains above the Bank of England's 2% target.", "ingested_utc": "2025-08-20T08:44:30Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:30Z", "source": "BBC_Business", "title": "What are interest rates and will they fall further?", "url": "https://www.bbc.com/news/articles/c3dky111m40o?at_medium=RSS&at_campaign=rss", "id_key": "780f465619d9e1da0175bd1dad8e0e265bd768550dcc28f5c39d6bccac601267", "summary": "The interest rate set by the Bank of England affects mortgage, loan and savings rates for millions.", "ingested_utc": "2025-08-20T08:44:30Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:32Z", "source": "Guardian_World", "title": "Fireball lights up sky over western Japan", "url": "https://www.theguardian.com/science/2025/aug/20/fireball-lights-up-sky-japan", "id_key": "770f1ce323ba75acf7b5cb3368ec837e95acf29182d9400b7c2444b49e998ac4", "summary": "Flashing light visible for hundreds of miles was an exceptionally bright meteor, say experts A flashing fireball dashed across the skies of western Japan, shocking residents and dazzling stargazers, though experts said it was a natural phenomenon and not an alien invasion. Videos and photos emerged online of the extremely bright ball of light visible for hundreds of miles shortly after 11.00pm local time (1400 BST) on Tuesday. Continue reading...", "ingested_utc": "2025-08-20T08:44:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:32Z", "source": "Guardian_World", "title": "Details of Monash IVF review to remain secret – as it happened", "url": "https://www.theguardian.com/australia-news/live/2025/aug/20/australia-news-live-bruce-lehrmann-federal-court-appeal-network-10-lisa-wilkinson-brittany-higgins-parliament-productivity-economic-reform-roundtable-ntwnfb", "id_key": "7f445f7c71c5a2d8b6dde4dd84857e96dae22bfe99f052c2993b72ccf80144b0", "summary": "This blog is now closed Get our breaking news email , free app or daily news podcast As I noted in my hello earlier, rain is on the brain in Sydney, with a deluge set to continue for days. Melbourne is cold, but lovely, and Adelaide and Hobart are both expecting sunshine today. Brisbane, Perth and Canberra are in for rain. Continue reading...", "ingested_utc": "2025-08-20T08:44:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:32Z", "source": "Guardian_World", "title": "University of Melbourne breached students’ privacy by using wifi network to monitor pro-Palestine protest", "url": "https://www.theguardian.com/australia-news/2025/aug/20/university-of-melbourne-surveilled-students-pro-palestine-protest", "id_key": "e3ba8bcb61e178200604ea5ce18418f245bb6fff69fc949a437eaefa3c032bf9", "summary": "Victoria’s deputy information commissioner finds university did not give adequate notice or justification for how location data would be used Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The University of Melbourne (UoM) breached Victoria’s Privacy and Data Protection Act when it used its wifi network to surveil students and staff holding a pro-Palestine protest last May , which could have resulted in a “significant breach of trust”, the state’s deputy information commissioner has found. The investigation, released on Wednesday , was prompted by media reports alleging UoM digitally tracked people at the sit-in to uncover potential misconduct. Continue reading...", "ingested_utc": "2025-08-20T08:44:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:32Z", "source": "Guardian_World", "title": "Trump says US may provide air support to Ukraine as Nato military leaders prepare to meet – Ukraine war live", "url": "https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news", "id_key": "94f201d8ded5981d0b95b15f8660e537efeabe3104eaeae89e785a0dcf40992b", "summary": "US president rules out putting troops on the ground to back Ukraine peace deal, as military leaders set to meet to discuss further support for country An object which fell and exploded in a cornfield in eastern Poland may have been a component of an old propeller engine, the Polish army said on Wednesday, adding that there had been no violation of Poland’s airspace from Ukraine or Belarus. Police had earlier announced that an unidentified object had fallen in a field in the village of Osiny in eastern Poland’s Lublin province, which borders Ukraine. “...after conducting preliminary analyses of radar system records, no violation of Polish airspace was recorded last night from either Ukraine or Belarus,” the Operational Command of the Polish Armed Forces said on X. Continue reading...", "ingested_utc": "2025-08-20T08:44:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:32Z", "source": "Guardian_World", "title": "Vienna announced as host city for Eurovision song contest 2026", "url": "https://www.theguardian.com/tv-and-radio/2025/aug/20/vienna-host-city-eurovision-song-contest-2026", "id_key": "6523321555f05f7b7946773779f8465f9916078a8f30badb4353532f800efaf5", "summary": "Final of 70th edition of competition to be held on 16 May at the Wiener Stadthalle, Austria’s largest indoor arena Vienna has been chosen to host the Eurovision song contest 2026, the world’s biggest live televised music event, Austria’s public broadcaster announced, with the final set for 16 May. Austria’s JJ won this year’s competition, held in Basel in Switzerland, with his song Wasted Love, which blends techno beats with operatic vocals – making his home country the 2026 host. Continue reading...", "ingested_utc": "2025-08-20T08:44:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:32Z", "source": "Guardian_World", "title": "Government looking at contingency options for where to house asylum seekers after Epping court ruling – UK politics live", "url": "https://www.theguardian.com/politics/live/2025/aug/20/government-housing-asylum-seekers-epping-court-injunction-uk-politics-latest-updates-news", "id_key": "37fa1d72d5c7e9d643de3674287e07b313fd92764abe58cca67699a1e5ce93d7", "summary": "Security minister Dan Jarvis says government is considering options after council granted injunction to stop people being placed at the Bell hotel Chancellor Rachel Reeves said there was “more to do to ease the cost of living” after the latest official figures showing UK inflation rose by more than expected last month. According to the PA news agency, Reeves said: We have taken the decisions needed to stabilise the public finances, and we’re a long way from the double-digit inflation we saw under the previous government, but there’s more to do to ease the cost of living. That’s why we’ve raised the minimum wage, extended the £3 bus fare cap, expanded free school meals to over half a million more children and are rolling out free breakfast clubs for every child in the country. Continue reading...", "ingested_utc": "2025-08-20T08:44:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:32Z", "source": "Guardian_World", "title": "Reeves considering tax on high-value homes to help plug hole in finances", "url": "https://www.theguardian.com/politics/2025/aug/20/rachel-reeves-considering-tax-expensive-homes", "id_key": "b8420b01d7b86e3f6b78fd6a7cd444de76ffd567c78c002cdae341f068e2acc2", "summary": "Reported plans could raise up to £40bn while preserving pledge not to raise income tax, VAT or national insurance UK politics live – latest updates Rachel Reeves is considering plans for a tax on expensive homes in an effort to raise billions of pounds and close a large hole in the public finances. The chancellor has ruled out increases to income tax, VAT and national insurance, but Treasury officials have been tasked with exploring other options to boost revenue. Continue reading...", "ingested_utc": "2025-08-20T08:44:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:51Z", "source": "CryptoSlate", "title": "Pump Fun reclaims Solana memecoin launchpad dominance with 62% revenue share over two weeks", "url": "https://cryptoslate.com/pump-fun-reclaims-solana-memecoin-launchpad-dominance-with-62-revenue-share-over-two-weeks/", "id_key": "15b7f824aec6b8ba2017618815425a1a9ffb1b352a612abced7a8e921ee6a8da", "summary": "Pump.fun has regained its status as the largest memecoin launchpad on Solana over the past two weeks. The dominance is evident in both revenue generation and trading volume. According to data from Blockworks, Pump.fun dominated 62% of all revenue generated from Aug. 4 to Aug. 17, which amounts to nearly $16.7 million. Regarding trading volume, […] The post Pump Fun reclaims Solana memecoin launchpad dominance with 62% revenue share over two weeks appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T08:44:51Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:55Z", "source": "CryptoNews", "title": "Harvard Economist Who Predicted Bitcoin Crashing to $100 Admits He Was Wrong", "url": "https://cryptonews.com/news/harvard-economist-who-predicted-bitcoin-crashing-to-100-admits-he-was-wrong/", "id_key": "2e7062478dcdce508b3aa18b1db80028d01aa2df9a38d8d5248db8f052279378", "summary": "Harvard economist Kenneth Rogoff publicly admits his decade-old prediction that Bitcoin would crash to $100 was fundamentally flawed, acknowledging three critical miscalculations about U.S. crypto regulation, the $20 trillion underground economy, and massive government cryptocurrency holdings while Bitcoin trades above $115,000. The post Harvard Economist Who Predicted Bitcoin Crashing to $100 Admits He Was Wrong appeared first on Cryptonews .", "ingested_utc": "2025-08-20T08:44:55Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:55Z", "source": "CryptoNews", "title": "Core Foundation, Hex Trust Partner to Bring Bitcoin Staking to APAC, MENA Clients", "url": "https://cryptonews.com/news/core-foundation-hex-trust-partner-to-bring-bitcoin-staking-to-apac/", "id_key": "4ca0ddf7b72ed9823dcd0cd0e7526be1f5fbb892fe4a3d4371ef2e23b359ed1a", "summary": "Core Foundation’s “dual stalking technology” will integrate with Hex Trust’s regulatory-compliant custody infrastructure to offer Bitcoin staking for institutional clients in APAC and MENA regions. The post Core Foundation, Hex Trust Partner to Bring Bitcoin Staking to APAC, MENA Clients appeared first on Cryptonews .", "ingested_utc": "2025-08-20T08:44:55Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:58Z", "source": "CoinJournal", "title": "SoFi Bank to start using Bitcoin for cross-border payments", "url": "https://coinjournal.net/news/sofi-bank-to-start-using-bitcoin-for-cross-border-payments/", "id_key": "329b1e2c71007f95220d9e30f58d4d2cab54ed31d5ffe8bccfd470531031db14", "summary": "SoFi will enable instant cross-border transfers using Bitcoin and UMA. Transfers will convert USD to Bitcoin via Lightning, then to local currency. The service will first launch in Mexico with lower fees than traditional remittances. SoFi Bank is preparing to shake up the global remittance industry by introducing a blockchain-powered international money transfer service. The […] The post SoFi Bank to start using Bitcoin for cross-border payments appeared first on CoinJournal .", "ingested_utc": "2025-08-20T08:44:58Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:44:58Z", "source": "CoinJournal", "title": "Bitcoin, Ether ETFs record heavy outflows as traders await Fed signals", "url": "https://coinjournal.net/news/bitcoin-ether-etfs-record-heavy-outflows-as-traders-await-fed-signals/", "id_key": "276999a8e7052d6ed2e558d1c588fb737fcab71cccbf678f146d1f0222e1c62a", "summary": "Data from SoSoValue showed spot Bitcoin ETFs recorded daily net outflows of $523 million on Tuesday. Spot Ether ETFs experienced $422.3 million in total net outflows, according to SoSoValue. Investors are now waiting for additional cues, including the release of minutes from the FOMC’s July meeting later on Wednesday. US spot Bitcoin and Ether exchange-traded […] The post Bitcoin, Ether ETFs record heavy outflows as traders await Fed signals appeared first on CoinJournal .", "ingested_utc": "2025-08-20T08:44:58Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:46:56Z", "source": "NPR_Top", "title": "Israeli military will call up 50,000 reservists as it plans new phase of war in Gaza", "url": "https://www.npr.org/2025/08/20/nx-s1-5507976/israel-palestinians-reservists-war-gaza", "id_key": "26f01371587ab8ad66bf550920d10e2f8809ff722392c5f39c7a880089620159", "summary": "An Israeli official said that the military will be operating in parts of Gaza City where the Israeli military has not yet operated and where Hamas is still active.", "ingested_utc": "2025-08-20T08:46:56Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:46:59Z", "source": "FT_Home", "title": "Reeves explores reform of capital gains tax on expensive houses", "url": "https://www.ft.com/content/a08a6992-3d0e-4ecf-9e9e-fc5ebf832659", "id_key": "0b602c88caa4f495ceb91d2e40b6a372cbfd26981181e2070f6f355ed313cb67", "summary": "UK Treasury considers overhaul of property levies as ministers confront hole in public finances of at least £20bn", "ingested_utc": "2025-08-20T08:46:59Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:46:59Z", "source": "FT_Home", "title": "UK councils weigh legal action on asylum hotels after Epping court win", "url": "https://www.ft.com/content/bbb18ba7-9f06-4952-8fc6-ac96dc8aa942", "id_key": "e6448a1afb9220d24a7ff8b861e1a843ac93beb54ff50be52cad782d84f74402", "summary": "High Court grants Epping Forest injunction against local hotel that blocks housing of asylum seekers there following wave of anti-immigration protests", "ingested_utc": "2025-08-20T08:46:59Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:47:00Z", "source": "FT_Markets", "title": "Figma rival Canva valued at $42bn as IPO rumours swirl", "url": "https://www.ft.com/content/fbf2c84c-81bd-4349-88ca-efbff5fb3c89", "id_key": "9bc4541b89130fef7144531e0596ab33ff9eee233ea724a3ee68f1325d2f842f", "summary": "One of Australia’s most valuable technology companies kicks off employee share sale", "ingested_utc": "2025-08-20T08:47:00Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:47:28Z", "source": "TheStreet_Top", "title": "Amazon is selling wireless Echo earbuds with a 'fantastic sound and fit' for $25 off", "url": "https://www.thestreet.com/deals/echo-buds-wireless-earbuds-alexa-amazon-sale", "id_key": "c2aa886c3a9ced46b54c423a69682196a95d181bd44c678ddd01ace5ad150bfe", "summary": "\"After a few minutes, you forget you've got them on.\"", "ingested_utc": "2025-08-20T08:47:28Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:47:39Z", "source": "FinancialPost_Business", "title": "Sweden Central Bank Holds Rates, Still Signals Cut This Year", "url": "https://financialpost.com/pmn/business-pmn/sweden-central-bank-holds-rates-still-signals-cut-this-year", "id_key": "0dcc228ef888bc8957f74efb9d3b94ee4bbcc88140e8b0deab98dfb580aa4818", "summary": "Sweden’s central bank kept interest rates steady to parry a recent spike in inflation and reiterated the prospect of a cut later this year to support a struggling economy.", "ingested_utc": "2025-08-20T08:47:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:47:39Z", "source": "FinancialPost_Business", "title": "Small Changes, Big Impact: The 5-Hour Productivity Hack Could Boost Canada’s GDP by 1.2%", "url": "https://financialpost.com/globe-newswire/small-changes-big-impact-the-5-hour-productivity-hack-could-boost-canadas-gdp-by-1-2", "id_key": "100b0d0107bb56bd0435aa0740b4e0f48a41cba70eac35d7b957c72c8202c9d5", "summary": "MONTREAL, Aug. 20, 2025 (GLOBE NEWSWIRE) — Canada’s long-standing productivity gap has been a persistent concern—but BDC suggests a surprisingly simple way to take action: the 5-hour hack. According to the Business Development Bank of Canada, if every small and medium-sized business (SME) in the country gained just five hours of work per month, the […]", "ingested_utc": "2025-08-20T08:47:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T08:47:39Z", "source": "FinancialPost_Business", "title": "Group files greenwashing complaint with securities watchdog against Enbridge, Cenovus", "url": "https://financialpost.com/pmn/group-files-greenwashing-complaint-with-securities-watchdog-against-enbridge-cenovus", "id_key": "0565ad095810a44db18576f29927c68b04ba8c95b411ac60b296a289512461c3", "summary": "CALGARY — A shareholder advocacy group has filed a greenwashing complaint with Alberta’s securities watchdog alleging Cenovus Inc., one of Canada’s biggest oilsands producers, and Enbridge Inc., the country’s biggest crude pipeline operator, have misled investors in their environmental disclosures. Investors for Paris Compliance, which seeks to hold publicly traded companies accountable for their climate […]", "ingested_utc": "2025-08-20T08:47:39Z"}
