{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T16:51:38Z", "source": "Guardian_World", "title": "Police clash with protesters as asylum hotel demonstrations take place in UK", "url": "https://www.theguardian.com/world/2025/aug/23/police-clash-with-protesters-as-asylum-hotel-demos-take-place-across-uk", "id_key": "cd0ba69913cacbeb5a351cdf0054bef4874e93b71bd3d64c471d3ab61cf0885a", "summary": "Counter-protests also taking place, with police separating rival groups in Bristol Protesters have clashed with police as demonstrations against hotels housing asylum seekers began to take place across the UK. Demonstrations under the “Abolish Asylum System” slogan were being held in towns and cities across England, including Bristol, Exeter, Tamworth, Cannock, Nuneaton, Liverpool, Wakefield, Newcastle upon Tyne, Horley in Surrey and Canary Wharf in central London. Continue reading...", "ingested_utc": "2025-08-23T16:51:38Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T16:54:43Z", "source": "Engadget_All", "title": "MasterClass deal: Get half off subscriptions for Labor Day", "url": "https://www.engadget.com/deals/masterclass-deal-get-half-off-subscriptions-for-labor-day-133223132.html?src=rss", "id_key": "6ed395bfad453592b58a0458df385c36740d814a1f9933d8589c6bbc285701f2", "summary": "If you want to brush up on some skills or learn new ones, MasterClass offers a good way to do just that. The streaming service has hundreds of classes taught by professionals and experts in their fields, and now you can get a subscription for 50 percent less than usual. All MasterClass membership tiers are on sale right now, so you can sign up for as low as $5 per month. With a subscription, you could watch a class on writing taught by James Patterson, or learn cooking techniques from Thomas Keller. If you're trying to impress at your next pickup basketball game you could learn about shooting, ball-handling and scoring from Steph Curry. Each class includes around 20 video lessons that run about 10 minutes long on average, as well as an in-depth workbook. MasterClass has also begun producing some original series for its platform. The series Business Rebels features different CEOs walking viewers through the strategies that helped them disrupt their industries. One entitled Skin Health features top dermatologists and a cosmetic chemist walking viewers through keeping their skin healthy through cleansing routines and specific beauty products. The wide range of skills or life lessons you could learn through these classes is why MasterClass is on our list of best subscriptions you can give as gifts . Maybe your loved one who loves to host dinner parties could use some tips from Gordon Ramsay. There are three subscription tiers for MasterClass that each differ only in how many devices they allow at one time, and whether offline videos are supported. The Standard subscription only supports one device, whereas the Plus subscription allows two. These are normally $10 and $15 per month, respectively, and neither offers offline mode. The Premium tier, which carries a regular price of $20 per month, allows up to six devices and features offline mode for downloaded classes. All three tiers are part of the 50 percent off sale, which marks them down to $5, $8 and $10 respectively. MasterClass bills annually, so be sure to calculate the total from the \"monthly\" price before deciding. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/masterclass-deal-get-half-off-subscriptions-for-labor-day-133223132.html?src=rss", "ingested_utc": "2025-08-23T16:54:43Z"}
