{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:36:30Z", "source": "Guardian_World", "title": "Famine confirmed in Gaza City for first time, UN-backed body says – Israel-Gaza war latest updates", "url": "https://www.theguardian.com/world/live/2025/aug/22/famine-benjamin-netanyahu-palestine-gaza-israel-war-latest-updates", "id_key": "3588df12a157e6dfc21bdb587ce0cb6b64c15739c51446dd38121716e0ed5755", "summary": "‘Famine in Gaza is entirely man-made’, UN-backed food security body says Famine in Gaza confirmation is a “deep stain on our collective humanity,” charity says ActionAid UK have urged the international community to use diplomatic pressure to bring about a permanent ceasefire after Famine was confirmed in Gaza by a UN backed body. There is now a race against time to stop this famine from becoming any further entrenched. Every hour counts and there is no time to waste. The international community must take meaningful action and use diplomatic pressure to bring about a permanent ceasefire immediately. The Famine Review Committee (FRC) has determined that Famine (IPC Phase 5) is now occurring in Gaza Governorate. Furthermore, the FRC projects Famine (IPC Phase 5) thresholds to be crossed in Deir al-Balah and Khan Younis Governorates in the coming weeks. As this Famine is entirely human-made, it can be halted and reversed. The time for debate and hesitation has passed, starvation is present and is rapidly spreading. There should be no doubt in anyone’s mind that an immediate, at-scale response is needed. Any further delay-even by days-will result in a totally unacceptable escalation of Famine-related mortality. • If a ceasefire is not implemented to allow humanitarian aid to reach everyone in the Gaza Strip, and if essential food supplies, and basic health, nutrition, and WASH services are not restored immediately, avoidable deaths will increase exponentially. Continue reading...", "ingested_utc": "2025-08-22T09:36:30Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:36:30Z", "source": "Guardian_World", "title": "Weather tracker: monsoon rains cause deadly floods in Pakistan and India", "url": "https://www.theguardian.com/environment/2025/aug/22/weather-tracker-monsoon-rains-deadly-floods-pakistan-india", "id_key": "15ca3ec8911e1446ce4d1ef2801ef7c5a9882cf2f10ad191da64baea912de0b7", "summary": "More than 300 dead after downpours in mountainous regions and several killed in Indian city of Mumbai Heavy monsoon rains have continued to pummel the Indian subcontinent over the past week, bringing devastating flooding and landslides and leaving hundreds of people dead in what has already been one of the deadliest monsoon seasons in recent years. Moist air surging inland from the Bay of Bengal and the Arabian Sea was driven into Pakistan and north-west India late last week by strong southwesterly monsoon winds. Combined with developing areas of low pressure, this triggered a succession of torrential downpours. Continue reading...", "ingested_utc": "2025-08-22T09:36:30Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:38:01Z", "source": "Erigon_Releases", "title": "v3.1.0-rc1 \"Pebble Paws\"", "url": "https://github.com/erigontech/erigon/releases/tag/v3.1.0-rc1", "id_key": "d372a8ab839fc755e1b743575870832da67f1594bda3ba5d628a8640dda601dd", "summary": "3.1.0 Pebble Paws Erigon 3.1.0 Pebble Paws is a significant update for node operators and validators, focusing on stability, performance, and efficiency. This release introduces several new features and optimizations, including the default enabling of receipt persistence, a smarter snapshots downloader, and numerous consensus layer improvements and official support for Shutter Network on Gnosis Chain. Breaking changes Port of external RPCDaemon now uses the same WebSocket port as the default for Erigon. ( #15643 ) Docker Images: Docker images are now based on Debian. ( #16228 ) Go Language Version: The required Go version is now golang 1.24. Receipt Persistence: The --persist.receipts flag is now enabled by default (more details are provided below). Pebble Paws will be the last Erigon release series to officially support Polygon. How to upgrade Erigon 3.1 Pebble Paws will work flawlessly with old data. For those who want to ensure they have the absolute latest data files and any recent data-specific fixes, you can optionally perform a manual data upgrade. After upgrading your Erigon binary and having done a back-up of your data directory, just run the command erigon snapshots reset --datadir /your/datadir . Key features Disk Footprint and Management Several improvements furtherly reduced the size of the Ethereum archive nodes while actually storing more data, making the nodes more cost-effective and easier to manage: The --persist.receipts flag is now enabled by default for Full and Minimal nodes. This downloads pre-calculated receipts, ensuring a consistent and predictable latency, meaning a more reliable system when interacting with the network, especially during high-traffic periods, and a 10x faster RPC for calls like eth_getLogs . The size of the receipts is 300 GB for the Ethereum mainnet, 1 TB for the Polygon bor-mainnet, and 200 GB for the Gnosis Network. However, this can be disabled with the command --persist.receipts=false . In this case, the RPC calls will generate receipts on demand from the StateHistory. ( #16040 ). The size of .ef files was reduced by 50% with better encoding, resulting in smaller archive nodes. ( #12907 ) Rolled out phase 1 of history expiry, allowing nodes to drop pre-merge data, which significantly reduces storage requirements and simplifies node maintenance. ( #15668 ) Efficiently upgrade the existing data using the new snapshots update and snapshots reset commands , reducing node downtime and resource usage while avoiding a full re-sync. Several optimization have been implemented to reduce latency, lower disk I/O, and optimize VM and snapshot operations, resulting in faster, more efficient node operation and easier maintenance ( #14135 , #14902 , #15115 , #15092 , #16140 ). Networking and Performance Faster and more reliable syncing: the new Bittorrent web seed implementation downloads entire files in a single stream instead of making many small-range HTTP requests, resulting in faster syncing, reduced server load, improved CDN compatibility, and enhanced protection against DDoS attacks. The downloader now automatically switches sources if the snapshot set becomes inaccessible, and once the snapshot files are downloaded, they are marked as read-only to prevent accidental corruption. Torrent logging and status outputs have been upgraded, offering clearer real-time insights into sync speed, estimated completion times, and the root causes of any synchronization stalls. ( #15043 ) A new configuration flag now enables independent tuning of web seeding and peer-to-peer (P2P) download speeds, delivering more control over how data is sourced and transferred. ( #15912 ) Improved and more reliable experience with faster, more accurate RPC responses, improved error handling, and broader support for new features and tools. ( #13795 , #13947 , #14075 , #14093 , #14105 , #14152 , #14803 , #14915 , #14994 , #15948 , #16029 , #16101 ) Smoother Polygon Network experiences with faster syncing, improved reliability, and better compatibility, thanks to a series of targeted bug fixes and optimizations. ( #14056 , #14080 , #13845 , #13807 , #15595 , #16160 , #16035 , #15538 ) The new probabilistic filter makes historical queries much faster and more efficient. ( #15960 ) Protocol Improved Caplin (Consensus Layer) reliability and performance with enhanced slot processing, better peer management, optimized block and attestation handling, new validator deposit toolingAore efficient reorg support. These updates provide smoother network participation, easier validator operations, and improved responsiveness. ( #13825 , #13858 , #13883 , #13893 , #14158 , #14128 , #14913 , #16084 , #16083 , #16219 , #14890 , #14875 ) Engine API and EIP Support: This release includes new Engine API methods like GetBlobsV1 and GetBlobsV2. It also implements various Ethereum Improvement Proposals (EIPs) related to blobs and gas, ensuring compatibility with upcoming network changes. ( #13975 , #15420 ) Added support for the latest protocol upgrades and features—delivering improved compatibility, security, and performance for users. ( #14705 , #14702 , #14672 , #15093 , #15148 , #15450 , #15067 , #15399 , #15519 , #15532 , #15609 , #15688 , #14213 ) Shutter Network Official support for Shutter Network has been added to Erigon Validators on Gnosis Chain, helping prevent malicious Maximal Extractable Value (MEV) attacks by enabling the use of encrypted transactions. ( #13725 , #13864 , #13865 , #13983 , #14187 , #16505 , #16554 , #16561 , #16592 , #16590 ) Further information can be found at https://github.com/erigontech/erigon/tree/release/3.1/txnprovider/shutter#shutter QA and Testing Improvemend testing and QA to deliver more reliable releases and higher quality software by expanding automated testing, enforcing stricter failure checks, and enhancing test coverage for every commit. ( #13783 , #13755 , #14094 , #13926 , #14115 , #14100 , #14178 , #14886 , #14210 , #15499 , #15215 ) Other Improvements Thanks to an updated build infrastructure and streamlined release processes, deployments have improved, becoming more reliable and secure. ( #13869 , #15082 , #15757 , #16228 ) Time-deterministic pruning loop has been introduced, making pruning steps bounded in time, improving predictability and stability, especially for large databases. ( #16069 ) Enabled the fulu devnet2 network, introducing advanced features like validator custody, earliest slot tracking, and blob recovery—empowering developers and node operators to test next-generation consensus and data availability enhancements. ( #15824 ) Changelog Fix a collection of downloader, snapshot sync and torrent related issues by anacrolix in #15043 Add WebSeed download rate flag by anacrolix in #15912 engineeapi, txpool: Implement GetBlobsV1, GetBlobsV2 by somnathb1 in #13975 and #15420 History expiry phase-1 rollout: (Drop Pre-merge data) by Giulio2002 in #15668 Updated config for bor-mainnet Bhilai fork by mh0lt in #15636 time-deterministic prune: step1 by AskAlexSharov in #16069 fulu devnet2 by domiwei in #15824 Polygon Bhilai Fork Updates by mh0lt in #15261 Historical exec bottleneck solved by new probabilistic filter in StateHistory files by AskAlexSharov in #15960 engineapi: Add Pectra banner by somnathb1 in #13785 EngineBlockDownloader: pass heightToDownload when available by yperbasis in #15056 engineapi: add jsonrpc client by taratorio in #14199 Implement ERC-7562 tracer by shohamc1 in #14705 Support RIP-7560 transactions to mining loop by shohamc1 in #14702 Implement EIP-7610 has storage check on create by taratorio in #14672 Implement EIP-7883 ModExp Gas Cost Increase by yperbasis in #15093 Implement EIP-7823: Set upper bounds for MODEXP by yperbasis in #15148 Implement EIP-7825: Transaction Gas Limit Cap by yperbasis in #15450 EIP-7892: Blob Parameter Only Hardforks - 2nd attempt by yperbasis in #15067 execution: EIP-7918: Blob base fee bounded by execution cost by yperbasis in #15399 Add P256Verify for osaka and implement EIP-7951 by somnathb1 in #15519 Add CLZ opcode by Giulio2002 in #15532 EIP-7934: RLP Execution Block Size Limit by taratorio in #15609 EIP-7907: Meter Contract Code Size And Increase Limit by taratorio in #15688 Account Abstraction Execution by shohamc1 in #14213 feehistory.go: optimize the high latency of eth_feeHistory by blxdyx in #14135 reduce disk IO during files merge by AskAlexSharov in #14902 VM OPSwap optimisation by JkLondon in #15115 etl: allocator by AskAlexSharov in #15092 cp: Optimised snapshot read operations for BorEvents by sudeepdino008 in #16140 Caplin: update highest process slot correctly during ForwardSync by Giulio2002 in #13825 Caplin: now respecting max peer count by Giulio2002 in #13858 Caplin: remove beacon blocks filtering by Giulio2002 in #13883 Caplin: removed reusable states in reorg by Giulio2002 in #13893 Caplin: implement encoding for archive node for Queues by Giulio2002 in #14158 Caplin: remove extra delay in attestation production by Giulio2002 in #14128 Caplin: bump default builder boost factor by Giulio2002 in #14913 Caplin: Added validator depositing tooling by Giulio2002 in #16084 Caplin: fully-working peerdas rpc by Giulio2002 in #16083 Caplin: added new queue endpoints for deposit lists by Giulio2002 in #16219 Erigon: add option to use execution network to import blocks by Giulio2002 in #14890 Erigon: optimistic inclusion for deep reorgs by Giulio2002 in #14875 rpcdaemon: Don't set miner by shohamc1 in #13795 jsonrpc: Add comprehensive Quantities validation for eth_getStorageAt by somnathb1 in #13947 rpcdaemon: Set correct txnum for bridge txns by shohamc1 in #14075 txpool: add more cases to return err instead of panicking on invalid Txn cases by somnathb1 in #14093 jsonrpc: Lenient on param check for eth_getStorageAt by somnathb1 in #14105 jsonrpc: add Authorizations to callArgs for eth_estimateGas by somnathb1 in #14152 ethapi: Add blobVersionedHashes to callArgs by somnathb1 in #14803 rpcdaemon: read hdr instead of blocksWithTxs in eth_estimateGas,eth_createAccessList by lupin012 in #14915 rpcdaemon: align response (block not found or txnHash not found) in case remote conf with local one by lupin012 in #16029 rpcdaemon: check BridgeBackend version only on Bor network by canepat in #16101 rpcdaemon: stack-based json stream by canepat in #14994 jsonrpc: implement eth_config by somnathb1 in #15948 Implemented mechanism to deliver mined blocks to block consumer by eastorski in #14056 Removed MiningBorHeimdall stage in mining pipeline if astrid flag is set by eastorski in #14080 polygon/heimdall: fix snapshot store last entity to check in snapshots too by taratorio in #13845 Implemented wait if heimdall is not synced to the chain by eastorski in #13807 proposerPriority from VotingPower to ProposerPriority by fredrik0x in #15595 Add bor init to txpool configuration by mh0lt in #16160 Remove unused polygon sync flags by mh0lt in #16035 Supported heimdall v2 endpoints by eastorski in #15538 qa-tests: execute qa-tests on every commit to the 3.x branch by mriccobene in #13783 qa-tests: improve rpc-integration tests by mriccobene in #13755 qa-tests: use the new dedicated runner for RPC testing by mriccobene in #14094 qa-tests: re-enable eth_estimateGas/test_14 by mriccobene in #13926 workflows: Stricter failure checks for hive tests by somnathb1 in #14115 qa-tests: enable change point analysis on RPC perf tests by mriccobene in #14100 tests: Update EEST fixtures to Vítkov (v4.1.0) release by somnathb1 in #14178 tests: Update EESTs to release v4.4.0 (Stromovka) by somnathb1 in #14886 Upgrade ethereum/tests to v17.0 by yperbasis in #14210 tests: update eest to fusaka-devnet-1@v1.0.0 by yperbasis in #15499 tests: update EEST to v4.5.0 and add fusaka-devnet-0@v1.0.0 fixtures by yperbasis in #15215 shutter: validate decryption keys based on eon info and signatures by taratorio in #13725 shutter: add encrypted and decrypted txn pools by taratorio in #13864 shutter: implement provide txns by taratorio in #13865 txnprovider/shutter: integration tests and fixes by taratorio in #13983 shutter: test cmds to send shutter txns and check validator registrations by taratorio in #14187 Bump builder and base docker images by lystopad in #13869 Upgrade builder image to 1.24-bookworm by lystopad in #15082 Rework Dockerfile, release and snapshot workflows by lystopad in #15757 Update release.yml - debian package dependency by lystopad in #16228 add gdbme flag that starting erigon under gdb (for debug) by JkLondon in #13874 Fix getProof for historical calls by awskii in #15564 Full Changelog : v3.0.15...v3.1.0-rc1 New Contributors Thanks to our first time code contributors: @julienrbrt made their first contribution in #13949 @VolodymyrBg made their first contribution in #13906 @0x0FOG made their first contribution in #13998 @shenpengfeng made their first contribution in #13997 @sjtucoder made their first contribution in #13726 @lemenkov made their first contribution in #14022 @elliothllm made their first contribution in #14052 @Olexandr88 made their first contribution in #14252 @Hopium21 made their first contribution in #14455 @threehonor made their first contribution in #14297 @ohko4711 made their first contribution in #14640 @fivecut made their first contribution in #14622 @hardlydearly made their first contribution in #14812 @gap-editor made their first contribution in #14807 @mutestt made their first contribution in #14805 @rodiazet made their first contribution in #14944 @carrychair made their first contribution in #15169 @roseshahar made their first contribution in #15288 @eeemmmmmm made their first contribution in #15475 @fredrik0x made their first contribution in #15595 @reallesee made their first contribution in #16103", "ingested_utc": "2025-08-22T09:38:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:38:52Z", "source": "NYTimes_Business", "title": "Nvidia’s Jensen Huang in Talks With China to Allay Security Fears Over A.I. Chips", "url": "https://www.nytimes.com/2025/08/22/business/jensen-huang-nvidia-china.html", "id_key": "d7f29fc353b39d54f0764658774967965476748c3d9e4df418b3cf301dec2c5a", "summary": "Jensen Huang said he was “surprised” by questions about his company’s chips, given China’s eagerness to acquire them for advanced A.I systems.", "ingested_utc": "2025-08-22T09:38:52Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:38:52Z", "source": "NYTimes_Business", "title": "Trump’s Attacks on the Fed and BLS Threaten Key Source of Economic Strength", "url": "https://www.nytimes.com/2025/08/22/business/trump-federal-reserve-bls.html", "id_key": "16449c9247b4b911f293de047279f1d0658d74bc3bba1f28305b84e4988838e9", "summary": "The president’s efforts to control the Federal Reserve and Bureau of Labor Statistics carry risks. But collectively, the moves could be even more damaging, economists warn.", "ingested_utc": "2025-08-22T09:38:52Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:38:52Z", "source": "NYTimes_Business", "title": "How Long Can This Uncanny Stock Market Prosper?", "url": "https://www.nytimes.com/2025/08/22/business/stock-market-nvidia-trump.html", "id_key": "11c8e01e9c3538650c06859f12d9f89e7231b178a489e4f6f891b4a71ec31704", "summary": "The U.S. market is top-heavy, with Nvidia occupying a bigger weight than any company in modern history. Risks abound, our columnist says.", "ingested_utc": "2025-08-22T09:38:52Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:38:53Z", "source": "NYTimes_World", "title": "The Crowdfunded War Map That Ukrainians Check Every Morning", "url": "https://www.nytimes.com/2025/08/22/world/europe/ukraine-russia-deepstate-war-map.html", "id_key": "14ceac1714e4d2e67a56dfb8e0bcc7ba16f9c8734b0ea48845ad1e0e630ff805", "summary": "The online DeepState map, based on geolocated combat footage and tips from Ukrainian Army sources, draws 900,000 views each day and acts as a counterbalance to the military’s omissions.", "ingested_utc": "2025-08-22T09:38:53Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:38:53Z", "source": "NYTimes_World", "title": "Nathaniel B. Palmer, a U.S. Icebreaker, May Have Sailed Its Last Expedition", "url": "https://www.nytimes.com/2025/08/22/climate/nathaniel-b-palmer-ship-budget-cuts-polar-science.html", "id_key": "9befcdc0c978b0200d5f7b620eaf61e28838105fe623c3f46e2c4ddfe8712eff", "summary": "The decommissioning would leave the United States with no icebreaker to study the southern seas and cede scientific leadership to rival countries like China.", "ingested_utc": "2025-08-22T09:38:53Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:38:53Z", "source": "NYTimes_World", "title": "Congo Has Astronomical Rates of Sexual Violence. Now Victims Have Lost Access to Care.", "url": "https://www.nytimes.com/2025/08/22/health/rape-congo-sexual-violence.html", "id_key": "fd37322db8c1f508f96bb8a6b9aa580df48fb034022994877ca379e817ea7bd1", "summary": "The conflict that has put rebels in control of much of the east of the country has left victims with no legal recourse and dismantled many of the clinics that offered care.", "ingested_utc": "2025-08-22T09:38:53Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:01Z", "source": "NPR_Top", "title": "Timeline: Trump administration's words as critics press for Epstein records", "url": "https://www.npr.org/2025/08/22/nx-s1-5508871/trump-bondi-epstein-files-release-history", "id_key": "de13c90ea1eac08f0a5d582a219d1ed8b5ace596d82a49c9a31a024b2cab798a", "summary": "The Trump administration has shifted its tone and message in response to persistent pressure about the Epstein records — especially from supporters who see the unreleased files as an unfulfilled promise.", "ingested_utc": "2025-08-22T09:39:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:01Z", "source": "NPR_Top", "title": "Trump DOJ hired lawyer who compared Jan. 6 prosecutions to the Holocaust", "url": "https://www.npr.org/2025/08/22/nx-s1-5507078/trump-holocaust-doj-jonathan-gross-jan-6", "id_key": "2a26ad08c36d5ea460c58cd45991011c34bb939923d36ea957d6e6530e3d3e57", "summary": "Before joining the Justice Department this year, attorney Jonathan Gross said Jan. 6 prosecutors were \"evil people. They will put you on a cattle car to Auschwitz without batting an eye.\"", "ingested_utc": "2025-08-22T09:39:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:01Z", "source": "NPR_Top", "title": "DHS to states: Follow our voting rules or lose out on election security money", "url": "https://www.npr.org/2025/08/22/nx-s1-5508345/election-security-grants-trump-voting-policy", "id_key": "a1d4fa1050b6a001398bbac33720f2f32345ed328dcea83dd91f566fd943703a", "summary": "The Trump administration has tied new requirements to election security grants. Some states told NPR they're passing on the grants as a result.", "ingested_utc": "2025-08-22T09:39:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:01Z", "source": "NPR_Top", "title": "Offered a cash price for a prenatal genetic test? It may be your best bet", "url": "https://www.npr.org/sections/shots-health-news/2025/08/22/nx-s1-5479877/prenatal-genetic-test-natera-health-insurance", "id_key": "aa7d34e5f39feb5bd4d42f47cf7cdf00fa0c0d6a83d81226fd50f499b55d6982", "summary": "An expectant mom got a $750 bill for a blood test to check for genetic abnormalities in her baby. Then she tried to figure out why it was so high.", "ingested_utc": "2025-08-22T09:39:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:01Z", "source": "NPR_Top", "title": "First wave of Epstein files is being sent to Congress, says Oversight Committee chair", "url": "https://www.npr.org/2025/08/22/nx-s1-5509535/epstein-files-congress-house-oversight-committee-trump", "id_key": "0a7ad0033867b332f0103f04f33bfb20f1aa3914071b0d3dfe89ee139ae9595d", "summary": "The Justice Department is expected to deliver files from its Jeffrey Epstein investigation to the House Oversight Committee starting Friday. The panel plans to release some of the files publicly.", "ingested_utc": "2025-08-22T09:39:01Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:01Z", "source": "NPR_Business", "title": "Largest retailers in the U.S. have raised prices on some items", "url": "https://www.npr.org/2025/08/22/nx-s1-5509940/largest-retailers-in-the-u-s-have-raised-prices-on-some-items", "id_key": "a1553f61edfe3b79fda15e797f92e925b4d1caa573bcece9090b55ce175da3a2", "summary": "Some of the largest retailers in the U.S., including Walmart, Home Depot and Target, have had to raise prices on some items due to tariffs. They've kept prices down on other items.", "ingested_utc": "2025-08-22T09:39:01Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:03Z", "source": "NPR_World", "title": "Hamas has one top strategy: End the war and survive", "url": "https://www.npr.org/2025/08/21/nx-s1-5507998/hamas-gaza-war-strategy-israel", "id_key": "30c1585f579d689a8680f35db44213852e3ee5b34e87bf5f91bd006bbc9869b9", "summary": "Hamas has endorsed a new proposal for a ceasefire deal with Israel in Gaza, as it faces pressure from Arab countries and seeks to ensure its own survival.", "ingested_utc": "2025-08-22T09:39:03Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:24Z", "source": "WIRED_All", "title": "Scientists Find a New Moon Orbiting Uranus", "url": "https://www.wired.com/story/new-moon-identified-on-uranus-orbiting-close-to-its-ring-system/", "id_key": "5e812502ce59b9f212c9c1d7ccdded3fa9529c6070bb7dbf5b72a7c7bb57cd93", "summary": "The provisionally named S/2025 U1 is so small it had gone unnoticed by probes and telescopes for the past 40 years.", "ingested_utc": "2025-08-22T09:39:24Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:26Z", "source": "Engadget_All", "title": "The best ereaders for 2025", "url": "https://www.engadget.com/mobile/tablets/best-ereader-130013808.html?src=rss", "id_key": "fbb9d4590c54beeace6afcd36f85f4ea3041417ce9d4056193ad8f2da384a36d", "summary": "After testing around a dozen ereaders, we think the best bet for most people is the Kobo Clara Colour . But the base-model Kindle is also good, offering a cheap and easy entry point into ebooks. And Boox makes a few E Ink readers that do more than just display books. Now that most ereader companies also offer color models, the field is wider than ever. In short, there are a few things to consider before buying your next (or first) ereader and this guide covers product recommendations alongside advice on how to get the most out of your new device. Table of contents Best ereaders What to look for in an ereader How to get books for your ereader How we test ereaders Ereader FAQs Recent updates The best ebook readers for 2025 What to look for in an ereader Plenty of apps, including the Kindle app, will let you download and read digital books on an iPhone, Android Phone or tablet. But what makes ebook readers different is the screen: nearly all of them use technology from a company called E Ink. It manufactures electronic paper displays (EPD) composed of three sheets: one containing millions of microcapsules filled with black and white ink particles sandwiched between transparent electrode layers. When a charge is applied, either the black or white particles shift to the top, forming letters and the whitespace around them. Color ereaders add a color filter array on top of the standard black and white microcapsule layer. The result is two different resolutions on one screen — the color clarity is 150 dpi while black and white images and text are still 300 dpi. Because these displays are so different from standard backlight LED panels, you can expect most good ereaders to do a number of things well. They’ll be easier to stare at for long periods of time and easier to read in direct sunlight. Also, since E Ink displays only require power to rearrange the ink, these devices have much longer battery lives than even the best tablets: we’re talking weeks on a single charge, not days. The ereader market is not as saturated as, say, the smartphone market, but there are still plenty of options out there and they do have small but important differences among them. They tend to range from around $100 to more than $400, though usually the higher end options are stylus-enabled read/write E Ink tablets like the Kindle Scribe. Beyond price, you should consider physical properties like buttons, lights, storage and resolution, as well as how the software lets you find and access books. Reading features With any ereader, you’ll navigate the OS via taps and swipes, and some add physical page-turn buttons. Most with built-in buttons have an auto-rotating screen so you can press with your right or left hand. As E Ink technology has advanced, resolution has greatly improved – even the budget Kindle ereader has a 300 ppi display. You can still find models with lower resolution, but we don’t recommend them. Some ereaders have front LEDs that support light temperature adjustment. That means you can switch to a warmer light after the sun goes down, which will feel easier on the eyes. If you’re concerned about blue light, you should go for a reader with that feature. Finally, dark mode is available on most later model ereaders, allowing you to invert the black and white text and background, which some people find easier to read in low-light settings. Other features The capabilities of these pocket libraries have advanced considerably since the early days. In addition to storing books, some let you browse the web, run apps and play music. The screen’s frame rate can’t handle gaming, but it’s good enough to show you the Wikipedia entry for Striver’s Row while you read Crook Manifesto . If you listen to audiobooks, you may want a Bluetooth-enabled ereader capable of playing them. Most of the models we tested have that ability, with the notable exception of the Nook ereader we tried. Keep in mind that audiobook files can take up more space than print files so you'll probably want a device with a higher storage capacity if you plan on doing a lot of listening. Above all, you should consider where and how you intend to find books to read. Most ereaders make it easiest to shop through their own digital bookstores, but all of them (even Kindles ) will now let you download titles from other sources, like libraries, unaffiliated ebook sellers and free public domain sites. Photo by Amy Skorheim / Engadget How to get books for your ereader Kindle, Nook and Kobo all have their own stores that you access directly from each brand’s devices. Prices are the same among all sellers, too. Publishers set the price of an ebook, not the retailer, so a title will cost the same at Amazon, Barnes & Noble, eBooks.com and the Kobo store. Amazon offers Kindle Unlimited for $12 per month, and it includes four million titles from which you can pick your next read. It includes audio and ebooks, but you won’t find many big, new releases or older bestsellers. Kobo has a subscription called Kobo Plus with about 1.3 million titles: it goes for $8 per month for ebooks only, $8 for audiobooks only or $10 for both. Buying a book from a proprietary store instantly delivers it to your device, provided you’re connected to WiFi. It also syncs your reading across devices and apps, so you can pick up where you left off on your phone if you forgot your ereader at home. It truly is the most convenient way to go, but if you don’t want to be locked into one brand’s store, or if you opt for an ereader without its own marketplace, you do have options. How to upload ePubs onto an ereader Stores like ebooks.com and Google Play have millions of ebooks for sale as digital rights-managed (DRM) ePub files, which Kobo, Nook and PocketBook readers can read in their native ereader apps. Kindles don’t support DRM ePub files at all and Boox devices require third party reading apps (of which there are many) to read those files. Titles from Apple Books are only readable in iOS devices. Titles from some publishers like Tor and public domain classics from sites like Project Gutenberg are also sold as ePubs, but without the added DRM. Consequently, Kindles and the Boox Neoreader do support those files. Books you get from third-party sources will look just like ones you bought from a proprietary store, thanks to the flowable, formatted nature of ePub files. While these device-agnostic ebook collections give you extra options for finding your next read, they require a few additional steps to get the files onto your ereader. To do so, you’ll typically need a computer running a free program called Adobe Digital Editions (ADE). After buying and downloading the ePub file, open ADE and plug your ereader into your computer (all readers here have a USB-C port for charging and data transfers). Your device should pop up in the left panel. Drag and drop the ePub file from your downloads folder into the main panel in ADE. The file will display as an image of the book cover. Drag that image onto your device on the left panel. If the file includes digital rights management (which protects against unauthorized copying) you’ll need to authorize your ereader, which requires using or creating a free Adobe ID . Once you’ve finished adding files to upload, eject the reader from your computer to complete the transfer process. Kindles use a web-based uploader instead of the ADE method. But since Kindle uses its own proprietary DRM technology instead of Adobe's, the only files it can accept from third parties are non-DRM files, such as from Tor Publishing or Project Gutenberg. After downloading a compatible ePub file, drag and drop it into your browser with the Send to Kindle page open. As long as you’re signed into Amazon, this wirelessly transfers the files to your associated device. Boox also uses a browser uploader called BooxDrop (along with many other methods ) to deliver ePubs to the device. Open it from the Boox App menu and you’ll see a device-specific url. Type that into your browser to access a file delivery portal that uploads to your library. Boox’s built-in ereader app, NeoReader, also doesn’t support files with DRM, so you won’t be able to read current titles from most publishers using that app. Fortunately, Boox devices run nearly every ereader app out there, Kobo and Kindle included, letting you access ePubs any number of ways. Recently, Bookshop.org, the online seller of physical books that supports indie bookstores, started selling ebooks and up to 100 percent of the profits will go to local booksellers. The company uses a different rights management system than ADE so, right now, you can only read titles you buy from them on the Bookshop.org app , but the company is working with the makers of both Kindle and Kobo to extend compatibility to those ereaders. How to read library books on an ereader Your local library card lets you borrow audio and ebooks through a program called Overdrive and its companion app Libby . On a Kobo , you have have built-in access to Overdrive in a separate tab. Once you’ve linked your public library card, the search function will include results for titles available from your local library system; a few taps will upload your selections to your device for the length of the loan. I personally find it easiest to borrow the title I want through the Libby app on my phone. After that, the book pops up on my Kobo’s home screen once the device syncs. To read library books on a Kindle , you can either go through the Libby app or the Overdrive section of your library’s website. Once you click Borrow, you’ll see the option to “Read now with Kindle,” which takes you to Amazon’s site to sign in. After that, the book will be delivered to your device the next time it connects to WiFi. For other ereaders, you’ll go through your library’s Overdrive portal and download the ePub after clicking the Borrow button. You can then use the ADE process we described above. Devices that run external apps, like Boox's Page, Go Color 7 or Palma, allow you to read library books via the Libby app, just as you would on a smartphone or iPad. You can also use the Libby app to borrow audiobooks, but you won’t be able to access them through your ereader. (The exception is an ereader, like a Boox device, that allows external apps). I found it was easier to listen to an audiobook on my phone anyway, regardless of whether I borrowed it through Libby or bought it from Kindle or Kobo. Photo by Amy Skorheim / Engadget How we test ereaders When putting together any guide, the first thing we do is spend hours researching the field. We look at what’s available, what’s new, and what shoppers and professional reviewers have to say. Then we narrow a list to the best candidates for hands-on testing. Over the course of the past two years, I’ve tested just over a dozen ereaders, representing five different brands: Amazon, Kobo, Barnes & Noble, Boox and PocketBook. I bought, borrowed and uploaded books for each device using the methods above. I used each one for between a few days to a few months. I evaluated each one in the areas of book access, ease of reading, extra features and overall value. Here’s everything we tested so far: Amazon Kindle (2022) Amazon Kindle (2024) Amazon Kindle Paperwhite (2021) Amazon Kindle Paperwhite Signature (2024) Boox Go Color 7 Boox Leaf 2 Boox Page Boox Poke 5 Boox Palma Kobo Libra 2 Kobo Libra Colour Kobo Clara 2E Kobo Clara Colour Kobo Nia NOOK GlowLight 4 PocketBook Era Other ereaders we tested Amazon Kindle Colorsoft Amazon’s first color Kindle impressed with its quick page-turns and load times, auto-adjusting front light and, of course, a decently striking color E Ink display. But at $280, it’s more expensive than all of the other color ereaders in its size range, including the Kobo Libra Colour and the Boox Go Color 7. Also, some Colorsoft owners reported seeing a yellow band at the bottom of their ereader’s display. This issue did not affect our first review unit during the original testing period, but it eventually appeared. An Amazon spokesperson told Engadget: \"A small number of customers have reported a yellow band along the bottom of the display. We take the quality of our products seriously—customers who notice this can reach out to our customer service team for a replacement or refund, and we’re making the appropriate adjustments to ensure that new devices will not experience this issue moving forward.\" Amazon sent us a new Colorsoft ereader at the end of 2024 and it does appear that the fixes the company made resolved the yellow-band issue. The screen on our second review unit appears warmer overall, but not overly so. It’s more akin to the screen on the Kobo Libra Colour, and that’s a good thing. Boox Go 7 stylus-enabled ereader Boox recently released two new stylus-enabled generations of their seven-inch reader: The monochrome Go 7 and a color-screen Go Color 7 (Gen II) . After trying out the stylus-enabled Go 7, I still like the standard, non-stylus enabled version better. True, I liked the Notebook app with its array of handwriting templates and I appreciated the low-to-no latency with the stylus. It also offers a good assortment of brush, pen and style options. But outside of the Notebook app, I didn’t find much use for the stylus. I was able to doodle in the margins of DRM-free books in Boox’s native NeoReader, but it doesn’t work in other apps or on any rights-managed books. There's a FreeMark option that allows you to draw or write atop any app, but it saves your doodles as separate images, as opposed to allowing you to mark up the page itself. I also found enabling the stylus to be a little glitchy. If you plan to do a lot of writing, you’ll probably be better served by an E Ink tablet , but if you want an ereader that can mark up your books, I suggest going with the Kobo Libra Color, detailed above. Ereader FAQs What's the difference between an ereader and an e-ink reader? Really, they are the same thing. E Ink is a company that designs and manufactures the paper-like screens found in most ereader devices. Technically, anything you read ebooks on can act as an ereader, so your phone, iPad or Android tablet could all serve that purpose, but they’re not considered dedicated ereaders. While there are some devices marketed as ereaders that have LCD or OLED screens instead of E Ink, they aren’t as common. One of the benefits of ereaders is the E Ink screen’s paper-like quality, which causes less eye strain for many people. But there is a difference between ereaders and E Ink tablets . These larger e-ink devices also employ E Ink screens, but they have stylus input and are often used for note taking and other tasks in addition to reading ebooks. We have an entire guide devoted to helping you pick out an E Ink tablet . Are there ads on my ereader? The base model Kindle and Kindle Paperwhite come with ads by default, but you can opt to pay $20 to remove them, either at the time of purchase or after you start using the device. The ads are limited to the lockscreen and are typically for other books or Kindle services. Kobo and Boox ereaders don’t come with ads. Which ereader has the longest battery life? Of the devices we tested, the Boox Go Color 7 has the largest listed battery capacity at 2,300mAh (Amazon doesn’t list the capacity of its Kindle devices). But thanks to the nature of E Ink screens and the relatively limited processing power required to display e-books, nearly all ereaders can go for weeks before they need a recharge. That means battery life probably isn’t as much of a deciding factor in buying an ereader as it would be with a tablet or smartphone. Which ereaders can read Kindle books? Amazon’s Kindle ereaders are the obvious answer, but other devices capable of running apps can also read titles from the Kindle store. For example, you can download the Kindle app on a Boox ereader through Google Play (the store comes standard in the Boox app menu). You can then sign into your Kindle account and access all the books in your library — the same way you’d read Kindle books on your phone or tablet. Can you buy Kindle books without a Kindle? Yes. You can buy Kindle books through the Kindle app or through Amazon’s website via a browser. You can read those titles on a Kindle or any device that can run the Kindle app, such as a smartphone, tablet or computer. Just be aware that Kindle titles can only be read through one of Amazon’s ereaders or the Kindle app. The company uses proprietary digital rights management on all ebooks it sells that can’t be read by other ereader apps like Kobo or Adobe ADE. What's the difference between Kindle and Kobo? Both Kindle and Kobo are brands of dedicated ereaders that support searching, buying, downloading and reading ebooks from their own stores. Both also support borrowing books from your local library via Overdrive and Libby. The difference is that Kindle is owned by Amazon and uses the Kindle store, whereas Kobo is owned by Rakuten and its books come from the Kobo store. Both stores come pre-loaded as a tab on their respective ereader and both carry most in-print books. Each store also carries their own exclusive ebooks as well, but Amazon’s library of Kindle-only books is much larger than Kobo’s . Amazon also offers Amazon Original stories to read on the Kindle, which are free short fiction and nonfiction reads that are free to Prime members. Which ereader is best for library books? Both Kobos and Kindles have simple systems for borrowing library books. Other ereaders, like Boox, let you borrow books after downloading the Libby App. Only Kobo ereaders let you search for and borrow books directly on the ereader, with a dedicated Overdrive tab. Kindles, on the other hand, utilize a convenient “read on Kindle” function from the Libby app or website. You can send a borrowed book to your Kindle just by signing into your account. Both methods are pretty easy, so which is the best for you probably depends on other factors than just the library-book feature. Recent updates August 2025 : Included new frequently asked questions covering battery life, E Ink screens and ads on ereaders. Mentioned Amazon’s release of a cheaper Colorsoft Kindle. July 2025 : Added our impressions of the new stylus-enabled Boox Go 7 series. Updated our Boox Palma recommendation to account for the upgrades to the Boox Palma 2. Included text formats to our specs and the battery life of the Kobo Clara Colour. March 2025 : Added news about Bookshop.org getting into the ebook market. Updated information about price-setting by publishers. January 2025: Updated the \"Others we tested\" section to include impressions of the second Kindle Colorsoft review unit we received. August 2024 : Replaced our Android tablet pick with the new Go Color 7 ereader from Boox. Updated book titles to current examples. Added an FAQ section to explain the difference between Kobo and Kindle ereaders and further detail library-book support on different models. November 2024 : Following the release of Amazon's new Kindle ereaders , we tested and reviewed the Kindle Paperwhite Signature Edition, the base-model Kindle and Amazon's new color ereader, the Kindle Colorsoft . Accordingly, we updated our budget pick, added a premium pick and noted our experience with the Colorsoft. This article originally appeared on Engadget at https://www.engadget.com/mobile/tablets/best-ereader-130013808.html?src=rss", "ingested_utc": "2025-08-22T09:39:26Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:35Z", "source": "AlJazeera_All", "title": "Argentina and Chile fans trade blame over ‘barbaric’ violence", "url": "https://www.aljazeera.com/sports/2025/8/22/argentina-and-chile-fans-trade-blame-over-barbaric-violence?traffic_source=rss", "id_key": "2011d936da5a769cf5a9099822c3c1a4f252d3a3a6c3df79627408e8072fed9e", "summary": "FIFA President Gianni Infantino describes match where 100 fans were arrested as 'barbaric' and calls for sanctions.", "ingested_utc": "2025-08-22T09:39:35Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:42Z", "source": "FinancialPost_Business", "title": "German Economy Shrinks More Than Estimated on Trade Reversal", "url": "https://financialpost.com/pmn/business-pmn/german-economy-shrinks-more-than-estimated-on-trade-reversal", "id_key": "6c17e3c1cbab846e35e083d76b6748ae9b1ca0d027296ba3db5fbfc6d1eca4e5", "summary": "Germany’s economy shrank more than initially estimated in the second quarter due to a much weaker performance by manufacturers following a surge in US business at the start of the year to avoid tariffs.", "ingested_utc": "2025-08-22T09:39:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:42Z", "source": "FinancialPost_Business", "title": "Oil Steadies With Focus on India-Russia Trade Before Tariff Hike", "url": "https://financialpost.com/pmn/business-pmn/oil-steadies-with-focus-on-india-russia-trade-before-tariff-hike", "id_key": "2b14be8e8b48ca0cb0ce7a9e4a3045bda9c0c2db264de02ffcc4e4d1fd6b6406", "summary": "Oil was steady as the market weighed the outlook for Russian crude flows to India after the Trump administration ramped up criticism of the trade ahead of an expected tariff increase.", "ingested_utc": "2025-08-22T09:39:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:42Z", "source": "FinancialPost_Business", "title": "US Scrap Copper Traders Redirect Metal to Sidestep China Levies", "url": "https://financialpost.com/pmn/business-pmn/us-scrap-copper-traders-redirect-metal-to-sidestep-china-levies", "id_key": "69201b91fd31b24dd2162b77aecac1fa80fdb97b1594f0543e24c78b41484b64", "summary": "Some US metal dealers are redirecting China-bound shipments of scrap copper through countries including Canada, Mexico and Vietnam in a risky move to avoid 10% import tariffs, according to people familiar with the matter.", "ingested_utc": "2025-08-22T09:39:42Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:49Z", "source": "Nikkei_Asia_Top", "title": "JPX and Nikkei replace 31 stocks in human capital index", "url": "https://asia.nikkei.com/announcements/jpx-and-nikkei-replace-31-stocks-in-human-capital-index", "id_key": "470d48e272698cf2373c7ed72aed15b0d88dd59f477152783a590605a63dcde6", "summary": "", "ingested_utc": "2025-08-22T09:39:49Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T09:39:56Z", "source": "MIT_TechReview", "title": "I gave the police access to my DNA—and maybe some of yours", "url": "https://www.technologyreview.com/2025/08/22/1122315/i-gave-police-access-to-my-dna/", "id_key": "2e5a960e59017dccb8f169867c2987f481c11010363dc9e8218bf6e84c19f26f", "summary": "Last year, I added my DNA profile to a private genealogical database, FamilyTreeDNA, and clicked “Yes” to allow the police to search my genes. In 2018, police in California announced they’d caught the Golden State Killer, a man who had eluded capture for decades. They did it by uploading crime-scene DNA to websites like the one…", "ingested_utc": "2025-08-22T09:39:56Z"}
