{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:06:54Z", "source": "Guardian_World", "title": "‘We want builders on site, not filling in forms’: Albanese government cuts red tape in bid to boost home building", "url": "https://www.theguardian.com/australia-news/2025/aug/23/we-want-builders-on-site-not-filling-in-forms-albanese-government-cuts-red-tape-in-bid-to-boost-home-building", "id_key": "a0753be7abbcd5697618989026df0e91ee9a68b703c0d8f38efda6ffe1d7b787", "summary": "Pausing changes to Construction Code, establishment of ‘strike team’ within environment department and use of AI in planning among reforms Get our breaking news email , free app or daily news podcast The Albanese government has promised to cut red tape and fast-track environmental approvals for new homes in an effort to address Australia’s housing crisis. On Saturday, the government announced plans to pause further residential changes to the National Construction Code and to streamline the assessment of more than 26,000 homes under the Environment Protection and Biodiversity Conservation Act. Continue reading...", "ingested_utc": "2025-08-23T13:06:54Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:06:54Z", "source": "Guardian_World", "title": "Ministers delay planning decision on Chinese ‘super-embassy’ in London", "url": "https://www.theguardian.com/uk-news/2025/aug/23/ministers-delay-planning-decision-chinese-super-embassy-london", "id_key": "b16575994047db076a5c31c459c88bd32c5b865b858812063ffad0fab45eb01f", "summary": "Date pushed back to October amid concerns over redacted drawings in plans for 20,000-sq-metre complex Ministers have delayed a decision on whether to grant planning permission to a proposed Chinese “super-embassy” in London amid concerns about redacted drawings in the building’s plans. The deputy prime minister, Angela Rayner, was expected to make a decision on 9 September but has pushed the date back to 21 October, saying more time was needed to consider the plans for the development, which would occupy 20,000 square metres (five acres) at Royal Mint Court in east London . Continue reading...", "ingested_utc": "2025-08-23T13:06:54Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:06:54Z", "source": "Guardian_World", "title": "Alarming levels of Pfas in blood of those living near US air force base, study finds", "url": "https://www.theguardian.com/us-news/2025/aug/23/pfas-air-force-base", "id_key": "b8f871ac281815e151b898a2453ad6da263b1d041df31f215940588b23d3540d", "summary": "Toxic ‘forever chemicals’ were found at a level 10 times higher than people who did not work in contaminated zone New research shows alarming levels of Pfas in the blood of people living or working near a US air force base responsible for polluting drinking water with high levels of the dangerous “forever chemicals”, a new state regulatory report has found. The levels are high enough in those who lived and worked near the Cannon air force base in Curry county to raise health concerns – about 10 times above the levels of those in the region who did not work in the contaminated zone. The pollution stems from a type of Pfas-laden firefighting foam the military has used across the nation, and the types of compounds found at high levels in participants’ blood were also commonly used in foam. Continue reading...", "ingested_utc": "2025-08-23T13:06:54Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:07:10Z", "source": "BitcoinMagazine", "title": "Freedom of Mind and Freedom of Money: Inside Costa Rica’s Growing Bitcoin Circular Economy", "url": "https://bitcoinmagazine.com/culture/bitcoin-circular-economy-awake-costa-rica", "id_key": "0b41db8df019329ee674f2cffbe52a53da879b8632f7263beed135974c7a41d2", "summary": "Bitcoin Magazine Freedom of Mind and Freedom of Money: Inside Costa Rica’s Growing Bitcoin Circular Economy An extract from the newly released book \"Bitcoin Circular Economies,\" the Costa Rica chapter discusses Bitcoin Jungle, a circular economy in Uvita, Costa Rica, and Bitcoin as a spiritual path. Like all the stories in this book, it’s a story of hope built on the sovereign money of the future. This post Freedom of Mind and Freedom of Money: Inside Costa Rica’s Growing Bitcoin Circular Economy first appeared on Bitcoin Magazine and is written by Gabriel Kurman .", "ingested_utc": "2025-08-23T13:07:10Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:07:12Z", "source": "CryptoSlate", "title": "SharpLink stock soars 15% after $1.5B buyback plan amid Ethereum market rally", "url": "https://cryptoslate.com/sharplink-stock-soars-15-after-1-5b-buyback-plan-amid-ethereum-market-rally/", "id_key": "7c1994c4aca2d45b9469b62ff9b09c736b9ddce114868513b7e071fe86791ebc", "summary": "Ethereum-focused SharpLink’s stock climbed more than 15% to trade above $20 after the company’s board approved a $1.5 billion stock repurchase program. In its Aug. 22 press statement, SharpLink explained that the authorization allows for buybacks through multiple channels, including open-market purchases and privately negotiated deals. The company emphasized that the scale of repurchases will […] The post SharpLink stock soars 15% after $1.5B buyback plan amid Ethereum market rally appeared first on CryptoSlate .", "ingested_utc": "2025-08-23T13:07:12Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:07:16Z", "source": "CryptoNews", "title": "Bitcoin’s Original Culture Sees Institutional Push as ‘Bad Direction’: Ego Death Capital", "url": "https://cryptonews.com/news/bitcoins-original-culture-sees-institutional-push-as-bad-direction-ego-death-capital/", "id_key": "6f5d1c9b60ad47ad73db461c84847431eb0a0837658f5b99e31a881cd9a8a843", "summary": "Skepticism over Wall Street’s deepening role in Bitcoin remains strong among early adopters, according to Preston Pysh, co-founder of Ego Death Capital. The post Bitcoin’s Original Culture Sees Institutional Push as ‘Bad Direction’: Ego Death Capital appeared first on Cryptonews .", "ingested_utc": "2025-08-23T13:07:16Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:14Z", "source": "NPR_Economy", "title": "What are the risks to the labor market after Powell's speech amid inflation concerns?", "url": "https://www.npr.org/2025/08/23/nx-s1-5511329/what-are-the-risks-to-the-labor-market-after-powells-speech-amid-inflation-concerns", "id_key": "eccb18699cb26023dbc0949aa2e49fa117aab1dead8a75de4d783479445c1dad", "summary": "Federal Reserve Chairman Jerome Powell received a standing ovation in Jackson Hole, Wyoming, on Friday. Powell said the central bank could soon resume cutting interest rates.", "ingested_utc": "2025-08-23T13:09:14Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:33Z", "source": "TheVerge_All", "title": "Ninja Gaiden: Ragebound is a perfect reimagining of the classic series", "url": "https://www.theverge.com/games-review/716421/ninja-gaiden-ragebound-review-nintendo-switch-playstation-xbox-pc", "id_key": "8e1fa93156cbbfb28b0af216b221c4a04415adcfa70b8b04a1833b5678317e47", "summary": "Ninja Gaiden is having a renaissance. The last mainline entry was originally released more than a decade ago, but by the end of 2025, there will be three new Ninja Gaiden titles. Two are 3D: Ninja Gaiden 2 Black, a modern-day remaster of Ninja Gaiden II released earlier this year, and Ninja Gaiden 4, co-developed […]", "ingested_utc": "2025-08-23T13:09:33Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:33Z", "source": "TheVerge_All", "title": "Will Trump help 4Chan escape the UK’s internet police?", "url": "https://www.theverge.com/politics/764653/4chan-uk-online-safety-act-trump", "id_key": "13895a84a0e45cba023a3f64bc75d8c4d77266fbc5931d3dfc990631193266ce", "summary": "After the United Kingdom began enforcing its sweeping Online Safety Act in April, British regulator Ofcom served violation notices to three notorious sites: 4chan, Gab, and Kiwi Farms, each of which risked multimillion-dollar fines. Late last week, Preston Byrne, a First Amendment lawyer representing them, struck back. Byrne announced he would sue Ofcom in US […]", "ingested_utc": "2025-08-23T13:09:33Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:35Z", "source": "WIRED_All", "title": "9 Best Keyboards (2025), Tested and Reviewed", "url": "https://www.wired.com/gallery/best-keyboards/", "id_key": "09773d9cd1d7d5c021f0a8f59c639403b42f5264ab5b047fc7cb5c0187a99cd1", "summary": "Whether you’re looking to boost your productivity or your Fortnite stats, these are the top keyboards for the job.", "ingested_utc": "2025-08-23T13:09:35Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:36Z", "source": "Engadget_All", "title": "Meta is licensing Midjourney's AI image and video tech", "url": "https://www.engadget.com/ai/meta-is-licensing-midjourneys-ai-image-and-video-tech-120012178.html?src=rss", "id_key": "09d2166c44b7afaea3fc85d69c484189b6913cf2461132bbe8eb7c27c603065b", "summary": "Meta has signed a partnership with Midjourney, an AI service that can generate images and videos from text prompts. According to Alexandr Wang, Meta's Chief AI Officer, Meta is licensing Midjourney's \"aesthetic technology\" for its future models and products. \"To ensure Meta is able to deliver the best possible products for people it will require taking an all-of-the-above approach. This means world-class talent, ambitious compute roadmap, and working with the best players across the industry,\" Wang added. 1/ Today we’re proud to announce a partnership with @midjourney , to license their aesthetic technology for our future models and products, bringing beauty to billions. — Alexandr Wang (@alexandr_wang) August 22, 2025 The company previously launched its own AI image generator and AI video editor , but Midjourney's technology could help Meta offer services that can actually compete with rivals', such as OpenAI's Sora and Google's Veo . Midjourney made V7 its default model for image generation back in June. It described V7 as an \"entirely new\" AI image generation model that's much smarter at processing text prompts than its predecessors. It also released its V1 video model , which allows users to turn the images they generate into a short animated video, at the same time. \"We are incredibly impressed by Midjourney. They have accomplished true feats of technical and aesthetic excellence, and we are thrilled to be working more closely with them,\" Wang said on X. This partnership is but Meta's latest move in its quest to form a Superintelligence laboratory and become a major player in the AI sphere. Mark Zuckerberg went on a hiring spreed and managed to convince several key players from rivals to join his company instead by offering them massive salaries and signing bonuses. Wang himself became the company's Chief AI office after Meta invested $14.8 billion in Scale AI, the company he founded. This article originally appeared on Engadget at https://www.engadget.com/ai/meta-is-licensing-midjourneys-ai-image-and-video-tech-120012178.html?src=rss", "ingested_utc": "2025-08-23T13:09:36Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:45Z", "source": "TheStreet_Top", "title": "TJX earnings show shoppers keep flocking to lower-priced outlets", "url": "https://www.thestreet.com/retail/tjx-earnings-show-shoppers-keep-flocking-to-lower-priced-outlets", "id_key": "bca54428dfc6a9abf4d687e5e8adff0cc6846ac706493024b697a8b6641cafe1", "summary": "Americans are still spending, they're just being more careful with their dollars.", "ingested_utc": "2025-08-23T13:09:45Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:45Z", "source": "TheStreet_Top", "title": "Social Security benefits: Claiming early can trigger major impact", "url": "https://www.thestreet.com/retirement/social-security-benefits-claiming-early-can-trigger-major-impact", "id_key": "cbb40350372589d80def0f1f967d573b9b9467ed26846704858c31c0b9e99575", "summary": "Finance experts explain a major Social Security decision confronting Americans.", "ingested_utc": "2025-08-23T13:09:45Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:45Z", "source": "TheStreet_Top", "title": "Why the US Just Took a Nearly 10% Stake in Intel", "url": "https://www.thestreet.com/technology/intel-begins-new-chapter-as-us-becomes-biggest-shareholder", "id_key": "03f00c8e04adb5a25a590db317a47fbdd081d8872752fae7730b67410bb631ef", "summary": "The United States has acquired a significant stake in the semiconductor company.", "ingested_utc": "2025-08-23T13:09:45Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:45Z", "source": "TheStreet_Top", "title": "Stocks soar after Powell makes surprising comments", "url": "https://www.thestreet.com/investing/stocks-respond-sharply-to-fed-powells-latest-message-on-interest-rates", "id_key": "8721e82af59d3f959a1f60484047097dc58454b7b4cf46479f1780fbe20a495a", "summary": "The S&P 500 and Nasdaq respond to Powell's comments at Jackson Hole.", "ingested_utc": "2025-08-23T13:09:45Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:09:52Z", "source": "FinancialPost_Business", "title": "‘It’s ridiculous’: Why some Canadian youth feel ready to tap out of tipping culture", "url": "https://financialpost.com/pmn/its-ridiculous-why-some-canadian-youth-feel-ready-to-tap-out-of-tipping-culture", "id_key": "032bd5429ec3ffb236870de39f7cba4a033ddd3367004ddca2ee4793c6f33ef2", "summary": "EDMONTON — Ren Alva is no stranger to leaving a good tip. The Edmonton university student believes in tipping service workers for a job well done, even leaving more during the holidays and after special events. But the 22-year-old from Bahrain was taken aback during a recent visit to a U-pick berry farm, where he […]", "ingested_utc": "2025-08-23T13:09:52Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T13:10:13Z", "source": "HackerNews_Top", "title": "Rethinking the Linux cloud stack for confidential VMs", "url": "https://lwn.net/Articles/1030818/", "id_key": "da08496dff90b2a5d5c4bed66a47c9e5f1bc21b0874cad33eac365e4e1df183d", "summary": "Comments", "ingested_utc": "2025-08-23T13:10:13Z"}
