{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:22Z", "source": "BBC_Business", "title": "How are interest rates set, and will they fall further?", "url": "https://www.bbc.com/news/articles/c3dky111m40o?at_medium=RSS&at_campaign=rss", "id_key": "a36d8c6e1e3bf95839af253579554e83f543489d5a1b48226d4d3a1e44402632", "summary": "The interest rate set by the Bank of England affects mortgage, loan and savings rates for millions.", "ingested_utc": "2025-08-20T13:39:22Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "BBC_Technology", "title": "Investigation into 'horrifying' death of French streamer", "url": "https://www.bbc.com/news/articles/c1mpjplk4pxo?at_medium=RSS&at_campaign=rss", "id_key": "9c136d33251ca9958b7efa80650c9112f3680f6230a7a76290b2a7488fec7d79", "summary": "Raphaël Graven, also known as Jeanpormanove, was found dead at a residence in Contes, a village north of Nice, prosecutors said.", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "Guardian_Business", "title": "What’s in a name? MSNBC, soon to be MS Now, adds to perilous history of the corporate rebrand", "url": "https://www.theguardian.com/media/2025/aug/20/msnbc-ms-now-name-change", "id_key": "5b2f8a18bdda0483717ca12e56df78f7d4f3da9276215ede2cd6c03865573c65", "summary": "As the US cable news network becomes the latest to face ridicule, marketing experts say many months (and hundreds of thousands of dollars) go into firms’ new names The Tropicana Crisis of 2009 underlined the importance of a company’s branding. In January of that year, the orange juicemaker, owned by PepsiCo, changed the look of its cartons. The shiny orange punctured by a straw was replaced by an almost abstract blob of orange juice. Continue reading...", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "Guardian_Business", "title": "Leading US economists urge peers to fight Trump’s attack on environment", "url": "https://www.theguardian.com/environment/2025/aug/19/leading-us-economists-urge-peers-to-fight-trumps-attack-on-environment", "id_key": "4d5ad859657a8eab6c5454b11dac625e8aed36dfb0464ad256c9b9f32f8a6885", "summary": "Experts say undermining green protections and research funding is against the principles of economics Three leading US economists are urging their peers around the world to push back against Donald Trump’s attack on environmental laws. In what amounts to a call to action to economists, the trio say rollback of environmental regulations is “inconsistent or antithetical” to fundamental principles of economics over how to allocate the world’s limited resources for the greatest possible value to society. Withdrawal from the Paris climate agreement. Eliminating consideration in federal policy of the well-established effects of climate breakdown on public welfare. Executive orders to “drill baby drill” giving priority to fossil fuel energy production. Ending research funding on environment and climate and the collection of environmental data. Reducing investments and regulations designed to tackle lead and forever chemicals in drinking water. Continue reading...", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "Guardian_Business", "title": "Walmart recalls potentially radioactive shrimp sold in 13 US states", "url": "https://www.theguardian.com/business/2025/aug/20/walmart-radioactive-shrimp-recall", "id_key": "fb8557f0b254a1f998f73875d2d5a6bad73f9bd0f3c4b188de4de1b9bcaf1085", "summary": "FDA officials detected Cesium-137, a radioactive isotope, in shipping containers and a sample of shrimp from Indonesia Walmart has recalled frozen, raw shrimp sold in 13 states because federal health officials say it could have potential radioactive contamination. The US Food and Drug Administration asked Walmart to pull three lots of Great Value brand frozen shrimp from stores after federal officials detected Cesium-137, a radioactive isotope, in shipping containers and a sample of breaded shrimp imported from Indonesia. Continue reading...", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "Guardian_Business", "title": "OpenAI eyes world’s largest valuation for private company in stock sale talks", "url": "https://www.theguardian.com/technology/2025/aug/19/openai-chatgpt-stock-sale-reports", "id_key": "9789475bd9e037b313e50e666c53d19863af3ceb0d3fba417cc92e569d7bb5d4", "summary": "Maker of ChatGPT reported to be considering $6bn share sale that would boost valuation to $500bn – above SpaceX The maker of ChatGPT is on the cusp of becoming the world’s most valuable private company. OpenAI is in talks to sell $6bn in shares, which would boost its valuation to $500bn, according to multiple reports . The artificial intelligence startup’s stock would be sold to investors by current and former employees. OpenAI has seen exponential growth over the past year. Investors, including Microsoft and SoftBank, have poured at least $40bn into the startup, giving it a valuation of $300bn as of March. Last October, it was valued at $157bn. Continue reading...", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "Guardian_Business", "title": "Trump’s tariffs replace diplomacy as other US tools of statecraft are discarded", "url": "https://www.theguardian.com/us-news/2025/aug/20/trump-tariffs-replace-diplomacy-us-statecraft-discarded", "id_key": "32a07ee9ccf44fb5430735fdeffcfcb170243939c2104a30ccf05e04e17216bd", "summary": "Measures meant to rebalance America’s economy are wielded instead against the likes of Canada, India and Brazil ‘to compel loyalty to the president’ On the campaign trail, Donald Trump pledged to use tariffs to revitalise American industry, bringing jobs home and helping to make America great again. But more than six months into his administration, experts say the president’s trade war is increasingly being wielded as a political cudgel, in lieu of more traditional forms of diplomacy. The president’s current target, India, has been unable to reach a trade agreement, and Trump appears ready to follow through with his threat to impose a further 25% tariff on Delhi – bringing the total to 50% – the joint highest levy on any country, along with Brazil. Continue reading...", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "Guardian_Business", "title": "Microsoft workers occupy HQ in protest against company’s ties to Israeli military", "url": "https://www.theguardian.com/technology/2025/aug/19/microsoft-workers-protest-washington-israel", "id_key": "9796f21fbbae4bd18d68174f8f6fd75844c8fe753d77f452fb5860bf71d079bb", "summary": "Employees outraged by report Azure platform used by Israel to store surveillance data collected on Palestinians Dozens of Microsoft employees occupied the company’s east campus in Redmond, Washington to protest against what they say is the use of its software by the Israeli military to carry out operations in Gaza and enable the surveillance of Palestinians. Less than a week after the company said it was launching an independent investigation into the use of its Azure software, current and former staff occupied a space they declared the “Free Zone”, holding placards that read “Join The Worker Intifada – No Labor for Genocide” and “Martyred Palestinian Children’s Plaza”. Continue reading...", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:23Z", "source": "Guardian_Business", "title": "Vienna announced as host city for Eurovision song contest 2026", "url": "https://www.theguardian.com/tv-and-radio/2025/aug/20/vienna-host-city-eurovision-song-contest-2026", "id_key": "6210eca0e24ef3801365a0447cbe90ba2a5db6ca5b566fee51823b4fc8879464", "summary": "Final of 70th edition of competition to be held on 16 May at the Wiener Stadthalle, Austria’s largest indoor arena Vienna has been chosen to host the Eurovision song contest 2026, the world’s biggest live televised music event, Austria’s public broadcaster announced, with the final set for 16 May. Austria’s JJ won this year’s competition, held in Basel in Switzerland, with his song Wasted Love, which blends techno beats with operatic vocals – making his home country the 2026 host. Continue reading...", "ingested_utc": "2025-08-20T13:39:23Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:24Z", "source": "Guardian_World", "title": "Jimmy Lai has ‘unwavering intent’ to solicit foreign sanctions, Hong Kong court told", "url": "https://www.theguardian.com/world/2025/aug/20/jimmy-lai-unwavering-intent-to-solicit-foreign-sanctions-hong-kong-court-told", "id_key": "64f9b8647fe4d2323a2f25213c041a71e32641cd0e6e3624760e880ec3064027", "summary": "Prosecution makes closing arguments in media mogul’s national security trial, which has lasted more than 140 days Prosecutors in Jimmy Lai’s marathon national security trial have wrapped up their closing arguments in Hong Kong, telling the court that the elderly media mogul and activist had “unwavering intent” to solicit foreign sanctions. Lai has pleaded not guilty to two charges of conspiring to commit foreign collusion under the Beijing-designed national security law, and another charge under the colonial-era laws of conspiring to publish seditious materials. Prosecutors say Lai used his media outlet and foreign political connections to lobby for governments to impose sanctions and other punitive measures against Chinese and Hong Kong authorities. Continue reading...", "ingested_utc": "2025-08-20T13:39:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:24Z", "source": "Guardian_World", "title": "Thousands of Airbus workers in UK to go on strike in dispute over pay", "url": "https://www.theguardian.com/business/2025/aug/20/thousands-of-airbus-workers-in-uk-to-go-on-strike-in-dispute-over-pay", "id_key": "1cd7e7b0aa72647a3c49c4e0bffdcde79d783d37c1c9679af7a5f914d344d4c1", "summary": "Series of walkouts planned for September at factories in Broughton, north Wales, and Filton, near Bristol Business live – latest updates Thousands of Airbus workers in the UK are set to go on strike for 10 days in September in a row over pay which threatens to disrupt the production of aircraft wings. A series of two-day strikes are planned to begin on 2 September and continue throughout the month at Airbus’s factories at Broughton, north Wales, and Filton, near Bristol, according to Unite. Continue reading...", "ingested_utc": "2025-08-20T13:39:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:24Z", "source": "Guardian_World", "title": "Ukraine security talks without Russia are ‘road to nowhere’, Lavrov says – Europe live", "url": "https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news", "id_key": "ab60683d636c616e0ea15ef38e0cd683b99e3c713ea29c633ae7e87b700e064c", "summary": "Lavrov also criticised what he saw as ‘clumsy’ attempts by Europe to change Trump’s position on Ukraine An object which fell and exploded in a cornfield in eastern Poland may have been a component of an old propeller engine, the Polish army said on Wednesday, adding that there had been no violation of Poland’s airspace from Ukraine or Belarus. Police had earlier announced that an unidentified object had fallen in a field in the village of Osiny in eastern Poland’s Lublin province, which borders Ukraine. “...after conducting preliminary analyses of radar system records, no violation of Polish airspace was recorded last night from either Ukraine or Belarus,” the Operational Command of the Polish Armed Forces said on X. Continue reading...", "ingested_utc": "2025-08-20T13:39:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:24Z", "source": "Guardian_World", "title": "French streamer dies live online after months of apparent mistreatment", "url": "https://www.theguardian.com/world/2025/aug/20/french-government-investigating-death-of-man-during-live-stream", "id_key": "703c1ca3c24b918c4a7272d2d2f2843f50b4ca377e3da40ed261201c0d810caa", "summary": "Jean Pormanove featured regularly in videos in which he appeared to be assaulted or humiliated as viewers watched French authorities are investigating the death of a man during a live video stream on the Kick platform, where he had regularly been shown enduring violence and humiliation. Prosecutors ordered an autopsy and opened an investigation into the death of the man, 46, in the village of Contes, north of Nice, on Monday. Continue reading...", "ingested_utc": "2025-08-20T13:39:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:24Z", "source": "Guardian_World", "title": "Israel to call up around 60,000 reservists before planned offensive on Gaza City, says Israeli military official – Middle East crisis live", "url": "https://www.theguardian.com/world/live/2025/aug/20/israeli-army-reservists-gaza-city-offensive-ceasefire-proposal-middle-east-crisis-latest-updates-news", "id_key": "b56545a5c85e79160ac2cbbbb98284f3ed79cd35e6c42925e4606d27c6ad0717", "summary": "Call-up notices sent as Israeli plans to increase its offensive; Israel studies Hamas’ response to proposal for 60-day ceasefire On the ground in Gaza City on Wednesday, Mustafa Qazzaat, head of the emergency committee in the Gaza municipality, described the situation as “catastrophic” as Israel’s defence minister approved a plan on Wednesday for the conquest of Gaza City. He told AFP that “large numbers” of people were fleeing their neighbourhoods, with the majority of those displaced “on the roads and streets without shelter.” Continue reading...", "ingested_utc": "2025-08-20T13:39:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:24Z", "source": "Guardian_World", "title": "Government’s deal with Iraq to return illegal migrants will ‘deter small boat arrivals’, says Starmer – UK politics live", "url": "https://www.theguardian.com/politics/live/2025/aug/20/government-housing-asylum-seekers-epping-court-injunction-uk-politics-latest-updates-news", "id_key": "24113994eaa2ebe68fa230a64b415e3f42adfc5337f9fc7cd6f594064655e865", "summary": "Prime minister says ‘strengthened partnership with Iraq will secure our borders’ as more councils in England plan to challenge asylum hotels Train fares in England are now expected to rise by a higher-than-expected 5.8% next year, causing concern among passenger groups. Rail ticket increases are usually calculated by adding one percentage point to July’s inflation reading on the retail prices index (RPI) , which came in 0.2 points above forecasts on Wednesday at 4.8%. Continue reading...", "ingested_utc": "2025-08-20T13:39:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:24Z", "source": "Guardian_World", "title": "Ministers line up plan to run Liberty Steel’s South Yorkshire plants in administration", "url": "https://www.theguardian.com/business/2025/aug/20/ministers-line-up-plan-to-run-liberty-steel-south-yorkshire-plants-in-administration", "id_key": "20fe5f8247f585778f7ed64d4352457751f8a64951a7aed028d526867f9f44ab", "summary": "Move shows government is ready to step in immediately to secure operations of SSUK, which employs 1,450 Business live – latest updates Ministers have lined up special managers to run Liberty Steel’s South Yorkshire operations if they are put into administration, according to a dramatic revelation at London’s high court. The development shows the government is ready to step in immediately to secure the continued operations of the Speciality Steel UK (SSUK), which employs 1,450 people at the group’s operations at an electric arc furnace in Rotherham and another plant in Stocksbridge, both in South Yorkshire. Continue reading...", "ingested_utc": "2025-08-20T13:39:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:41Z", "source": "BitcoinMagazine", "title": "KARTOON STUDIOS LAUNCHES “BITCOIN BRIGADE: ADVENTURES IN SATOSHI CITY” – A NEW ANIMATED CHILDREN’S SERIES AND MULTI-PLATFORM ECOSYSTEM BUILT AROUND BITCOIN AND DEFI", "url": "https://bitcoinmagazine.com/press-releases/kartoon-studios-launches-bitcoin-brigade-adventures-in-satoshi-city-a-new-animated-childrens-series-and-multi-platform-ecosystem-built-around-bitcoin-and-defi", "id_key": "45cc4c66ca516deabfadffda90aaa1c361f86e99c7ece1999151764d977dcfdd", "summary": "Bitcoin Magazine KARTOON STUDIOS LAUNCHES “BITCOIN BRIGADE: ADVENTURES IN SATOSHI CITY” – A NEW ANIMATED CHILDREN’S SERIES AND MULTI-PLATFORM ECOSYSTEM BUILT AROUND BITCOIN AND DEFI Kartoon Studios, in Partnership with Austria’s Bitkern, Unveils a Bitcoin-Native Ecosystem that Combines Animated Entertainment, Interactive Rewards, and Educational Apps to Empower the Next Generation. This post KARTOON STUDIOS LAUNCHES “BITCOIN BRIGADE: ADVENTURES IN SATOSHI CITY” – A NEW ANIMATED CHILDREN’S SERIES AND MULTI-PLATFORM ECOSYSTEM BUILT AROUND BITCOIN AND DEFI first appeared on Bitcoin Magazine and is written by Kartoon Studios .", "ingested_utc": "2025-08-20T13:39:41Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:41Z", "source": "BitcoinMagazine", "title": "Who Rugged Rogoff?", "url": "https://bitcoinmagazine.com/takes/who-rugged-rogoff-blames-criminals-trump", "id_key": "1b2aa68c44d3863c0ba6d662cc7076107223d5cb7357816adc938120f70c64ac", "summary": "Bitcoin Magazine Who Rugged Rogoff? Kenneth Rogoff spoke, and the Bitcoin hornet’s nest awoke. When the celebrated Harvard economist and former chief economist at the IMF yesterday publicly confessed that he was wrong on Bitcoin, he didn’t do so gracefully; instead, he doubled down. You see, it wasn’t that his prediction in 2018 of Bitcoin’s imminent doom and the bitcoin […] This post Who Rugged Rogoff? first appeared on Bitcoin Magazine and is written by Joakim Book .", "ingested_utc": "2025-08-20T13:39:41Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:42Z", "source": "CryptoSlate", "title": "China quietly prepares yuan stablecoins as 99% of supply minted in dollars", "url": "https://cryptoslate.com/china-quietly-prepares-yuan-stablecoins-as-99-of-supply-minted-in-dollars/", "id_key": "c1ee673106298bbb7786504a648197ee3c88144448fb1ad9d076bdc92d47d07d", "summary": "China is evaluating yuan-backed stablecoins for the first time, with the State Council set to review a roadmap on currency internationalization and stablecoin usage later this month, per Reuters. The plan would assign regulatory responsibilities, outline risk controls, and task the People’s Bank of China with implementation, and pilot activity is expected in Hong Kong […] The post China quietly prepares yuan stablecoins as 99% of supply minted in dollars appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T13:39:42Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:42Z", "source": "CryptoSlate", "title": "Why Bitcoin’s realized cap spiked as price fell to $112k", "url": "https://cryptoslate.com/insights/why-bitcoins-realized-cap-spiked-as-price-fell-to-122k/", "id_key": "87962d164ce4c47ab85eaa9168f84f6eb1d17ba333076c5f1e6c5d71ccdbb41f", "summary": "Bitcoin’s spot price fell on Aug. 19 while realized cap climbed, a textbook case of how on-chain cost basis can advance even on a red day. The daily close dropped 2.94% from $116,284 on Aug. 18 to $112,861 on Aug. 19. The realized cap rose by $1.172 billion over the same window, from $1.038456 trillion […] The post Why Bitcoin’s realized cap spiked as price fell to $112k appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T13:39:42Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:42Z", "source": "CryptoSlate", "title": "Market saw $449M in liquidations as ETH dropped nearly 6%", "url": "https://cryptoslate.com/insights/market-sees-449m-in-liquidations-as-eth-drops-nearly-6-percent/", "id_key": "a0a115f2e11f9821397490ee70e171a0f9c25bfeb2e4a981102f8b9b486989ec", "summary": "The crypto market saw heavy liquidations totaling $449.11 million, with the overwhelming majority coming from longs. Out of this figure, $362.34 million came from longs and just $87 million from shorts, showing that most traders were positioned for the upside. Bybit and Binance dominated activity, accounting for $166.53 million and $140.36 million in liquidations, respectively, […] The post Market saw $449M in liquidations as ETH dropped nearly 6% appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T13:39:42Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:42Z", "source": "CryptoSlate", "title": "Fed warns banks could become irrelevant if they ignore blockchain adoption now", "url": "https://cryptoslate.com/fed-warns-banks-could-become-irrelevant-if-they-ignore-blockchain-adoption-now/", "id_key": "77b9cfc76130a2e6ca09f97d4c389fbf5bde7685b5882329b73eb0ff392426db", "summary": "Federal Reserve Vice Chair for Supervision Michelle Bowman has called for banks to embrace blockchain technology or risk losing relevance. At the Wyoming Blockchain Symposium on Aug. 19, Bowman emphasized that regulators and banks must adopt a more proactive approach to the crypto industry. She pointed out that integrating these new innovative technologies would be crucial […] The post Fed warns banks could become irrelevant if they ignore blockchain adoption now appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T13:39:42Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:43Z", "source": "CryptoBriefing", "title": "China may approve yuan-backed stablecoins amid fears of dollar-powered tokens", "url": "https://cryptobriefing.com/china-yuan-backed-stablecoins-approval/", "id_key": "23fffe8e2f6f8ef412f5312f514d2cc5404471a9b743fa086959c7d164fa9556", "summary": "China's potential approval of yuan-backed stablecoins could shift global financial dynamics, challenging the dollar's dominance in digital currency. The post China may approve yuan-backed stablecoins amid fears of dollar-powered tokens appeared first on Crypto Briefing .", "ingested_utc": "2025-08-20T13:39:43Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:53Z", "source": "CryptoNews", "title": "Crypto VC Funding Drops 59% to $1.97 Billion in Q2 2025", "url": "https://cryptonews.com/news/crypto-vc-funding-drops-59-to-1-97-billion-in-q2-2025/", "id_key": "e4ee613471fad579a2986b9c5b0d50f10c42287268511b3621dd2b1cb60ceab1", "summary": "Venture capital funding for crypto startups plunged in the second quarter of 2025, marking one of the weakest periods since late 2020. The post Crypto VC Funding Drops 59% to $1.97 Billion in Q2 2025 appeared first on Cryptonews .", "ingested_utc": "2025-08-20T13:39:53Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:53Z", "source": "CryptoNews", "title": "Ethereum Crashes to $4,063 as BlackRock, Fidelity, Dump $422M Worth of ETH – Rally Over?", "url": "https://cryptonews.com/news/ethereum-crashes-to-4063-as-blackrock-fidelity-dump-422m-worth-of-eth-rally-over/", "id_key": "8ca8ab21299fba81b8eed0b019533832f4ff0b1b6717e897d6480e3bc1bd559f", "summary": "Ethereum crashes to $4,063 amid massive institutional selling as ETF giants BlackRock, Fidelity, and Grayscale offload $422M worth of ETH within 24 hours triggering $172.9M in liquidations and raising questions about the end of ETH's 200% rally. The post Ethereum Crashes to $4,063 as BlackRock, Fidelity, Dump $422M Worth of ETH – Rally Over? appeared first on Cryptonews .", "ingested_utc": "2025-08-20T13:39:53Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:39:53Z", "source": "CryptoNews", "title": "Altcoin Season On? Is SOL About to See a Major Price Spike as Bullish Bets on Solana Stablecoins for $1.15B Capital Raise?", "url": "https://cryptonews.com/news/altcoin-season-on-is-sol-about-to-see-a-major-price-spike-as-bullish-bets-on-solana-stablecoins-for-1-5b-capital-raise/", "id_key": "573618b92d6bc4fe78f8d30500f14ce48049690f4a22ecdcf156ecf40d331a3d", "summary": "Does Bullish's decision to receive the proceeds of its $1.15 billion IPO in Solana-based stablecoins mean that a big SOL rally is coming? The post Altcoin Season On? Is SOL About to See a Major Price Spike as Bullish Bets on Solana Stablecoins for $1.15B Capital Raise? appeared first on Cryptonews .", "ingested_utc": "2025-08-20T13:39:53Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:38Z", "source": "MarketWatch_Bulletins", "title": "The bond market is flashing a potentially worrisome sign about Fed rate cuts", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=74e74f2f-6e40-4718-ad95-2850eadeb7e1&mod=mw_rss_bulletins", "id_key": "2b0d49be4e2b85be073c359815674892cf42c62c61d83f04ddfcf71d76468fad", "summary": "", "ingested_utc": "2025-08-20T13:41:38Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:45Z", "source": "NYTimes_Business", "title": "How Tariffs Will Affect This Unique Cheese", "url": "https://www.nytimes.com/video/business/small-business/100000010283073/blue-cheese-stilton-tariffs-america.html", "id_key": "5aff9cb493471e8abeea9f9e5dce41eba023e23b0bcf85935e3c7f6e2803705f", "summary": "Stilton is a special type of blue cheese that can be made in only three English counties. There are just four producers of Stilton left, but this one was crowned best cheese in the world, according to one of the industry’s top awards last year. Eshe Nelson, a business reporter for The New York Times, went to Clawson Farms, the producer of the award-winning Stilton, which is trying to expand its business in the United States, despite the higher costs imposed by the Trump administration’s tariff policy.", "ingested_utc": "2025-08-20T13:41:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:45Z", "source": "NYTimes_Business", "title": "Is the A.I. Sell-off the Start of Something Bigger?", "url": "https://www.nytimes.com/2025/08/20/business/dealbook/ai-dip-blip-palantir-nvidia.html", "id_key": "d017c7a4c152f89d0b6fcbe6e39ec937fd08e689a6a0e1caaa35c91c1f9c1307", "summary": "A sharp drop in technology stocks, and even comments by OpenAI’s Sam Altman, suggest investors are getting too exuberant about artificial intelligence.", "ingested_utc": "2025-08-20T13:41:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:45Z", "source": "NYTimes_Business", "title": "New Details Emerge on Fox Hosts’ Efforts to Bolster Trump in 2020", "url": "https://www.nytimes.com/2025/08/19/business/media/fox-news-trump-election-documents.html", "id_key": "4a1046cb2426a6d429f53e66f2e89acf7f4d5fac6ae8ce245e87b29334f7c221", "summary": "The documents were released as part of a defamation case against Fox Corporation filed by Smartmatic, an election technology company.", "ingested_utc": "2025-08-20T13:41:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:45Z", "source": "NYTimes_World", "title": "African Union Endorses Call to Abandoned the Mercator Map", "url": "https://www.nytimes.com/2025/08/19/world/africa/africa-map-mercator.html", "id_key": "ad425da26ed14e3e3e057e6df314bfae4f10009ff1a067e9bb57f96071ac4ca7", "summary": "A campaign is underway to replace the world’s most popular map, which the effort’s supporters say promotes a false view of the continent and its size.", "ingested_utc": "2025-08-20T13:41:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:45Z", "source": "NYTimes_World", "title": "No Food, No Water, a Broken Leg: How a Hiker Survived a Harrowing Week in the Wild", "url": "https://www.nytimes.com/2025/08/20/world/europe/alec-luhn-missing-hiker-norway-found-interview.html", "id_key": "89626248064331e69dbd5c548d594aa84ec418775375a2dff9c4b04fb3f82f89", "summary": "Alec Luhn, 38, an American journalist, hopes the lessons he learned from his ordeal in a national park in Norway can help others.", "ingested_utc": "2025-08-20T13:41:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:45Z", "source": "NYTimes_World", "title": "More Than 70 Afghans Returning From Iran Die in Fiery Bus Crash", "url": "https://www.nytimes.com/2025/08/20/world/asia/afghan-deportation-bus-crash.html", "id_key": "088c658226eb8ea436d981b98588a9de1e451efdc2a0d0ddb9c2c60861ae6feb", "summary": "The bus collided with two vehicles. The victims were among the 1.8 million Afghans expelled from Iran as the country vowed to deport undocumented residents en masse.", "ingested_utc": "2025-08-20T13:41:45Z"}
{"published_utc": "2025-08-16", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:47Z", "source": "NYTimes_Technology", "title": "Elon Musk’s SpaceX Most Likely Doesn’t Pay Taxes", "url": "https://www.nytimes.com/2025/08/15/technology/spacex-musk-government-contracts-taxes.html", "id_key": "9e7c59e04d1cdcb1652a5194c0e7856649bfe5c9817abafd59f26a7b68b8c22d", "summary": "Elon Musk’s rocket company relies on federal contracts, but years of losses have most likely let it avoid paying federal income taxes, according to internal company documents.", "ingested_utc": "2025-08-20T13:41:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:53Z", "source": "NPR_Top", "title": "Trump's control of D.C. police is limited. Its National Guard is a different story", "url": "https://www.npr.org/2025/08/20/nx-s1-5505987/trump-dc-takeover-timing-national-guard-police", "id_key": "58c37db7e1a26e6a23c898b5ef7cce483f27562a781e16e1e6fa944e04b0b6c4", "summary": "President Trump needs Congress' permission to use D.C.'s police for over 30 days, but there are no such limits on its National Guard. Experts spoke to NPR about how the takeover could end.", "ingested_utc": "2025-08-20T13:41:53Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:53Z", "source": "NPR_Top", "title": "After the CDC shooting, federal workers pressure RFK Jr. for more protections", "url": "https://www.npr.org/sections/shots-health-news/2025/08/20/nx-s1-5507208/after-shooting-cdc-workers-demand-more-protections-from-hhs-secretary", "id_key": "23a869c51b6707e2a89c15af46051b2286c9e352fdeaca3582bcf02a7e1f08dd", "summary": "More than 750 current and former HHS employees signed a letter to Health Secretary Robert F. Kennedy, Jr. demanding he stop spreading inaccurate information and guarantee the safety of the workforce.", "ingested_utc": "2025-08-20T13:41:53Z"}
{"published_utc": "2025-08-11", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:54Z", "source": "NPR_Economy", "title": "Stores that import musical instruments hit hard by Trump's tariffs", "url": "https://www.npr.org/2025/08/11/nx-s1-5486143/stores-that-import-musical-instruments-hit-hard-by-trumps-tariffs", "id_key": "6279812720a59890cb9f26ccc8fba50198872280a0a22d33b793a4277f4f9a2e", "summary": "Over the years, there's been a decline in the manufacture of musical instruments in the U.S. A large portion come from overseas. Now, tariffs are causing a big jump in costs for music stores.", "ingested_utc": "2025-08-20T13:41:54Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:57Z", "source": "FT_Home", "title": "UK house price inflation accelerates following rate cuts", "url": "https://www.ft.com/content/7c036f7a-66a5-4e4b-9be4-d86a2cdc307c", "id_key": "b1e5d9a662c6ad9a4f6a47d8ae5cdaf88388751f2185bfd46313fa1670bd7f97", "summary": "Rental inflation cools to 5.9% in July, with average rent hitting £1,343 a month", "ingested_utc": "2025-08-20T13:41:57Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:57Z", "source": "FT_Home", "title": "Europe’s rich watch Norway’s election debate on wealth taxes", "url": "https://www.ft.com/content/0d853ed3-d1bc-4a6d-a892-b46a32c54d86", "id_key": "a65d52c95e5fbfd80e52eadbfc1a4f73c15ed9a67d9f69f1a8d43daa22cc839f", "summary": "Changes to taxation are at the heart of the centre-right’s attempts to retake power", "ingested_utc": "2025-08-20T13:41:57Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:41:57Z", "source": "FT_Home", "title": "Israel to call up 60,000 reservists ahead of Gaza City invasion", "url": "https://www.ft.com/content/34df5836-2c2f-4f4f-90d1-174797e53c0b", "id_key": "e9da85c75465756148d23c53107d2814d0744c669643c35981800aa35dee25f1", "summary": "Plan for renewed assault comes as officials approve controversial settlement project that would split West Bank", "ingested_utc": "2025-08-20T13:41:57Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:12Z", "source": "TheVerge_All", "title": "Amazon now sells used Hertz rental cars", "url": "https://www.theverge.com/news/762183/hertz-amazon-autos-used-rental-vehicles", "id_key": "e9135e500dc4f1f9f868bd277c6e6d8fc6f49572e2398bd83d07ff275eabe19c", "summary": "Hertz has announced that it will start selling used cars from its rental business on Amazon Autos. The company’s pre-owned vehicles are now available in Dallas, Houston, Los Angeles, and Seattle, according to a new page on Hertz’s website, with “more locations coming soon.” The Verge was unable to find any live Hertz vehicle listings […]", "ingested_utc": "2025-08-20T13:42:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:15Z", "source": "WIRED_All", "title": "AI Isn’t Coming for Hollywood. It's Already Arrived", "url": "https://www.wired.com/story/artificial-intelligence-hollywood-stability/", "id_key": "001bc4a5fe8461ddf16d76f58a37c9f59f162714970dca1e274b27cf37adcdaa", "summary": "An early winner in the generative AI wars was near collapse—then bet everything on a star-studded comeback. Can Stability AI beat the competition?", "ingested_utc": "2025-08-20T13:42:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:16Z", "source": "Engadget_All", "title": "This Anker 3-in-1 wireless charging station is down to a record-low price", "url": "https://www.engadget.com/deals/this-anker-3-in-1-wireless-charging-station-is-down-to-a-record-low-price-145325478.html?src=rss", "id_key": "9ca4178d537a617cf06bd54bfcb149853753687d45d224eb9fec2031570a93ba", "summary": "Anker makes some of our favorite charging gear, and now you can save on a bunch of wireless power accessories from the brand. Whether you're going back to school soon or want a new charging station that can power up a few devices at once, there are discounts here worth considering. One of the best is this 3-in-1 MagSafe charging station , on sale for a record low price of $63. The Qi2-certified charger wirelessly charges your compatible iPhone, Apple Watch, and AirPods on one compact and convenient dock. Qi2 boasts 15W of power, so you can take advantage of fast charging on compatible devices. This means the station can charge an iPhone 16 Pro Max to 20 percent in just 20 minutes and an Apple Watch Series 10 from zero to 100 percent in just over an hour. The magnetic stand for your iPhone is adjustable with 45 degrees of vertical rotation and 360 degrees of horizontal rotation, so you can always find the perfect angle for your phone while charging. Being able to wirelessly charge these three daily devices at once might remind you of Apple's wireless charging pad that never was, but Anker's 3-in-1 charging station offers an elegant solution. We tend to like Anker's charging products , and we’ve found they make some of the best charging stations on the market. Anker's products can be a bit pricey, though, which is why the best time to pick them up is during these sales. The company actually has a slew of its charging products on sale right now . Its 3-in-1 wireless charging cube is 31 percent off right now and down to $104. If you're a Prime member and have a Qi2-compatible iPhone, then you might also look at Anker's simple Qi2 charging pad , which is 35 percent off for a two-pack right now. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/this-anker-3-in-1-wireless-charging-station-is-down-to-a-record-low-price-145325478.html?src=rss", "ingested_utc": "2025-08-20T13:42:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:16Z", "source": "Engadget_All", "title": "IBM and NASA made an open-source AI model for predicting solar weather", "url": "https://www.engadget.com/ai/ibm-and-nasa-made-an-open-source-ai-model-for-predicting-solar-weather-130013974.html?src=rss", "id_key": "848a0429d471d0085d067a72394334e1466366a262710f19f1630e2f851743c5", "summary": "Last year, the most powerful geomagnetic storm in 20 years hit Earth . It produced stunning aurora displays in parts of the US that are normally too far south to see them. Normally, such storms are a headache for energy providers. In 1989, for example, the Canadian province of Québec suffered a nine-hour blackout following a series of plasma ejections from the Sun. This time around, power companies were better prepared, and in the US and Canada, there weren't significant service disruptions. The episode highlighted the value of proper preparation against geomagnetic storms, and for the past couple of years, NASA and IBM have been working to give the scientific community and others a better way to predict solar weather. Today, they're releasing the result of their work, an open-source foundation model called Surya. Named after the Sanskrit word for the Sun, Juan Bernabe-Moreno, director of IBM Research Europe, UK and Ireland, describes the system as an \"AI telescope for the Sun.\" IBM trained the model on nine years of high-resolution images from the Solar Dynamics Observatory (SDO), a satellite NASA has been using to study the Sun since 2010. IBM Effectively, Surya applies machine learning to solar image interpretation and forecasting, and the results are promising. In early testing, Bernabe-Moreno says IBM found the model was 16 percent more accurate at answering the question \"will there be a solar flare in the next 24 hours?\" than past systems. Additionally, the model can generate visual predictions of what the SDO might see ahead of time. So far, using data from the most recently completed solar cycle , IBM has found Surya can accurately predict what the sun will look like two hours ahead of time. \"We’re exploring the accuracy of even longer lead time predictions,\" Bernabe-Moreno told me. Two hours might not seem like a lot, but according to Bernabe-Moreno, who previously worked at one of Europe's largest energy companies, it could be a game changer for infrastructure providers, which have spent the last few decades building more responsive power grids. Moreover, Surya is a 366 million parameter model, meaning it's light enough to run on less powerful hardware. The irony of today's announcement is that it demonstrates the value of NASA's science team exactly at a time when its very existence is threatened. If you haven't been following what's been going on at the agency, President Trump plans to cut NASA's science budget by nearly half . The Solar Dynamics Observatory would be among the missions affected by the proposed cuts. It won't be cancelled like New Horizons and OSIRIS-APEX, but according to an analysis by The Planetary Society , the mission would have its operating budget slashed from $14 million annually to $8 million per year. IBM Policymakers from both parties have pushed back on the proposal, but with the Senate and House not yet in agreement on the agency's 2026 operating budget, and the appropriations deadline quickly approaching, NASA's fate is uncertain. Even if the cuts don't go through, the agency is on track to lose close to 4,000 employees , or about 20 percent of its workforce, as part of the Trump administration's broader efforts to trim the number of workers across the federal government. Bernabe-Moreno says Surya wouldn't have come together without NASA's help. \"From the very beginning, the science team at NASA have been informing us what the model should do, how to validate the model, and how to ensure it's robust,\" he said. If there's a silver lining to the funding situation, it's that the science team's work will live on. \"The beauty of this model is that we created a capability — an AI platform, if you want,\" said Bernabe-Moreno. \"And this capability has applications beyond NASA.\" If you want to check out Surya for yourself, you can download the model from Hugging Face . This article originally appeared on Engadget at https://www.engadget.com/ai/ibm-and-nasa-made-an-open-source-ai-model-for-predicting-solar-weather-130013974.html?src=rss", "ingested_utc": "2025-08-20T13:42:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:16Z", "source": "Engadget_All", "title": "Apple's MacBook Air M4 is cheaper than ever right now", "url": "https://www.engadget.com/deals/apples-macbook-air-m4-is-cheaper-than-ever-right-now-123031245.html?src=rss", "id_key": "af5cdb3dd4b9187ffd73e3aac039c5a88116ed51309a7f38cc6fa81a236e51de", "summary": "Whether you need a new MacBook for the upcoming semester or you've just been itching to upgrade from an older machine, now's a good time to buy. Amazon has a sale on the latest M4 MacBook Air that knocks up to 20 percent off many configurations. The base model is where you'll get the biggest discount. The 16GB RAM/256GB SSD laptop is down to $799 from $999, which is the lowest price we've seen. You can upgrade to 512GB SSD for $999 , down from $1,199, another all-time low price, or 24GB of RAM and a 512GB SSD for $1,199, down from $1,399. Then there's the 15-inch MacBook Air M4 , whose cheapest model is on sale for $999, dropping from $1,199. The 17 percent discount is the best deal we've seen since the pair debuted in March. As with the 13-inch model, the 16GB and 512GB SSD option is also a record-low price, dropping to $1,199 from $1,399. Then there's the 24GB upgrade , which is $1,399, down from $1,599. We're big fans of the MacBook Air M4, giving it a 92 in our review . Part of that comes from an already lower starting price for the MacBooks than their predecessors. The 2025 models also get a speed boost thanks to the M4 chip and are very thin with a 0.44-inch thickness. Neither the 13- or 15-inch will drag you down, weighing 2.7 pounds and 3.2 pounds, respectively. Plus, they both have excellent battery life, lasting over 18 hours while playing an HD video. The big differences in the 15-inch model mostly come down to size. The screen is obviously bigger, as is its trackpad. Other than that, it offers better speakers than its 13-inch sibling. Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/apples-macbook-air-m4-is-cheaper-than-ever-right-now-123031245.html?src=rss", "ingested_utc": "2025-08-20T13:42:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:25Z", "source": "TheStreet_Top", "title": "77-year-old airline cancels all flights in Chapter 11 bankruptcy", "url": "https://www.thestreet.com/travel/ravn-alaska-airline-shuts-down", "id_key": "8b46ce9e2730bdcf6a931a5568383f6d06e29851d3e39e3fc74fd8f3edeaa562", "summary": "\"We appreciate the years of service we were able to provide,\" the regional airline said as its goodbye.", "ingested_utc": "2025-08-20T13:42:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:25Z", "source": "TheStreet_Top", "title": "Secretive hedge fund takes profit on IT highflyer, buys major position in another", "url": "https://www.thestreet.com/investing/secretive-hedge-fund-takes-profit-on-it-highflyer-buys-major-position-in-another", "id_key": "600526a4483311fe3d9f55f6581466b8dcb8cdef98b95ce34f3e83360306bbdf", "summary": "Two hot tech stocks make up its largest holdings.", "ingested_utc": "2025-08-20T13:42:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:25Z", "source": "TheStreet_Top", "title": "Amazon is selling a $91 5-tier metal wire storage shelf for $35, and shoppers say it's 'strong and stable'", "url": "https://www.thestreet.com/deals/mmzg-5-tier-metal-wire-shelf-amazon-sale", "id_key": "c42d4d807804523a933876275490356b7fcfd6af834b084f5ecbabaa3fb6f42e", "summary": "This shelf has tons of potential.", "ingested_utc": "2025-08-20T13:42:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:25Z", "source": "TheStreet_Top", "title": "Why Secretary Bessent strongly defends US investment in Intel", "url": "https://www.thestreet.com/investing/stocks/treasury-secretary-delivers-candid-take-on-us-buying-intel-stock", "id_key": "4dfbd0209eeb11ce3146f380e397e6fcef4fd3c28456efce52c767538cc4a61f", "summary": "Secretary Scott Bessent weighed in on the chipmaker's future.", "ingested_utc": "2025-08-20T13:42:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:25Z", "source": "TheStreet_Top", "title": "Another iconic chicken fast-food chain closing locations", "url": "https://www.thestreet.com/restaurants/harolds-chicken-locations-file-for-bankruptcy", "id_key": "31650a11dbcc8cb13c449fd22fb30b45e8afe39c0741b2ca8d5ddd7f4b0acedc", "summary": "\"We've made the decision to close this location,\" a voicemail for the restaurant now says.", "ingested_utc": "2025-08-20T13:42:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:25Z", "source": "AlJazeera_All", "title": "Israel approves illegal settlement plan that would split occupied West Bank", "url": "https://www.aljazeera.com/news/2025/8/20/israel-approves-settlement-plan-which-will-split-occupied-west-bank-in-half?traffic_source=rss", "id_key": "02797ea8a87967078ef70bdf7ad6e5dcc74b5c84949abdc061bd364ef9e0e0a1", "summary": "Location of E1 is significant because it is one of the last geographical links between Bethlehem and Ramallah.", "ingested_utc": "2025-08-20T13:42:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:32Z", "source": "FinancialPost_Business", "title": "First Quantum Announces Completion of $1,000 Million Senior Notes Offering", "url": "https://financialpost.com/globe-newswire/first-quantum-announces-completion-of-1000-million-senior-notes-offering-2", "id_key": "2f6e41f5e403480ae7d7d8f61e867cde737d5e437b1c789ddd49b1399eea54a6", "summary": "(In United States dollars, except where noted otherwise) TORONTO, Aug. 20, 2025 (GLOBE NEWSWIRE) — First Quantum Minerals Ltd. (“First Quantum” or the “Company”) (TSX: FM) announces that it has completed its offering of $1,000 million aggregate principal amount of 7.250% senior notes due 2034 (the “Notes”). The Notes are senior unsecured obligations of the […]", "ingested_utc": "2025-08-20T13:42:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:32Z", "source": "FinancialPost_Business", "title": "Andersen Consulting Adds Advisory and Market Intelligence Firm Ventures", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/andersen-consulting-adds-advisory-and-market-intelligence-firm-ventures", "id_key": "355b8f772d5bc1ed24adfcc304f24fedae8e8be46c43b31b0dd47b28c41a6715", "summary": "SAN FRANCISCO — Andersen Consulting announces a Collaboration Agreement with Ventures, a leading advisory and business intelligence firm based in the Middle East, enhancing its capabilities in market analysis, economic advisory, and industry forecasting across key sectors. Founded in 2002, Ventures delivers comprehensive services across advisory, consumer research, and business intelligence through its divisions—Ventures Onsite, […]", "ingested_utc": "2025-08-20T13:42:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:32Z", "source": "FinancialPost_Business", "title": "Energy Vault, Turkey’s Astor Enerji Launch Global Strategic Partnership with BESS Deployments Totalling 2 GWh and 1 GW Transformer Procurement from Astor Enerji", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/energy-vault-turkeys-astor-enerji-launch-global-strategic-partnership-with-bess-deployments-totalling-2-gwh-and-1-gw-transformer-procurement-from-astor-enerji", "id_key": "dae3a8a2bed0eac3cb8c70cb3664a3e3313ab6e1b033917811de08188e76cce3", "summary": "The partnership brings together advanced expertise in energy storage, transformers, high-voltage equipment, and energy management software — maximizing project returns (IRR) while reducing time-to-market for critical infrastructure such as AI Data Centers Energy Vault will deliver to Astor Enerji 2 GWh of B-VAULT™ systems for its grid-connected PV projects, combining advanced energy storage technology with […]", "ingested_utc": "2025-08-20T13:42:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:32Z", "source": "FinancialPost_Business", "title": "Stallion Uranium Completes First Tranche of Non-Brokered Private Placement and Announces Upsizing", "url": "https://financialpost.com/globe-newswire/stallion-uranium-completes-first-tranche-of-non-brokered-private-placement-and-announces-upsizing", "id_key": "929e133925a3277dd77494850319667b2ab4028b7fcd6179f06dbbc00511e234", "summary": "NOT FOR DISTRIBUTION TO U.S. NEWS WIRE SERVICES OR DISSEMINATION IN THE UNITED STATES VANCOUVER, British Columbia, Aug. 20, 2025 (GLOBE NEWSWIRE) — Stallion Uranium Corp. (the “Company” or “Stallion”) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) is pleased to announce that it has closed a first tranche of its previously announced non-brokered private placement of […]", "ingested_utc": "2025-08-20T13:42:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:32Z", "source": "FinancialPost_Business", "title": "How to make climate-friendly and sustainable choices when shopping online", "url": "https://financialpost.com/pmn/how-to-make-climate-friendly-and-sustainable-choices-when-shopping-online", "id_key": "6d12fa3d7a132686c1d2666d9ab95429a6c4811456d6aaa30b682adff5278c57", "summary": "One way to be climate-friendly: Shop sustainably. But figuring out which products count as “sustainable” can be hard, especially when buying online. As ordering with a computer or phone becomes more ubiquitous, the number of online products labeled sustainable is also increasing. Yet there is no single seal of approval across e-commerce platforms that verifies […]", "ingested_utc": "2025-08-20T13:42:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:32Z", "source": "FinancialPost_Business", "title": "EDI Launches Next-Gen MMU with Remote Access and Enhanced Security", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/edi-launches-next-gen-mmu-with-remote-access-and-enhanced-security", "id_key": "32e3d4bdde930ffd784fd5ac74db2f16888dd88878cb1c27f388f913f8cffb4e", "summary": "A More Efficient Solution to Optimize Traffic Safety and Reduce Operational Costs GREENVILLE, Texas — Eberle Design (EDI), an industry leader in traffic monitoring solutions and part of the Synapse ITS family of brands, today announced its new Malfunction Management Unit (MMU), which will be showcased for the first time at Atlanta ITS World Congress […]", "ingested_utc": "2025-08-20T13:42:32Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T13:42:32Z", "source": "FinancialPost_Business", "title": "RouteThis Names Tom Lieu as Chief Financial Officer to Support Next Stage of Growth", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/routethis-names-tom-lieu-as-chief-financial-officer-to-support-next-stage-of-growth", "id_key": "3fc5955d891e8cf7df538b3ed5bc8abb9e88804733f96910fd00d90b9c6ec105", "summary": "KITCHENER, Ontario — RouteThis, a leader in WiFi customer experience (CX) solutions, today announced the addition of Tom Lieu to its executive team as Chief Financial Officer (CFO). With a proven track record in scaling financial operations for high-growth technology companies, Lieu joins RouteThis during a pivotal time as the company expands its market presence […]", "ingested_utc": "2025-08-20T13:42:32Z"}
