{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:43Z", "source": "BBC_World", "title": "Heavy rain paralyses life in India's financial capital Mumbai", "url": "https://www.bbc.com/news/articles/cx29jw7488go?at_medium=RSS&at_campaign=rss", "id_key": "933dd0e5a6246a21aa8306a53746573ba72454ed867ce70d609d5abd3548c691", "summary": "Nearly 600 people were rescued from a stalled monorail system and 350 others have been shifted to shelters.", "ingested_utc": "2025-08-20T07:32:43Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:46Z", "source": "Guardian_World", "title": "News live: Australia needs to escalate sanctions on Israel, Husic says; widespread flood warnings for NSW", "url": "https://www.theguardian.com/australia-news/live/2025/aug/20/australia-news-live-bruce-lehrmann-federal-court-appeal-network-10-lisa-wilkinson-brittany-higgins-parliament-productivity-economic-reform-roundtable-ntwnfb", "id_key": "89963dcee21afa844566d3d53c59571433639ca2dae19f6e114eb7ae8ebc7aa3", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast As I noted in my hello earlier, rain is on the brain in Sydney, with a deluge set to continue for days. Melbourne is cold, but lovely, and Adelaide and Hobart are both expecting sunshine today. Brisbane, Perth and Canberra are in for rain. Continue reading...", "ingested_utc": "2025-08-20T07:32:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:46Z", "source": "Guardian_World", "title": "Childcare needs a ‘fundamental reset’ to improve safety. These are Victoria’s key recommendations", "url": "https://www.theguardian.com/australia-news/2025/aug/20/victoria-childcare-safety-review-recommendations-unveiled-ntwnfb", "id_key": "49d9ea48cbd6fe79a576b3e8fa9c8f193ca2d822edfa5d56936139131abf2669", "summary": "State to accept all 22 recommendations as federal government releases names of 30 childcare centres subject to compliance action Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Major reforms to working with children checks, more unannounced visits to childcare centres and a rethink of the reliance on for-profit providers are among the recommendations of Victoria’s urgent review into childcare. The review, written by the former South Australian premier Jay Weatherill and senior Victorian bureaucrat Pam White, was released in full by the state government on Wednesday. Continue reading...", "ingested_utc": "2025-08-20T07:32:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:32:46Z", "source": "Guardian_World", "title": "Rail fares in England on path to rise by 5.8% next year on back of inflation data", "url": "https://www.theguardian.com/money/2025/aug/20/rail-fares-in-england-rise-next-year", "id_key": "b10a1811cdb81fd4d037f6fcb91dd393b91c17db8386d602f70afadee4112398", "summary": "Concern among passenger groups after reading that dictates regulated ticket prices came in higher than forecast UK inflation rises by more than expected to 3.8% Business live – latest updates Train fares in England expected to rise by as much as 5.8% next year on the back of the latest inflation data release, sparking concern among passenger groups. Increases in rail ticket prices are usually calculated by adding one percentage point to July’s inflation reading on the retail prices index, which was a higher than expected 4.8%, according to figures from the Office for National Statistics. Continue reading...", "ingested_utc": "2025-08-20T07:32:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:07Z", "source": "NPR_Top", "title": "Cobalt-free batteries reign in Chinese EVs. Why not the US?", "url": "https://www.npr.org/2025/08/20/nx-s1-5507156/cobalt-free-batteries-reign-in-chinese-evs-why-not-the-us", "id_key": "cda2dd8d877984ef7828aa12a9abbdd6bed6034186dc11bc24b8df0390fd3029", "summary": "There’s been an era-defining race underway between two types of batteries used in electric vehicles: lithium batteries that use cobalt, and ones that use iron phosphate. Cobalt, a metal with a checkered human rights record, has been in the lead. Until recently. Henry Sanderson’s book on the elements that build electric vehicles is Volt Rush: The Winners and Losers in the Race to Go Green . Related episodes: The race to produce lithium How batteries are already changing the grid How batteries are riding the free market rodeo in Texas How EV batteries tore apart Michigan (Update) Batteries are catching fire at sea For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Fact-checking by Sierra Juarez . Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter .", "ingested_utc": "2025-08-20T07:35:07Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:07Z", "source": "NPR_Top", "title": "What is the legacy of Yellowstone wolves 30 years after their reintroduction?", "url": "https://www.npr.org/2025/08/20/nx-s1-5507229/wolves-elk-predator-yellowstone-national-park-ecosystem", "id_key": "970bf2fc9e2f130f7b8d26fc90f42dd7ae3ffb04423599a4e7e9bcd8d761547a", "summary": "Thirty years ago, park rangers reintroduced grey wolves into Yellowstone National Park. They wanted to restore the ecosystem and get the elk population, which had decimated the plant community, in check. And it worked – or so the popular narrative suggests. But is it really so simple? Today on the show, we explore how the Yellowstone ecosystem has changed since wolves returned and whether those changes can really be pinned solely on wolves. Plus, how the narrative of the Yellowstone wolf legacy could affect wolf reintroduction elsewhere. Curious about other science controversies? Email us at shortwave@npr.org . Listen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at plus.npr.org/shortwave .", "ingested_utc": "2025-08-20T07:35:07Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:09Z", "source": "NPR_World", "title": "Spain battles record wildfires even as the end of a heat wave brings lower temperatures", "url": "https://www.npr.org/2025/08/19/g-s1-83505/spain-wildfires-record-heat-wave-galicia", "id_key": "e3f7ad80d35b899f7dea180aee9788d7cd2ff158c630c7fb338b825183d9beee", "summary": "The fires have ravaged small, sparsely populated towns in the country's northwest, forcing locals in many cases to act as firefighters. About 2,382 square miles have burned across Spain and Portugal.", "ingested_utc": "2025-08-20T07:35:09Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:09Z", "source": "NPR_World", "title": "Putin and Zelenskyy could meet. And, Trump wants to stop voting by mail", "url": "https://www.npr.org/2025/08/19/g-s1-83374/up-first-briefing-putin-zelenskyy-may-meet-mail-in-votings-future", "id_key": "5813625c8bfc01684ff8858ac4a0dfe9fb77cd4f98ca621fdb27ab278df7ac41", "summary": "Trump says there are plans underway for Putin and Zelenskyy to meet to discuss an end to the war between Russia and Ukraine. And, Trump wants to stop states from voting by mail.", "ingested_utc": "2025-08-20T07:35:09Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:26Z", "source": "TheVerge_All", "title": "Hyperkin’s DualSense-inspired Xbox controller is finally launching this fall", "url": "https://www.theverge.com/news/761638/hyperkin-competitor-xbox-wired-controller-sony-ps5-dualsense", "id_key": "0e4b391887d49bce0512c24a9d48f2bed69c0b18df70c09269148cc4aa113f80", "summary": "There’s good news if you’re an Xbox gamer who’s longingly stared at the sleeker design of Sony’s DualSense controller for the PlayStation 5. After revealing the final form of its Competitor gamepad at CES 2025, Hyperkin has announced it will be available sometime in October for $49.99 in black and white color options for North […]", "ingested_utc": "2025-08-20T07:35:26Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:30Z", "source": "Engadget_All", "title": "The best wireless mice for 2025", "url": "https://www.engadget.com/computing/accessories/best-wireless-mice-pc-gaming-mobile-150027822.html?src=rss", "id_key": "1585ab537d7dbdcf8c7ad566a74d2b95034ae57f23832183a2a27faf3dfad71d", "summary": "We may deliberate for days when buying a laptop or computer or spend hours lining up the most comfortable and stylish keyboard before aimlessly adding a utilitarian mouse to our basket. The impact of a good, feature-rich and — perhaps most importantly — ergonomic mouse can be huge. Not just to your productivity, but to the quality and comfort of your worklife overall. A good mouse has long offered some level of configuration and customization, but more modern options go beyond that with the ability to automate repetitive tasks or convoluted keypresses at the click of a button. Unsurprisingly, even mice haven’t escaped the wave of AI hype, with many flagship models bringing services like ChatGPT or Copilot to your fingertips. Beyond the fancy features, there’s still a lot to consider to find the best mouse for work, creativity or even play. Will the mouse fit your grip style or handedness? Do you prefer the convenience of Bluetooth or stability of a 2.4Ghz USB dongle? Can it connect to more than one device easily? Is the smoothness of the scroll wheel going to be a dealbreaker? Perhaps the companion software unlocks new functionality you never knew you needed? If you hadn’t considered all of those things, the good news is, we have (and more). Below are our picks for the best wireless productivity mice you can buy right now. Best wireless mice for 2025 This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-wireless-mice-pc-gaming-mobile-150027822.html?src=rss", "ingested_utc": "2025-08-20T07:35:30Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:39Z", "source": "AlJazeera_All", "title": "As UN agencies mull Kenya move, some fear exclusion from Nairobi’s growth", "url": "https://www.aljazeera.com/features/2025/8/20/as-un-agencies-mull-kenya-move-some-fear-exclusion-from-nairobis-growth?traffic_source=rss", "id_key": "008c19003f953a02199cfb165d69c031329872ceef34ac1dc8c7f8031987de90", "summary": "Kenyans veer between hope for prosperity and wariness as UN plans relocation of key offices from Western cities.", "ingested_utc": "2025-08-20T07:35:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T07:35:47Z", "source": "FinancialPost_Business", "title": "Trump Raises Stakes Over Copper Project With CEOs at White House", "url": "https://financialpost.com/pmn/business-pmn/worlds-two-biggest-miners-meet-with-trump-over-copper-project", "id_key": "c6d87729318856ef6ca16a6d6772adcc721a2437030bb99e7f524df89966f92c", "summary": "President Donald Trump met with the chief executive officers of the world’s two biggest mining companies to discuss a copper project that could supply the US with a quarter of its demand for decades to come, adding greater weight to his push to boost local output of the vital metal.", "ingested_utc": "2025-08-20T07:35:47Z"}
