{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T20:32:35Z", "source": "Guardian_World", "title": "Australian universities to cut about 2,400 jobs and hundreds of courses as sector blames ‘confused’ government policies", "url": "https://www.theguardian.com/australia-news/2025/aug/24/australian-university-course-cuts-jobs", "id_key": "eccb1091b11dead55961535b6c021ec5247fe689bfa0fcfbb3a7ea4be860118a", "summary": "Vice-chancellors say they’ve been forced to restructure but critics point finger at ‘unaccountable’ university management Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Hundreds of university courses within teaching, languages, archaeology and media are among those being slashed as the tertiary sector pushes back against “confused” government policies. Almost half of Australia’s universities have restructured in the past year, leading to the merging or disbanding of more than 50 schools of study and drastic reductions in course options for students, particularly in the humanities. Continue reading...", "ingested_utc": "2025-08-23T20:32:35Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T20:32:35Z", "source": "Guardian_World", "title": "Zohran Mamdani leads in fundraising for New York City mayoral contest", "url": "https://www.theguardian.com/us-news/2025/aug/23/zohran-mamdani-fundraising-new-york-city", "id_key": "8b0516caf34f274c203e2c6bda59baebbdfd3ec1744ec4f67023524038cfee6d", "summary": "The Democratic nominee far outpaces former governor Andrew Cuomo and embattled incumbent Eric Adams Zohran Mamdani pulled in almost double the funds of his nearest rivals for New York City mayor between early July and mid-August, as the candidates prepare for the crucial post Labor Day push to the November poll. New York’s City’s campaign finance board said on Saturday that the democratic socialist, who won the Democratic party nomination in June against former state governor Andrew Cuomo , raised $1,051,200, with an average donation of $121 recorded equally from donors in and outside the state. Continue reading...", "ingested_utc": "2025-08-23T20:32:35Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T20:32:35Z", "source": "Guardian_World", "title": "Bus carrying junior high football team crashes in Pennsylvania, sending 21 people to hospital", "url": "https://www.theguardian.com/us-news/2025/aug/23/pennsylvania-bus-crash-junior-high-football-team", "id_key": "d4319c33372a445f0ffa9895924b13ce7d2e0d61de001b6d8bf259f93e2e7b3d", "summary": "Bus overturned about 20 miles north of Pittsburgh while carrying players from Aliquippa junior high school A bus carrying a junior high football team to a game crashed on Saturday north of Pittsburgh, sending 21 of the 28 people onboard to the hospital, officials said. Twenty-five Aliquippa junior high students and three adults were headed to a game in nearby Gibsonia. The crash occurred in Economy Borough, about 20 miles north of Pittsburgh. Continue reading...", "ingested_utc": "2025-08-23T20:32:35Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T20:34:58Z", "source": "NPR_Top", "title": "RAINBOW CROSSWALK PROTEST", "url": "https://www.npr.org/2025/08/23/nx-s1-5510009/locals-react-after-officials-erased-a-rainbow-crosswalk-honoring-pulse-nightclub-victims", "id_key": "1444cf68bfa0e1454885a33d5a97aa05487a35b3e86bae23b85c2c1ac535e209", "summary": "The rainbow crosswalk in front of Orlando's Pulse nightclub was removed by Florida transportation officials. The crosswalk was a memorial for those killed in a 2016 mass shooting at the gay bar.", "ingested_utc": "2025-08-23T20:34:58Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T20:35:20Z", "source": "Engadget_All", "title": "Overwatch 2 will allow KBM on console, but you'll be up against PC players", "url": "https://www.engadget.com/gaming/overwatch-2-will-allow-kbm-on-console-but-youll-be-up-against-pc-players-200034777.html?src=rss", "id_key": "81aa983e10aca0d7255f66ce8df2e54a7775a3826bffea6db04e4cd3eeacae05", "summary": "Overwatch 2 console players will officially be able to use a keyboard and mouse starting with the release of Season 18. In patch notes posted ahead of the new season, the Overwatch 2 team says matchmaking pools will be tweaked slightly so players are sorted into a Mouse and Keyboard Pool and a Controller Pool. Those playing on a console using keyboard and mouse (KBM) inputs will be paired with PC players and other KBM console players, while the Controller Pool will be reserved only for console players using a controller. Season 18 arrives on August 26. For players who switch to the Mouse and Keyboard Pool, \"your internal MMR, skill ratings and ranks for all game modes will be separate from your statistics in the Controller Pool,\" according to the patch notes. This group won't have access to aim assist, as has been the case and will continue to be for PC players using a controller. KBM players will have to accept the prompt to switch to that pool in order to play, or manually switch in the Gameplay Options menu. This article originally appeared on Engadget at https://www.engadget.com/gaming/overwatch-2-will-allow-kbm-on-console-but-youll-be-up-against-pc-players-200034777.html?src=rss", "ingested_utc": "2025-08-23T20:35:20Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-23", "retrieved_utc": "2025-08-23T20:35:37Z", "source": "FinancialPost_Business", "title": "European postal services suspend shipment of packages to US over tariffs", "url": "https://financialpost.com/pmn/european-postal-services-suspend-shipment-of-packages-to-us-over-import-tariffs", "id_key": "d340722f7e18b493183df82529150dc44a133689c7af60bed4f6ff7ed6744611", "summary": "ATHENS, Greece (AP) — The end of an exemption on tariff duties for low-value packages coming into the United States is causing multiple international postal services to pause shipping as they await more clarity on the rule. The exemption, known as the ” de minimis” exemption, allows packages worth less than $800 to come into […]", "ingested_utc": "2025-08-23T20:35:37Z"}
