{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:50:42Z", "source": "BBC_World", "title": "Why Oval Office map has played crucial role in Trump's view of Ukraine war", "url": "https://www.bbc.com/news/articles/cjeynw8jppdo?at_medium=RSS&at_campaign=rss", "id_key": "49067e33665104f9612003d7d5c8d139e207be91b2683a2a663c7553d39af4fa", "summary": "Ukraine's leader has taken issue with the American map, because of the amount of control it gives Russia.", "ingested_utc": "2025-08-19T18:50:42Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:50:45Z", "source": "Guardian_World", "title": "White House considering Budapest for Putin-Zelenskyy bilateral, report suggests – live", "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news", "id_key": "c2f37c03f8de0b63d07525ddfb7c901d636ecf401ea56b496b39664eeae3fe8e", "summary": "Spokeswoman refuses to confirm possible location for talks, says Trump ‘definitively’ rules out US troops in Ukraine but remains open to air support Volodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February , which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough. In his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports. A meeting between Zelenskyy and Putin ... could it finally happen? The need for security guarantees agreed – but details unclear Trump believes he is very good at solving conflicts A potential boost for the US arms industry Continue reading...", "ingested_utc": "2025-08-19T18:50:45Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:50:45Z", "source": "Guardian_World", "title": "Merseyside police helicopter crew to face no action after chasing suspect at low altitude", "url": "https://www.theguardian.com/uk-news/2025/aug/19/merseyside-police-helicopter-crew-to-face-no-action-after-chasing-suspect-at-low-altitude", "id_key": "648db96e5a2998b329ad39ef1252beb6f42a2deeea70547e33f684dfd3918837", "summary": "Internal review by the National Police Air Service finds the crew acted ‘appropriately’ during pursuit A police helicopter crew will face no action after flying at low altitude while pursuing a suspect on a motorbike in Merseyside. Video footage was published on social media last week showing a National Police Air Service (Npas) helicopter pursuing the man, which resulted in the detention of the suspect for numerous alleged offences including dangerous driving, driving a motor vehicle which had been taken without the owner’s consent, driving while disqualified, failing to stop and conspiring to intentionally/recklessly cause a public nuisance. A second suspect was arrested for alleged theft of a motor vehicle and assisting an offender. Continue reading...", "ingested_utc": "2025-08-19T18:50:45Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:50:45Z", "source": "Guardian_World", "title": "Ice used Marriott chain to detain immigrants, despite hotel’s 2019 pledge not to cooperate", "url": "https://www.theguardian.com/us-news/2025/aug/19/ice-marriott-hotel-detentions", "id_key": "ba5eaf67d92a7f49738f1e94ee6cb42f28cd185121b26996b69655e7e0d2204d", "summary": "Sheraton in Louisiana held father and teenage son this month in apparent contradiction of former position A Sheraton hotel in Louisiana has been used by immigration officials to hold people who are being deported, in what appears to be a contradiction of a position Sheraton’s parent company, Marriott, took in 2019 when it said its properties would not be used in cooperation with Ice. The Intercept first reported that the hotel, located on MacArthur Drive in Alexandria, Louisiana , near a major deportation hub and airport used by Ice, had been used by immigration officials earlier this month to hold a father and his teenage son for four days after their arrest in New York. They were then deported to Ecuador. The Intercept cited phone-tracking evidence that had been shared with the publication and was later seen by the Guardian. Continue reading...", "ingested_utc": "2025-08-19T18:50:45Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:50:45Z", "source": "Guardian_World", "title": "Trump threat to end mail-in ballots a ‘priority’, White House says, signaling push after Congress returns – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/19/texas-congressional-maps-democrats-republicans-donald-trump-us-politics-updates-news", "id_key": "13ed423e064bebc50c3368955b03042929588e37981e1436cedc726a3735e476", "summary": "Karoline Leavitt says administration will talk to members of Congress and state legislatures after Trump said he planned to end mail-in ballots The Republican governors of Louisiana and Tennessee will send hundreds of their national guard troops to assist federal law enforcement in DC – to help assist the president’s “crime crackdown”. They join Mississippi, Ohio, West Virginia and South Carolina – who have all sent national guard troops to DC. Continue reading...", "ingested_utc": "2025-08-19T18:50:45Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:51:01Z", "source": "Blockworks", "title": "Wyoming FRNT stablecoin on Solana to go live on Kraken", "url": "https://blockworks.co/news/wyoming-frnt-stablecoin-kraken", "id_key": "97ca87f0020275b17ce945aeea6d6d690534bc0cbe32437d2f5554aed78e70ae", "summary": "The state-backed token is being deployed across 7 blockchains and will direct profits toward education", "ingested_utc": "2025-08-19T18:51:01Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:51:49Z", "source": "CryptoNews", "title": "Altcoin Season Rotations Ignite: Cardano Depth, Tron Settlement Flows, Floki Buzz", "url": "https://cryptonews.com/news/altcoin-season-watch-cardano-tron-and-floki-show-divergent-setups/", "id_key": "4765348e2095aba05983131e256a917d48b544c062bc42650c6935cd7b2d10e6", "summary": "Altcoin Season has appeared as a selective rotation rather than a blanket rally. Capital has preferred pairs with depth as Bitcoin dominance has remained above 60%. ADA has offered liquidity, TRX has been supported by stablecoin settlement, and FLOKI has kept activity visible on major venues. The post Altcoin Season Rotations Ignite: Cardano Depth, Tron Settlement Flows, Floki Buzz appeared first on Cryptonews .", "ingested_utc": "2025-08-19T18:51:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:51:49Z", "source": "CryptoNews", "title": "Bybit EU Staking, Coinbase Futures Lift Mantle ($MNT) – Can Bulls Clear $1.40?", "url": "https://cryptonews.com/news/mantle-mnt-rallies-12-on-major-news-but-faces-key-technical-test/", "id_key": "1d3955eb48edd6074b796b3cd4d04d90020294849c6dc3513a822f8195685d82", "summary": "Mantle ($MNT) has climbed to $1.39 as Bybit EU has introduced MiCA-compliant staking and Coinbase International has listed MNT futures, expanding access. The MI4 fund has exceeded $200M AUM. After BtcTurk’s breach, price has held while $1.40 has remained a near-term ceiling. Volume has shown supply near $1.40. The post Bybit EU Staking, Coinbase Futures Lift Mantle ($MNT) – Can Bulls Clear $1.40? appeared first on Cryptonews .", "ingested_utc": "2025-08-19T18:51:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:53:45Z", "source": "NYTimes_World", "title": "No Tariff Exemption for European Wine and Spirits, at Least for Now", "url": "https://www.nytimes.com/2025/08/19/world/europe/tariff-exemption-european-wine-spirits.html", "id_key": "6af52655a83a7b6cebe0bcf8cd88f776c4736f4d6f20d36e3c0cf3025e2e93c8", "summary": "As the text of a trade agreement comes together, European Union negotiators haven’t persuaded the Americans to cut alcohol tariffs to zero.", "ingested_utc": "2025-08-19T18:53:45Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:53:56Z", "source": "FT_Home", "title": "Powell to deliver Jackson Hole address under fire on multiple fronts", "url": "https://www.ft.com/content/f572f1fa-0a62-4621-90de-e048c8caa890", "id_key": "5607af543467831cb0b9135d3b05a1fa7dbc7d54caa9c6336f6e88a1c44a6985", "summary": "Federal Reserve chair is under bombardment from Trump and battling an insurgency within the central bank", "ingested_utc": "2025-08-19T18:53:56Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:53:57Z", "source": "FT_Markets", "title": "European defence rally falters on Ukraine ceasefire talks", "url": "https://www.ft.com/content/d548ee94-5e02-4124-87ad-7fd5ee039758", "id_key": "a088f820e643762dd7bf0c78b7fe2b75ff2d2e56899c0ef58b5b3d5965a9156f", "summary": "Share prices fall as Trump vows to involve Zelenskyy in peace discussions with Putin and Kyiv promises to buy US weapons", "ingested_utc": "2025-08-19T18:53:57Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:12Z", "source": "TheVerge_All", "title": "Meta’s AI translation tool can dub your Instagram videos", "url": "https://www.theverge.com/news/761665/meta-ai-translation-facebook-instagram-reels", "id_key": "bfd0aa69de1a05c1d95d919d7ca94b30aefe62ddfb1e0c217f3c07216ec0c728", "summary": "Meta is bringing its AI translation tool to more users on Facebook and Instagram, which automatically dubs your reels into another language. The feature also uses AI to make its dub match up with the sound of your voice and the movement of your mouth. For now, you can only translate your reels from English […]", "ingested_utc": "2025-08-19T18:54:12Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:12Z", "source": "TheVerge_All", "title": "The new Nissan Leaf is still one of the cheapest EVs in America", "url": "https://www.theverge.com/nissan/761633/nissan-leaf-starting-price-cheap-ev", "id_key": "0cab03b79f16001f050f94f0e08dfb3036fd246883c72b33bea415a73536ac8b", "summary": "Nissan stunned us all when it released the specs for its refreshed Leaf: new crossover body; dual charging ports; and over 300 miles of range. Today, the Japanese released the starting price for the Leaf, and lo and behold, it’s still a hell of a bargain. When it reaches dealerships this fall, the 2026 Leaf […]", "ingested_utc": "2025-08-19T18:54:12Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:12Z", "source": "TechCrunch_All", "title": "Appeals court says NLRB structure unconstitutional, in a win for SpaceX", "url": "https://techcrunch.com/2025/08/19/appeals-court-says-nlrb-structure-unconstitutional-in-a-win-for-spacex/", "id_key": "f39ecaf16039aa47c0340a8225b06ee145cb7ac859fc166e75e197f347bc7459", "summary": "SpaceX scored a win in a decision from the Fifth Circuit over the labor board's structure.", "ingested_utc": "2025-08-19T18:54:12Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:12Z", "source": "TechCrunch_All", "title": "Google pays $30M to settle lawsuit over children’s YouTube data", "url": "https://techcrunch.com/2025/08/19/google-pays-30m-to-settle-lawsuit-over-childrens-youtube-data/", "id_key": "0fd3aa1742f4a57e803387c776e4d72f47734642fe6914a39865d8f15ebc0dd8", "summary": "Google has agreed to pay $30M to settle a lawsuit over children's data collection, though the company denies wrongdoing.", "ingested_utc": "2025-08-19T18:54:12Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:12Z", "source": "TechCrunch_All", "title": "Meta is shaking up its AI org, again", "url": "https://techcrunch.com/2025/08/19/meta-is-shaking-up-its-ai-org-again/", "id_key": "2a290aee6bd543d867c1406112b0ccef52317a8f041a95925f20a1525f95150b", "summary": "On Friday, The Information reported that Meta was preparing to tear down its existing AI org and reorganize it into four new groups. Four days later, the change has been made official with an internal memo.", "ingested_utc": "2025-08-19T18:54:12Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:14Z", "source": "WIRED_All", "title": "PNY’s Overclocked RTX 5070 Ti Is Finally Selling at Retail", "url": "https://www.wired.com/story/pny-rtx-5070-deal/", "id_key": "a399b5f090726212e62bbd66dc8e95b96f303474b37e80588bd8716de3c5405f", "summary": "Finding a 50 Series card at retail price is rare, and including Borderlands 4 for free is legendary loot.", "ingested_utc": "2025-08-19T18:54:14Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:15Z", "source": "Engadget_All", "title": "Webb telescope spots a new moon orbiting Uranus", "url": "https://www.engadget.com/science/space/webb-telescope-spots-a-new-moon-orbiting-uranus-182932627.html?src=rss", "id_key": "e850a3ec45f9c089b0f69e6338daa71c009032a115ab7ed09522826802798bff", "summary": "The James Webb Space Telescope (JWST) continues to bear fruit. Images captured by the floating watchtower revealed a previously unknown moon orbiting Uranus. The discovery, made on February 2, increases the planet's moon tally to 29. The moon was easy to miss: It's only an estimated six miles wide. It's located about 35,000 miles from Uranus' center, orbiting the planet's equatorial plane. The moon has a nearly circular orbit, suggesting it could have formed near its current location. NASA's short video below shows the faint speck orbiting its ringed host. The new moon joins 13 other small moons in Uranus' orbit. The planet also has five major moons (Miranda, Ariel, Umbriel, Titania and Oberon) and 10 irregular ones. The new moon won't have a name until one is approved by the International Astronomical Union (IAU). It was detected using 10 40-minute long-exposure images taken by Webb's Near-Infrared Camera (NIRCam). A team led by the Southwest Research Institute pored through the telescope's images to identify it. \"No other planet has as many small inner moons as Uranus, and their complex inter-relationships with the rings hint at a chaotic history that blurs the boundary between a ring system and a system of moons,” Matthew Tiscareno of the SETI Institute wrote. “Moreover, the new moon is smaller and much fainter than the smallest of the previously known inner moons, making it likely that even more complexity remains to be discovered.” This article originally appeared on Engadget at https://www.engadget.com/science/space/webb-telescope-spots-a-new-moon-orbiting-uranus-182932627.html?src=rss", "ingested_utc": "2025-08-19T18:54:15Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:15Z", "source": "Engadget_All", "title": "Nissan's redesigned Leaf EV starts at $29,990", "url": "https://www.engadget.com/transportation/evs/nissans-redesigned-leaf-ev-starts-at-29990-181520692.html?src=rss", "id_key": "145352c9317f64e12855800c4c8b84d194339a3214e0c8a74448c134e73faf34", "summary": "We learned earlier this summer that Nissan was working on a redesign of its Leaf EV, but today the company shared some additional information about the vehicle. One of the most notable details is the price, which will be $29,990 for the Leaf S+ trim. That's a lower amount for the third-generation car than the original 2011 Leaf cost, continuing what has become a trend of Nissan offering electric vehicles for modest prices . The Leaf SV+ will retail for $34,230 and the Leaf Platinum+ will cost $38,990, but no price has been shared yet for the entry-level Leaf S model. Another compelling aspect of these 2026 Leaf models is the maximum driving range of up to 303 per charge, depending on the model. This performance is a marked improvement over the range for most of its previous iterations . All the models will have a quick-charge time of 35 minutes and will be compatible with NACS charging ports . The higher-end trims will have additional perks such as bigger dual display screens, more audio speakers, and wireless phone charging for the interior. This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/nissans-redesigned-leaf-ev-starts-at-29990-181520692.html?src=rss", "ingested_utc": "2025-08-19T18:54:15Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:15Z", "source": "Engadget_All", "title": "Call of Duty: Black Ops 7 arrives on November 14", "url": "https://www.engadget.com/gaming/call-of-duty-black-ops-7-arrives-on-november-14-180834596.html?src=rss", "id_key": "4d5bf2fa1c9798ad2fc0e893d38a25801fa7bdbabeb4dc3674697e207bce0936", "summary": "Call of Duty: Black Ops 7 will launch on November 14. Microsoft revealed the release date for the upcoming shooter sequel alongside a new trailer during Opening Night Live at Gamescom 2025 . Notably, while Black Ops 7 will be on PC, PlayStation and Xbox at launch, it'll skip the Switch 2, despite a binding legal agreement between Microsoft and Nintendo that requires that the company's consoles receive the same access to Call of Duty as Xbox. Similar to past games in the series, Call of Duty: Black Ops 7 is leaning into a trippy narrative and a futuristic setting. The sequel is set 40 years after the events of Call of Duty: Black Ops 6 , and follows David Mason (as played by Milo Ventimiglia) and his squad of Black Ops operatives as they take on \"a manipulative enemy who weaponizes fear above all else,\" according to publisher Activision. Microsoft, who owns the Call of Duty franchise following the completion of its acquisition of Activision Blizzard King in 2023, originally signed on for a 10-year pact with Nintendo to bring Call of Duty games to the Switch. The company made the commitment — and another, vaguer one with PlayStation — in an attempt to smooth over any opposition to gobbling up another large publisher. The acquisition was ultimately allowed to move forward, and Microsoft has so far ended up bringing even more of what could have been exclusive games to other consoles. Black Ops 7 has name recognition and a devoted fan base on its side, but it'll face some healthy competition this fall. Battlefield 6 is set to be released on October 10 , and based on the response to the beta alone , it seems like time away has made EA' shooter franchise all the more popular. Call of Duty: Black Ops 7 will be available on PlayStation 5, PlayStation 4, Xbox Series X/S, Xbox One, Steam and Battle.net. Xbox Game Pass subscribers will get the game at launch. The game will come to Switch later in 2025. This article originally appeared on Engadget at https://www.engadget.com/gaming/call-of-duty-black-ops-7-arrives-on-november-14-180834596.html?src=rss", "ingested_utc": "2025-08-19T18:54:15Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:15Z", "source": "Engadget_All", "title": "Absolum is awesome and I can't wait to play it on October 9", "url": "https://www.engadget.com/gaming/absolum-is-awesome-and-i-cant-wait-to-play-it-on-october-9-180037272.html?src=rss", "id_key": "d0115924dd58850d520bdc0ea51fb093deadffe0bb94c1a538a5808fbbd95acb", "summary": "Absolum , the fantasy beat-'em-up from the team behind Streets of Rage 4 will arrive on October 9, Dotemu shared today. Ahead of the announcement, the publisher hosted a new preview of the game, giving the gaming press a chance to check out a new playable character and zone (more on those in a moment). I didn't get a chance to play Absolum when it was first announced back in March , so going into this latest demo I didn't know what to expect. Now, after playing Absolum through most of the weekend, I can't wait for the final version in October. In fact, I think it might end up being a surprise game of the year contender for a lot of people. I've never been a fan of beat-'em-ups; most haven't had enough depth to keep me interested. Absolum solves that issue by smartly borrowing from modern roguelikes, with Supergiant's Hades standing as an obvious influence. Each run in Absolum starts with you selecting a \"Ritual\" for your character. Like Boons in Hades , these modify your character's abilities with special properties. For example, one Ritual I encountered in my second playthrough caused throwable rose daggers to spawn whenever I timed a dodge perfectly. In turn, these allowed me to quickly dispatch dangerous enemies at a distance. The further into a run you get, the more likely you are to encounter additional Rituals. And, once again borrowing from Hades and its idea of Duo Boons, some Rituals are designed to synergize with one another. Combined with the game's Arcana system, which allows you to select up to two special attacks for your character, there's great combat variety in Absolum. Dotemu In fact, it never feels like you're simply button mashing. Combat is very Souls-like in that there are many different enemies for the player to take on, and each one requires its own approach. What's more, dodging attacks is often more important than dishing out damage. Healing items in Absolum are few and far between, but to balance this, the game gives you a few different ways to avoid getting hurt. You can either side step away from an attack, dash directly into an enemy to block them or use your character's Skill attack to perform what the game calls a \"Clash.\" If timed correctly, all three options allow you to punish an enemy for trying to get the jump on you. Of the three, however, Clashes — acting as Absolum's version of a parry — are the hardest to pull off, but can turn a boss fight in your favor, allowing you to deflect an attack that would have otherwise been devastating. With this preview, Dotemu let everyone try the game's full roster of four characters. Over the five hours I played the demo, I had the most fun with Galandra, a necromantic warrior with a sword on her back that would be big enough even for Guts. Each character feels distinct from their counterparts. Brome, for instance, who wasn't in the recent Steam Next Fest demo Dotemu released, is the game's only mage-like character. His playstyle centers around zoning your enemies with beams of power. Oh, and did I mention that he's a frog? Meanwhile, the new zone, Jaroba, did a great job of mixing things up just as I was getting used to ebb and flow of Absolum's combat . Enemies here employ much more devious attacks that are harder to dodge and counter. If rougelike fans didn't have Hades 2 to look forward to this year, I think Absolum would easily be in the running for one of the best indie releases of 2025. As it stands, the game has tough competition, but if you're a fan of challenging and mechanically complex but fun combat systems, I think you owe it to yourself to check out Absolum come October when it arrives on Steam , Nintendo Switch, PlayStation 4 and PS5. This article originally appeared on Engadget at https://www.engadget.com/gaming/absolum-is-awesome-and-i-cant-wait-to-play-it-on-october-9-180037272.html?src=rss", "ingested_utc": "2025-08-19T18:54:15Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:15Z", "source": "Engadget_All", "title": "Battlestar Galactica might finally get the video game adaption it deserves", "url": "https://www.engadget.com/gaming/pc/battlestar-galactica-might-finally-get-the-video-game-adaption-it-deserves-180032698.html?src=rss", "id_key": "73dfd0d25ce7a336b9b97673f0d68e20237895e5c8ef2c86d035433835e4675d", "summary": "In the 16 years since Ronald D. Moore's take on Battlestar Galactica ended its official TV run in 2009, the most surprising thing about the series is that it hasn't inspired many great games. Sure, more than a few releases have carried the Battlestar Galactica name, but none of those have managed to capture what made the 2003 miniseries and later 2004 show so special. That might change early next year when Battlestar Galactica: Scattered Hopes arrives. Ahead of today's announcement of the game, publisher Dotemu gave the gaming press a chance to play an early build of Scattered Hopes . The first thing you need to know about the game is that it's made by Alt Shift, the studio behind 2019's Crying Suns . Alt Shift doesn't shy away from the fact Crying Suns was inspired by Battlestar Galactica, and the studio's love for the source material shows in its new project. Even in the version I played, which was missing gameplay features and had yet to be properly balanced, Scattered Hopes feels like BSG's three-hour pilot episode recreated in game form. Alt Shift / Dotemu In Scattered Hopes, you're tasked with leading a fleet of ships fleeing the destruction of Caprica. Like Crying Suns, the game is a roguelike, meaning gameplay revolves around randomized runs and you're expected to fail your mission multiple times before you get anywhere close to success. At the start of each run, you pick a fleet, with each one offering a different mix of military and civilian ships for you to command. Once you're underway, gameplay is a mix of turn-based and real-time strategy as your fleet jumps from system to system to try and outrun the Cylons. When you first arrive in a sector, you have a handful of turns to carry out scavenging missions, repairs to your fleet and research that will enhance your combat abilities. During this time, situations can develop among the survivors of the Twelve Colonies. For example, on my first run, a group of thieves started stealing supplies from the fleet. What's interesting about these scenarios is that you'll frequently be forced to choose between different factions among your survivors, representing the interests of workers, military personnel and other more shady elements. Often, these groups will come forward on their own to offer you something, but those gifts never come free, and you need to balance the influence of each group, lest one become too powerful. Alt Shift / Dotemu After a few turns of this, the Cylons will arrive and will always do so with overwhelming force. These battles play out in real-time, though there's a tactical pause in case things get too hectic. At the start of my first run, I only had one Battlestar and two fighter squadrons to fight off everything that came my way. The goal of these encounters is not to defeat the Cylons, but rather to stay alive as long as it takes for the faster than light drives on your ships to spin up. These battles are the most fun part of the experience. They're absolutely hectic, and I found making it out with minimal damage to my fleet required prioritizing the right targets. That's easier said than done. The Cylons often sent a homing missile or tactical nuke my way that forced me to redirect my fighter squadrons to intercept those, leaving the rest of my fleet vulnerable. Even in its early state, with seemingly a lot of work left for Alt Shift to do before the game ships early next year, Scattered Hopes is an incredibly fun exercise in crisis management, and I'm hopeful the studio can stick the landing. In the meantime, you can wish list the game on Steam. This article originally appeared on Engadget at https://www.engadget.com/gaming/pc/battlestar-galactica-might-finally-get-the-video-game-adaption-it-deserves-180032698.html?src=rss", "ingested_utc": "2025-08-19T18:54:15Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:16Z", "source": "TheEconomist_Business", "title": "How AI-enhanced hackers are stealing billions", "url": "https://www.economist.com/business/2025/08/19/how-ai-enhanced-hackers-are-stealing-billions", "id_key": "aef57f568a318308ad09ae8abdbfb5dc66d24c520965f65eb944966c0b8be4aa", "summary": "It is a boom time for cybersecurity firms", "ingested_utc": "2025-08-19T18:54:16Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:23Z", "source": "TheStreet_Top", "title": "Royal-approved clothing brand files Chapter 7, shuts down", "url": "https://www.thestreet.com/retail/fashion-brand-worn-by-kate-middleton-files-chapter-7-bankruptcy", "id_key": "009460700e27ee2b74f780a5652c8985f7c4615306c68adf0173ac9837ba9c16", "summary": "The company has closed its doors and laid off all workers, but the brand, a favorite of Kate Middleton may go on.", "ingested_utc": "2025-08-19T18:54:23Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:31Z", "source": "FinancialPost_Business", "title": "Hedge Fund Heir Elizabeth Simons Gives $250,000 to Mamdani PAC", "url": "https://financialpost.com/pmn/business-pmn/hedge-fund-heir-elizabeth-simons-gives-250000-to-mamdani-pac", "id_key": "733a2bcd38b126afeadbef3d41f53fb0451e0d9b86ed9c7754cf9393f7d96bf5", "summary": "Philanthropist Elizabeth Simons, the daughter of Renaissance Technologies founder James Simons, gave $250,000 to a super PAC supporting Democratic mayoral candidate Zohran Mamdani last week.", "ingested_utc": "2025-08-19T18:54:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:31Z", "source": "FinancialPost_Business", "title": "Trump weaponization czar urged New York Attorney General James to resign over mortgage probe", "url": "https://financialpost.com/pmn/trump-weaponization-czar-urged-new-york-attorney-general-james-to-resign-over-mortgage-probe", "id_key": "33f716b2a35127b1566592ccd425743c5a912dc2e76f1dc9de1220ad942af5bd", "summary": "NEW YORK (AP) — President Donald Trump’s political weaponization czar sent a letter urging New York Attorney General Letitia James to resign from office “as an act of good faith” four days after starting his mortgage fraud investigation of her. Then he showed up outside her house. Ed Martin, the director of the Justice Department’s […]", "ingested_utc": "2025-08-19T18:54:31Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:38Z", "source": "Nikkei_Asia_Top", "title": "China's growing ties with Serbia point to new 'Silk Curtain' in Europe", "url": "https://asia.nikkei.com/politics/international-relations/china-s-growing-ties-with-serbia-point-to-new-silk-curtain-in-europe", "id_key": "8ff033cce8e3cfc121ac0501321bb3ac44103bd356f9630f0419335eb8cfba02", "summary": "", "ingested_utc": "2025-08-19T18:54:38Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T18:54:38Z", "source": "Nikkei_Asia_Top", "title": "Huge Vietnam smart city backed by Japan's Sumitomo moves forward", "url": "https://asia.nikkei.com/business/markets/property/huge-vietnam-smart-city-backed-by-japan-s-sumitomo-moves-forward2", "id_key": "084e7fad4f8c474aa47f3a61a4595399c85156b353f122d21a7fdf98809c6ef0", "summary": "", "ingested_utc": "2025-08-19T18:54:38Z"}
