{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T13:54:13Z", "source": "Guardian_World", "title": "Five journalists among 20 killed in Israeli attack on Gaza hospital, say health officials", "url": "https://www.theguardian.com/world/2025/aug/25/journalists-among-people-killed-by-israeli-strike-on-gaza-hospital", "id_key": "cb9a4b5424f70d65f1a0509647a9acde49d268644d692e080f684e269f80b79a", "summary": "Deaths take the number of Palestinian journalists killed in the conflict since 7 October 2023 to at least 193 Five journalists were among at least 20 people killed by Israeli strikes on Nasser hospital in southern Gaza, health officials said. The strikes on Monday killed Hussam al-Masri, who worked for Reuters, Mariam Abu Dagga, who worked for the Associated Press, the Al Jazeera journalist Mohammed Salam, the photojournalist Moaz Abu Taha , and Ahmad Abu Aziz from Quds Feed. Another Reuters journalist, Hatem Khaled, was wounded in the attack. Continue reading...", "ingested_utc": "2025-08-25T13:54:13Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T13:54:39Z", "source": "Unchained", "title": "AAVE Tumbles After WLFI Reportedly Claims Token Deal is ‘Fake News’", "url": "https://unchainedcrypto.com/aave-tumbles-after-wlfi-reportedly-claims-token-deal-is-fake-news/", "id_key": "831185a1b3b52841038392d34e0d8140ecc675377e9406083e127dae127ab9f1", "summary": "Decentralized lending protocol Aave’s native token AAVE tumbled 8% after a rumor that its token deal with Trump family-linked DeFi protocol World Liberty Financial (WLFI) would not go ahead as planned. The core issue centers around a governance proposal from October 2024, approved by the Aave DAO, that granted Aave ... The post AAVE Tumbles After WLFI Reportedly Claims Token Deal is ‘Fake News’ appeared first on Unchained .", "ingested_utc": "2025-08-25T13:54:39Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T13:56:28Z", "source": "NYTimes_Business", "title": "SpaceX Reschedules Scrubbed 10th Test Launch of Starship Rocket", "url": "https://www.nytimes.com/2025/08/24/science/spacex-starship-launch.html", "id_key": "0b50350e13f6579898e46f551b1451b65ac9854a1ca2e3c4df354973261de768", "summary": "Elon Musk’s company says it will try again on Monday for the next trip of its Starship prototype, which experienced setbacks during its last three flights.", "ingested_utc": "2025-08-25T13:56:28Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T13:57:01Z", "source": "Engadget_All", "title": "The MasterClass Labor Day sale discounts subscriptions by 50 percent", "url": "https://www.engadget.com/deals/the-masterclass-labor-day-sale-discounts-subscriptions-by-50-percent-133223509.html?src=rss", "id_key": "55f6936031eb37121fcc4810cea59a3a557f2b039a37981a901effe597a3b405", "summary": "MasterClass promises online learning with instructors who are the very best in their fields, and an annual subscription is currently 50 percent off across all tiers. Subscribers to MasterClass will have access to over 200 classes taught by iconic authors, chefs, athletes and leaders representing a diverse collection of skill sets and backgrounds. With a subscription, you could watch a class on writing taught by James Patterson, or learn cooking techniques from Thomas Keller. If you're trying to impress at your next pickup basketball game you could learn about shooting, ball-handling and scoring from Steph Curry. Each class includes around 20 video lessons that run about 10 minutes long on average, as well as an in-depth workbook. MasterClass has also begun producing some original series for its platform. The series Business Rebels features different CEOs walking viewers through the strategies that helped them disrupt their industries. One entitled Skin Health features top dermatologists and a cosmetic chemist walking viewers through keeping their skin healthy through cleansing routines and specific beauty products. The wide range of skills or life lessons you could learn through these classes is why MasterClass is on our list of best subscriptions you can give as gifts . Maybe your loved one who loves to host dinner parties could use some tips from Gordon Ramsay. There are three subscription tiers for MasterClass that each differ only in how many devices they allow at one time, and whether offline videos are supported. The Standard subscription only supports one device, whereas the Plus subscription allows two. These are normally $10 and $15 per month, respectively, and neither offers offline mode. The Premium tier, which carries a regular price of $20 per month, allows up to six devices and features offline mode for downloaded classes. All three tiers are part of the 50 percent off sale, which marks them down to $5, $8 and $10 respectively. MasterClass bills annually, so be sure to calculate the total from the \"monthly\" price before deciding. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-masterclass-labor-day-sale-discounts-subscriptions-by-50-percent-133223509.html?src=rss", "ingested_utc": "2025-08-25T13:57:01Z"}
