{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:43:30Z", "source": "Guardian_Business", "title": "‘Pattern of lawfare’: Trump is targeting opponents with mortgage fraud claims", "url": "https://www.theguardian.com/us-news/2025/aug/24/trump-lawfare-mortgage-fraud-lisa-cook", "id_key": "acd44ef017f6624c6110e245bee016bbbad59fc2aeb8441efd6a461c1c0fc438", "summary": "First Letitia James, then Adam Schiff and now president has trained his ire on Lisa Cook, threatening to fire Fed governor Donald Trump and his allies have been accused of executing a “pattern of lawfare” akin to those exerted by authoritarian regimes in Hungary and Russia after adopting a new strategy to target political opponents: allegations of mortgage fraud. First it was Letitia James, the New York attorney general, then it was Adam Schiff, a California senator. Now, the president is targeting Federal Reserve governor Lisa Cook, demanding she resign and threatening to fire her. Continue reading...", "ingested_utc": "2025-08-24T13:43:30Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:43:30Z", "source": "Guardian_Business", "title": "Tariffs ‘starting to show up’: how Trump’s strategy could increase back-to-school costs", "url": "https://www.theguardian.com/us-news/2025/aug/24/trump-tariffs-school-supplies-prices", "id_key": "89c62f1313cf88a55def41513652fa07ab127d52a24f9885fb6aa918bb9b5ac6", "summary": "National Retail Federation estimates families are budgeting an average of nearly $875 for the year for shopping Summer is drawing to a close and as parents and children get ready for a new school year, their first lesson will be in economics. Most of Donald Trump’s tariffs went into effect at the beginning of August. We are still waiting on a deal with China. But with school supplies so dependent on imports, consumers have been anxiously waiting to see how tariffs will affect the prices they see in stores. Continue reading...", "ingested_utc": "2025-08-24T13:43:30Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:43:31Z", "source": "Guardian_World", "title": "Canada to drop counter-tariffs on some US goods one day after call with Trump", "url": "https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump", "id_key": "9ad735fcce11b655a43835c5a4a8ec0e268ece817262d09f54e09551ae60379c", "summary": "Mark Carney says change will go into effect on 1 September but tariffs on steel, aluminum and autos will remain Canada will drop its counter-tariffs on some American goods in the coming days, Mark Carney has said, as the country’s prime minister looks to end a protracted trade war with longtime ally the United States. From 1 September, the Canadian government will remove some levies on US goods that comply with the North American free-trade pact, a move meant to “match” how the White House treated Canadian goods. Levies on steel, aluminum and autos will remain in place. Continue reading...", "ingested_utc": "2025-08-24T13:43:31Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:46:17Z", "source": "Engadget_All", "title": "Ooni Labor Day sale: Get 30 percent off the Volt 12 pizza oven", "url": "https://www.engadget.com/deals/ooni-labor-day-sale-get-30-percent-off-the-volt-12-pizza-oven-150908698.html?src=rss", "id_key": "5df5d7c741e493faa51bc7a5843d7d2fe85bcc209862c174e6a91461a04abbd7", "summary": "The Ooni Labor Day sale is here, bringing deep discounts to all kinds of pizza ovens and aspiring pizzaiolo accessories. One of the highlights of the sale is the Volt 12 pizza oven , which is 30 percent off and down to $629. Ooni also discounted the Volt's cover as well, so you can pick on up for only $49 along with the oven itself. The Volt 12 is an electric pizza oven that operates indoors, a first for the company. We praised the unit in our official review , saying that it \"works just as well\" as the company's indoor models. It preheats quickly and the interior is spacious. It can hit 850 degrees, which cooks a pizza in 90 seconds. The oven also requires little-to-no supervision during use. It's pretty much a set it and forget it type appliance. This operates in stark contrast with the company's outdoor models, which demands that folks pay attention to the fire during use. The Volt 12 made our list of the best pizza ovens , and it's absolutely the finest indoor model available right now. The only major downside is the price. It's tough to recommend any indoor kitchen doodad at $900, but it's easier to do so at $629. This isn't the only interesting item on sale right now at Ooni. The company's selling the Koda 2 Max outdoor pizza oven for $1,039 , which is a discount of $270. This extra-large gas-powered oven can handle multiple pizzas at once. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/ooni-labor-day-sale-get-30-percent-off-the-volt-12-pizza-oven-150908698.html?src=rss", "ingested_utc": "2025-08-24T13:46:17Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:46:17Z", "source": "Engadget_All", "title": "The best Labor Day sales for 2025: Get up to 50 percent off tech from Apple, Anker, Shark and others", "url": "https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-get-up-to-50-percent-off-tech-from-apple-anker-shark-and-others-120049434.html?src=rss", "id_key": "0e9d90213763b99c970c050b68f1e8863ff363167bd700e36afad2d6d5e0e409", "summary": "Labor Day marks the unofficial end to summer as the weather starts to get crisper and students head back to school for the new semester. It also marks a good time to check out the tech deals available across the web. While seasonal holidays like Memorial Day and Labor Day are not the boon for tech sales that shopping events like Amazon Prime Day are, they can present good opportunities to save on things like laptops, tablets, smart home gear and more. Here, we've curated the best Labor Day sales on tech we could find this year. Since this time of year does overlap with the back-to-school season, students should be first in line to check out these deals. If you need some new gadgets for college, or refreshed tech to help you out in your first job after graduating, now's the time to see if you can get it for less. Student discounts are handy and exclusive to those who can prove their student status, but the good thing about Labor Day sales is that anyone can take advantage of them — student ID not required. Best Labor Day sales: Engadget's top picks Apple AirPods Pro 2 for $169 (32 percent off): The AirPods Pro 2 are Apple’s best set of wireless earbuds for now, as they offer the full set of Apple-focused features, strong ANC, onboard volume controls, a comfy in-ear design and a warm sound profile that most should find agreeable. They can even work as a hearing aid , though their six-hour battery life still isn’t the best, and you should only get them if you’re all-in on Apple hardware. But if that’s the case, we consider them the best wireless earbuds for iPhone owners. Apple iPad (11-inch, A16) for $299 ($50 off): Apple's entry-level iPad is, unsurprisingly, the best iPad option for those on a budget. It has solid performance thanks to the A16 chipset, 128GB of storage in the base model and good battery life. Apple Mac mini M4 for $499 ($100 off): The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard, two front-facing USB-C ports, an extra Thunderbolt 4 port and the ability to drive three external displays. We gave the M4 Pro model a review score of 90 . Google Pixel 10 smartphone + $100 Amazon gift card for $799 ($100 off): More of a pre-order deal than a Labor Day deal, this bundle includes a free gift card when you order the latest Google Pixel phone in advance. You'll find different gift card deals at Amazon depending on which phone you go with: the Pixel 10 Pro and Pro XL have a $200 gift cards included, while the Pixel 10 Pro Fold comes with a free $300 gift card. Eufy 11S Max robot vacuum for $150 (46 percent off): This model is one of our favorite budget robot vacuums thanks to its slim design that lets you get underneath furniture more easily and strong suction power for its size. Note that it does not have Wi-Fi connectivity, but it comes with a remote that lets you control the robot to your liking. Shark AI Ultra robot vacuum for $298 (50 percent off): This Shark robot vacuum is a version of one of our favorites and it comes with a auto-empty base that can hold up to 60 days worth of debris. It has strong suction power and home mapping capabilities, so you can tailor cleaning jobs to your liking in addition to putting the robot on a cleaning schedule. Blink Outdoor 4 security cameras (3 camera system) for $100 (47 percent off): Some of our favorite security cameras , Blink Outdoor 4 devices support 1080p video, two-way talk, motion alerts and night vision. The most convenient thing about these is that they're totally wireless and run on AA batteries that can last up to two years before you need to replace them. That combined with their weather-proof design allows you to place them both inside and outside. Cosori 9-in-1 air fryer for $90 (25 percent off): One of our picks for the best air fryers , this Cosori model has a spacious six-quart cooking basket and nine prep modes to choose from. In our testing, it consistently crisped up all kinds of foods, from frozen appetizers to raw proteins, and it has a nifty safety feature with its built-in basket release button. HORI Piranha Plant camera for Switch 2 for $40 (33 percent off): If you plan on taking advantage of the Switch 2's video and group chat feature, there's no cuter way to do it than with this Piranha Plant camera. In addition to using it with the pot as a stand, the plant itself detaches from the pot so you can use the camera in portable mode with the USB port on the new console. ESPN Unlimited with Disney+ and Hulu (with ads) for $30/month ($6/month off): ESPN’s new streaming service is officially available now, and new subscribers can get Disney+ and Hulu included for one year when they sign up. The regular price of the new ESPN Unlimited plan is $30 per month, but this bundle offer throws in Disney+ and Hulu (with ads) for one year at no extra cost. If you want to break it down, you’re essentially getting each of the three services for $10 monthly with this offer. NordVPN deal — Get up to 77 percent off two-year plans: Most of NordVPN's two-year plans are on sale right now. You'll get 77 percent off the Prime tier, bringing the price down to $189 for 27 months of service (Nord throws in an extra three months for free). Arguably the best plan for most people is the Plus tier, which is 73 percent off and down to $108 for the 27-month term. MasterClass deal — Get 50 percent off one-year subscriptions: You can sign up for one year of MasterClass access for as low as $5 per month thanks to this sale that runs through September 1. A subscription lets you watch hundreds of online video classes taught by experts in their fields, and subject matter ranges from writing to cooking to sports. Best Labor Day sales on tech Beats Studio Pro headphones for $180 (49 percent off) 8Bitdo Ultimate 2C Wired Controller for $15 (25 percent off) Sony WH-1000XM4 headphones for $198 (43 percent off) Anker 621 5K magnetic power bank for $28 (30 percent off) Amazon Fire Max 11 tablet for $175 (24 percent off) Nothing Headphones (1) for $269 ($30 off) Amazon Labor Day sale: Get up to 40 percent off headphones, earbuds, tech accessories and more Sonos back-to-school sale: Save up to 25 percent on headphones and speakers Ooni Labor Day sale: Get 20 percent off the Koda 2 Max and save on other pizza ovens Solo Stove Labor Day sale: Get 20 percent off fire pits and 15 percent off select accessories Meater Labor Day sale: Get up to 27 percent off smart meat thermometers Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-get-up-to-50-percent-off-tech-from-apple-anker-shark-and-others-120049434.html?src=rss", "ingested_utc": "2025-08-24T13:46:17Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:46:19Z", "source": "TheEconomist_Finance", "title": "Fear the deficit-populism doom loop", "url": "https://www.economist.com/finance-and-economics/2025/08/24/fear-the-deficit-populism-doom-loop", "id_key": "5b79a9ee0e89ddfe5ed7f26dc28dc1f0bef70fc0c43c16b143f99bf2bbba8dd7", "summary": "Politicians, particularly in Europe, are in a terrible bind", "ingested_utc": "2025-08-24T13:46:19Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:46:26Z", "source": "TheStreet_Top", "title": "Ross earnings show Americans still shopping, but focused on best deals", "url": "https://www.thestreet.com/retail/ross-earnings-show-americans-still-shopping-but-theyre-focused-on-the-best-deals", "id_key": "725efdbc8ac825a7f27317906d3f5507207c24bda4173e0794d90bffd3e84f49", "summary": "Consumers are pinching pennies but opening their wallets at discounters like Ross.", "ingested_utc": "2025-08-24T13:46:26Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:46:26Z", "source": "AlJazeera_All", "title": "How burgers helped me better understand my Vietnamese immigrant mother", "url": "https://www.aljazeera.com/features/2025/8/24/how-burgers-helped-me-better-understand-my-vietnamese-immigrant-mother?traffic_source=rss", "id_key": "ef7f64d9dd82ddedd48adadcf25736c1c3834b63c283fc6ff980fc2e9322e759", "summary": "Once, eating cheeseburgers allowed my mother to feel American. Now, it shows that she is free to eat what she wants.", "ingested_utc": "2025-08-24T13:46:26Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T13:46:26Z", "source": "AlJazeera_All", "title": "Israeli protesters confront far-right Security Minister Itamar Ben-Gvir", "url": "https://www.aljazeera.com/video/newsfeed/2025/8/24/israeli-protesters-confront-far-right-security-minister-itamar-ben-gvir?traffic_source=rss", "id_key": "cd33e16e81d76eb57c1d232e342a5107c33734d81e5a5f8574b5ed4c0d0ed54f", "summary": "A group of protesters confronted Israel's National Security Minister Ben-Gvir, accusing him of pursuing war.", "ingested_utc": "2025-08-24T13:46:26Z"}
