{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:50:30Z", "source": "Guardian_World", "title": "Protesters gather in Washington DC as federal law enforcement officers stop drivers – US politics live", "url": "https://www.theguardian.com/us-news/live/2025/aug/15/washington-dc-donald-trump-protests-us-politics-latest-updates-news", "id_key": "906b19a2b52666c014321ee1ae16aa40a86f36f84506b8a2d530df1ad06c8ae9", "summary": "At least one person reportedly arrested as protesters heckle law enforcement and warn drivers to avoid area as Trump makes false claims about crime levels Good morning and welcome to the US politics live blog. My name is Tom Ambrose and I’ll be bringing you all the latest news lines over the next few hours. We start with news that Donald Trump has falsely claimed crime in Washington DC is “the worst it’s ever been” on Thursday, amid a federal takeover of the city’s police department and deployment of the national guard and federal agents in the city. As part of its advertising blitz to attract new recruits, Immigration and Customs Enforcement (Ice) released a social media video on Thursday that uses a song by the rapper DaBaby and shows agency vehicles that appear to be painted in the same red, blue and gold style as Donald Trump’s private plane, which was featured in the opening sequence for The Apprentice. New York’s mayor, Eric Adams , confirmed on social media that a federal building where protesters held a silent vigil on Thursday against Immigration and Customs Enforcement (Ice) was evacuated after “envelopes containing white powder were discovered”. In another sign that the Trump presidency is largely made-for-TV, the White House and Fox News revealed that Trump will appear on Fox News both before and immediately after his summit meeting with Vladimir Putin on Friday. Four days after Trump ordered the unhoused residents of Washington DC, whom he sped past in his motorcade for a golf outing, to leave the city, local officials helped clear encampments before announced sweeps by federal agents. Continue reading...", "ingested_utc": "2025-08-15T09:50:30Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:53:30Z", "source": "TheStreet_Top", "title": "Walmart is selling the 'perfect' kitchen drawer organizer for just $14", "url": "https://www.thestreet.com/deals/dakomm-expandable-silverware-drawer-organizer-walmart-flash-sale", "id_key": "d67846236ac9032311dfe153d7fada2e8a8f7acffe68cd6d3d3ca01e6ca6253a", "summary": "\"I'm absolutely thrilled with this great silverware organizer.\"", "ingested_utc": "2025-08-15T09:53:30Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-15", "retrieved_utc": "2025-08-15T09:53:37Z", "source": "FinancialPost_Business", "title": "Canadian Home Sales Rise for Fourth Straight Month as Buyers Return", "url": "https://financialpost.com/pmn/business-pmn/canadian-home-sales-rise-for-fourth-straight-month-as-buyers-return", "id_key": "67c6f642c8e27b87547097ac941d27cdd4370a911137fdb857f6231317d8cb33", "summary": "Canadian home sales rose for a fourth straight month as growing confidence the economy will weather US tariffs draws more buyers back into the market.", "ingested_utc": "2025-08-15T09:53:37Z"}
