{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:31:56Z", "source": "Guardian_World", "title": "Coalition’s climate tussles to get public airing as parliament debates Barnaby Joyce’s bill to dump net zero", "url": "https://www.theguardian.com/australia-news/2025/aug/25/coalitions-climate-tussles-to-get-public-airing-as-parliament-debates-barnaby-joyces-bill-to-dump-net-zero", "id_key": "b26c0e2c56956798fe6f4178d786a43a1d0683900766984e2fa8af6a2386e6ae", "summary": "Ideological tensions to be on full display amid growing list of Liberal state divisions opposed to emissions reduction policy Get our breaking news email , free app or daily news podcast The Coalition’s internal struggle over climate change will be on full display on Monday as the House of Representatives prepares to debate Barnaby Joyce’s private bill to dump Australia’s net zero target. Over the weekend, the Queensland Liberal National party convention voted to abandon Australia’s net zero targets , adding to the growing list of Liberal state divisions opposed to the emissions reduction policy, including South Australia and Western Australia. The state divisions’ motions do not bind the federal party room but will ignite ideological tensions within the Coalition as it undertakes a review of its internally contested energy and emissions reduction policies. The tussles are expected to play out in public on Monday, with Joyce’s bill to ditch the 2050 net zero target up for debate in the lower house to open the sitting fortnight. Continue reading...", "ingested_utc": "2025-08-24T15:31:56Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:31:56Z", "source": "Guardian_World", "title": "‘No place is safe’: families flee Gaza City as Israel vows to press on with offensive", "url": "https://www.theguardian.com/world/2025/aug/24/families-flee-gaza-city-as-israel-vows-to-press-on-with-offensive", "id_key": "5ddc2e3b1134bc40ce794af54a0e025aaea9e182d9a96f6acdb4682ced1fda7d", "summary": "Others refuse to leave as aircraft and tanks bomb outskirts of city where about half of Gaza’s 2m people now live Israeli aircraft and tanks have pounded the eastern and northern outskirts of Gaza City , destroying buildings and homes, as Israeli leaders vowed to press on with an expanded large-scale offensive on the city. Witnesses reported the sound of continuous explosions overnight from Saturday night into Sunday morning in the areas of Zeitoun and Shejaia. Meanwhile, tanks shelled houses and roads in the nearby Sabra neighbourhood and several buildings were blown up in the northern area of Jabaliya. Continue reading...", "ingested_utc": "2025-08-24T15:31:56Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:31:56Z", "source": "Guardian_World", "title": "UK weather: bank holiday sun forecast for most with highs of 30C in places", "url": "https://www.theguardian.com/uk-news/2025/aug/24/bank-holiday-temperatures-of-nearly-30c-forecast-met-office", "id_key": "d2902614629b5b2db8e66a9ea99cdade65dd778816aab7f9f90dcf709b253637", "summary": "Met Office predicts remnants of Hurricane Erin will then bring wind and rain for the rest of the week Bank holiday temperatures are expected to soar to near 30C (86F) across parts of the UK on Monday before the remnants of Hurricane Erin bring wind and rain. Maximum temperatures on Sunday will be about 26C or 27C, then those attending Notting Hill carnival in London on Monday can expect it to reach 28C or 29C with widespread sunshine for most, the Met Office said. Continue reading...", "ingested_utc": "2025-08-24T15:31:56Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:31:56Z", "source": "Guardian_World", "title": "Ministers vow to give sexual violence victims ‘the justice they deserve’", "url": "https://www.theguardian.com/society/2025/aug/24/ministers-vow-sexual-violence-victims-justice-deserve-england-wales", "id_key": "dfe87db57e04d821833c4c074ec734e28a13eb788cf5fdd9b425a5bd5d647964", "summary": "Exclusive: Figures show proportion of sentences referred back as unduly lenient has risen in England and Wales Ministers have vowed to give victims of sexual violence “the justice they deserve” as figures showed that growing numbers of sentences for such crimes in England and Wales were being referred back to judges as unduly lenient. According to internal government figures seen by the Guardian, the number of sentences for rape and sexual assault that were increased by the court of appeal after being referred by the public and the attorney general’s office has risen this year. Continue reading...", "ingested_utc": "2025-08-24T15:31:56Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:34:40Z", "source": "Engadget_All", "title": "Sonos back-to-school sale: Headphones and speakers are up to 25 percent off", "url": "https://www.engadget.com/deals/sonos-back-to-school-sale-headphones-and-speakers-are-up-to-25-percent-off-125211063.html?src=rss", "id_key": "dbc7eceb0968778292f9bf7dfbf8846ab0e45ab5cb54ea55298498e8b2e4663e", "summary": "The back-to-school season isn't only a good time to save on things like a new laptop. Case in point: Sonos' back-to-school sale. Whether you want to upgrade the sound in your dorm room or home office, you can save up to 25 percent on Sonos speakers and other gear right now. Included in the sale is the Era 100 , which has a 10-percent discount at the moment. Our choice for midrange smart speaker is down to $179 from $199 as part of a larger sale on the Sonos website . The same price is available on Amazon , as are some more deals on Sonos products . Sonos debuted the Era 100 speaker in 2023 as a replacement for the Sonos One. It offers great sound quality and has built-in mics for Trueplay tuning and voice control. It's worth mentioning that the Sonos Ace headphones are also on sale for $299, down from $399 — a 25 percent discount. The headphones have come a long way since they first launched, including the introduction of TrueCinema, which works with a Sonos soundbar to create the best spatial audio experience. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/sonos-back-to-school-sale-headphones-and-speakers-are-up-to-25-percent-off-125211063.html?src=rss", "ingested_utc": "2025-08-24T15:34:40Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:34:48Z", "source": "TheStreet_Top", "title": "Chick-fil-A quietly adds pumpkin pie latte to its menu and customers are angry", "url": "https://www.thestreet.com/restaurants/chick-fil-a-quietly-adds-pumpkin-pie-latte-to-its-menu-and-customers-are-angry", "id_key": "e3aef5858f93a149a8f3cac051d4a94fa5c8e5690cd1f9f25dbee36b764f05f7", "summary": "Chick-fil-A's highly anticipated fall menu addition has sparked major internet buzz.", "ingested_utc": "2025-08-24T15:34:48Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:34:49Z", "source": "AlJazeera_All", "title": "Moscow says Russia and Ukraine exchange 146 prisoners each", "url": "https://www.aljazeera.com/news/2025/8/24/moscow-says-russia-and-ukraine-exchange-146-prisoners-each?traffic_source=rss", "id_key": "f0ced37aa09a25596a8a9f38c2c9b386cff1f90be6ed629a71d6876ed1e8cd6b", "summary": "The exchange comes amid diplomatic efforts to solve the conflict and a Ukrainian drone attack on Russia overnight.", "ingested_utc": "2025-08-24T15:34:49Z"}
{"published_utc": "2025-08-24", "retrieved_date": "2025-08-24", "retrieved_utc": "2025-08-24T15:35:10Z", "source": "HackerNews_Top", "title": "US attack on renewables will lead to power crunch that spikes electricity prices", "url": "https://www.cnbc.com/2025/08/24/solar-wind-renewable-trump-tariff-utility-tax-credit-itc-ptc-obbb-electricity-price.html", "id_key": "7662287473cae4063b5871781f9516cd185c0c4766f072d9ae18c8e5d2175bd5", "summary": "Comments", "ingested_utc": "2025-08-24T15:35:10Z"}
