{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:51:48Z", "source": "Guardian_World", "title": "Aubrey Plaza talks about her husband’s suicide: ‘A daily struggle, obviously’", "url": "https://www.theguardian.com/culture/2025/aug/19/aubrey-plaza-husband-jeff-baena-death", "id_key": "068e0c153303401d94a84f75ef7adaa37fb0223ec04801e9bb0e6b69c7907e6b", "summary": "Actor opens up about death of her director husband Jeff Baena, referring to her grief as ‘a giant ocean of awfulness’ The actor Aubrey Plaza has opened up about the suicide of her husband, director Jeff Baena, who died in January . The White Lotus and Parks and Recreation star was speaking to Amy Poehler for her podcast Good Hang when she was asked how she was doing during “a terrible, terrible, tragic year”. Continue reading...", "ingested_utc": "2025-08-19T15:51:48Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:52:12Z", "source": "CryptoSlate", "title": "Ripple’s RLUSD and Donald Trump-linked USD1 used in Bullish’s $1.1 billion IPO settlement", "url": "https://cryptoslate.com/ripples-rlusd-and-donald-trump-linked-usd1-used-in-bullishs-1-1-billion-ipo-settlement/", "id_key": "474b8a1fa430d0b192cae5901902b3f32a5fe5bd21085996abc4ac3d3f8b637e", "summary": "Crypto exchange Bullish disclosed on Aug. 19 that part of its $1.15 billion IPO proceeds was received in a mix of stablecoins, including Ripple’s RLUSD on the XRP Ledger and President Donald Trump-affiliated USD1. The firm said these tokens were among several digital assets involved in the settlement process, which also included Circle’s USDC and […] The post Ripple’s RLUSD and Donald Trump-linked USD1 used in Bullish’s $1.1 billion IPO settlement appeared first on CryptoSlate .", "ingested_utc": "2025-08-19T15:52:12Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:54:07Z", "source": "MarketWatch_Bulletins", "title": "Nearly 50% of adults are now ordering kids’ meals", "url": "https://www.marketwatch.com/bulletins/redirect/go?g=48575865-a8e3-42bd-a372-e1ddf1d855d8&mod=mw_rss_bulletins", "id_key": "a2061e09b8e284119517aab59347257424d52629a6327bfed800839b93bf9c36", "summary": "", "ingested_utc": "2025-08-19T15:54:07Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:54:43Z", "source": "TheVerge_All", "title": "Get ready for Silksong’s ‘special announcement’ on Thursday", "url": "https://www.theverge.com/news/761451/hollow-knight-silksong-special-announcement-youtube", "id_key": "979b0f8aa5df568094d545f075af72f100bdaeb26832026243f49b7f7960c235", "summary": "Prepare your best clown makeup: Team Cherry, the developers of Hollow Knight: Silksong, will be making a “special announcement” about the game on Thursday at 10:30AM ET. The announcement will be shown on Team Cherry’s YouTube channel, and the premiere link is already live. It’s been a very long wait for solid Silksong news, so […]", "ingested_utc": "2025-08-19T15:54:43Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:54:44Z", "source": "TechCrunch_All", "title": "Aalo Atomics raises $100M to build a microreactor and data center together", "url": "https://techcrunch.com/2025/08/19/aalo-atomics-raises-100m-to-build-a-microreactor-and-data-center-together/", "id_key": "cec642032de2d7868e0361f5267416de4ef5bf7c3c47663c65ef054683613639", "summary": "Nuclear startup Aalo Atomics plans to turn on its first power plant, the 50-megawatt Aalo-X, in the summer of 2026. It's an aggressive timeline that bucks nuclear industry trends.", "ingested_utc": "2025-08-19T15:54:44Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:54:47Z", "source": "Engadget_All", "title": "How to watch Gamescom 2025 and what to expect", "url": "https://www.engadget.com/gaming/how-to-watch-gamescom-2025-and-what-to-expect-120024733.html?src=rss", "id_key": "ee6fabd8e522d85a65920b04ef2e195b81d5972d56f8892716daa6290719982a", "summary": "It feels like Summer Game Fest is only just in our rear view mirror and yet there's another video game extravaganza on the horizon. Gamescom is the planet's largest gaming event and we're sure to find out about a bunch of interesting new games at the Opening Night Live showcase. Xbox is broadcasting from the show floor across two days, and there will be other presentations that are worth keeping an eye on, including a \"special announcement\" for Hollow Knight: Silksong . Gamescom is taking place between August 20 and 24 this year, and we're learning bits and pieces about what to expect from the various showcases. The affair will kick off with Opening Night Live, a showcase hosted by Geoff Keighley that bridges the gap between his two other major events, Summer Game Fest Live and The Game Awards. That will be followed by two days of Xbox broadcasts, the latest edition of the Future Games Show and three days of Bethesda streams. There will also be news from Ubisoft on what's next for The Division 2 . The company will host two panels related to the franchise during Gamescom. One will include more info about The Division Resurgence ( a delayed mobile game ), as well details about a \"big Division 2 project.\" We'll update this preview with more Gamescom details as we get them, and embed video versions of each stream as they become available too. Here's our breakdown of how to watch Gamescom 2025 and what to expect from the event. Gamescom schedule Opening Night Live — August 19, 1:30PM ET (pre-show), 2PM (main show) Xbox @ gamescom 2025 Broadcast — August 20, 9AM ET Future Games Show — August 20, 2PM ET Xbox @ gamescom 2025 Broadcast — August 21, 9AM ET Hollow Knight: Silksong - Special Announcement — August 21, 10:30AM ET Awesome Indies — August 21, 12PM ET Bethesda — August 22-25 How to watch Gamescom Opening Night Live - August 19, 2PM ET Watch on YouTube Opening Night Live perhaps won't feature as many heavy hitters as Summer Game Fest Live or The Game Awards typically have, but one thing's for certain: Call of Duty fans will definitely want to tune in. The two-hour showcase will feature the \"worldwide reveal\" of Call of Duty: Black Ops 7. We'll almost certainly get a release date here too. Reports suggest we won't get a release date for Hollow Knight: Silksong at ONL, but we may not have to wait much longer... (more on that in a bit). You can also expect a trailer for multiplayer RPG Honor of Kings: World, along with new looks at Ghost of Yotei , The Outer Worlds 2 , Resident Evil Requiem, Silent Hill f, Ninja Gaiden 4, Daemon X Machina: Titanic Scion and The Seven Deadly Sins: Origin. You'll get to see the opening cinematic for the World of Warcraft: Midnight expansion as well. It won't all be game reveals and announcements, though — there'll be a performance of music from Clair Obscur: Expedition 33 featuring composer Lorien Testard and vocalist Alice Duport-Percier. Additionally, you'll get a peek at season two of Prime Video's Fallout series, which will arrive in December. We'll be keeping tabs on all the news from Opening Night Live right here on Engadget. Myself, senior editor Jess Conditt and editor-in-chief Aaron Souppouris will be live-blogging our way through ONL. Join us! It should be fun. How to watch Xbox @ gamescom 2025 Day 1 Broadcast — August 20, 9AM ET Watch on YouTube , Twitch , TikTok or Facebook One major piece of news we're likely to get from Xbox during one of its streams (if it isn't revealed at ONL beforehand) is the release date and pricing for the ASUS ROG Xbox Ally and Xbox Ally X handheld systems. Leaker billbil-kun has reported the devices will arrive on October 16, at least in Europe, costing €599 for the Xbox Ally and €899 for the higher-end Xbox Ally X. Microsoft had already confirmed these handhelds would be available in time for the holiday season, so that rumored release date makes sense. Either way, we should get confirmation during Gamescom of when to expect these devices, especially since the company says it will discuss the handhelds during its August 20 stream. This particular event will feature the likes of Grounded 2, Keeper and Call of Duty: Black Ops 7 . The Order of Giants , an expansion for Indiana Jones and the Great Circle, will be showcased alongside Final Fantasy VII Remake Intergrade, Microsoft Flight Simulator 2024, Dying Light: The Beast, World of Warcraft: Midnight, Hotel Barcelona, Invincible Vs., Cronos: The New Dawn, Outbound, Powerwash Simulator 2 and Starsand Island. Along with the English-language broadcast, Xbox's streams will be available in other languages on regional Xbox channels on the likes of YouTube, Twitch, TikTok and Facebook. The streams will be available in Traditional Chinese, German, French, Japanese, Brazilian Portuguese and Mexican Spanish, as well as with ASL and English audio descriptions. How to watch Future Games Show — August 20, 2PM ET Watch on Twitch or YouTube Actors David Hayter (Snake in the Metal Gear series) and Maggie Robertson (Lady Dimitrescu in Resident Evil Village ) will be hosting this edition of the Future Games Show. This installment will feature more than 50 games across world premieres, new trailers and sudden demo releases. Capcom, Bandai Namco Entertainment, EA and NACON are among those who'll be represented in this one, which will feature projects from AAA and indie publishers and studios. Several games have been confirmed to make an appearance here, including Skate (which is slated to hit early access this year ), Resident Evil Requiem, Cronos: The New Dawn, Hotel Barcelona, Deer & Boy, The Seven Deadly Sins: Origin and Katanaut . Not only that, there will be a post-show that will run for 40 minutes and feature more trailers, world premieres and demo announcements. How to watch Xbox @ gamescom 2025 Day 2 Broadcast — August 21, 9AM ET Watch on YouTube , Twitch , TikTok or Facebook Xbox will be broadcasting live from the Gamescom show floor for a second straight day. This particular stream will include details on Ninja Gaiden 4, The Outer Worlds 2 and Overwatch 2 (perhaps with more info about Season 18, which is set to start on August 26). You can also expect looks at Onimusha: Way of the Sword, At Fate's End, Age of Empires IV, High on Life 2, Jurassic World Evolution 3 and Fragpunk . In addition, the lineup for this stream includes Silent Hill f, Metal Gear Solid Delta: Snake Eater, Lego Voyagers, Final Fantasy Tactics - The Ivalice Chronicles, Mortal Kombat: Legacy Kollection, Mistfall Hunter and My Hero Academia: All's Justice. How to watch Hollow Knight: Silksong - Special Announcement — August 21, 10:30AM ET Watch on YouTube This is not a drill. Team Cherry has scheduled a \"special announcement\" for maybe the most anticipated and hyped-up game this side of Grand Theft Auto VI . The developer and publisher hasn't revealed exactly what it plans to announce regarding Hollow Knight: Silksong, but it's gotta be a release date, right ? A deeper dive into the game would be most welcome too. It's been six long years since we had some hands-on time with Hollow Knight: Silksong . However, Gamescom attendees will be able to try it out at the Microsoft and Nintendo booths on the show floor. I hope the two companies have lots of space to accommodate what are sure to be long lines. How to watch Awesome Indies — August 21, 12PM ET Watch on YouTube and Twitch The Indie Arena Booth will host more than 200 games for Gamescom attendees to check out, but you won't necessarily need to be there in person to see them. Many will be featured in an hour-long showcase called Awesome Indies. Here, we'll see \"exclusive trailers, first peeks at never-before-seen gameplay, amazing premieres and exciting newcomers,\" according to Gamescom. There are a lot of interesting games being featured at the booth, including Cairn and Strange Antiquities . I'm particularly hoping the showcase will include some more details about Ball x Pit , which is one of my most anticipated games right now, Militsioner and the creepy-looking Fractured Blooms . How to watch Bethesda broadcasts - August 22 Watch on Twitch There will be plenty from the Bethesda side of the Xbox division as well. The publisher will be broadcasting from the Xbox show floor at Gamescom for three days, starting on August 22. According to Microsoft , these streams will include \"developer interviews, game showcases, community segments, crafting highlights and live IRL tours.\" This article originally appeared on Engadget at https://www.engadget.com/gaming/how-to-watch-gamescom-2025-and-what-to-expect-120024733.html?src=rss", "ingested_utc": "2025-08-19T15:54:47Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:55:17Z", "source": "FinancialPost_Business", "title": "Ninepoint Announces August 22 Launch Date for its Single-Stock High Income ETFs Focused on Iconic Canadian Companies", "url": "https://financialpost.com/globe-newswire/ninepoint-announces-august-22-launch-date-for-its-single-stock-high-income-etfs-focused-on-iconic-canadian-companies", "id_key": "e84a9730e82de4062ac6a0e2eae07c27d6e77b535cdc11632f620e5591632fd1", "summary": "Ninepoint HighShares ETFs give investors a new way to seek high monthly income from individual Canadian blue-chip stocks Management fees for all ETFs in the suite are waived until February 28 2026 TORONTO, Aug. 19, 2025 (GLOBE NEWSWIRE) — Ninepoint Partners LP (“Ninepoint”), one of Canada’s leading alternative investment management firms, today announced that after […]", "ingested_utc": "2025-08-19T15:55:17Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T15:55:17Z", "source": "FinancialPost_Business", "title": "Purpose Investments’ Canadian Yield Shares Suite Receives OSC Receipt, Set to Launch August 21, 2025", "url": "https://financialpost.com/globe-newswire/purpose-investments-canadian-yield-shares-suite-receives-osc-receipt-set-to-launch-august-21-2025", "id_key": "7af5f953652e4ae2159791d59d727342352a4ec34e3eb9e3618f8c26939d4360", "summary": "TORONTO, Aug. 19, 2025 (GLOBE NEWSWIRE) — Purpose Investments Inc. (“Purpose” or “Purpose Investments”) is pleased to announce that it has received final prospectus approval for new Canadian Yield Shares ETFs, marking a significant expansion in the evolution of the Yield Shares suite. These ETFs are expected to begin trading on Cboe Canada August 21, […]", "ingested_utc": "2025-08-19T15:55:17Z"}
