{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:35:29Z", "source": "Guardian_Business", "title": "White House cancels union contracts for hundreds of thousands of federal workers", "url": "https://www.theguardian.com/us-news/2025/aug/22/trump-federal-workers-union-rights", "id_key": "a09ddea23e3fa101a8536d45686c17b08c1e02b0377d25456efe5873ef6a4877", "summary": "Government workers are ‘canary in coalmine’ for Trump bid to gut union rights, leaders warn The Trump administration has unilaterally stripped hundreds of thousands of federal workers of their union contracts after a federal appeals court overruled an injunction which halted the plans. It is just getting started, according to the White House. An executive order issued in March sought to cancel all collective bargaining agreements for most federal employees, citing national security concerns – and remove collective bargaining rights from more than a million workers. Continue reading...", "ingested_utc": "2025-08-22T22:35:29Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:35:29Z", "source": "Guardian_World", "title": "US health department moves to strip thousands of employees of collective bargaining rights", "url": "https://www.theguardian.com/us-news/2025/aug/22/trump-administration-collective-bargaining-rights", "id_key": "b99b691085a8af54619eec126d78de691f87bdd6d017ddb6b134fdd603f295be", "summary": "Union decries effort as illegal as department confirms it is ending its recognition of unions for some employees The US Department of Health and Human Services (HHS) has moved to strip thousands of federal health agency employees of their collective bargaining rights, according to a union that called the effort illegal. HHS officials confirmed Friday that the department is ending its recognition of unions for a number of employees and reclaiming office space and equipment that had been used for union activities. Continue reading...", "ingested_utc": "2025-08-22T22:35:29Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:35:29Z", "source": "Guardian_World", "title": "Multiple fatalities, including at least one child, reported in New York bus crash", "url": "https://www.theguardian.com/us-news/2025/aug/22/new-york-bus-crash-niagara-falls", "id_key": "9e7ef1ba98860b7bf72b81672a69825906d00dd253694ae612ce26fcfdcd86a4", "summary": "Bus was transporting 52 people from Niagara Falls to New York City, when it lost control and ended up in a ditch A crash in upstate New York involving a tourist bus with more than 50 people on their way back from a trip to Niagara Falls caused multiple deaths on Friday, including at least one child, and passengers were trapped in the wreckage, according to law enforcement. The exact number of deaths wasn’t immediately available. Hospitals in the region said they evaluated or treated more than 40 people, with injuries ranging from head trauma to broken arms and legs. Continue reading...", "ingested_utc": "2025-08-22T22:35:29Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:35:29Z", "source": "Guardian_World", "title": "Ghislaine Maxwell transcripts: what we know at a glance", "url": "https://www.theguardian.com/us-news/2025/aug/22/ghislaine-maxwell-transcript-what-we-know", "id_key": "cd43a3da222134949c1f6b3a6ae06b29396b77a02006bf2c774e9daac318b52e", "summary": "US justice department released transcripts of interview with Jeffrey Epstein associate – here’s what we have learned The US Department of Justice has released the transcripts and audio recording of an interview conducted by Todd Blanche, the deputy attorney general, with the convicted sex trafficker Ghislaine Maxwell . The transcripts include redacted documentation from a two-day interview on 24 and 25 July and several audio recordings. Here’s what we know so far at a glance: Maxwell said that she “never” saw Donald Trump receive a massage. She also said that she “never witnessed the president in any inappropriate setting in any way,” adding that, whenever she saw the president, he was “a gentleman in all respects”. One notable point is that Maxwell denied ever recruiting masseuses from Trump’s Mar-a-Lago club. “I’ve never recruited a masseuse from Mar-a-Lago for that, as far as I remember. I can’t ever recollect doing that,” she told Blanche. A reminder that Trump claimed his falling-out with Epstein stemmed from Epstein’s efforts to hire workers away from Trump’s Florida club. Maxwell detailed the social relationship between Trump and Epstein, who cultivated a wide and powerful social circle for many years. “I don’t know how they met, and I don’t know how they became friends. I certainly saw them together and I remember the few times I observed them together, but they were friendly. I mean, they seemed friendly,” she said. Maxwell also did not recall former US president Bill Clinton receiving a massage while travelling with Epstein . Blanche said, on the record, that the conversation was not “promising to do anything” for Maxwell. He said that anything she said could not be used against her, unless she provided false statements or there was a retrial in her case. According to Maxwell, Epstein did not have any video or photographic evidence of any high-profile individuals committing sexual offences . And to that point, Maxwell also said she didn’t hear or witness any instances of Epstein blackmailing powerful people. Maxwell said she recruited a number of masseuses for Epstein but “never checked their age or credentials ”. She added that, throughout her time with Epstein, she never heard any examples of “sexually inappropriate contact” between Epstein’s guests and in-house masseuses. Despite her claims that Epstein did not extort anyone, Maxwell said she did not believe that Epstein died by suicide. She chalked that up to “mismanagement” at the Bureau of Prisons. In the interview, Maxwell said she did believe that Epstein “did a lot of, not all, but some of what he’s accused of ”. But she maintained that “he became that man over a period of time”. Maxwell did not remember whether Trump submitted a letter for Epstein’s 50th birthday album , as reported by the Wall Street Journal. She also could not remember asking Trump to contribute. Continue reading...", "ingested_utc": "2025-08-22T22:35:29Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:35:48Z", "source": "CryptoSlate", "title": "The Great Crypto Divide: Why Wall Street’s old guard still won’t touch crypto", "url": "https://cryptoslate.com/the-great-crypto-divide-why-wall-streets-old-guard-still-wont-touch-crypto/", "id_key": "ea0d1d9d5c04e7e428228b23117c5b949d21abd956511d6fc3ec86f8fee96c1b", "summary": "Bitcoin and crypto seem to be on the verge of mainstream adoption, with US spot exchange-traded funds (ETFs) shattering inflow records, Goldman Sachs holding more crypto ETF shares issued by BlackRock than any other institution, and corporate treasuries from Strategy to Bitmine embracing digital assets. However, a recent survey from Bank of America showed three-quarters […] The post The Great Crypto Divide: Why Wall Street’s old guard still won’t touch crypto appeared first on CryptoSlate .", "ingested_utc": "2025-08-22T22:35:48Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:35:48Z", "source": "CryptoBriefing", "title": "Six asset managers file amendments for spot XRP ETFs as Grayscale adds new S-1", "url": "https://cryptobriefing.com/xrp-etf-filings-grayscale-eth-ath/", "id_key": "12d40a5368c74d3b61561e31033276e2f07dc410e95224eb99ba4d2d91170e7e", "summary": "Six issuers filed S-1 amendments and Grayscale a new spot XRP ETF, as Powells cut signal lifted ETH to ATH and XRP 10%. The post Six asset managers file amendments for spot XRP ETFs as Grayscale adds new S-1 appeared first on Crypto Briefing .", "ingested_utc": "2025-08-22T22:35:48Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:38:25Z", "source": "TheVerge_All", "title": "Apple accuses former Apple Watch staffer of conspiring to steal trade secrets for Oppo", "url": "https://www.theverge.com/news/764775/apple-watch-trade-secrets-oppo-lawsuit", "id_key": "4f01d889669984708a46c8be3f1e8e67cf4f6796b53ee7288162026195c5b2ee", "summary": "Apple is suing a former employee on the Apple Watch team who left to join Oppo, alleging that he “conspired to steal Apple’s trade secrets relating to Apple Watch and to disclose them to his new employers.” Ahead of starting his new job at Oppo, the employee, Dr. Chen Shi, attended “dozens” of meetings with […]", "ingested_utc": "2025-08-22T22:38:25Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:38:27Z", "source": "ArsTechnica_All", "title": "Two men fell gravely ill last year; their infections link to deaths in the ’80s", "url": "https://arstechnica.com/health/2025/08/two-men-fell-gravely-ill-last-year-their-infections-link-to-deaths-in-the-80s/", "id_key": "8beac9ba2a4d06ddb55f046c3ea353a75831c7e4e94627e1aa59d7385bdcc3e5", "summary": "The bacterium is known to live in Mississippi, but the new cases may expand its range.", "ingested_utc": "2025-08-22T22:38:27Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:38:28Z", "source": "WIRED_All", "title": "Bluesky Goes Dark in Mississippi Over Age Verification Law", "url": "https://www.wired.com/story/bluesky-goes-dark-in-mississippi-age-verification/", "id_key": "1d6105e63c60ef94af1fecb312357ede28eb5a702258c451e3a5a4d46d36b5c6", "summary": "Bluesky has chosen to block access in the state rather than risk potential fines of up to $10,000 per violation.", "ingested_utc": "2025-08-22T22:38:28Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:38:29Z", "source": "Engadget_All", "title": "The US government is taking an $8.9 billion stake in Intel", "url": "https://www.engadget.com/big-tech/the-us-government-is-taking-an-89-billion-stake-in-intel-205047795.html?src=rss", "id_key": "b180c88f8327677a5a10eaae98618c1bb7c65c34642ed344d9782a30772a062a", "summary": "President Donald Trump says the US government is taking a 10 percent stake in chip maker Intel. Trump shared the news during a press conference on Friday , though an official announcement is still forthcoming, Reuters reports . News of a plan to convert Intel's previously promised CHIPS Act funding into equity in the company was first reported earlier in August. A meeting between Intel CEO Lip-Bu Tan and Trump following the President's call for Tan to resign seems to be the source of the deal. \"He walked in wanting to keep his job and he ended up giving us 10 billion dollars for the United States. So we picked up 10 billion,\" Trump shared during the press conference. Intel later announced more details on the investment. The company said in a press release that the government will \"make an $8.9 billion investment in Intel common stock.\" It adds that the equity stake will be funded by $5.7 billion previously earmarked for as part of the CHIPS act, and $3.2 billion awarded as part of the Secure Enclave program. Intel had previously recieved $2.2 billion in CHIPS grants, making the government's total spend on the chipmaker $11.1 billion. The government paid $20.47 per share, making the full investment equivalent to a 9.9 percent stake in the company. It's important to note that the government investing in Intel is not the same thing as receiving free money, it's the exact opposite. Despite earlier comments from US Commerce Secretary Howard Lutnick suggesting the stake would be non-voting, common stock does come with voting rights. Intel does note that the investment will be passive, with no board representation, and that the government has agreed to vote with its board of directors \"on matters requiring shareholder approval, with limited exceptions.\" Intel was supposed to receive up to $10.86 billion in federal funding to expand its chip manufacturing business in the US as part of the CHIPS Act. By agreeing to this deal, Tan is likely trying to make sure that funding still goes through, one of several drastic moves to keep Intel afloat. Tan assumed the title of CEO following Pat Gelsinger's sudden retirement in 2024 . Since taking over, he's already committed to cutting Intel's workforce by 20 percent. Even with lower costs and guaranteed investment, the company's future is still uncertain: Intel is reportedly struggling to make its next-gen Panther Lake chips at scale. The Trump administration says it won't seek similar equity deals with other recipients of CHIPS act funding. That hasn't stopped them from making other equally unprecedented financial arrangements. NVIDIA and AMD reportedly struck a deal with the US government that gives the companies the ability to export products to China in exchange for 15 percent of their profits. Update, August 22, 6:20PM ET: This story was updated after publish with more information on the deal from Intel, and the headline was changed to the dollar figure, rather than the previously stated \"10 percent\" amount. A section quoting US Commerce Secretary Howard Lutnick saying that the stake was non-voting was also ammended to reflect the final details of the deal. This article originally appeared on Engadget at https://www.engadget.com/big-tech/the-us-government-is-taking-an-89-billion-stake-in-intel-205047795.html?src=rss", "ingested_utc": "2025-08-22T22:38:29Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:38:29Z", "source": "Engadget_All", "title": "Abxylute will sell an absurd 3D handheld from Intel and Tencent Games for \"under $1,700\"", "url": "https://www.engadget.com/gaming/pc/abxylute-will-sell-an-absurd-3d-handheld-from-intel-and-tencent-games-for-under-1700-220556583.html?src=rss", "id_key": "06c751cc174676eecec2eb29252abad11d097c8ab8bed3c866984aac19557dcc", "summary": "As the handheld PC boom has taken off, companies have tried to push the boundaries of the Steam Deck form factor Valve helped popularize. Lenovo tried detachable controllers . Acer is trying an 11-inch screen . And Abxylute is apparently combining them both (and then some) into the Abxylute 3D One , which The Verge reports features an 11-inch, glasses-free 3D display and detachable controllers, all for \"under $1,700.\" The Abxylute 3D One is based on a hardware prototype co-developed by Intel and Tencent that the companies demoed at CES 2025. The prototype, dubbed the \"Sunday Dragon 3D One,\" featured a display that used eye-tracking to achieve its 3D effect. The version Abxylute is selling seems to be offering more or less the same features, with an Intel Lunar Lake chip, 32GB of LPDDR5X RAM, an 120Hz display and a built-in kickstand. The Abxylute 3D One's controllers can detach like Joy-Cons, which leaves it looking like a chunky Surface Pro. Abxylute \"Abxylute claims the product’s specifically optimized to deliver 3D for 50 of the top Steam games,\" The Verge writes , though it can also be used for more than gaming if you're desperate. The Abxylute 3D One will include software for converting 2D photos and video to 3D, and a detachable keyboard accessory complete with a trackpad. No part of what Abxylute is offering here seems particularly practical, but if you like 3D and are into the company's maximalist approach, you could be getting a deal. Acer's 11-inch handheld, the Acer Nitro Blaze 11, starts at $1,100. A 3D laptop like the ASUS ProArt Studiobook 16 starts at $2,000. The Abxylute 3D One could approximate the features of both for a fairly reasonable price in the middle. That might not make up for the fact that it seems too heavy to hold for more than 30 minutes at a time, but you can put that to the test yourself when the Abxylute 3D One goes on sale in \"late September or early October.\" This article originally appeared on Engadget at https://www.engadget.com/gaming/pc/abxylute-will-sell-an-absurd-3d-handheld-from-intel-and-tencent-games-for-under-1700-220556583.html?src=rss", "ingested_utc": "2025-08-22T22:38:29Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:38:45Z", "source": "FinancialPost_Business", "title": "North Carolina Supreme Court says bars’ COVID-19 lawsuits can continue", "url": "https://financialpost.com/pmn/north-carolina-supreme-court-says-bar-owners-covid-19-lawsuits-can-continue", "id_key": "5077276bf488533c706b72bf7e73b6eb8ee7bee2d572512f629c447a279701d8", "summary": "RALEIGH, N.C. (AP) — The North Carolina Supreme Court issued favorable rulings Friday for bars and their operators in litigation seeking monetary compensation from the state for COVID-19 restrictions first issued by then-Gov. Roy Cooper that shuttered their doors and, in their view, treated them unfairly compared to restaurants. The majority decisions by the justices […]", "ingested_utc": "2025-08-22T22:38:45Z"}
{"published_utc": "2025-08-22", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:39:01Z", "source": "HackerNews_Top", "title": "Top Secret: Automatically filter sensitive information", "url": "https://thoughtbot.com/blog/top-secret", "id_key": "3b7f232d0cf363dc3eec6db4650300af56dfbb4e6d043b760b8b112708a947d7", "summary": "Comments", "ingested_utc": "2025-08-22T22:39:01Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-22", "retrieved_utc": "2025-08-22T22:39:01Z", "source": "HackerNews_Top", "title": "Writing Micro Compiler in OCaml (2014)", "url": "http://troydm.github.io/blog/2014/03/29/writing-micro-compiler-in-ocaml/", "id_key": "c729f4759efe5c3e4df2a7626d219aaa3fee449700915a1b659fc0b5ad1f176e", "summary": "Comments", "ingested_utc": "2025-08-22T22:39:01Z"}
