{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:50:13Z", "source": "Guardian_World", "title": "Australia news live: Queensland police to ask court to halt pro-Palestine protest; ACCC sues Google over search engine deals", "url": "https://www.theguardian.com/australia-news/live/2025/aug/18/politics-ebikes-qantas-lambie-gaza-palestine-danielle-wood-productivity-tax-reform-roundtable-anthony-albanese-jim-chalmers-ntwnfb", "id_key": "64db61bf704cc7e5b0e9558b7a8006bd5814dd81c0c07baba051189691bdc649", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Shadow education minister says childcare safety reforms should come more quickly Jonno Duniam , the shadow minister for education, said governments on both sides of the spectrum had failed for years to institute reforms on the childcare sector, issuing calls for the Labor government and states to act quickly to make such changes. Both governments of all persuasions have dropped the ball. The government I was a part of dropped the ball. We should have acted on that at the time. The fact that we didn’t and the fact that we are now hearing these stories means we failed. But regardless of who was in power and who didn’t do what, here we are today and we need to act. With the resources of eight states and territories and the commonwealth combined, I would be absolutely stunned if we could not get this thing off the ground in the next few weeks. So I hope that things do speed up. I hope that the end result is a national system. Continue reading...", "ingested_utc": "2025-08-18T05:50:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:50:13Z", "source": "Guardian_World", "title": "Ukraine war live: ‘Russia must end this war,’ Zelenskyy says as he arrives in Washington for Trump talks", "url": "https://www.theguardian.com/world/live/2025/aug/18/ukraine-war-live-update-russia-zelenskyy-washington-trump-europe-meeting-talks-latest-news", "id_key": "55ca6c204b624293778fe3a3d718ae448a4e29294e18f556609249bfa93a2f09", "summary": "Ukrainian president hopes ‘joint strength with America, with our European friends, will force Russia into a real peace’ as he joins leaders from Europe in Washington for crucial summit with Donald Trump Trump rules out Ukraine reclaiming Crimea or joining Nato as European leaders gather in Washington Here are some scenes in Washington DC amid the security operation ahead Volodymyr Zelenskyy and European leaders’ visit for their crucial talks with Donald Trump. In saying that “peace must be lasting”, Volodymyr Zelenskyy also said on X that must be “not like it was years ago , when Ukraine was forced to give up Crimea and part of our East –part of Donbas – and Putin simply used it as a springboard for a new attack”. Now, our soldiers have successes in Donetsk and Sumy regions. I am confident that we will defend Ukraine, effectively guarantee security, and that our people will always be grateful to President Trump, everyone in America, and every partner and ally for their support and invaluable assistance. Continue reading...", "ingested_utc": "2025-08-18T05:50:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:50:13Z", "source": "Guardian_World", "title": "‘Shut it down and start again’: staff disquiet as Alan Turing Institute faces identity crisis", "url": "https://www.theguardian.com/technology/2025/aug/18/shut-it-down-and-start-again-staff-disquiet-as-alan-turing-institute-faces-identity-crisis", "id_key": "950458f5412e54323f1d1b15433156c01bf9e7324573a731a2c176843fbffc0d", "summary": "Whistleblower warns UK’s top AI research body in danger of collapse due to threats over funding and new direction When the UK government announced the creation of the Alan Turing Institute in 2014 it promised a “fitting memorial” to the renowned computer scientist and artificial intelligence pioneer. More than a decade on, Britain’s leading AI institute is in turmoil as staff warn it may be in danger of collapse and ministers demand a shift in focus to defence and security work. Continue reading...", "ingested_utc": "2025-08-18T05:50:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:50:13Z", "source": "Guardian_World", "title": "Watchdog condemned for clearing Grant Shapps to join defence startup", "url": "https://www.theguardian.com/politics/2025/aug/18/watchdog-condemned-for-clearing-grant-shapps-to-join-defence-startup", "id_key": "2c1047b847f58740cb2ceef91457bd4308113948592cc515bdf8c44d0a90f27f", "summary": "Former defence secretary allowed to take role as chair of Cambridge Aerospace, as long as he avoids defence matters The parliamentary standards body has been criticised for clearing Grant Shapps, a former Conservative defence secretary, to join a defence startup as long as he promises not to work on defence matters. In a ruling that drew scorn from political ethics experts, the Advisory Committee on Business Appointments (Acoba), which monitors and advises on the revolving door between Westminster and the business sector, gave Shapps the green light to become the chair of Cambridge Aerospace. Continue reading...", "ingested_utc": "2025-08-18T05:50:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:50:13Z", "source": "Guardian_World", "title": "Anti-gang scheme in Liverpool ‘boosts public confidence in police’", "url": "https://www.theguardian.com/uk-news/2025/aug/18/anti-gang-scheme-in-liverpool-boosts-public-confidence-in-police", "id_key": "7605fc97e4bcb412c1621d7e49679a91299f0fc98915a2690dc404a4ac7c1e6a", "summary": "Scheme has led to 5,300 arrests and seizure of 630kg of Class A and B drugs, according to Merseyside police A scheme aimed at tackling gang activity in Liverpool has brought about an increase in public confidence in the police three years since three fatal shootings in the space of a week, police have said. Merseyside police said the scheme, based on the principles of clearing an area of gang activity, holding it so that organised crime cannot return to it, and building a cohesive community, has led to an 300% increase in community intelligence, as well as more than 5,300 arrests and the seizure of about 630kg of Class A and B drugs. Continue reading...", "ingested_utc": "2025-08-18T05:50:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:50:13Z", "source": "Guardian_World", "title": "Parents of Merseyside gang violence victims speak out three years on", "url": "https://www.theguardian.com/uk-news/2025/aug/18/parents-of-liverpool-gang-violence-victims-olivia-pratt-korbel-speak-out-three-years-on", "id_key": "d53a12ef31bc48ca742bc9557942f1bd2f59bfa339749fc3b1504c019203086c", "summary": "Mother of Olivia Pratt-Korbel, who was killed aged nine in 2022, joins others to call for courage in tackling gun crime The mother of a girl who was killed as a result of gang violence in Liverpool has joined the families of other victims of gun crime to speak out against it. Olivia Pratt-Korbel was nine when she was killed in her home in Dovecoat on 22 August 2022. She was shot by Thomas Cashman , a drug dealer, as he chased a competitor. Continue reading...", "ingested_utc": "2025-08-18T05:50:13Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:52:24Z", "source": "NYTimes_World", "title": "A Centrist Surges in Bolivia as Voters Turn Away From Socialism", "url": "https://www.nytimes.com/2025/08/17/world/americas/bolivia-presidential-election-explained.html", "id_key": "b06184dcdb016b1969d30a0eba3c8b37fa50dd467e57e35f91223a5ee4129e78", "summary": "Rodrigo Paz, who had trailed in the polls, won the first round of the presidential election on Sunday, as decades of dominance by a leftist party neared an end.", "ingested_utc": "2025-08-18T05:52:24Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:52:32Z", "source": "NPR_Top", "title": "Bolivia's presidential vote goes to runoff between centrist and right-wing candidates", "url": "https://www.npr.org/2025/08/18/nx-s1-5505907/bolivia-presidential-election-runoff", "id_key": "56ee783c50165bb09ddc92049ad51187bb1572553141e425f449492dad210594", "summary": "A dark horse centrist, Sen. Rodrigo Paz, drew more votes than the right-wing front-runners, although not enough to secure an outright victory, early results showed.", "ingested_utc": "2025-08-18T05:52:32Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:53:03Z", "source": "TheStreet_Top", "title": "Dave Ramsey sends strong message on Social Security, 401(k)s", "url": "https://www.thestreet.com/retirement/dave-ramsey-bluntly-speaks-on-social-security-401k", "id_key": "d5d031796e94ac8807aa6caad211720c39613a015a2373e9f082de186b704223", "summary": "The bestselling personal finance author makes a key statement for Americans on retirement savings.", "ingested_utc": "2025-08-18T05:53:03Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:53:11Z", "source": "FinancialPost_Business", "title": "India’s Russian Oil Purchases Are ‘Opportunistic,’ Navarro Says", "url": "https://financialpost.com/pmn/business-pmn/indias-russian-oil-purchases-are-opportunistic-navarro-says", "id_key": "9899e588eb9b79f8488c2d1a2d1424c18ec391374116bdfdd5f6ab9f28643c88", "summary": "The dramatic increase in India’s buying of Russian oil since the invasion of Ukraine is “opportunistic and deeply corrosive” of a global effort to isolate the Kremlin and curb Vladimir Putin’s war machine, White House trade adviser Peter Navarro wrote in the Financial Times.", "ingested_utc": "2025-08-18T05:53:11Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:53:26Z", "source": "HackerNews_Top", "title": "A gigantic jet caught on camera: A spritacular moment for NASA astronaut", "url": "https://science.nasa.gov/science-research/heliophysics/a-gigantic-jet-caught-on-camera-a-spritacular-moment-for-nasa-astronaut-nicole-ayers/", "id_key": "5059c31f05f3bf103081b8eb3b8c3332a0b686fd7aaf423852c24edb1aa83397", "summary": "Comments", "ingested_utc": "2025-08-18T05:53:26Z"}
{"published_utc": "2025-08-14", "retrieved_date": "2025-08-18", "retrieved_utc": "2025-08-18T05:53:26Z", "source": "HackerNews_Top", "title": "How Keeta processes 11M financial transactions per second with Spanner", "url": "https://cloud.google.com/blog/topics/financial-services/how-blockchain-network-keeta-processes-11-million-transactions-per-second-with-spanner", "id_key": "33c1cb3dfa26ad5f75fb2c933692fb1f0622ae7cf556911249d03f4cf2ce4ba7", "summary": "Comments", "ingested_utc": "2025-08-18T05:53:26Z"}
