{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T21:47:19Z", "source": "Guardian_World", "title": "Nine students trapped in Gaza will get help to take up places at UK universities", "url": "https://www.theguardian.com/education/2025/aug/20/nine-students-trapped-in-gaza-will-get-help-to-take-up-places-at-uk-universities", "id_key": "bca4893c1662b92168ba44ebd09259c5970282b7abda4028b5c663e9806a6cee", "summary": "UK government is facilitating evacuation of scholarship recipients after campaign by MPs and university leaders Nine students in Gaza with full scholarships to study at British universities have been told the UK government is working to facilitate their evacuation. The students – who have all been awarded Chevening scholarships, funded by the Foreign Office in recognition of their potential as future leaders – welcomed the development on Wednesday, but dozens more Palestinians in Gaza with university places are still awaiting news. Continue reading...", "ingested_utc": "2025-08-20T21:47:19Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T21:49:43Z", "source": "NPR_Top", "title": "Massacres in eastern Congo cast doubt on U.S. mediated peace deal", "url": "https://www.npr.org/2025/08/20/nx-s1-5508633/drc-rwanda-hrw-trump", "id_key": "4826f2f9edcc7298e234cc09b3f1d19b20276284bd88272bc36dae3e7b538d1b", "summary": "Rwanda backed M23 rebels in eastern Democratic Republic of Congo killed hundreds of villagers in July, according to Human Rights Watch, raising doubts about Trump backed peace process.", "ingested_utc": "2025-08-20T21:49:43Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T21:49:45Z", "source": "NPR_World", "title": "Massacres in eastern Congo cast doubt on peace talks", "url": "https://www.npr.org/2025/08/20/nx-s1-5508633/drc-rwanda-hrw-trump", "id_key": "f19d23b3f28c5b707749734dbf3917ba8d26501091e3190bff68ced06ffad7bc", "summary": "Rwanda backed M23 rebels in eastern Democratic Republic of Congo killed hundreds of villagers in July, according to Human Rights Watch, raising doubts about Trump backed peace process.", "ingested_utc": "2025-08-20T21:49:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T21:50:03Z", "source": "TheVerge_All", "title": "The Made by Google event felt like being sucked into an episode of Wandavision", "url": "https://www.theverge.com/analysis/762891/made-by-google-pixel-10-jimmy-fallon", "id_key": "eda896c7c24f7f573834fabc786dcd373460e889a0f5ca545c10a6e858def1ba", "summary": "For the past twenty years or so, I've had a clear image of what a product launch keynote is supposed to be like. A charismatic executive walks across the stage, points to some animations and pre-taped clips, a live demo or two happens, and the crowd goes wild. Clips proliferate on social media and cue […]", "ingested_utc": "2025-08-20T21:50:03Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T21:50:06Z", "source": "Engadget_All", "title": "Climbing game Cairn will have a 'free solo' mode with no rope", "url": "https://www.engadget.com/gaming/climbing-game-cairn-will-have-a-free-solo-mode-with-no-rope-213450638.html?src=rss", "id_key": "1885cccc744fa875bc19cb724d3484cab70b1deb52ff6e7c29d97a44ddc54edb", "summary": "If you tried the demo for upcoming climbing game Cairn and somehow found it too easy, you're in for a treat. Developer The Game Bakers announced at the latest Future Games Show that Cairn will include a \"Free Solo\" mode that lets you tackle the game's already difficult climbs without pitons or a rope. A typical climb in Cairn — and most rock climbing games for that matter — tasks you with managing rope, and the pitons you use to anchor it to a rock face. You add pitons as you climb so that in the event you slip, you only fall to your last piton rather than all the way to the ground. In Free Solo mode, you don't have that safety net, turning each climb into more of a roguelike run. In the real life rock climbing world, \"Free Solo\" climbing is when you tackle a climb without a partner or traditional equipment. The term rose to mainstream relevance after the release of the documentary Free Solo , which followed climber Alex Honnold as he trained for and ultimately ascended El Capitan in Yosemite National Park. Adding a dangerous style of climbing to what's already a difficult game feels appropriate in this case. On top of a climbing mechanic that makes you move each limb individually, Cairn also requires you to manage your hunger, thirst and an inventory of supplies. At least based on its demo, the game is far more demanding then something like Jusant , which was much more concerned with making its traversal fun and expressive rather than realistically difficult. If you're itching for punishment, the Cairn demo is available to download now on PS5 and PC. The game will be released on both platforms on November 5, 2025. This article originally appeared on Engadget at https://www.engadget.com/gaming/climbing-game-cairn-will-have-a-free-solo-mode-with-no-rope-213450638.html?src=rss", "ingested_utc": "2025-08-20T21:50:06Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T21:50:22Z", "source": "FinancialPost_Business", "title": "BWR Exploration Inc. Enters into an Amalgamation Agreement with Electro Metals and Mining Inc.", "url": "https://financialpost.com/globe-newswire/bwr-exploration-inc-enters-into-an-amalgamation-agreement-with-electro-metals-and-mining-inc", "id_key": "5440d37843bf8f68d2f5aa85aea1ba4d614e6b74f882756e4a051d58956d934f", "summary": "TORONTO, Aug. 20, 2025 (GLOBE NEWSWIRE) — BWR Exploration Inc. (TSXV: BWR) a Toronto, Ontario based corporation with its registered address at 82 Richmond Street East, Toronto, Ontario (“BWR”), is pleased to announce that, further to its news release dated December 24, 2024, it has entered into an amalgamation agreement dated August 19, 2025 (the […]", "ingested_utc": "2025-08-20T21:50:22Z"}
