{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T20:38:23Z", "source": "Guardian_World", "title": "Supermarkets suspend supplies from Lincolnshire pig farm after covert filming of animal abuse", "url": "https://www.theguardian.com/world/2025/aug/17/supermarkets-suspend-supplies-from-lincolnshire-pig-farm-after-covert-filming-of-animal-abuse", "id_key": "2882c9290fbc0effd9dcd52945f8ef41c603c11c85a1cd97136ed923ed2639b2", "summary": "Tesco, Asda and Sainsbury’s said they had ‘immediately’ suspended supplies from Somerby Top Farm after piglets kicked by workers Three of the UK’s biggest supermarkets have suspended supplies from a Lincolnshire pig farm after footage filmed covertly by an animal rights organisation appeared to show workers kicking piglets and hitting them with boards and paddles. The footage also suggested the injured pigs with open wounds were packed into pens covered in faeces, with some left lame and writhing in pain. Continue reading...", "ingested_utc": "2025-08-17T20:38:23Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T20:41:12Z", "source": "TechCrunch_All", "title": "‘Stranger Things’ creators may be leaving Netflix", "url": "https://techcrunch.com/2025/08/17/stranger-things-creators-may-be-leaving-netflix/", "id_key": "842b5682aaf64c60aefecc2b467701c70740292436b29a30604667d1a5da48d8", "summary": "Netflix could soon lose the creative team behind one of its biggest hits, with the Duffer Brothers reportedly signing an exclusive deal with Paramount.", "ingested_utc": "2025-08-17T20:41:12Z"}
{"published_utc": "2025-08-17", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T20:41:15Z", "source": "Engadget_All", "title": "Anthropic's Claude AI now has the ability to end 'distressing' conversations", "url": "https://www.engadget.com/ai/anthropics-claude-ai-now-has-the-ability-to-end-distressing-conversations-201427401.html?src=rss", "id_key": "6ea48b832988a62db1aa68da11f0f528dfab9edbd2d467260c2115a8c05c0e43", "summary": "Anthropic's latest feature for two of its Claude AI models could be the beginning of the end for the AI jailbreaking community. The company announced in a post on its website that the Claude Opus 4 and 4.1 models now have the power to end a conversation with users. According to Anthropic, this feature will only be used in \"rare, extreme cases of persistently harmful or abusive user interactions.\" To clarify, Anthropic said those two Claude models could exit harmful conversations, like \"requests from users for sexual content involving minors and attempts to solicit information that would enable large-scale violence or acts of terror.\" With Claude Opus 4 and 4.1, these models will only end a conversation \"as a last resort when multiple attempts at redirection have failed and hope of a productive interaction has been exhausted,\" according to Anthropic. However, Anthropic claims most users won't experience Claude cutting a conversation short, even when talking about highly controversial topics, since this feature will be reserved for \"extreme edge cases.\" Anthropic In the scenarios where Claude ends a chat, users can no longer send any new messages in that conversation, but can start a new one immediately. Anthropic added that if a conversation is ended, it won't affect other chats and users can even go back and edit or retry previous messages to steer towards a different conversational route. For Anthropic, this move is part of its research program that studies the idea of AI welfare. While the idea of anthropomorphizing AI models remains an ongoing debate, the company said the ability to exit a \"potentially distressing interaction\" was a low-cost way to manage risks for AI welfare. Anthropic is still experimenting with this feature and encourages its users to provide feedback when they encounter such a scenario. This article originally appeared on Engadget at https://www.engadget.com/ai/anthropics-claude-ai-now-has-the-ability-to-end-distressing-conversations-201427401.html?src=rss", "ingested_utc": "2025-08-17T20:41:15Z"}
{"published_utc": "2025-08-15", "retrieved_date": "2025-08-17", "retrieved_utc": "2025-08-17T20:41:47Z", "source": "HackerNews_Top", "title": "The Oldest Mask in the World (Pre-Pottery Neolithic B)", "url": "https://www.imj.org.il/en/collections/334459-0", "id_key": "5274ef00d3f164c289c196adc30c480991f2ac555d665ed358a50e78ee12f0e9", "summary": "Comments", "ingested_utc": "2025-08-17T20:41:47Z"}
