{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:32:30Z", "source": "Guardian_World", "title": "Poland’s president vetoes legislation to prolong benefits for Ukrainian refugees", "url": "https://www.theguardian.com/world/2025/aug/25/polands-president-vetoes-legislation-to-prolong-benefits-for-ukrainian-refugees", "id_key": "0f18be2b8b8fc0b6883f7349e6311285a4cee0397ad3049cf1f264012e5e9ba8", "summary": "Karol Nawrocki says only Ukrainians in work should receive child benefit payments in Poland Poland’s president has vetoed legislation to prolong benefits received by Ukrainian refugees in Poland, following up on a campaign promise to tighten welfare payments amid a steady growth in anti-Ukrainian sentiment among Poles. Karol Nawrocki, who took office earlier this month after winning an election in spring, said only Ukrainians in work should receive child benefit payments. Continue reading...", "ingested_utc": "2025-08-25T17:32:30Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:32:30Z", "source": "Guardian_World", "title": "Three people killed and one critically injured in Isle of Wight helicopter crash", "url": "https://www.theguardian.com/uk-news/2025/aug/25/people-killed-isle-of-wight-helicopter-crash", "id_key": "4d5b289ca9bef5a41b532a35e13219542ee3e9664e66b0ff35b8e9b752bb7b77", "summary": "One person in hospital in serious condition after crash during flying lesson Three people have been killed after a helicopter crashed on the Isle of Wight during a flying lesson. The helicopter carrying four people crashed into a field near Shanklin at about 9.20am on Monday. One person onboard was airlifted to hospital and remains in a serious condition. Continue reading...", "ingested_utc": "2025-08-25T17:32:30Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:32:30Z", "source": "Guardian_World", "title": "France has ‘no lessons to take’ from US on tackling antisemitism, says minister", "url": "https://www.theguardian.com/world/2025/aug/25/france-has-no-lessons-to-take-from-us-on-tackling-antisemitism-say-ministers", "id_key": "8d88c710dc2253ab490ae0f2ea99b64a7ac46797dcd4e344f1d12d8480281dcd", "summary": "Comments come after US ambassador accused government of failing to do enough to stem hate crimes against Jews Cabinet ministers and Jewish groups have said France has “no lessons to take” from the US on tackling antisemitism, as Washington’s ambassador to Paris was summoned after accusing the government of failing to do enough to stem hate crimes against Jews. Charles Kushner, who is Jewish, was ordered to report to the foreign ministry on Monday after he wrote a letter to Emmanuel Macron criticising a “lack of sufficient action” by the government to confront the “dramatic rise” in antisemitism in France. Continue reading...", "ingested_utc": "2025-08-25T17:32:30Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:32:55Z", "source": "CryptoNews", "title": "Next SPX6900 Meme Coin TOKEN6900 ICO Must End in Less Than 72 Hours", "url": "https://cryptonews.com/news/next-spx6900-meme-coin-token6900-ico-must-end-in-less-days/", "id_key": "160d458a3df97e09dfce3079d2361fd16b2ee991928ced35421abba47816f9a5", "summary": "The next billion-dollar SPX6900 ‘index’ coin – TOKEN6900 (T6900) – must end its ICO in just three days, so there’s no time to lose to get in on the price action.Available to purchase for just $0.0071, the token prides itself on being the ultimate ‘vibe liquidity’ asset to save your wealth from the avarice and […] The post Next SPX6900 Meme Coin TOKEN6900 ICO Must End in Less Than 72 Hours appeared first on Cryptonews .", "ingested_utc": "2025-08-25T17:32:55Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:32:55Z", "source": "CryptoNews", "title": "Gemini Unveils XRP Credit Card With Crypto Rewards – Up to 4% Back, $200 Bonus", "url": "https://cryptonews.com/news/gemini-launches-visa-like-xrp-credit-card-with-crypto-rewards/", "id_key": "3efb9c9c858ffcc1396129a0f7eb5f96c248d4ded523ace7c7ccc33a43f85e1a", "summary": "Gemini has introduced a credit card with Ripple that gives up to 4% back in XRP on purchases, a $200 signup bonus, and RLUSD stablecoin access. The launch shows Gemini expanding rewards as XRP adoption in payments continues to grow. The post Gemini Unveils XRP Credit Card With Crypto Rewards – Up to 4% Back, $200 Bonus appeared first on Cryptonews .", "ingested_utc": "2025-08-25T17:32:55Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:32:56Z", "source": "CoinJournal", "title": "Gemini taps Ripple to launch limited edition credit card with 4% XRP cashback", "url": "https://coinjournal.net/news/gemini-taps-ripple-to-launch-limited-edition-credit-card-with-4-xrp-cashback/", "id_key": "5d4f46fa79c75d443a6e77551b3f4e27d50e7e654f7d4f8086ad0407b57246a7", "summary": "The exchange has partnered with Ripple to launch a limited edition credit card. Users will enjoy up to 4% XRP cashback on their day-to-day purchases. Ripple’s RLUSD stablecoin to simplify crypto access. As cryptocurrencies integrate with our daily financial undertakings, trading platform Gemini has collaborated with Ripple to release an XRP-powered credit card. The limited-edition […] The post Gemini taps Ripple to launch limited edition credit card with 4% XRP cashback appeared first on CoinJournal .", "ingested_utc": "2025-08-25T17:32:56Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:34:29Z", "source": "Guardian_World", "title": "Woody Allen rebuts Ukrainian condemnation over Moscow film festival appearance", "url": "https://www.theguardian.com/film/2025/aug/25/woody-allen-rebuts-ukrainian-condemnation-over-moscow-film-festival-appearance", "id_key": "b3b7c6dc0847800be64c9a211e0aa5433c949a525ab7ee78c664b83dc761c664", "summary": "The director said he did not ‘feel cutting off artistic conversations is ever a good way to help’ after Ukraine calls the film-maker’s participation a ‘disgrace’ Woody Allen has denied claims that his participation in a Moscow film festival was “whitewashing” Russian atrocities, after condemnation of his appearance by Ukraine’s ministry of foreign affairs. Allen said in a statement to the Guardian: “When it comes to the conflict in Ukraine, I believe strongly that Vladimir Putin is totally in the wrong. The war he has caused is appalling. But, whatever politicians have done, I don’t feel cutting off artistic conversations is ever a good way to help.” Continue reading...", "ingested_utc": "2025-08-25T17:34:29Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:34:29Z", "source": "Guardian_World", "title": "Screenwriter Paul Laverty arrested at Palestine protest in Edinburgh", "url": "https://www.theguardian.com/uk-news/2025/aug/25/screenwriter-paul-laverty-arrested-palestine-action-edinburgh", "id_key": "72ca3b6b234f7441abf693527dfa0156e2d285d74f1b4ee77ca468e6313e3aff", "summary": "Ken Loach collaborator was allegedly wearing a T-shirt that referenced banned group Palestine Action The award-winning Scottish screenwriter Paul Laverty has been arrested in Edinburgh for wearing a T-shirt that allegedly referenced the proscribed protest group Palestine Action. Laverty was himself attending a protest outside St Leonard’s police station in the city centre to support Moira McFarlane, a member of Scottish Palestine Solidarity Campaign, who was due to be charged under section 13 of the Terrorist Act for wearing a T-shirt with the words “Genocide in Palestine, time to take action”. The words “Palestine” and “action” were in capital letters. Continue reading...", "ingested_utc": "2025-08-25T17:34:29Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:34:48Z", "source": "NYTimes_Business", "title": "Maurice Tempelsman, Diamond Magnate and Jackie Onassis’s Companion, Dies at 95", "url": "https://www.nytimes.com/2025/08/25/business/maurice-tempelsman-dead.html", "id_key": "c5b4058e4a8bde7966de5c29095811bb350eba71c124add55eae3696a5ab5418", "summary": "A private and politically connected gem merchant, he was thrust into the public spotlight when his personal relationship with the former first lady became known in the late 1980s.", "ingested_utc": "2025-08-25T17:34:48Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:18Z", "source": "TechCrunch_All", "title": "A new security flaw in TheTruthSpy phone spyware is putting victims at risk", "url": "https://techcrunch.com/2025/08/25/a-new-security-flaw-in-thetruthspy-phone-spyware-is-putting-victims-at-risk/", "id_key": "b036e466e6a3816b9335a0902c8a625b6a41875ea71e1c95e46ef3bf9624fbaa", "summary": "Exclusive: Hackers can take over the accounts of TheTruthSpy spyware customers, putting their victims' private phone data at risk thanks to a new security flaw.", "ingested_utc": "2025-08-25T17:35:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:18Z", "source": "TechCrunch_All", "title": "Tech founder throws hat in California governor’s race", "url": "https://techcrunch.com/2025/08/25/tech-founder-throws-hat-in-california-governors-race/", "id_key": "7a9e555d1ddb8942036e0dccf229197f9dc61bdc339f651694098b59a2f56004", "summary": "A Bay Area tech founder, Ethan Agarwal, says he's running for California governor.", "ingested_utc": "2025-08-25T17:35:18Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:19Z", "source": "WIRED_All", "title": "Elon Musk's xAI Sues Apple and OpenAI Over App Store Rankings", "url": "https://www.wired.com/story/elon-musks-xai-sues-apple-and-openai-over-alleged-app-store-rigging/", "id_key": "a3b30937943138e7d606bce1d08c246d4971876c8dce008b1ab6bb93a64a185f", "summary": "The xAI lawsuit claims that Grok's ranking below ChatGPT is a sign of allegedly monopolistic behavior.", "ingested_utc": "2025-08-25T17:35:19Z"}
{"published_utc": "2025-08-23", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:19Z", "source": "WIRED_All", "title": "Scientists Have Identified the Origin of an Extraordinarily Powerful Outer-Space Radio Wave", "url": "https://www.wired.com/story/scientists-identified-origin-extraordinarily-powerful-outer-space-radio-wave-frb-chime/", "id_key": "8a1dede73b80e4d4f631740c9c73f26b20ffb70bcba9b4324748929c858677b8", "summary": "In March 2025, Earth was hit by a fast radio burst as energetic as the sun but lasting only milliseconds.", "ingested_utc": "2025-08-25T17:35:19Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:21Z", "source": "Engadget_All", "title": "Elon Musk and xAI are suing Apple and OpenAI because Grok isn't topping the app charts", "url": "https://www.engadget.com/ai/elon-musk-and-xai-are-suing-apple-and-openai-because-grok-isnt-topping-the-app-charts-170020376.html?src=rss", "id_key": "02e548d5ef359b721d8609f157f23971276ee042633129bfc39ecfcde3c5ced6", "summary": "Elon Musk's artificial intelligence company xAI is suing Apple and OpenAI, as reported by Reuters . The suit accuses the companies of illegally conspiring to stop rival AI companies from getting a fair shot on the App Store, alleging they have \"locked up markets to maintain their monopolies and prevent innovators like X and xAI from competing.\" The complaint suggests that Apple and OpenAI have been conspiring to suppress xAI's products on the App Store. \"If not for its exclusive deal with OpenAI, Apple would have no reason to refrain from more prominently featuring the X app and the Grok app in its App Store,\" xAI told Reuters . Apple has integrated OpenAI's ChatGPT into several of its products, but it remains to be seen if that has translated to any anticompetitive practices. It's worth noting that rival AI apps like DeepSeek and Perplexity have both spent time on the top of App Store charts since this partnership began, according to CNBC . This is a remarkable claim given what I have heard alleged that Elon does to manipulate X to benefit himself and his own companies and harm his competitors and people he doesn't like. https://t.co/HlgzO4c2iC — Sam Altman (@sama) August 12, 2025 This lawsuit comes after Musk threatened legal action a couple of weeks back after making similar accusations regarding Apple and OpenAI. Apple has yet to respond to the complaint but OpenAI CEO Sam Altman responded to Musk's original allegation by calling it \"a remarkable claim given what I have heard alleged that Elon does to manipulate X to benefit himself and his own companies and harm his competitors and people he doesn’t like.\" Altman is likely referencing various studies that indicate Musk made huge changes to the X algorithm to favor his personal posts and posts by conservative commentators. He has also threatened to \"fix\" the Community Notes feature on X, which is a crowdsourced fact-checking tool. OpenAI spokesperson Kayla Wood told The Verge that today's lawsuit \"is consistent with Mr. Musk's ongoing pattern of harassment.\" xAI also brought this lawsuit to the Northern District of Texas Fort Worth Division, which is a notoriously conservative arm of the federal court . This is where Musk typically steers his various lawsuits, in a practice some refer to as \"judge shopping.\" This article originally appeared on Engadget at https://www.engadget.com/ai/elon-musk-and-xai-are-suing-apple-and-openai-because-grok-isnt-topping-the-app-charts-170020376.html?src=rss", "ingested_utc": "2025-08-25T17:35:21Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:30Z", "source": "AlJazeera_All", "title": "Syria condemns new Israeli ‘military incursion’ in Damascus countryside", "url": "https://www.aljazeera.com/news/2025/8/25/syria-condemns-new-israeli-military-incursion-in-damascus-countryside?traffic_source=rss", "id_key": "924c7eaa4ef73a961a8ee23da38ff9ab700c57e2e0fba60c25e10547c356477a", "summary": "Syria's foreign minister accuses Israel of violating a 1974 agreement to advance its 'expansionist and partition plans'.", "ingested_utc": "2025-08-25T17:35:30Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:37Z", "source": "FinancialPost_Business", "title": "Diane Francis: Sidelined on the international stage", "url": "https://financialpost.com/diane-francis/sidelined-international-stage", "id_key": "3cc84f2627edabccf73d806f6e296986ae97bef811e7075d20f12fef62d2104f", "summary": "The Liberals have held Canada back economically for a decade, but also orphaned the country geopolitically", "ingested_utc": "2025-08-25T17:35:37Z"}
{"published_utc": "2025-08-25", "retrieved_date": "2025-08-25", "retrieved_utc": "2025-08-25T17:35:44Z", "source": "Nikkei_Asia_Top", "title": "China's imports of US energy drop to near zero amid tariff tensions", "url": "https://asia.nikkei.com/politics/international-relations/us-china-tensions/china-s-imports-of-us-energy-drop-to-near-zero-amid-tariff-tensions", "id_key": "1c93ae3fa5b9e1d8bb0d5102a71c338b07451c76c6550cff597a94fd3b0038ea", "summary": "", "ingested_utc": "2025-08-25T17:35:44Z"}
