{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:22Z", "source": "BBC_World", "title": "Tulsi Gabbard revokes security clearances of 37 US intelligence officials", "url": "https://www.bbc.com/news/articles/c78mj2m85pno?at_medium=RSS&at_campaign=rss", "id_key": "a2ad73c50d094d7b340187520d257700c4c2fabf815c8c935a4c421fddb28a7e", "summary": "The director of national Intelligence accuses the officials, who served under Biden and Obama, of politicising intelligence for partisan or personal gain.", "ingested_utc": "2025-08-20T16:46:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:22Z", "source": "BBC_World", "title": "Watch: Fire rages at Milan airport check-in desk", "url": "https://www.bbc.com/news/videos/cj4wz44kqzxo?at_medium=RSS&at_campaign=rss", "id_key": "a4a029730e7a0aef6eb80ef3dd185f5abf1726eddc97fe4e85cd007a3904b5e7", "summary": "Footage shared on social media shows a man knocked to ground after smashing an advertisement screen.", "ingested_utc": "2025-08-20T16:46:22Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:24Z", "source": "Guardian_Business", "title": "Hate your job? How to have more fun at work - from ‘thin-slicing’ your joy to expressing your personality", "url": "https://www.theguardian.com/money/2025/aug/20/hate-your-job-how-to-have-more-fun-at-work-from-thin-slicing-your-joy-to-expressing-your-personality", "id_key": "b357f0ad56256e8625f13e271d4bdec174680a3b91172fd78304635e75cbafcf", "summary": "Forget productivity! Author and consultant Bree Groff believes the true sign of a successful workplace is how much fun the employees are having. Is this the answer to post-Covid burnout and disengagement? Who would say work was fun? Your job might be rewarding (some of the time). You may get on with your colleagues (some of them). But fun ? It seems simultaneously too grand an ambition and too small. After the work-centric “hustle culture” of the 2010s, then the backlash and widespread burnout brought on by the Covid-19 pandemic, the general feeling around work right now could be described as ambivalent at best. At worst, it’s openly combative, as evinced by frequent references to the “battle” over working from home. Managers want employees back in the office; employees want flexibility, and to limit work’s impact on their lives. Continue reading...", "ingested_utc": "2025-08-20T16:46:24Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:25Z", "source": "Guardian_World", "title": "South African minister under investigation for historical racial slur on social media", "url": "https://www.theguardian.com/world/2025/aug/20/south-african-minister-under-investigation-for-historic-racial-slurs-on-social-media", "id_key": "5c72541f24aafd14129b15bf6e7578658bd5c59c293e87e55d127843add716a1", "summary": "Gayton McKenzie given deadline to apologise, undergo sensitivity training and delete posts on X from 2011 to 2017 South Africa’s sport, arts and culture minister, Gayton McKenzie, is under investigation by the country’s human rights commission for historical social media posts containing a highly offensive racial slur, reigniting a debate about racism, identity and the lingering effects of colonialism and apartheid. McKenzie, an anti-immigrant populist from the Coloured community with a history of stirring up controversies, was given a Wednesday evening deadline by the South African Human Rights Commission (SAHRC) to issue an approved apology, undergo sensitivity training, donate to an agreed charity and delete the X posts , which were still online at the time of publication. Continue reading...", "ingested_utc": "2025-08-20T16:46:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:25Z", "source": "Guardian_World", "title": "Polish army believes drone that exploded in eastern Poland was launched from Russia – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news", "id_key": "e4888fdef48873a3a5f9d4c7a586ffaf3af19b4b5ddaad88a88855961b16f555", "summary": "This live blog is now closed An object which fell and exploded in a cornfield in eastern Poland may have been a component of an old propeller engine, the Polish army said on Wednesday, adding that there had been no violation of Poland’s airspace from Ukraine or Belarus. Police had earlier announced that an unidentified object had fallen in a field in the village of Osiny in eastern Poland’s Lublin province, which borders Ukraine. “...after conducting preliminary analyses of radar system records, no violation of Polish airspace was recorded last night from either Ukraine or Belarus,” the Operational Command of the Polish Armed Forces said on X. Continue reading...", "ingested_utc": "2025-08-20T16:46:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:25Z", "source": "Guardian_World", "title": "Israel to call up around 60,000 reservists before planned offensive on Gaza City, says Israeli military official – as it happened", "url": "https://www.theguardian.com/world/live/2025/aug/20/israeli-army-reservists-gaza-city-offensive-ceasefire-proposal-middle-east-crisis-latest-updates-news", "id_key": "2aef5fcef69d4d71a718de9cf393a100bd3ea81a93902178f97085a97fdbdd33", "summary": "This blog is now closed, you can read more on this story here Israel is “killing all prospects” for peace in the Middle East, Jordan’s foreign minister has said amid escalating international outrage over Israel’s plans for a new large-scale offensive in Gaza City and plans to massively expand Jewish settlements in the West Bank . Ayman Safadi made his remarks during a visit to Moscow on the same day that the Israeli defence minister, Israel Katz, approved a plan to conquer Gaza City, an urban area home to hundreds of thousands of people in the north of the Palestinian territory. Continue reading...", "ingested_utc": "2025-08-20T16:46:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:25Z", "source": "Guardian_World", "title": "Former C of E vicar found guilty of indecent assault against nine women", "url": "https://www.theguardian.com/uk-news/2025/aug/20/chris-brain-former-vicar-guilty-indecent-assault", "id_key": "6a9cc7623117882b3c4796ddd2b7add0c90b49778ee039fb8bc75d51ea3bf658", "summary": "Jury continues to deliberate further charges against Chris Brain, who led Nine O’Clock Service movement in Sheffield between 1986 and 1995 A former vicar who led an evangelical movement between 1986 and 1995 has been found guilty of 17 counts of indecent assault against nine women. Chris Brain, 68, appeared at Inner London crown court accused of sexual offences against 13 women who were members of the Nine O’Clock Service (NOS), an influential Sheffield-based Christian worship group that was likened to a cult. Continue reading...", "ingested_utc": "2025-08-20T16:46:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:25Z", "source": "Guardian_World", "title": "Reeves leaves no stone unturned as she mulls reforms for property tax", "url": "https://www.theguardian.com/politics/2025/aug/20/reeves-leaves-no-stone-unturned-as-she-mulls-reforms-for-property-tax", "id_key": "42415f481ca859a394898e4493e8749c0bafafc0c091b60cb7be6e83bb3ace73", "summary": "Chancellor and prime minister are latest in a long line of politicians who have tried to squeeze more out of UK property Rachel Reeves is in favour of radical tax reform – or at least she was in 2018. “We need a radical overhaul of the tax system because our current system of wealth taxation isn’t working,” she argued in her pamphlet The Everyday Economy. Seven years later, in her second year as chancellor, Reeves appears to be returning to some of the themes in that pamphlet, especially as it relates to the UK’s convoluted and unpopular system of taxing property. Continue reading...", "ingested_utc": "2025-08-20T16:46:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:25Z", "source": "Guardian_World", "title": "Military vehicle crashes into car in DC as states send more national guard troops", "url": "https://www.theguardian.com/us-news/2025/aug/20/military-vehicle-crash-dc", "id_key": "979a4925664e2f28cfedb9fc17771ef2f25124d30b89a1e345162d4c0b270858", "summary": "Incident comes as six states pledge to send at least 1,200 troops to Washington DC despite falling crime rate A military vehicle crashed into a car in Washington DC on Wednesday morning, an incident that comes as more than six Republican-led states have all pledged to send more national guard troops to DC. The city’s local CBS station first reported on the accident, which happened in Washington’s Capitol Hill neighborhood, and cited confirmation from the DC fire and emergency services. On social media , the department said that one person was extricated and transported with “minor injuries”. Continue reading...", "ingested_utc": "2025-08-20T16:46:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:41Z", "source": "Blockworks", "title": "Solana’s proprietary AMMs are reshaping liquid asset markets for users", "url": "https://blockworks.co/news/solanas-proprietary-amms", "id_key": "dd1357f6bd82dc9e73269e8bdde58d699b6ffdc57ff2d3f7052d890d348b0651", "summary": "Prop AMMs like SolFi, HumidFi and Obric are taking over liquid capital markets", "ingested_utc": "2025-08-20T16:46:41Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:44Z", "source": "BitcoinMagazine", "title": "From the Bitcoin Jungle to the Sea, Let Lightning be Free!", "url": "https://bitcoinmagazine.com/print/bitcoin-jungle-lightning-to-fiat-payments", "id_key": "4d5b87fe0df47777669cbc5a8a108b61bd539874c5993b2eec9e244069793abf", "summary": "Bitcoin Magazine From the Bitcoin Jungle to the Sea, Let Lightning be Free! From Costa Rica to Kenya to Ghana, it’s becoming easier than ever to live on a bitcoin standard thanks to homegrown apps that allow users to settle fiat mobile money bills with bitcoin over Lightning. This post From the Bitcoin Jungle to the Sea, Let Lightning be Free! first appeared on Bitcoin Magazine and is written by Frank Corva .", "ingested_utc": "2025-08-20T16:46:44Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:46:46Z", "source": "CryptoSlate", "title": "UK sanctions target Russia’s crypto network to curb military funding", "url": "https://cryptoslate.com/uk-sanctions-target-russias-crypto-network-to-curb-military-funding/", "id_key": "97bf5a15c30ff11d6d573ca84d1a63093b5fdc1df99e04c24834f7633b617ace", "summary": "The UK government has imposed new sanctions on entities tied to Russia’s use of cryptocurrencies to bypass Western restrictions. In an Aug. 20 statement, UK authorities said Russia has turned to Kyrgyz financial institutions and opaque crypto channels to move funds through offshore networks. The UK named Kyrgyzstan’s Capital Bank and its director, Kantemir Chalbayev, […] The post UK sanctions target Russia’s crypto network to curb military funding appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T16:46:46Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:48:44Z", "source": "NYTimes_Business", "title": "Target Replaces CEO Brian Cornell Amid Sales Slump", "url": "https://www.nytimes.com/2025/08/20/business/target-retail-sales-outlook-tariffs.html", "id_key": "2126106b61941b58ea645845deb6439fa1cc67d5d600c6cb9cfe0ad71ebe6c53", "summary": "Michael Fiddelke, the company’s chief operating officer, will step into the role in February.", "ingested_utc": "2025-08-20T16:48:44Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:48:45Z", "source": "NYTimes_World", "title": "Drone Explosion in Haiti Kills 2 SWAT Members, Injures 6 Others", "url": "https://www.nytimes.com/2025/08/20/world/americas/haiti-drones-police-gangs.html", "id_key": "7741dcadab44fa4f5b268035a3d65cb2798673178e98ddb69fc9227a075c369f", "summary": "A drone intended for attacking gang members detonated at a police base, raising questions about how the deadly operations are conducted.", "ingested_utc": "2025-08-20T16:48:45Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:48:56Z", "source": "FT_Home", "title": "What are Rachel Reeves’ options for raising property taxes?", "url": "https://www.ft.com/content/7cc6840c-3233-4042-b5f4-0a711f0c8928", "id_key": "a49c7f28c8e04f855bce1fe4dd0bfbf67a9efc7ec3b6b6de965f210043401a9e", "summary": "UK chancellor examines case for a ‘mansion tax’ that would be technically workable but politically combustible", "ingested_utc": "2025-08-20T16:48:56Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:48:57Z", "source": "FT_Markets", "title": "A super-precise forecast — about the future no less", "url": "https://www.ft.com/content/c0478990-8df2-485c-bebc-14f70d3ce6b7", "id_key": "57d555256daa02094eeba976cc720f99118eedafdfc3fc726d73027aff6ed3b2", "summary": "Death, taxes, and MSCI Index rebalances?", "ingested_utc": "2025-08-20T16:48:57Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "Here’s where you can preorder Google’s upcoming Pixel Watch 4", "url": "https://www.theverge.com/tech/761364/google-pixel-watch-4-preorder-how-to-buy-price-release-date", "id_key": "7477c4e6b8b598f8f095855aa2eed20652bc7fb12fe40b8d7498091c9ff10a9e", "summary": "Google’s Pixel phone lineup isn’t the only thing getting an upgrade in the coming weeks. The company also took the time during its recent Made by Google event to introduce the forthcoming Pixel Watch 4, which starts at $349 and hits shelves on October 9th. Thankfully, if you’re looking to secure one at launch, you […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "ESPN&#8217;s streaming launch brings a TikTok-like feed and AI commentary", "url": "https://www.theverge.com/news/762294/espn-live-sports-streaming-app-launch-tiktok-feed-ai", "id_key": "62531cbe37f2224cf18c16222073cc42415ab84109752edb74010fe165ae7921", "summary": "ESPN is showing off its overhauled app ahead of the launch of its live sports streaming service. On Wednesday, ESPN detailed all of the new features coming to the ESPN app, including a TikTok-style vertical video feed. ESPN’s long-awaited live sports streaming service costs $29.99 per month and puts all 12 of the network’s linear […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "Google&#8217;s Pixel Buds 2A add Gemini, noise cancellation, and a replaceable battery", "url": "https://www.theverge.com/hands-on/760852/google-pixel-buds-2a-hands-on-active-noise-cancellation-battery-gemini-earbuds", "id_key": "ac17ada75225de754916e3412f47dfb37a94a75cb7ee81ff6da94a63795ec440", "summary": "Four years after launching the original Pixel Buds A-series, Google's back with the Pixel Buds 2A. The new budget buds are $30 more expensive at $129.99, but add some notable updates like an upgraded chip, Gemini access, a replaceable battery, and most importantly, active noise cancellation. The 2A also adds a Tensor A1 chip, which […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "The Google Pixel 10 and 10 Pro come with magnets, a new chip, and AI everywhere", "url": "https://www.theverge.com/hands-on/761055/google-pixel-10-pro-hands-on-camera-gemini", "id_key": "39be7ae67445557e21e153ad0a622bf69e46a6bce9aa6a661f35a4fc2ea24ecd", "summary": "Google has formally announced the Pixel 10, 10 Pro, and 10 Pro XL, and their hardware upgrades can be summed up in two letter/number combinations: G5 and Qi2. Otherwise, there's not much to see on the outside of the phones. They mostly cost the same as last year's devices - $799 for the Pixel 10, […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "Google&#8217;s Pixel Watch 4 has big ideas — and an even bigger focus on AI", "url": "https://www.theverge.com/hands-on/761918/google-pixel-watch-4-hands-on-smartwatch-wearable-gemini", "id_key": "f10e7548860e195845a2fc6a6e2467049d2e4a2b1d7684573116ffd62ae4e600", "summary": "The original Pixel Watch was late to the game. For years, there had been rumors of a Google smartwatch that never materialized. Then, when it finally arrived, it was a quintessential first-gen device, with thicc bezels, dismal battery life, and a host of quirks that needed ironing out. My DMs were full of people wondering […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "Google’s Pixel Buds Pro 2 are getting new AI-powered features in September", "url": "https://www.theverge.com/news/762048/googles-pixel-buds-pro-2-new-ai-powered-features", "id_key": "73ea1052d1ceec912f10f2d7622d09851965205301b0a724a25a3fe537eea201", "summary": "Google just announced its new budget Pixel Buds 2A, but it didn’t forget about the earbuds it launched last fall. Owners of the Pixel Buds Pro 2 will get an update in September that will deliver a few new AI-powered features. One of them, Adaptive Audio, automatically adjusts the volume based on the noise in […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "The Google Pixel 10 Pro Fold is the first fully dust-resistant foldable", "url": "https://www.theverge.com/hands-on/762080/google-pixel-10-pro-fold-dust-rating-ip68", "id_key": "4893e16d1e18cd638c0792bab1805ee90d07a634d1ba8bdec2c95e6a5009e035", "summary": "Finally, a foldable to take to the beach. The Google Pixel 10 Pro Fold is official, matching last year's starting MSRP of $1,799, and it comes with an IP68 rating. That means full water and dust resistance, which is something that no other foldable maker has figured out yet - and no small feat for […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:12Z", "source": "TheVerge_All", "title": "Google Pixel 10 launch event: the 8 biggest announcements", "url": "https://www.theverge.com/news/762150/google-pixel-10-launch-event-announcements", "id_key": "069e272890d525bd2e4a3b42fd39114dae5ed824d0331dd51964df3b2ac85d74", "summary": "Google has just announced a bunch of shiny new devices to look at and AI features to yell about. As part of its Made by Google event, the company revealed an upgraded Pixel 10 lineup, a bubblier smartwatch with a brighter screen, and a ton of AI updates that extend across all of its new […]", "ingested_utc": "2025-08-20T16:49:12Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:13Z", "source": "TechCrunch_All", "title": "Google launches the Pixel 10 series,  base model now has three-cameras", "url": "https://techcrunch.com/2025/08/20/google-launches-the-pixel-10-series-base-model-now-has-three-cameras/", "id_key": "f207fdbce3b8d28fe17fbf14f7e00f2f9acbb3d382c91466824752870c3515ad", "summary": "Google is improving the base Pixel offering by introducing a three rear camera system to the Pixel 10.", "ingested_utc": "2025-08-20T16:49:13Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:13Z", "source": "TechCrunch_All", "title": "Google doubles down on ‘AI phones’ with its Pixel 10 series", "url": "https://techcrunch.com/2025/08/20/google-doubles-down-on-ai-phones-with-its-pixel-10-series/", "id_key": "d9ed749e6cb3427cca82e8acdedeadbc3ff852a797ac5b94322cb7875e529bbe", "summary": "Google's updates to the Pixel 10 line allow it to showcase what its latest AI technology can do when enhanced by the Tensor G5 processor, an upgrade to the company's custom silicon designed for the AI experience.", "ingested_utc": "2025-08-20T16:49:13Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:13Z", "source": "TechCrunch_All", "title": "Google launches a new Pixel Journal app", "url": "https://techcrunch.com/2025/08/20/google-launches-a-new-pixel-journal-app/", "id_key": "73c07772737b978d786fedd60c542fe1c5ef27e6d545957421b0d952a1ee5eba", "summary": "Pixel Journal is a new journaling app from Google that uses on-device AI to suggest writing prompts.", "ingested_utc": "2025-08-20T16:49:13Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:14Z", "source": "ArsTechnica_All", "title": "Sony makes the “difficult decision” to raise PlayStation 5 prices in the US", "url": "https://arstechnica.com/gadgets/2025/08/sony-joins-xbox-and-nintendo-in-hiking-playstation-5-prices-in-the-us/", "id_key": "ca242d4021c11837fb0a791e52d8e59c0969d2f3e177143be8127a74ad5beff5", "summary": "Price hikes go into effect August 21; standard PS5 will now start at $550.", "ingested_utc": "2025-08-20T16:49:14Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:14Z", "source": "ArsTechnica_All", "title": "Google unveils Pixel 10 series with improved Tensor G5 chip and a boatload of AI", "url": "https://arstechnica.com/gadgets/2025/08/google-unveils-pixel-10-series-with-improved-tensor-g5-chip-and-a-boatload-of-ai/", "id_key": "ce2aba1c9002abb7d82cca9005b60028d90233f1940854a831477fce7911e3cb", "summary": "The Pixel 10 series arrives with a power upgrade but no SIM card slot.", "ingested_utc": "2025-08-20T16:49:14Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:15Z", "source": "WIRED_All", "title": "Phone Searches at the US Border Hit a Record High", "url": "https://www.wired.com/story/phone-searches-at-the-us-border-hit-a-record-high/", "id_key": "41781ba3cb351a4bd1686ab777c6e06d9790087b0a5a3b78fd0bcba7db48cb78", "summary": "Customs and Border Protection agents searched nearly 15,000 devices from April through June of this year, a nearly 17 percent spike over the previous three-month high in 2022.", "ingested_utc": "2025-08-20T16:49:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:15Z", "source": "WIRED_All", "title": "10 Crazy Features Powering Google's Pixel 10 Phones (and Watch)", "url": "https://www.wired.com/story/all-the-new-ai-features-in-google-pixel-10-phones/", "id_key": "82dd6b2b7c024436811952d5ddd0ea85bdf8d37918162b1dbb82acb60c4691b0", "summary": "Google’s latest AI features include real-time translated phone calls in your own AI-generated voice, an AI camera coach that makes you a better Instagram husband, and a voicemail replacement.", "ingested_utc": "2025-08-20T16:49:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "How to pre-order Google’s new Pixel 10 phones, Pixel Watch 4 and Pixel Buds 2a", "url": "https://www.engadget.com/mobile/smartphones/how-to-pre-order-googles-new-pixel-10-phones-pixel-watch-4-and-pixel-buds-2a-160046941.html?src=rss", "id_key": "e5bfc81f5f27001bfc3a6a35ef20aa880fcb9fef1f5239dfada783ee4d1038dc", "summary": "Google unveiled a swarm of new Pixel devices on Wednesday, including four Pixel 10 phones, the Pixel Watch 4 and a set of wireless earbuds called the Pixel Buds 2a. We’ve gone hands-on with some of the hardware already , and we’ll have full reviews in the days ahead, so most people should hold off before making any purchases. If history is any indication, it shouldn’t be too long before we see discounts for the new phones either. But if you’re interested in taking the plunge early, we’ve quickly broken down what’s new and where you can pre-order each device below. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-pre-order-googles-new-pixel-10-phones-pixel-watch-4-and-pixel-buds-2a-160046941.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "A Fitbit Ring would make so much sense", "url": "https://www.engadget.com/wearables/a-fitbit-ring-would-make-so-much-sense-163055386.html?src=rss", "id_key": "2d9f035d1a0c09210fc0d36a865b95029d736dc1fc7e68716f06a3d972aaa31e", "summary": "Ever since Samsung introduced the Galaxy Ring , I’ve wanted Google to make a smart ring. I initially imagined it would be a Pixel Ring — something that would fit into the existing wearable portfolio that includes the Pixel Watch and Pixel Buds. But at a recent roundtable with the heads of Google’s Health, Fitbit and Wearables businesses, I was presented a more compelling possibility. When CNN ’s Lisa Eadicicco asked the question on everyone’s mind about whether Google would expand its wearable product portfolio with other types of gadgets, the answer surprised me. After first giving an expected “nothing to share as yet” response, Sandeep Waraich, the senior director of product management for Google Wearables, pointed towards the Fitbit family. “We see there’s a big opportunity with a discrete device that lasts very long [and] has a simple experience that’s very focused on health and fitness.” Waraich continued by saying “today, Fitbit has a pretty robust portfolio but it has not been refreshed for a while, so that’s where we see opportunity and we have been deeply thinking about bringing the right experiences.” He did not reveal much more upon further pushing, but one thing became clear to me. If Google were to make a smart ring, it would be part of the Fitbit family. That makes a lot of sense, if you consider the activity trackers that Fitbit is synonymous with. They are fairly basic wristworn devices that do little more than count your steps, track your heart rate and occasionally vibrate to tell you to look at your phone. You could say they’re unsophisticated, but they’re also simple and serve very specific purposes. Plus, they last forever — clocking between days and weeks on a charge. As someone who loathes wearing any device to bed, I’m frustrated at the lack of options available to me for sleep-tracking. Bed sensors don’t seem to get very accurate data, while bedside radar or motion detectors (like the Nest Hub or Amazon’s retired Halo RIse) have been largely abandoned by their makers. A smart ring, like the Galaxy Ring or Oura, are effective and comfortable solutions. The thing is, a lot of my digital data is housed in Google services. I’m a Gmail girl, and I pay quite a lot every month for a generous amount of Drive storage. A Google-powered sleep tracker appeals to my data hoarder tendencies. Throw in the fact that Fitbit has long led the way in accurate and sophisticated sleep and activity tracking, and a Fitbit Ring’s potential grows significantly. Of course, there’s always the risk that, should Google make a smart ring, it might give up on the product after a few years, rendering my data or device useless. Just look at the Google graveyard . I will say that Waraich and his colleagues seem to see a future where people have multiple devices that serve various, specific purposes. A smartwatch and smart ring could both coexist as useful accessories that feed into a person’s main device, which these days is usually a smartphone. In addition to those gadgets, people likely also own laptops, TVs and tablets — screens of all sizes. In response to a follow-up question on the topic of a multi-device lifestyle, Google’s general manager of Health and Home Rishi Chandra said “There’s no doubt we need to maximize the devices you already have.” But he added “there’s no doubt in my mind there’s going to be new form factors that will exist.” He cautioned, though, that “it’s too early to have conviction,” stating that currently the team is in the “experimentation phase.” “We are experimenting,” Chandra said. What comes out of that experimentation and what sticks around ultimately depends on developments in the industry that no one can assuredly predict. I do think, though, that given the company’s expertise in simple, straightforward activity trackers, a Fitbit Ring would not be too much of a stretch. Plus, the fact that the Oura Ring is now in its fourth generation and that it and the Galaxy Ring have proven to be worthwhile devices show that there is a market for this category. This article originally appeared on Engadget at https://www.engadget.com/wearables/a-fitbit-ring-would-make-so-much-sense-163055386.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Xbox unveils its Handheld Compatibility Program", "url": "https://www.engadget.com/gaming/xbox/xbox-unveils-its-handheld-compatibility-program-162635781.html?src=rss", "id_key": "95316e13f90e387a22275e82a79603c5856b977df225f76b434cb2e64042bfe2", "summary": "Microsoft announced Wednesday during Gamescom 2025 that not only will its Xbox Ally handhelds be released on October 16, but the company is spinning up a new initiative to support optimized gaming on these devices called the Handheld Compatibility Program. The initiative seems to be similar to Valve's Steam Deck Verified , where Xbox will test games to ensure their compatibility with the new Xbox Ally handhelds. \"We have worked with game studios to test, optimize, and verify thousands of games for handheld compatibility, allowing you to jump into the game without having to tweak settings, or requiring only minor adjustments,\" said Roanne Sones, CVP of Gaming Devices and Ecosystem at Xbox. The program will be available on release day and users will be able to see handheld compatibility directly in their game libraries. Games will be badged as \"Handheld Optimized,\" indicating games with default controller inputs, appropriate resolution for full-screen play and more. Games badged as \"Mostly Compatible\" may require minor in-game setting adjustments for an optimal experience on the Xbox Ally handheld. Microsoft says it will continue to partner with developers to submit their titles for handheld compatibility testing. In addition to the \"Handheld Optimized\" badge, games will also be given a Windows Performance Fit indicator of either \"Should play great\" or \"Should play well.\" Microsoft says these signal \"compatibility and performance fit,\" but really it's anyone's best guess what that means or how it's different from the Handheld Performance badge. We've reached out to Microsoft for additional details and will update if we hear back. This article originally appeared on Engadget at https://www.engadget.com/gaming/xbox/xbox-unveils-its-handheld-compatibility-program-162635781.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Google Pixel 10 phones will narc on AI-edited images", "url": "https://www.engadget.com/ai/google-pixel-10-phones-will-narc-on-ai-edited-images-161757203.html?src=rss", "id_key": "a7ac63334ab4cc405c6369484e818fca1a646383cc0782599521664ab7aa3c8c", "summary": "Google unveiled its Pixel 10 lineup today, and the company’s latest phones will be the first to implement industry-standard C2PA Content Credentials within the native camera app. This enables people to identify whether an image was edited using AI, confirming its authenticity (or lack thereof) to anyone looking at it. The Coalition for Content Provenance and Authenticity, or C2PA , designed an open technical standard that essentially enforces transparency on a piece of media, providing information on how it was created and what, if any, modifications have been made. Appearing as a digital watermark (the C2PA likens it to a nutrition label), Content Credentials will be present in all photos taken by a Pixel 10 camera, and that imprint will also be viewable by anyone using Google Photos. The camera features on the latest Pixel phones are more pumped full of AI than ever, making it possible to apply edits in Google Photos using text or natural language voice prompts describing what you want. This in theory allows anyone lacking photo editing skills to bypass the manual process entirely, and by tapping on different parts of the photo you can get Gemini-powered suggestions on what edits to make. Google joined the C2PA last year , assisting with the development of the latest version of Content Credentials and eventually building the tech into Google Search, so that any image containing CP2A metadata would be identifiable as such. The standard is now supported in Google Images, Lens and Circle to Search, as well as the Pixel 10 phones announced today. Content Credentials will gradually roll out to Android and iOS devices running Google Photos in the coming weeks. This article originally appeared on Engadget at https://www.engadget.com/ai/google-pixel-10-phones-will-narc-on-ai-edited-images-161757203.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Everything announced at the Made by Google Pixel event, including the Pixel 10 lineup", "url": "https://www.engadget.com/mobile/smartphones/everything-announced-at-the-made-by-google-pixel-event-including-the-pixel-10-lineup-161155567.html?src=rss", "id_key": "560c89db2e6b3ab6e6078b30178d7c5d8656c7b36aeee7f6906e40d4dda3f2ef", "summary": "Google is kicking off the fall tech event season (albeit in late summer) today with its Made by Google showcase . The headline attraction at the event is the Pixel 10 lineup, but there's plenty of other interesting stuff on offer too, such as the Pixel Watch 4, Pixel Buds 2a and — of course — a bunch of AI-related announcements. Google has also confirmed something many folks have been waiting for: its take on MagSafe. The company is calling its version Pixelsnap. Here's a look at everything that announced at the Made by Google event, along with links to our more in-depth coverage of each product and our hands-on impressions: Pixel 10 A tenth birthday is typically cause for a special celebration. The Pixel brand isn't quite that old yet (the original Google Pixel arrived in 2016), but there might still be enough to the base Pixel 10 to make fans don a conical hat and blow a party horn. For one thing, this is the first non-Pro Pixel phone to boast a telephoto lens. It is a 5x optical zoom lens, but it supports 10x optical image quality with the help of cropping and computational photography. Using the Super Res Zoom feature can give you a 20x zoom equivalent. Along with the telephoto lens, the Pixel 10 has 48MP wide and 13MP ultrawide sensors on the rear, as well as a 10.5MP selfie lens. As with the other phones in this year's lineup, the Pixel 10 runs on the Google Tensor G5 chip. It's said to be 34 percent faster than the Tensor G4 chipset and it's the first chipset that runs the Gemini Nano model. According to Google, that supports more than 20 generative AI experiences that run locally. The user interface is in line for some changes too. The company says Material 3 will support expressive photo wallpapers, customizable quick settings and improved typography. All of that should look pretty good on the Actua display, which delivers up to 3,000 nits of brightness. Google also claims that the Pixel 10's battery can power the device for more than 30 hours, up from the 24-plus hours for which the Pixel 9 lineup was rated. When you use a 30W adapter, you'll be able to charge the Pixel 10 to 55 percent of its capacity (i.e. 16-plus hours of use) in 30 minutes. In addition, the handset boasts a satin metal finish, Gorilla Glass Victus 2 and an IP68 rating for dust and water resistance. The Pixel 10 will shelves on August 28. It starts at $799 and will be available in Obsidian, Frost, Lemongrass and Indigo colorways. Read more about the Pixel 10 . Pixel 10 Pro / Pro 10 XL Sam Rutherford for Engadget How would you like that thing we just told you about but with higher specs and maybe a larger display? The Pixel 10 Pro and Pixel 10 Pro XL each boast a 50MP wide lens, a 48MP ultrawide and a 48MP 5x telephoto lens. Google claims this is its best camera system in a smartphone to date. There's more memory in these models too, with 16GB of RAM versus 12GB in the base Pixel 10. (The Pixel 10 Pro Fold has 16GB of RAM too.) The Super Actua displays are about 10 percent brighter than on the Pixel 9 Pro series, with 2,200 nits of full-screen brightness or 3,300 peak when viewing HDR content, and that's while consuming less power than previous models. The Pixel 10 Pro has a 6.3-inch screen while the Pixel 10 Pro XL has a 6.8-inch display, and each has a variable refresh rate of up to 120Hz. As with the base Pixel 10, the Pro models are slated to have more than 30 hours of battery life on a single charge. The Pixel 10 Pro supports 30W fast charging, while you can top up a Pixel 10 Pro XL with 45W of fast charging. Both support Qi2, but in what's said to be a first for a phone, the 10 Pro XL offers 25W wireless charging via Qi2.2 compatibility. The Pixel 10 Pro XL has upgraded speakers too, with what Google claims is loud and powerful bass, along with full and balanced stereo audio. The Pixel 10 Pro and 10 Pro XL will be available in Moonstone, Jade, Porcelain and Obsidian colorways on August 28, with pre-orders opening up today. The Pixel 10 Pro starts at $999 for 128GB of storage and the Pixel 10 Pro XL will run you $1,199 for 256GB of storage. Read more about the Pixel 10 Pro and Pixel 10 Pro XL. Pixel 10 Pro Fold Sam Rutherford for Engadget Of course, there's a fourth phone in the Pixel 10 lineup this fall. Google made durability a priority on the Pixel 10 Pro Fold, which has an IP68 rating for dust and water resistance (a first for a foldable, the company says). A new gearless hinge will help with that — Google says it's twice as durable as the hinge in the Pixel 9 Pro Fold. In fact, the company claims the Pixel 10 Pro Fold is designed to handle over 10 years of folding. The internal, eight-inch Super Actua Reflex display (said to be the largest on any phone), and outer 6.4-inch Actua display both deliver up to 3,000 nits of brightness. Google says it redesigned the interior with resilient, ultra-thin glass, along with dual anti-impact layers to help protect it from drops. The Pixel 10 Pro Fold is said to have the largest battery in a foldable yet, with a 5,015mAh capacity. As with the rest of the Pixel 10 lineup, there's Qi2 wireless charging support — an apparent first for a foldable. Alternatively, you'll be able to charge the battery to half of its capacity in 30 minutes with a 30W adapter, Google says. The triple-camera array includes a new 48MP main sensor, along with a 10.5MP ultrawide lens with macro focus and a 10.8MP telephoto lens. A feature called Instant View will show recently-taken pictures alongside the viewfinder. Google says it improved multitasking as well, with split-screen functionality that supports app resizing and the option to drag and drop files. The Pixel 10 Pro Fold comes in Moonstone and Jade colorways, but it'll arrive later than the rest of the Pixel 10 family — it's scheduled to land on October 9. It starts at $1,799 for 256GB of storage. If you're willing to splash out more cash, though, you can have up to 1TB of onboard storage, the first time that's been an option in a Pixel Pro Fold. Read more about the Pixel 10 Pro Fold. Pixelsnap Sam Rutherford for Engadget As mentioned above, all of the Pixel 10 devices have Qi2 wireless charging capabilities built-in, but Google is expanding on that with its own, long-awaited spin on MagSafe. Google's take is called Pixelsnap. The company is offering a slew of magnetic accessories for Pixel 10 devices, including cases, a charging puck, charging stand and non-charging ring stand. Read more about Pixelsnap . AI updates Sam Rutherford for Engadget This being Google in the Gregorian calendar year of 2025, of course there are a bunch of AI features coming to the Pixel 10 lineup (some should trickle down to older models later). Magic Cue might be the handiest of the latest tools. This is said to deliver proactive suggestions based on your activity by pulling data from the likes of Gmail and Google Calendar. For instance, if you're calling your airline, Magic Cue might pull up your flight details. If a friend asks for the address of your Airbnb vacation rental, Magic Cue could bring that up to save you some time. There are plenty of other AI tools on the way to Pixel 10 devices. I am an abysmal photographer, so Camera Coach sounds like it could be a genuinely useful feature for people like me. When you point the cameras at a subject or scene you want to capture, Gemini kicks into gear to analyze what the lenses are picking up. The feature will offer composition and framing suggestions, and suggest camera modes to employ. Gemini Live can offer visual guidance with on-screen overlays. Meanwhile, the Guided Frame feature will describe what the camera sees, primarily to assist blind and low-vision users. This is said to work on any scene and seems (at least on the surface) similar to services like Be My Eyes . Sam Rutherford for Engadget Other Pixel 10 AI camera tools include Auto Best Take, which can seemingly pick out the best group photo from multiple options. As for adjusting images, the Conversational Editing feature harnesses Gemini to help you tweak things using natural language voice prompts. You might ask it to adjust lighting, change the framing of a shot or remove objects, and hopefully Gemini will be able to handle those without a hitch. In addition, Pixel 10 devices are the first phones to implement C2PA (Coalition for Content Provenance and Authenticity) content credentials directly in the camera app. This is an industry standard labeling system for content that's created or modified using generative AI. Elsewhere, Pixel translation tools could be in line for a serious upgrade with Voice Translate. Google says this feature will be able to translate calls in real-time in your own voice. Google has folded a new native audio model into Gemini Live that's said to control the emotional tone and be capable of detecting a user's emotions. AI could help you better manage your calls too. The Call Message function will keep missed and declined calls separate from spam, and offer real-time transcripts as well as suggestions for next steps. Gboard writing tools, Pixel Studio and NotebookLM integration are in line for updates too. Sam Rutherford for Engadget Last but not least, Pixel 10 devices have a Pixel Journal app that will remain private ( following in Apple's footsteps to a degree). The app harnesses AI to offer prompts that may help you track your progress and record your thoughts. Read more about the Pixel 10 AI features. Pixel Watch 4 Sam Rutherford for Engadget Let's move on from phones and take a gander at Google's latest smartwatch. The Pixel Watch 4 has a new dome-style display that's 10 percent larger than the screen on the Pixel Watch 3. It can reach up to 3,000 nits of brightness. Battery life is said to be improved too, with Google claiming it can power the wearable for up to 40 hours on a single charge. Google has also made it easier to replace the screen and battery this time around too, though we'll have to see it in person before we can judge how easy it is to actually do. Other features include satellite connectivity for emergencies (when you're out of range of Wi-Fi and cell towers), an electrocardiogram app and irregular heart rhythm notifications. Google says the Pixel Watch 4 will be able to detect when a wearer's heart stops beating and contact emergency services. There will also be an AI-based personal fitness coach . Fitbit Premium subscribers will be the first to gain access to that. The Pixel Watch 4 will be available in in two sizes, 41mm and 45mm. It starts at $349 and will hit shelves on October 9. Read more about the Pixel Watch 4 and AI personal fitness coach . Pixel Buds 2a and Pixel Buds Pro 2 updates Sam Rutherford for Engadget Google hasn't forgotten about its earbuds here either. The company is releasing the the Pixel Buds 2a with active noise cancellation (ANC), powered by a Tensor A1 chip. Even with this upgrade, these are Google's lightest and smallest A-Series earbuds to date. They're IP54 rated for dust and water resistance, while the charging case has an IPX4 rating. The Tensor A1 chip is also said to deliver improved quality for calls and other audio, while supporting Gemini and other AI features in the Pixel Buds 2a. These earbuds are said to have double the battery life of their predecessors at 10 hours on a single charge, with the case adding 17 hours of listening time (seven and 13 hours, respectively, when ANC is enabled). The Pixel Buds 2a will be available on October 9 in Hazel and Iris colorways. However, due to these upgrades, the Pixel Buds 2a will cost $130, which is $31 more than the previous generation. Meanwhile, Google is offering the Pixel Buds Pro 2 in a new colorway, Moonstone, to match some of the Pixel 10 devices. A software update in September will introduce more features to the Pixel Buds Pro 2, including protection from certain sudden loud noises, the ability to adjust audio based on the volume of your surroundings, a way to answer or dismiss calls with head gestures and advanced audio processing for Gemini Live. Read more about the Pixel Buds 2a and Pixel Buds Pro 2 updates . Hands-on with the Pixel 10 lineup and Pixel Watch 4 Sam Rutherford for Engadget Ahead of the Made by Google event, we had a chance to go hands-on with the new devices. You can now check out our first impressions of: Google Pixel 10, Pixel 10 Pro and Pixel 10 Pro XL Pixel 10 Pro Fold Pixel Watch 4 If you're interested in pre-ordering any of those — or the Pixel Buds 2a — we've got you covered with our pre-order guide . This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/everything-announced-at-the-made-by-google-pixel-event-including-the-pixel-10-lineup-161155567.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "All the new AI features coming to the Pixel 10 phones", "url": "https://www.engadget.com/ai/all-the-new-ai-features-coming-to-the-pixel-10-phones-160017270.html?src=rss", "id_key": "f49828a31d97cb84c2ac170365b4c6b678276cbdb4a70658182b11257a42a290", "summary": "Software has always been an integral part of the Pixel experience, and that's not changing with the new Pixel 10 family . At its Made by Google event today in New York, Google detailed a suite of new machine learning and AI features that will debut with the Pixel 10 series before making their way to earlier models. The first new tool most people are likely to encounter is Magic Cue. As you're texting your friends, Gemini Nano , Google's private on-device model, will populate the conversation with contextual suggestions. For example, if a friend asks about a dinner reservation you two made last week, the Pixel 10 will display a shortcut you can tap to send them a Google Maps listing. Magic Cue depends on there being a digital paper trail to work. You can long press the shortcuts it generates to see where Gemini sourced the information it's relaying to you. In the case of the example above, it may have come from your personal Gmail. Sam Rutherford for Engadget The feature has extensions throughout Android. For instance, if a family member texts you about a flight you two are about to take, Magic Cue will not only provide the number of the airline, it will also display information about your flight on screen for easy reference. On the Discover page, which you can access on nearly every Android device by swiping to the leftmost page of your phone's home screen, there's a new shortcut to a feature called the Daily Hub. Like Samsung's Now Brief , it's a page with an AI-generated summary of the upcoming day. At the top, you'll see a greeting, with a weather forecast and and any upcoming events on your calendar. Below that, there will be a list of reminders pulled from Gmail, Keep and other Google apps. If you keep scrolling, you'll also find recommended articles and videos from YouTube. Sam Rutherford for Engadget For those who also want to reflect at the end of their day, there's a new Journal app too. It has AI features built throughout. For instance, as you're writing an entry, it will automatically suggest images to include from your photo library. Additionally, the app will attempt to automatically categorize your entries based on topics you've designated. Google has used emoji for this part of the interface, which make it easy to see at a glance what you wrote about from the app's monthly view. Over in Photos, Google has introduced a feature called Conversational Editing. It allows you to tweak an image by describing to your phone how you want it modified. For example, say you took a selfie of yourself in a busy tourist location. You can tell Photos — using your voice, your phone's on-screen keyboard or a suggested prompt — to edit all the strangers out of the scene. After a few moments, the on-device model will produce a new image, with the original displayed alongside it so you can compare the two. It's possible to build multiple edits on top of one another, and if you don't like the latest edit, you can go back. Sam Rutherford for Engadget In the camera app, there are a handful of new AI features . First, there's Camera Coach, which will examine the shot you're about to snap. It will read the scene and make suggestions on the angle and lighting to use, as well what capture mode is best for the situation. Another new AI feature, dubbed Auto Best Take, finds and combines similar photos so that everyone in a group shot looks their best. Lastly, Google updated last year's Add Me feature to make it easier to include the photographer in even larger groups. Elsewhere, Google is introducing a few upgrades to its Gemini Live visual assistant that build on the base the company debuted last year. To start, there are new visual indicators that will mask part of your phone's screen to make it easier to see what Gemini is referring to when it answers a question. This feature will be available first on Pixel 10 devices before rolling out to other Android phones and iOS devices later. Separately, Google says it will soon release a new model that \"dramatically\" improves how Gemini uses key elements of human speech. For instance, you'll be able to tell the assistant to speak slowly if you're jotting down notes, and it will change its tone depending on the emotional nature of the topic you're discussing. The Pixel 10 family is available to per-order today , with general availability of the Pixel 10, Pixel 10 Pro and Pixel 10 Pro XL to follow on August 28. The Pixel 10 Pro Fold , Pixel Watch 4 and Pixel Buds 2a won't arrive at retail until October 9. This article originally appeared on Engadget at https://www.engadget.com/ai/all-the-new-ai-features-coming-to-the-pixel-10-phones-160017270.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "The Pixel 10 Pro series features brighter displays, bigger batteries and Qi2 wireless charging", "url": "https://www.engadget.com/mobile/smartphones/the-pixel-10-pro-series-features-brighter-displays-bigger-batteries-and-qi2-wireless-charging-160059520.html?src=rss", "id_key": "7f32e1f15d72eadc36da08591f39f97fcb42de22d73dad69bf42f8fdfd496acf", "summary": "After the usual months of rumors and anticipation, Google has officially launched the new Pixel 10 Pro and 10 Pro XL at its Made by Google event. The new generation flagship devices carry packed spec sheets with impressive upgrades from the Pixel 9 Pro . Perhaps the most exciting among them is the addition of Pixelsnap , which supports Google's new ecosystem of Qi2-compatible chargers that magnetically align to the back of the phone. Beyond just the convenience, Qi2 compatibility should offer faster wireless charging speeds, too. This functionality had been conspicuously missing from flagship Android devices until now, and spawns a whole new world of accessories that can snap onto the back of the Pixel. Google's flagship phones have long been known for delivering excellent photos, and these new Pixel's continue that tradition. Both models carry a triple rear camera system with a 50MP wide lens, a 48MP ultrawide with macro, and an “upgraded” 48MP 5x telephoto lens. It’s not clear yet what’s new about that telephoto camera, as it has the same f/2.8 aperture and 22-degree field of view as the one on the Pixel 9 Pro series. ProRes support is standard for more serious photo editors. The 6.3-inch Pixel 10 Pro and the 6.8-inch Pixel 10 Pro XL will both feature a Super Actua display with variable refresh rate up to 120 Hz. The displays offer up to 3,300 nits of peak brightness or 2,200 nits peak in HDR, about ten percent brighter than on the Pixel 9 Pro series. Both models boast their largest batteries yet with over 30 hours of battery life, which represents a roughly 25 percent boost over the last generation. The Pixel 10 Pro supports 30W fast charging while the Pro XL supports 45W. While both phones support the Qi2 standard, the 10 Pro XL is the first phone to support Qi2.2 with 25W wireless charging. The standard 10 Pro is limited to 15W wireless charging. Both sizes will be sold with 16GB of RAM. The Pro and Pro XL will both sport the Google Tensor G5 chip, which powers new on-board AI features coming to the entire Pixel 10 lineup. Key among them is Magic Cue, which can provide relevant information to the user by understanding when it's needed, like pulling up your flight info when you're calling the airline. Camera Coach is another AI-powered feature that will help users take better photographs by helping them find the best angle or lighting. Both sizes will be available in four color choices, those being Moonstone, Jade, Porcelain and Obsidian. The Pixel 10 Pro will launch at $999 for the 128GB model, and the Pixel 10 Pro XL will launch at $1,199 with 256GB of storage (double what the Pixel 9 Pro XL included). The new Pixel Pro line is available for pre-orders today and will hit shelves on August 28. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/the-pixel-10-pro-series-features-brighter-displays-bigger-batteries-and-qi2-wireless-charging-160059520.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "The Pixel Watch 4 offers better battery life and easier screen replacements", "url": "https://www.engadget.com/wearables/the-pixel-watch-4-offers-better-battery-life-and-easier-screen-replacements-160053246.html?src=rss", "id_key": "a3b1009fae6e647b67a829e8ad9b148cef5ec08853cb09a354808dc2452fb802", "summary": "Google just announced the Pixel Watch 4 at the Made by Google event . The upcoming smartwatch features a newly-designed domed display that's ten percent larger than the Pixel Watch 3's screen. It can also reach 3,000 nits of brightness. The battery life is impressive here, with the company saying it should last up to 40 hours per charge. That's enough time to use the watch all day and night, for those who want to track their sleep every once in a while. It also offers 25 percent faster charging when compared to the previous model. Google The Pixel Watch 4 gives customers access to SOS satellite communications, which lets users connect to emergency services via the device. This works even when cellular and Wi-Fi coverage isn't available. The feature first launched with the Pixel 9 series of smartphones . It's the first smartwatch by Google \"designed with serviceability in mind.\" This means that it's easier to replace the battery and screen. The Pixel Watch 4 tracks over 40 exercises, including yoga and kickboxing. There's an AI-based personal fitness coach that arrives first for Fitbit Premium users after the watch launches. As for health metrics, the smartwatch has an ECG app and offers irregular heart rhythm notifications. There's also a brand-new feature that detects when a heart stops beating, which automatically connects users to emergency services. All health metrics can be tracked via an integrated dashboard. Google Of course, the watch was designed with Google Gemini in mind. There's a new speaker for communication and a raise-to-talk functionality. The company says that Gemini will leverage data \"from apps across your device\" to answer questions. The Pixel Watch 4 comes in two sizes (41mm and 45mm) and integrates with a full range of accessories, including various bands. The company is introducing new watch faces and changed up the design of some pre-existing watch faces. It'll be available for purchase on October 9, with prices starting at $349. This article originally appeared on Engadget at https://www.engadget.com/wearables/the-pixel-watch-4-offers-better-battery-life-and-easier-screen-replacements-160053246.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "The Pixel 10 Pro Fold offers improved dust resistance and Qi2 wireless charging", "url": "https://www.engadget.com/mobile/smartphones/the-pixel-10-pro-fold-offers-improved-dust-resistance-and-qi2-wireless-charging-160052381.html?src=rss", "id_key": "461224046261809a9a0f222b7e1b244b67754f06fb60fdb8a6daaa0395090154", "summary": "Google just announced the Pixel 10 Pro Fold smartphone at the Made by Google event . This latest foldable offers some novel features, especially when compared to rival handsets like the recently-released Galaxy Z Fold 7 . The Pixel 10 Pro Fold offers an IP68 rating for dust and water resistance. This is pretty significant for dust, as the Z Fold 7 has just an IP48 rating. IP68 is a good rating and essentially means that the unit will be completely dustproof and can withstand being submerged in water deeper than one meter for around 30 minutes. The Pixel 9 Pro Fold offered an IPX8 rating, which is the same metric for water but a much poorer rating for dust. The Pixel 10 Pro Fold also includes Qi2 wireless charging, and it's the first foldable to offer this feature. That'll pair nicely with Google's just-announced PixelSnap platform, which is the company's answer to Apple's MagSafe. Google The general specs are solid here. It ships with a 6.4-inch external OLED display and an 8-inch internal display when unfolded. The hinge is made from high-grade aluminum alloy and the external display features a Corning Gorilla Glass Victus 2 cover. The battery lasts for around 24 hours, but Google's Extreme Battery Saver software can extend that all the way up to 84 hours. We'll have to test that when we run the handset through its paces. It can also charge up to 50 percent in just 30 minutes. There's a triple rear camera system, including a 48MP wide lens, a 10.5MP ultrawide lens with macro focus and a 10.8MP telephoto lens. It ships with a Google Tensor G5 chip, 16GB of RAM and up to 1TB in storage. The bad news? The Pixel 10 Pro Fold won't be available until October 9, while the other Pixel phones drop on August 29. Like most foldables, this handset is on the expensive side. Prices start at $1,799. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/the-pixel-10-pro-fold-offers-improved-dust-resistance-and-qi2-wireless-charging-160052381.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Pixelsnap is Google's Qi2-powered answer to MagSafe for the Pixel 10 series", "url": "https://www.engadget.com/mobile/smartphones/pixelsnap-is-googles-qi2-powered-answer-to-magsafe-for-the-pixel-10-series-160048306.html?src=rss", "id_key": "30d6de604dc3732c770fe64b80d58b85394d4a91a3b8c67aa3214fc07fefae0b", "summary": "Google just revealed something called Pixelsnap at today's Made by Google event . This is the company's answer to Apple's MagSafe technology, so it's a magnetic attachment system that can integrate with Qi2 wireless chargers. All of the new Pixel 10 phones have been outfitted with the tech, which lets users \"effortlessly snap wireless chargers, stands, grips and thousands of other accessories,\" including the just-announced official Pixelsnap charger. That Qi2 wireless charger reaches speeds up to 25W and there's a version with a stand to dock a phone while charging. Google Google also announced the Pixelsnap Ring Stand, which is for hands-free viewing, and a range of Pixelsnap phone cases. There are plenty of accessories coming from third-party companies, including car mounts, wallets, grips and more. The tech should also integrate with most pre-existing magnetic accessories. The Pixelsnap wireless charger costs $40, while the one with a stand costs $70. The Pixelsnap Ring Stand starts at $30 and dedicated smartphone cases start at $50. The phones will still be able to attach magnetically and wirelessly charge with one of these cases. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/pixelsnap-is-googles-qi2-powered-answer-to-magsafe-for-the-pixel-10-series-160048306.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "A closer look at Google’s AI health coach and the redesigned Fitbit app", "url": "https://www.engadget.com/ai/a-closer-look-at-googles-ai-health-coach-and-the-redesigned-fitbit-app-160041881.html?src=rss", "id_key": "7b9802f9acec3db0c4f7e0fc4197f6a48ee6454b9471c098aa2e44a4af1bfd83", "summary": "Alongside the Pixel Watch 4 (and family of Pixel 10 devices), Google also introduced a new “personal health coach” today at its Made By Google event. A preview of it will begin rolling out in October as part of the Fitbit app to Premium users in the US. The app is also getting a redesign which the company says will be “available with the latest Fitbit trackers, Fitbit smart watches and Pixel watches.” The first thing Fitbit users may notice is a visual refresh. In place of the current organization system, the bottom of the screen will feature four tabs: Today, Fitness, Sleep and Health. The home page (Today) will still feature daily progress stats in the form of bars and rings at the top, though these are now customizable so you can display your favorite metrics there. Below this is a feed of your upcoming workouts, recent activity and progress reports served in individual cards that you can tap into for more information. This layout, with data visualizations at the top and a feed that follows, is the same across all four tabs. Google At a recent demo, the company’s director of product management for Fitbit and health Andy Abramson showed us how his app surfaced his weekly cardio load in a ring, with bars to its right for his steps, readiness and sleep performance. “We call these our focus metrics,” he said. These are in a color scheme that will be familiar to Fitbit users, with purple continuing to be the color representing sleep data and teal for steps. But there’s a few more updates that Google says “address common user suggestions,” and these include easier layouts, more intuitive data visualization, “improved syncing — and of course, dark mode.” Google didn’t just give the Fitbit app a makeover. It said that coaching and AI were at the core of the redesign, and that the “entire app was rebuilt so the health coach can understand your goals, build your plan, contextualize your metrics and bring insights at the right moments.” Abramson said that his team sought to figure out “How do we put the AI coach in every part of the app?” Instead of simply tucking the AI features into a dedicated tab, “We actually need to tie it together.” To that end, a floating “Ask Coach” button is on every page of the app at the bottom right, and tapping it will take you into a conversation window with the Gemini-powered AI. This button is accessible across all the tabs in the updated app, and you can ask it questions about all the data you’ve provided to Fitbit. On your first time using the new app, you’ll be prompted to have a conversation with the AI coach, where it will ask about your goals, available equipment and any preferences, injuries or other relevant medical history. Those will go into an area called “Coach Notes,” that you can access in the Health tab and see what the app knows about you. There, you can delete things you don’t want in there any more. Cherlynn Low for Engadget If you only have a few free weights and a rowing machine, for example, the coach can build a custom plan that suggests a variety of weights-based exercises interspersed with sessions on your rower. But if you tell it at any point that you might be looking to incorporate outdoor runs into your routine, it can do so. Abramson told the app he wanted to get better at trail runs, for example, and in the version of the app I saw, that guidance affected a lot of the recommendations he was served. As he had told it he was traveling and had access to a hotel gym, it also suggested some activities on the facility’s Peloton bike. In future versions of the AI coach, you might be able to integrate with Gemini Live and point your camera around your (or your hotel’s) gym to get the system to identify what equipment is available and generate suggestions based on that. For now, all input to the app is limited to text, which means you may still need to know the difference between a barbell, a Y-bell and a dumbbell. The coach will build programs based on the info you supply, and these will come with detailed instructions and “metric targets that focus on weekly progression.” If you’re familiar with the cardio load and readiness score features that Google and Fitbit have rolled out in recent years, it’s easy to see how the concept has been developing over time. Your activity progress should not be judged on a daily basis — too many variables could affect whether you were able to get in a run or 10,000 steps on any given day. Instead, a more forgiving and holistic approach would be to consider weekly movement. If, like me, you tend to get in two cardio days, two strength days and one HIIT day a week, you won’t be penalized for not getting cardio in on a weights day. Or say you put in too many hours at work one day, writing a long article late into the night. The AI coach will recognize that you didn’t get as much sleep as usual and adjust your target cardio load accordingly. Google said the coach will make “real-time check-ins and adjustments” and that if you let the system know you’ve hurt your back, it will give you tips on how to modify your workouts. Google Part of the update to the Fitbit app includes new sleep algorithms that Google says make it more accurate, providing “a more precise understanding of your sleep duration and stages.” The coach also guides you to get better sleep, by studying your patterns over the week and sharing insights on how to improve things over time. If it notices that on weekdays you take a longer time than usual to fall asleep, for example, it might recommend heading to bed or turning off your devices earlier. If it thinks you might be jetlagged, it could suggest sleep schedules to help you re-adjust to new timezones. Finally, the sleep coach might look at your energy expenditure each day and recommend a bedtime that could get you 30 minutes of extra rest to get over a particularly grueling workout you undertook that morning. In time, the Fitbit coach will get data from a variety of sources, as it will support Health Connect and HealthKit to get things like your glucose levels or your weight and body composition from your smart scale or other connected devices. Google also says that in addition to helping you get personalized insights based on your activity and rest, its AI coach can help make sense of an overwhelming amount of data noise. That’s not just the information overload from all the different metrics your wearable might collect, but also the fact that there is a ton of content out there today that Google says is “written for everyone in general and no one in particular.” Since it has access to a wealth of data about you and a gigantic knowledge base from the internet, the coach can filter out noise to give you pertinent answers to your questions. You can ask things like “I’m feeling stressed right now. What can I do?” or “What are the best exercises for weight loss” and, according to Google, “get truly personalized answers that are backed by science.” The system will also serve up timely and regular reports on your performance and any trends or changes. Using AI to make sense of the overwhelming amount of data collected by our wearables seems like a smart approach, but it’s not without its drawbacks or concerns. Will your sensitive information be safely guarded? What type of information will the AI Coach serve and how trustworthy is that guidance? Google Google appears to be attempting to get ahead of those concerns, saying it is “committed to building our personal health coach with leading industry experts and through scientific research.” It’s partnered with Stephen Curry “and his performance team,” and is “working closely with our Consumer Health Advisory Panel, a diverse group of leading experts in medicine, AI and behavioral science.” I think it’s imperative that Google state very clearly that its AI Coach can not replace a doctor, a registered dietitian or a certified coach, and that it has guardrails in place to prevent aggressively pushing a person towards dangerous outcomes. The good news is, Google is well aware that it will have work to do, and is clear that it is “releasing this experience as a preview so you can help shape it as we make regular improvements.” For now, the AI is designed to help with fitness and sleep insights and recommendations, though it’s worth noting that Fitbit has historically considered a broader range of areas including mental health and menstrual cycles as essential components of overall wellbeing. In future, the AI Coach may also cover those types of data. If you’re keen to test the redesigned Fitbit app and new personal health coach out, you’ll have to be a Fitbit Premium subscriber, be based in the US and sign up to get notified when the preview is available in October. This article originally appeared on Engadget at https://www.engadget.com/ai/a-closer-look-at-googles-ai-health-coach-and-the-redesigned-fitbit-app-160041881.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Google Pixel 10 series hands-on: The base model takes center stage", "url": "https://www.engadget.com/mobile/smartphones/google-pixel-10-series-hands-on-the-base-model-takes-center-stage-160040470.html?src=rss", "id_key": "a86521718b9f11cfa156c81a0463fc0e252e1ed3415e539a22b8990e10808c50", "summary": "The Pixel 10 marks the 10th generation of Google's homegrown smartphone efforts. This year, alongside a new Tensor G5 chip, the company has included some upgrades that might make the base model the star of the family. The standard Pixel 10: Now with a dedicated zoom for the first time Aside from updated color options (obsidian, indigo, frost and lemongrass), the standard Pixel 10 doesn't look too much different from last year's phone. It still has a matte aluminum frame and a 6.3-inch OLED screen with a 120Hz refresh rate. For 2025, Google has upped the brightness of its Actua display to a peak of 3,000 nits (up from 2,700 nits). Google also claims the Pixel 10's speakers have been significantly improved, though it was hard to tell by how much during my demo. Inside, changes to the Pixel 10's specs are a bit more robust. The Tensor G5 features a CPU that's 34 percent better year-over-year on top of a new TPU that's 60 percent faster than before. Memory and storage are staying the same at 12GB of RAM and either 128GB or 256GB of storage, though it's important to note that battery capacity has increased to 4,970mAh (up from 4,700mAh). That latter figure is even more than what you get from the Pixel 10 Pro (4,870mAh). But by far, the biggest upgrade on the standard Pixel 10 is a new 10.8MP camera with a 5x optical zoom, joining the existing 48MP main and 13MP ultrawide cams. This is the first time Google has ever put a dedicated zoom lens on a base Pixel, which is a huge value add because previously anyone who wanted a telephoto camera had to pay extra for one of the premium models. And based on what I saw in person and its specs, its telephoto camera appears to be similar to what we got in last year's Pixel 9 Pro Fold, so even if it's not quite as powerful as what's available on the Pixel 10 Pros, it's still a great addition to the base model. Furthermore, when compared to the standard Galaxy S25 , the Pixel 10 suddenly has a significant hardware advantage thanks to a bigger battery (just 4,000 mAh on the Samsung), a longer zoom (5x vs 3x) and slightly faster wired charging (up to 30 watts on the Pixel instead of just 25W). Plus, both phones come with the same seven years of Android updates and security patches. Sam Rutherford for Engadget That said, it remains to be seen if the Tensor G5 can match the general overall performance of the Snapdragon 8 Elite chips used in Samsung phones. That has always been a shortcoming of Google's homegrown silicon. But for pretty much everything else, the base Pixel 10 is looking like a much more complete device and a great option for anyone looking to save some money, since its price is staying the same at $799. Pixel 10 Pro and Pro XL: Even better specs and some Pro-only camera tricks As for the $999 Pixel 10 Pro and $1,199 Pro XL, like their smaller sibling, their appearance hasn't changed too much. The easiest way to tell them apart from the base model is that the Pros have a shiny frame instead of matte and slightly different colors: obsidian, moonstone, porcelain and jade. Their 6.3- and 6.8-inch Super Actua displays have gotten a similar bump in brightness up to 3,300 nits (up from 3,000 nits), while memory and storage have received a boost as well, up to 16GB of RAM and as much as 1TB of storage. Unfortunately, even though the Pixel 10 Pro XL now supports wired charging at up to 45 watts, the 10 Pro remains capped at 30. Sam Rutherford for Engadget Of course, with the base Pixel 10 getting a new zoom lens, Google couldn't forget about the Pro models. The Pixel 10 Pro and Pro XL's cameras have the same resolution as before: a 50MP main, 48MP ultra-wide and a 48MP telephoto with 5x optical zoom. However, Google has made some tweaks that include a new ISP, an improved optical image stabilization system and some additional tools like the ability to shoot portrait mode shots in full resolution, a first for the Pixel family. However, my favorite new feature here is Pro Res Zoom, an upgraded version of Super Res Zoom that can capture long-distance shots at up to 100x while using machine learning to fill in the gaps. Google says its algorithm pays special attention to things like people's faces, so hopefully we don't run into any AI slop. From what I've seen, Pro Res Zoom works remarkably well, especially when you consider that everything is happening on-device instead of sending images to the cloud for additional processing. Seeing this kind of sharpness at up to 100x from a 5x optical zoom is damn impressive, even if the Pixel is getting an assist from AI. New software, camera and AI features Sam Rutherford for Engadget Naturally, this wouldn't be a Pixel launch without a bunch of new software and AI-powered tricks. Sadly, there are so many new tools that I didn't have a chance to do a deep dive into all of them. The feature with the most potential might be Magic Cue, which uses AI to surface helpful information like addresses, reservations and more directly inside some of your most commonly used apps like Google Messages and Gmail. These prompts appear as little rainbow bubbles and you can tap on them to quickly send relevant info to others. When dealing with a flight, Magic Cue can call the related airline for you. Meanwhile, Google's Daily Hub functions a lot like Samsung's Now Brief feature, which puts handy reminders, calendar appointments and more all in a single place. This gives you a quick overview of important things happening each day. Alternatively, if you want to be a bit more introspective, the Pixel Journal feature is essentially a digital diary that's meant to help you reflect on important events or surface new topics that may be relevant to your interests. Elsewhere, there's a new on-the-fly translation feature that can mimic the sound of your own voice during calls. Gemini Live is also getting a visual overlay so it can better highlight things on your screen and clearly point out what it sees. And then there's Take a Message, which is kind of like Call Screener but for missed calls. For photography, Google showed off the ability to use natural language voice commands to edit images or add completely new elements to a pic (like putting sunglasses on an alpaca). Best Take has also been improved to analyze up to 150 frames before you even hit the shutter in group shots, allowing the phone to pick out an image where everyone is smiling. But if that doesn't happen, it can use AI to create a composite photo with the best expressions across a series of shots. Also, across the Pixel 10 line, Google is supporting the C2PA standard , so that there will be no guessing which images have been made or tweaked with AI and which ones are all natural (at least for things created in first-party apps). And finally, launching as a preview later this fall, there's a new Camera Coach tool that uses AI to help you frame your shots, improve your composition or even suggest some new angles and ideas (Google calls it Get Inspired). The feature offers step-by-step instructions on how to recreate a specific shot. Pixelsnap: Finally, official Qi2 support from a major Android phone maker Sam Rutherford for Engadget The last major upgrade is the addition of proper Qi2 wireless charging support. Google is calling this Pixelsnap, but it's based on the same underlying spec used in iPhones and other Qi2-compatible devices and it will be available on the entire Pixel 10 family. The one quirk is that while the Pixel 10 Pro XL can wirelessly charge at up to 25 watts, the base Pixel 10 and Pixel 10 Pro are still limited to just 15 watts. On top of that, Google will have a handful of Pixelsnap accessories, including a charging mount with a removable Pixelsnap puck, a magnetic ring stand and more. Regardless, after major Android phone makers failed to add Qi2 support to last year's flagships , I'm glad Google is finally coming around, even if it took longer than I'd like. Not only does this open up the Pixel 10 line to the wide world of magnetic accessories, with a big name like Google hopping on the trend, it puts more pressure on companies like Samsung to properly adopt the standard instead of its devices being merely \" Qi2 ready \" (aka, Qi2 but without a built-in magnetic mounting point). Early thoughts Sam Rutherford for Engadget All told, I really like what Google is doing with the Pixel 10 line. The addition of a proper zoom camera on the base model is a blessing for people who might not want to pay the $200 premium for the Pro versions. It’s also great because I think the matte finish on the standard Pixel 10 looks better than the polished frame on the Pixel 10 Pro. And that goes double for the indigo variant, which is a callback to the original deep blue hue we saw back on the first Pixel from 2016. As a fan of long-distance photography, I really like the addition of Pro Res Zoom, though I do want to test it some more to see the limits of Google's AI magnification. It kind of bugs me that the Pixel 10 Pro XL has faster wired and wireless charging, as those specs really ought to be the same across both Pro models. And while the Tensor G5 seems to be much speedier than any of Google's previous chips, I'm very curious as to how much better it'll feel in the real world, particularly for stuff like gaming. But as a whole, the Pixel 10 family is shaping up to be some of the most well-rounded smartphones Google has ever made. The Pixel 10, Pixel 10 Pro and Pixel 10 Pro XL are available for pre-order today starting at $799, $999 and $1,199 with official sales beginning on August 27. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/google-pixel-10-series-hands-on-the-base-model-takes-center-stage-160040470.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Google brings ANC to its A-Series earbuds with the Pixel Buds 2a", "url": "https://www.engadget.com/audio/headphones/google-brings-anc-to-its-a-series-earbuds-with-the-pixel-buds-2a-160039849.html?src=rss", "id_key": "9bb933d41849bd1f729a3b22642b39869083298a02fa7da4605acf972718f45c", "summary": "Apple brought active noise cancellation (ANC) to its \"regular\" AirPods last year, and for 2025, Google is doing the same. Google announced the Pixel Buds 2a ($130) today alongside its slate of Pixel 10 phones, marking the first time the company's so-called A-Series earbuds have come equipped with ANC. Google also took design cues from its pricier Pixel Buds Pro 2 while outfitting this new model with a Tensor A1 chip. Sadly, all of the upgrades come with a price increase as the Pixel Buds 2a are $30 more than the previous version. For the 2a's design overhaul, Google ditched the \"stabilizer arc\" for the \"twist-to-adjust stabilizer\" from the Pixel Buds Pro 2. Like before, the company promises this element allows you to have both a secure and a more relaxed fit on the same earbuds simply by rotating them one way or the other. In terms of overall size, the Pixel Buds 2a are the lightest and smallest A-Series earbuds thus far. What's more, this new version is IP54 rated for dust and water resistance (buds only), which is an improvement over the A-Series' IPX4 rating. The charging case didn't have any ingress protection previously, but it's now IPX4. The biggest update on the Pixel Buds 2a is the addition of ANC that's paired with Google's Silent Seal 1.5. As you might expect, transparency mode is available when you need to tune in to your surroundings. That ANC should help you to hear the retooled acoustics and 11mm dynamic drivers better, including spatial audio and customized sound via a 5-band EQ. The Tensor A1 chip is the component that's in the Pixel Buds Pro 2. Here, it provides improved performance across audio and calls. Google says the chip processes audio 90 times faster than the speed of sound, adapting to changes in your environment to cancel noisy distractions. Plus, the Tensor A1 allows you to use Gemini and other AI features with the Pixel Buds 2a. Google doubled the battery life on this new model compared to the Pixel Buds A-Series. You can now expect up to 10 hours of use on the earbuds with another 17 hours in the case. With ANC enabled, those figures drop to seven hours and 13 hours, respectively. So even with noise cancellation turned on, battery life on the Pixel Buds 2a is still better than the previous model. The Pixel Buds 2a are available for pre-order starting today for $130. General availability is scheduled for October 9 and you can choose between Hazel (pictured) and Iris color options. This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/google-brings-anc-to-its-a-series-earbuds-with-the-pixel-buds-2a-160039849.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "The Pixel 10 is the first non-Pro model with a telephoto lens", "url": "https://www.engadget.com/mobile/smartphones/the-pixel-10-is-the-first-non-pro-model-with-a-telephoto-lens-160036808.html?src=rss", "id_key": "a9d49ec80befdc4e401c25d325f05adf2ce8c1c43cd2dd7ae68b73565fe96fcb", "summary": "This year, you don't have to splurge on a top-tier Pixel phone to get optical zoom. The camera bar on the standard Pixel 10 includes a 5x telephoto lens, a first for the series. Qi2 charging also comes to the series with Google's MagSafe-like Pixelsnap accessory ecosystem. The $799 handset is powered by the Tensor G5 chip, which powers new on-device AI features. Google says the Pixel 10's 48 MP 5x telephoto lens can produce 10x optical image quality. However, that's using a combination of optical zoom, cropping and computational photography. If you want pure optical zoom, 5x is all you get. Google's Super Res Zoom (combining multiple frames to enhance detail) takes it up to a 20x zoom equivalent. If you don't mind leaning on its digital trickery, the phone could be a solid choice for concert or wildlife photography. The zoom lens is joined by 48 MP wide and 13 MP ultrawide lenses. On the front is a 10.5 MP selfie camera. Google All Pixel 10 phones have built-in Qi2 wireless charging . This finally brings MagSafe-like capabilities to Android flagships, five years after Apple added it to the iPhone . (The Galaxy S25 series supports Qi2 but without built-in magnets .) Google is launching an array of magnetic accessories, dubbed Pixelsnap. This includes $50 Pixel 10 cases, a $40 charging puck, a $70 charging stand and a $30 (non-charging) ring stand. Google says the Pixel 10's battery will last longer than the Pixel 9's. The company rates the new model for 30+ hours of use. (Last year's Pixels were rated for 24+ hours.) The Pixel 10 can also charge to 55 percent in 30 minutes when using a 30W adapter. Under the hood is Google's Tensor G5 chip, which powers all of the Pixel 10 series. The company says its CPU is 34 percent faster than the Tensor G4. The phone has 12GB of RAM and 128GB / 256GB storage tiers, the same as the Pixel 9. Google The Tensor G5 powers a new on-device AI feature called Magic Cue, which offers proactive suggestions. Google says Magic Cue can bring up your flight details when you call your airline. Or, it can pull up your Airbnb address when a friend asks for it. This aligns with the AI as a context-sensitive concierge approach that device makers are moving toward. Meanwhile, Camera Coach falls into the automate everything, no skill required category of AI. When you aim the camera, the feature uses Gemini models to analyze the scene. It then provides framing and composition suggestions. It can also recommend the best camera modes to use. Google There are plenty more AI features onboard. There's a new audio model for Gemini Live . It's said to detect your emotion and control the assistant's emotional tone. (It sounds a bit creepy in theory, but we'll reserve judgment until we try it.) Then there's Pixel Journal, a private app with AI-generated prompts for recording thoughts. (It's launching first in Europe and English.) Finally, Voice Translate brings Google Meet's live translation feature to your phone calls. It translates calls to other languages in real time, simulating the users' voices. Wild stuff. The Pixel 10 has a satin metal finish (\"spacecraft-grade aluminum\") with Gorilla Glass Victus 2. The phone has an IP68 rating for dust and water resistance. The Google Pixel 10 arrives on August 28. It starts at $799 for 128GB storage. You can order it in obsidian, frost, lemongrass and indigo colors. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/the-pixel-10-is-the-first-non-pro-model-with-a-telephoto-lens-160036808.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Google's Pixel 10 'Camera Coach' uses AI to help you take the best photos", "url": "https://www.engadget.com/mobile/smartphones/googles-pixel-10-camera-coach-uses-ai-to-help-you-take-the-best-photos-160032157.html?src=rss", "id_key": "3d85623ea95174e50ae531a56c978e1d90a5d0516711f3ca9d349e509d77de21", "summary": "With the arrival of the Pixel 10, the spotlight is on the cameras that Google's phones are known for . Compared to the Pixel 9's dramatic camera bump , however, this year's improvements are mainly iterative. The base model got the biggest hardware update with the addition of a third camera. Otherwise, Google focused mainly on AI processing this time, particularly with a new feature designed to help users improve their photos and Gemini AI addition that lets you edit photos using only your voice. For better or worse, a lot of Google's camera enhancements are on the AI side. A key new update is the Gemini AI-powered Camera Coach that aims to help users with photo composition. When enabled, it can read the scene and offer advice for the angle and lighting and even suggest the best mode (Portrait, Night Sight, etc.). Another new AI mode called Auto Best Take finds and combines similar photos into one so everyone in a group shot looks their best. And Google updated the \"Add Me\" feature from last year so you can include the photographer in even bigger groups. Google Google is also using AI to make it easier to edit Pixel 10 images The editor inside Google Photos now provides AI-powered suggestions that combine multiple effects for quick edits, even if you know nothing about photo touchups. Simply ask for a specific edit like \"remove the cars in the background\" or \"restore this old photo.\" The AI will understand the change you're trying to make and use all the tools available to automatically do so. You can then add follow-up instructions for further improvements. Finally, all Pixel 10 models have an updated Portrait mode that offers \"improved segmentation, detail, sharpness, and texture,\" so that photos shot in that mode look less, well, AI generated. The base Pixel devices have played second fiddle to the Pro models in the past. However, the Pixel 10 now has a triple-camera system just like the other models, thanks to the addition of a 10.8MP 5x telephoto lens. That boosts the maximum digital Super Res Zoom up to 20x, double that of the Pixel 9. It's worth noting that a 5x optical zoom is rare on a base model camera — the Galaxy S25 has just a 3x lens, for instance. The other two are a 48MP wide (main) camera with macro focus, compared to a 50MP version before, along with a 13MP ultra-wide. Unfortunately, the latter is a downgrade in terms of resolution from the 48MP ultra-wide shooter on the previous model. Google is promising optical quality at 0.6x, 1x, 5x and 10x zoom levels. The 10.5MP ultra-wide selfie camera with a 95-degree field of view is the same mediocre one as before, though. Google Hardware-wise, the triple-camera systems on the Pixel 10 Pro and Pixel 10 Pro XL models are unchanged in terms of resolution. Both have 50MP wide, 48MP ultra-wide with macro focus and 48MP 5x telephoto lenses, along with 42MP ultra-wide selfie cameras as before. One new feature on both models is the \"Pro Res Zoom\" optimized for the Tensor G5 chip that goes up to 100x, compared to 20x on the Pixel 9 Pro and Pro XL. Since that zoom is digitally enhanced, however, you may see some wonky artifacts. One other change is double the stabilization on the wide camera that's supposed to provide more cinematic footage, according to Google. Not much has changed on the video side, with 8K available on the Pro models only via the Video Boost feature that digitally upscales footage from 4K. Finally, the Pixel 10 Fold has a similar setup to the Pixel 10, with a 48MP wide camera, 10.5MP ultra-wide camera and 10.8MP telephoto with 5x optical zoom. The front and inner cameras are both 10MP f/2.2 models. Sam Rutherford for Engadget Pixel 10 devices will also be the first to implement C2PA content credentials within the native camera app, whether they were created with or without AI. As a reminder, C2PA (Content Provenance and Authenticity) is a standard being used by Meta , Google and others to detect and label changes made by AI. Another key AI accessibility feature called Guided Frame describes what the camera is seeing for blind and low vision users. Finally, it's worth calling out the new Actua 360 display available on all models, particularly the 50 percent extra brightness (up to 3,000 nits peak). That makes photography easier on sunny days as you can better see details in your composition. In sum, it's good to see the Pixel 10 getting some love on the photo side with a triple camera system that matches or beats its competition. The Pixel 10 Pro models are mostly unchanged, however, removing some incentive to upgrade rom the Pixel 9 Pro — though the new AI features look more promising than usual. In any case, you'll get the full picture of the Pixel 10 lineup's cameras with Engadget's upcoming reviews. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/googles-pixel-10-camera-coach-uses-ai-to-help-you-take-the-best-photos-160032157.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Pixel Buds Pro 2 may soon help protect you from sudden loud noises", "url": "https://www.engadget.com/audio/headphones/pixel-buds-pro-2-may-soon-help-protect-you-from-sudden-loud-noises-160032121.html?src=rss", "id_key": "a62e691ffacfe3f5b022f19c3d4fb076a72c10f9ea2121c1d25dbd68cddd1e05", "summary": "Today's Made by Google/Pixel 10 event isn't just about phones (or AI, for that matter). Google has announced several updates for the Pixel Buds Pro 2 as well. Perhaps the most visible change is that the earbuds are available in a new gray colorway called Moonstone. This is perhaps designed with those who like to match the colors of their earbuds and phone in mind, as you can snap up a Pixel 10 in Moonstone as well. Pre-orders for the Pixel Buds Pro 2 in Moonstone open today. In addition, several new features are coming to Pixel Buds Pro 2 in September via a software update. One that's called Loud Noise Protection will automatically dampen the volume of sudden loud noises while you're wearing the earbuds to help protect your hearing. It could work for things like a train passing while you're waiting at a station, but Google says that the feature is \"not suitable to safeguard against sharp, sudden impulse sounds, such as gunshots, explosions or fireworks.\" On a similar note, Adaptive Audio will automatically adjust the volume based on how noisy your physical environment is. Google says it could help to drown out distractions in loud environments so you can better hear what you're listening to, all the while helping make sure you're aware of what's going on around you. You'll soon be able to answer calls using head gestures. With the help of the accelerometer other sensors, the earbuds will be able to detect when you nod or shake your head, and you can use this movement to answer or decline calls and respond to texts. Also coming in September is advanced audio processing for Gemini Live. Google says that, when you're using the AI voice assistant on a compatible Android device (and in a supported language and country), Pixel Buds Pro 2 will be able to eliminate background noise and prioritize your voice so Gemini Live can pick up what you're saying more clearly. This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/pixel-buds-pro-2-may-soon-help-protect-you-from-sudden-loud-noises-160032121.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Pixel 10 Pro Fold hands-on: Forget thinness, Google is going hard on durability", "url": "https://www.engadget.com/mobile/smartphones/pixel-10-pro-fold-hands-on-forget-thinness-google-is-going-hard-on-durability-160018609.html?src=rss", "id_key": "b606a24a4462dadbceebb7dd483d32fa2cc6551a8e85fcd7403653148104c9a0", "summary": "The Pixel 9 Pro Fold was a revelation. Not only did Google switch to a simpler design while adding a larger main display, the company caught up to Samsung's long-running foldable line in just two generations . However, for its third go — the Pixel 10 Pro Fold — Google is opting for a different strategy than we’ve seen recently on the Galaxy Z Fold 7 . Instead of focusing on thinness, Google may have just created the most rugged foldable on the market. That’s due in large part to the phone’s new IP68 rating. Now I will admit that certification might not sound like a huge deal because non-flexy flagships have had this kind of durability for years. But this is the first time any foldable has put both top-tier dust and water resistance together in one device. And when you consider that these kinds of gadgets are generally a bit more fragile than their glass-brick counterparts, that means something. Furthermore, Google says the Pixel 10 Pro Fold’s (P10PF from here on out) 8-inch Super Actua Flex display features a new titanium backplate that adds extra rigidity while a more robust layer of ultra-thin glass provides increased scratch resistance. On the outside, Google went with Gorilla Glass Victus 2 in front and back while installing a new gearless hinge the company claims is designed to handle more than 10 years of bending. Then to top things off, Google equipped the P10PF with a larger 5,015mAh battery, which is a significant jump up from the 4,650mAh cell in its predecessor. Even with all these improvements, the P10PF’s overall dimensions are almost exactly the same as the previous model. Between its weight (9.1 ounces) and thickness (10.8mm folded) though, Google’s foldable is still rather chunky compared Samsung’s newly streamlined Z Fold 7 (8.9mm and 7.5 ounces). Following the major redesign we got last year on the Pixel 9 Pro Fold, getting another all-new, super sleek chassis for the P10PF probably wasn’t going to happen. But given the increased durability on this year’s phone, I’m willing to give Google another 12 months to combine this newfound ruggedness with a thinner design. I just hope its engineers don’t get complacent and push things out further than that. Sam Rutherford for Engadget On the inside, the P10PF also boasts upgraded specs and performance with its Tensor G5 chip leading the way. According to Google, its CPU features 34 percent better performance while its TPU fares even better with a 60 percent jump over what we got from the Tensor G4. And just like the rest of the Pixel 10 family, the P10PF supports Google’s Pixelsnap magnetic charging ecosystem, which is fully compatible with the Qi2 protocol. So not only is the Pixel 10 line the first batch of phones from a major Android OEM to support Qi2, the P10PF is also the first foldable phone with this industry standard. Wired charging speeds have increased slightly to 30 watts, but unfortunately wireless charging is staying pat at 15W. Base memory is also staying the same at 16GB of RAM, though there is a wider range of storage options from 256GB to 1TB. Some other small details I appreciate are the P10PF’s slimmer bezels around the outside of its exterior display. It makes the curved corner in the top left look a lot less awkward and it allowed Google to increase its overall size a touch to 6.4 inches across (up from 6.3). On top of that, both of its displays are brighter too, topping out at 3,000 nits (up from 2,700 nits). Aside from updated software and AI tools like Magic Cue and the Daily Hub, all of which will be available across the Pixel 10 family, the P10PF is getting two notable foldable-specific upgrades. The first is enhanced drag and drop support that works in tandem with expanded split screen functionality to improve multitasking and moving files between apps. That said, as I was using demo devices that were essentially fresh out of the box, it was difficult to tell how much of an impact this may have on everyday use. The other addition is a new dual-pane layout for the P10PF’s camera app, which takes better advantage of the extra screen space you have when the phone is unfolded. This allows you to see new photos as soon as you snap them on the left while the viewfinder stays open on the right. The biggest potential shortcoming of the P10PF is that its camera hardware is largely staying the same. Granted, that's not a huge deal because the previous model had the best photo quality of any foldable phone. But sadly, because the P10PF doesn't have the same sensors as the Pixel 10 Pro and Pro XL, this means the P10PF also won’t have access to Google’s AI-powered 100x Pro Res Zoom or the ability to capture portrait shots in full resolution. Unfortunately, when I asked if these features would be ported to the P10PF in the future, a Google rep told me there are currently no concrete plans to do so. Here's how last year's Pixel 9 Pro Fold (left) compares in size to the new Pixel 10 Pro Fold (right). Sam Rutherford for Engadget In a lot of ways, it feels like Google is doing almost everything it can to improve the Pixel 10 Pro Fold without completely redesigning it with a thinner chassis. So if you’re the type of person who can handle a little extra junk in the trunk, there’s a lot to like about a foldable phone that comes with more robust durability. The Pixel 10 Pro Fold starts at $1,799 and is available for pre-order today in two colors: jade and moonstone. However, there will be a bit of delay until it actually arrives as official sales aren’t slated to start until October 9. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/pixel-10-pro-fold-hands-on-forget-thinness-google-is-going-hard-on-durability-160018609.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:16Z", "source": "Engadget_All", "title": "Pixel Watch 4 hands-on: A long, thoughtful list of improvements", "url": "https://www.engadget.com/wearables/pixel-watch-4-hands-on-a-long-thoughtful-list-of-improvements-160015292.html?src=rss", "id_key": "8a292d3d1e7b1119832eed3049c18eff7b74f0d66defeb19536d562d5c935b61", "summary": "Most people don’t think of Google when they think about smartwatch makers , but the latest Pixel Watch might change that. A surprising number of updates are coming to the Pixel Watch 4 , and I was impressed by how these changes add up to make it less of an iterative update than I initially expected. Of all its new features, I found the Pixel Watch 4’s satellite communications capability, repairable design and improved charging speeds most compelling. Other changes, like the brighter, curved display, dual-chip architecture, upgraded haptics engine and speaker as well as Wear OS 6 and other software features are less exciting, but will matter more to the day-to-day experience. The redesigned Fitbit app, which will have a new AI experience at its core, will also impact your daily use more. At first glance and from a recent hands-on, I’m intrigued by the Pixel Watch 4 and how the individual improvements might add up to a more meaningful overall experience. Satellite connectivity for emergency communications on a smartwatch I want to jump right into the new feature I’m most interested in: emergency satellite communications. Google says the Pixel Watch 4 is the first standalone commercial smartwatch to support this feature, and that probably largely has to do with the chip that powers it. The Snapdragon Wear 5 Gen 2, which Qualcomm announced today along with the Wear 5+ Gen 2, is the first wearable processor to offer satellite support, according to the company. It’ll use Skylo’s Narrowband Non-Terrestrial Network (NB-NTN) and allow for “two-way emergency messaging directly from the wearable device.” It’s worth noting that this will only work on LTE models and in the contiguous United States, though. In a recorded demo of the feature at a hands-on event, I saw what it would look like on a Pixel Watch 4 when you try to connect to a satellite to send a message. Now, to be extremely clear, this was a pre-recorded video that played on loop on the device. All I did was hit play and watch. Still, it was nice to get an idea of what the process would require. It looked like you’d need to follow onscreen instructions to move your wrist around while the system searched for an available satellite to connect to. It was reminiscent of existing versions on phones. Whether it’s ultimately reliable or effective is something I can’t say until I get to actually test it. Sam Rutherford for Engadget Improved charging dock and faster recharging In contrast, I did get to see for myself just how quickly the Pixel Watch 4 recharges. On paper, the company says the new watch can go from 0 to 50 percent charged in 15 minutes or less. I sat next to a Pixel Watch 4 for ten minutes as it sat on a charging dock, and saw it go from 70 percent to 90 percent in that time. That’s impressive, and though that math doesn’t appear to match what the company promised, there’s a fairly straightforward reason. A Google representative told me that past 80 percent, the charging changes from CC (constant current) to CV (constant voltage). Without getting too much into the technicalities of what’s happening , basically when CV kicks in, charging speeds slow down. This is a fairly standard battery optimization measure for most modern devices. If the Pixel Watch 4 were starting off closer to 0 percent, it’s possible that it would have recharged to 50 percent in 15 minutes, but I don’t know for certain. I’m also not sure whether the fact that the demo unit was connected to a portable battery instead of a wall socket made any difference in this case. I am, however, glad to see that it was able to get 20 percent of juice in just 10 minutes — just about the time it takes for me to get ready for the gym every morning. Google also redesigned the charging dock. Instead of a puck that sits under the watch (like you’ll find on almost all smartwatches today), the Pixel Watch 4 has a cradle that it can sit sideways in. The charger itself has a smaller footprint: instead of a round disc, it’s a rectangular dock about the size of a double A battery, with a groove in it to accommodate the watch. You can place the Pixel Watch 4 in there, knob side up with the screen facing either direction. When it’s connected, the watch will show the time and charge level and I could see that information from about six feet away. It’s basically the iPhone’s Standby mode but for a watch that’s propped up on its side. Sam Rutherford for Engadget I’m not sure how much easier it is to drop a watch sideways into a cradle as opposed to straight onto a disc, but I do think having the charge level be viewable from a distance is helpful. I’m also glad that Google spent time thinking about faster charging and making the device last longer, since those were complaints we had with previous models. To be specific, the company says the new smartwatch lasts 25 percent longer than its predecessor, thanks to a dual-chip architecture and efficiencies via Wear OS 6. New curved, brighter display Google says the Pixel Watch 4 has all new hardware on both the inside and out. In fact, it went as far as to say it completely redesigned the Pixel Watch and that this is the biggest update to the device yet. One of the most visible changes is the display. Not only is it 50 percent brighter than the one on the Pixel Watch 3, but the screen itself is domed this time, not just the glass at the top. I didn't really see a difference at first, but when looking a Pixel Watch 4 and 3 side-by-side, the new model was noticeably brighter, and watch faces seemed to stretch a bit closer to the edge of the case. Since the interface uses a black background, though, it was hard to tell whether the bezel was thinner. There are quite a few new features that I didn’t get to test, which I’ve collected in a list at the bottom of this article. For now, it’s probably more relevant to talk about things like Gemini on Wear OS 6, Raise to talk (to the assistant), the redesigned Fitbit app and the AI-powered updates. Raise to talk to Gemini and AI-generated message replies The Pixel Watch 4 isn’t the first watch to launch with Google’s latest wearable platform (that honor belongs to Samsung’s Galaxy Watch 8 series). But it does have an exclusive feature to make interacting with Gemini a bit easier: Raise to talk. Unlike on the Samsung wearable, where you have to verbally invoke the assistant or long press the knob on the side, on the Pixel Watch 4 you can bring your wrist to your face and Gemini will be ready for your requests. When it recognizes the gesture, the Pixel Watch 4 will show a small animated icon at the bottom of its screen to indicate it’s listening. But on my repeated attempts to trigger it, the system only registered that I had brought my wrist up about half of the time. Granted, I was using a watch that belonged to a Google representative and was a bit loose on my wrist, so the accuracy might improve with a better fit. I did notice other Google executives perform very deliberate movements to get the watch to listen and even then it seemed like Raise To Talk required multiple attempts to work. This is something I will have to wait till I get a unit in the real world to evaluate the efficacy of, but for now I am intrigued by the potential convenience but skeptical of the actual performance. Senior director of product management for Google Wearables Sandeep Waraich later explained that the system is currently tuned to recognize more deliberate movements as a way to avoid false positives. Waraich said that over time, and possibly by the time the Watch 4 is on shelves in October, the motion required to trigger Raise To Talk should require less exaggeration. When I did get Gemini to hear me, it responded fairly quickly to my question about activities to do in New York on a hot summer day. Again, I’d need more time with the device to judge how useful this would be in the real world. There was another feature that had much more potential to be helpful though: AI-generated quick replies to messages. I only saw a quick demo on a Google rep’s watch, but in response to a message saying “How’d the basketball game go?” the system suggested responses of “We won,” “We lost, but it was fun” and “It was great” with a basketball emoji. That’s much better than the canned prompts from before that were more likely to be “Yes,” “No,” “Call me later” or some other generic variant. It did take a second for them to load, though. A Google spokesperson at the event told us that this is possibly the first time an on-device language model has been deployed on a smartwatch, which might be noteworthy but it’s not anything that will materially impact the experience. I will say that while I didn’t get to dive too deeply into the rest of Wear OS 6 with Material 3 Expressive on the Pixel Watch 4, we do already have a review of the Samsung Galaxy Watch 8 up and in it we cover some of the changes to the platform. On Google’s smartwatches, I liked how the new software made better use of space in things like the Weather and Search cards, with an improved balance between putting more information within one page while still retaining a generous size for buttons and text. Cherlynn Low for Engadget A closer look at the redesigned Fitbit app One of the places any Pixel Watch owner will be spending much of their time is the Fitbit app, where their collected health and fitness data will be presented. I spent some time with a preview version of the redesigned app, which will be available in October to Premium users in the US. Aesthetically, the app looks quite different, with a customizable dashboard of stats at the top of the main page (aka the Today tab). At the bottom are new tabs “Today,” “Fitness,” “Sleep” and “Health.” Though the font feels more reminiscent of recent Android and Material designs, existing Fitbit users will find the color scheme familiar. Purple is still what your sleep progress bar’s color is, while your steps are still shown in a teal bar. But below all those visual representations of data is a card with a prompt to chat with the new AI Coach, followed by what Google calls a “stream,” and a floating blue “Ask Coach” button at the bottom right. The stream is separated into Upcoming and “Your day so far” sections, with the latter populated by cards summarizing your progress on areas like sleep and fitness. In a small demo, Google's director of product management for Fitbit and Health Andy Abramson walked us through the new product. He showed us his app, where a card titled “Less sleep than usual last night” said he had about 4 hours and 28 minutes of estimated sleep. It summarized the amount of time awake and interruptions during that period, and then asked “Given the shorter duration, how are you feeling energetically this morning?” A card further down, titled “Your body is well-balanced today” and tagged “Readiness,” talked about Abramson’s readiness score, what it means and showed a chart on his performance this week. You can choose to continue conversations by tapping into each card, or simply ignore them and continue scrolling down the stream. Tapping through the tabs at the bottom brings you into similarly laid out pages with information specific to your activity, sleep and vitals (as measured by the wearable). That last one will show your heart rate, respiratory rate, blood oxygen and other stats, followed by sections called “Health areas,” “Detection and self screening” and “Personal info.” This presents a combination of information your fitness tracker collects, as well as data you enter. This all feeds into the new AI Coach, which will be a paid Fitbit Premium feature, that is meant to be your Gemini-powered “personal health coach.” It’s still a fairly new tool that’s going to be in limited preview as Google continues to assess its efficacy and evaluate necessary tweaks and guardrails, but at least it seems like the company is well aware of the potential pitfalls it might encounter in the development of any AI tool for health. In a press release announcing the new personal health coach and the Fitbit redesign, Google said “We’re committed to building our personal health coach with leading industry experts and through scientific research.” To that end, it’s partnering with Stephen Curry “and his performance team” and “also working closely with our Consumer Health Advisory Panel, a diverse group of leading experts in medicine, AI and behavioral science.” I remain skeptical of AI’s trustworthiness in general, but if there’s one thing Google and Fitbit have it’s an abundance of data from the years of experience they have in collecting health data from wearables. AI seems like a suitable method to make sense of the madness, as long as it’s done mindfully. And it does seem like the Pixel Watch and Fitbit teams are thinking carefully about their approach. I will need to wait till I get to use the new app and AI Coach on my own to see how personalized and useful it is, of course. Repairability plus a list of other updates coming to the Pixel Watch 4 There were quite a few other updates I didn’t get to test during my time with the Pixel Watch 4, including the AI-powered activity recognition system, improved sleep-tracking and overnight skin temperature-sensing, as well as the accuracy of the new dual-frequency GPS. I didn’t get to check out the feature that streams your bike workout stats to your phone in real time so you can see the details more easily when your device is mounted to your handlebar. I also didn’t go about measuring if the Watch 4’s vibrations were indeed 15 percent stronger than its predecessor’s, and I wasn’t able to verify if the speakers were clearer than before, either. In addition, I can’t vouch for the durability of the Pixel Watch 4, which is rated IP68 for dust- and water-resistance and has a custom Gorilla Glass covering and aluminum housing. I doubt I will be putting those ruggedness claims to the test, but it’s heartening to know there is a respectable level of protection here. Sam Rutherford for Engadget The good news is, even if you do manage to break the screen somehow, you won’t need to buy a new Pixel Watch 4. It has a repairable design that allows you to remove the display and battery in case those parts need to be replaced. Again, I didn’t break out my screwdriver and fix a Pixel Watch 4, but I did scrutinize the (very small) screws along the case in the groove where the straps attach to the device. Theoretically, though, I applaud the notion of repairable devices and am pleased to see Google take this approach. The Pixel Watch 4’s pricing, availability and value One more thing that’s laudable: The Pixel Watch 4’s price remains unchanged from the Pixel Watch 3. It starts at $349 for the 41mm Wi-Fi model, and you can get the larger size or LTE-connected variants for more money. The smartwatch is available for pre-order today, though it’ll only start shipping and be in stores on October 9. While I continue to recommend you wait till we can publish a full review before investing your hard-earned money on any device, I do think the list of improvements Google is bringing to the Pixel Watch series is a long, thoughtful and meaningful one. For a smartwatch that has faced its fair share of challenges across the generations, the Pixel Watch 4 finally feels like it’s both maturing and carving out a space for itself. This article originally appeared on Engadget at https://www.engadget.com/wearables/pixel-watch-4-hands-on-a-long-thoughtful-list-of-improvements-160015292.html?src=rss", "ingested_utc": "2025-08-20T16:49:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:25Z", "source": "TheStreet_Top", "title": "Amazon is selling a $40 massage gun for $22 that's 'a game changer for muscle recovery'", "url": "https://www.thestreet.com/deals/olsky-massage-gun-amazon-sale", "id_key": "139bdd77e33627ac869cb89570381e0f6bd3e0b4d55292d8b05a46f28ad1bde4", "summary": "\"A powerful and effective tool for everyday pain relief.\"", "ingested_utc": "2025-08-20T16:49:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:25Z", "source": "TheStreet_Top", "title": "Stock Market Today: Tech stocks are diving (and taking the S&P and Nasdaq with them)", "url": "https://www.thestreet.com/investing/stock-market-today-august-20-2025", "id_key": "eaa9ff453a1a5c0f653f4ee399851f6c79c3835dd9350f5a3a0a4cb3030e75f7", "summary": "Plus: Target, TJX, and Lowe's all report today", "ingested_utc": "2025-08-20T16:49:25Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:37Z", "source": "FinancialPost_Business", "title": "Trump Says US Won’t Back Solar, Wind Projects Hurting Farms", "url": "https://financialpost.com/pmn/business-pmn/trump-says-us-wont-back-solar-wind-projects-hurting-farms", "id_key": "8f7af6b1eb5d31f19aa7bcb1a7e9518d33db4819e01ce666d81283bb109d175d", "summary": "President Donald Trump said the US won’t approve solar and wind projects that hurt farmland, claiming they are inflating electricity prices.", "ingested_utc": "2025-08-20T16:49:37Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:37Z", "source": "FinancialPost_Business", "title": "Couchdrop Simplifies B2B Data Transfers With New Integrations With Modern Business Applications", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/couchdrop-simplifies-b2b-data-transfers-with-new-integrations-with-modern-business-applications", "id_key": "f7b35bf82bcf76e642264d552db623889647958755d67f06820845ac776e5c38", "summary": "CHRISTCHURCH, New Zealand — Couchdrop, the cloud platform for secure b2b file transfers, announced a major update that adds new integrations with modern business applications, including iPaaS platforms and data warehouses. This update is a significant improvement for the platform and sets a new standard for the next generation of managed file transfers. Building the […]", "ingested_utc": "2025-08-20T16:49:37Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:37Z", "source": "FinancialPost_Business", "title": "Google’s Pixel 10 phones raises the ante on artificial intelligence", "url": "https://financialpost.com/pmn/googles-pixel-10-phones-raises-the-ante-on-artificial-intelligence", "id_key": "34e9df23432248ce3045fd206a0ac34a16f1e547d737ee395878b315c73082cc", "summary": "Google on Wednesday unveiled a new line-up of Pixel smartphones injected with another dose of artificial intelligence that’s designed to do everything from fetch vital information stored on the devices to help improve photos as they’re being taken. The AI expansion on the four Pixel 10 models amplifies Google’s efforts to broaden the use of […]", "ingested_utc": "2025-08-20T16:49:37Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T16:49:53Z", "source": "HackerNews_Top", "title": "Show HN: Luminal – Open-source, search-based GPU compiler", "url": "https://github.com/luminal-ai/luminal", "id_key": "56dd46c144001d57759a95fbbc7fbb11a4fc623236948006947adff851db7742", "summary": "Comments", "ingested_utc": "2025-08-20T16:49:53Z"}
