{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:37:18Z", "source": "Guardian_World", "title": "Ukraine live updates: Starmer and Macron to co-chair ‘coalition of the willing’ debrief after White House talks", "url": "https://www.theguardian.com/world/live/2025/aug/19/ukraine-live-updates-trump-zelenskyy-putin-meeting-europe-latest-news", "id_key": "4c731b5d6fba1bd54e2cbfe5cc01a6d411db6c33f9b9ee31fd25b2e9c2d226b6", "summary": "European leaders to meet virtually on Tuesday after talks at the White House where Trump said arrangements being made for meeting between Putin and Zelenskyy Full report: Trump arranging Zelenskyy-Putin meeting as European leaders push for US security guarantees Sketch: All smoke and no fire as Zelenskky emerges unbruised after Trump meet Volodymyr Zelenskyy navigated Monday’s meeting more successfully than his Oval Office encounter in February , which ended abruptly when Donald Trump and JD Vance publicly upbraided him for not being grateful enough. In his opening remarks to the media on Monday, the Ukrainian president repeated his thanks at least eight times, the Associated Press reports. A meeting between Zelenskyy and Putin ... could it finally happen? The need for security guarantees agreed – but details unclear Trump believes he is very good at solving conflicts A potential boost for the US arms industry Continue reading...", "ingested_utc": "2025-08-19T09:37:18Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:37:18Z", "source": "Guardian_World", "title": "Woman sexually assaulted on flight challenges UK rules on compensation", "url": "https://www.theguardian.com/society/2025/aug/19/woman-sexually-assaulted-on-flight-challenges-uk-rules-on-compensation", "id_key": "1f70d1068cb79682239d933aba569bf4c030c7fc00ebac55b32a01be3c5c68f9", "summary": "Woman who was attacked on flight from Qatar to London was denied payout because plane was not registered in UK A woman who was sexually assaulted while sleeping on a flight to London is challenging UK government rules that disqualify her from a compensation scheme because the plane was not registered in Britain. She was attacked on a Qatar Airways flight from Doha, Qatar, to Gatwick in September last year. Continue reading...", "ingested_utc": "2025-08-19T09:37:18Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:37:41Z", "source": "CryptoNews", "title": "SEC Delays Truth Social Crypto ETF Decision Amid Trump Financial Interest Scrutiny", "url": "https://cryptonews.com/news/sec-delays-truth-social-crypto-etf-decision-amid-trump-financial-interest-scrutiny/", "id_key": "3a70d6e6159199b1c78e9b2bdefee832165716bfcfcc451fb80d4f6aa2c80ce1", "summary": "SEC delays Truth Social Bitcoin and Ethereum ETF decision until October 8 amid mounting scrutiny over President Trump's expanding $1.2B crypto empire and potential conflicts of interest stemming from his administration's pro-crypto policies. The post SEC Delays Truth Social Crypto ETF Decision Amid Trump Financial Interest Scrutiny appeared first on Cryptonews .", "ingested_utc": "2025-08-19T09:37:41Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:39:38Z", "source": "NYTimes_Business", "title": "Economic Data Has Taken a Dark Turn. That Doesn’t Mean a Crash Is Near.", "url": "https://www.nytimes.com/2025/08/19/business/economy/us-economic-trends-unemployment-inflation.html", "id_key": "00d0bb75ac6b5f646e0df92d35715515688addad5be9ac1c066a674e7d1f0cd1", "summary": "Inflation is up and job creation down, but the U.S. economy could still pull through without too much pain.", "ingested_utc": "2025-08-19T09:39:38Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:39:38Z", "source": "NYTimes_Business", "title": "Why Did Shari Redstone Give Up Control of Paramount?", "url": "https://www.nytimes.com/2025/08/19/business/media/shari-redstone-paramount-trump-settlement.html", "id_key": "c204c8bd014f2006986cd2e5568700d937b2d6af0a61ff54b999b6a21022072f", "summary": "The media mogul spoke at length for the first time about selling her family’s empire, Paramount’s settlement with President Trump — and getting her reputation battered along the way.", "ingested_utc": "2025-08-19T09:39:38Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:39:39Z", "source": "NYTimes_World", "title": "What to Know About the Protests Outside U.K. Hotels Housing Asylum Seekers", "url": "https://www.nytimes.com/2025/08/19/world/europe/uk-asylum-seeker-hotels-protests.html", "id_key": "c90a6c9eb34fd4402d342da3ebf2e30318b66f85e8f8b20f3b00462210eaff80", "summary": "A judge is set to decide if a hotel in Epping, England, can be barred from being used to accommodate asylum seekers, highlighting what has become a contentious issue in Britain.", "ingested_utc": "2025-08-19T09:39:39Z"}
{"published_utc": "2025-08-13", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:39:40Z", "source": "NYTimes_Economy", "title": "Trump Warns of Economic Disaster if Court Strikes Down Tariffs", "url": "https://www.nytimes.com/2025/08/13/us/politics/trump-tariffs-case-federal-court.html", "id_key": "ff29ec15d11a0b88c3bfd48cb6c1da6e8b0afb600d962fec7f7232bd727c10d9", "summary": "The president has crowed about the billions of dollars collected so far from tariffs. That money could be at risk if the White House loses the legal battle.", "ingested_utc": "2025-08-19T09:39:40Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:39:47Z", "source": "NPR_Top", "title": "Toxicity is a good defense, until it isn't", "url": "https://www.npr.org/2025/08/19/nx-s1-5500216/cardiotonic-steroid-toxic-poison-heart-attack", "id_key": "745e61d69a8d23a4854f6db351945b7753ab3750bee8f1e14dd012269eef090c", "summary": "Imagine, you’re a toxic toad hanging around South America. No other animals are gonna mess with you, right? After all, you’re ~toxic~! So if anyone tries to eat you, they’ll be exposed to something called a cardiotonic steroid — and may die of a heart attack. Well, unfortunately, for you, some animals have developed adaptations to these toxic steroids. Evolutionary biologist Shabnam Mohammadi has spent her career studying how these adaptations work — and says even humans have used these toxins to their advantage since ancient Egypt. So today on Short Wave, we get a little… toxic (cue Brittney Spears). Host Regina G. Barber talks to Shabnam about how some predators can get away with eating toxic prey. Curious about biology? Email us at shortwave@npr.org. Listen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at plus.npr.org/shortwave .", "ingested_utc": "2025-08-19T09:39:47Z"}
{"published_utc": "2025-08-18", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:39:49Z", "source": "NPR_World", "title": "Jimmy Lai: Closing arguments in Hong Kong tycoon national security trial begin", "url": "https://www.npr.org/2025/08/18/g-s1-83232/jimmy-lai-trial-begins-for-hong-kong-dissident-tycoon-after-delay", "id_key": "2e9327d91096775b4d0447982c3dc032b26ba1d36087b7e5f5bdf371afc640b3", "summary": "Lai is accused of colluding with foreign forces under the controversial national security law, which Beijing imposed.", "ingested_utc": "2025-08-19T09:39:49Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:08Z", "source": "TheVerge_All", "title": "UK drops demand for backdoor into Apple encryption", "url": "https://www.theverge.com/news/761240/uk-apple-us-encryption-back-door-demands-dropped", "id_key": "d948dd0df0b2b74c6cdc251135959b4a5eebc56898d9be0bb04e77180c006354", "summary": "The United Kingdom will no longer force Apple to provide backdoor access to secure user data protected by the company’s iCloud encryption service, according to US Director of National Intelligence Tulsi Gabbard. “Over the past few months, I’ve been working closely with our partners in the UK, alongside @POTUS and @VP, to ensure Americans’ private data […]", "ingested_utc": "2025-08-19T09:40:08Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:10Z", "source": "WIRED_All", "title": "An Ancient Penis Worm With Rings of Sharp Teeth Has Been Discovered in the Grand Canyon", "url": "https://www.wired.com/story/an-ancient-penis-worm-with-rings-of-sharp-teeth-has-been-discovered-in-the-grand-canyon/", "id_key": "8c88a6b6b1886dd97c84c3c1d599b6f66dd772a83920107566711362946b68de", "summary": "The 500-million-year-old fossil, containing a species named in honor of the krayt dragons in Star Wars, is a much larger ancestor of phallic marine worms that can be found on the seabed today.", "ingested_utc": "2025-08-19T09:40:10Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:12Z", "source": "Engadget_All", "title": "The best pizza oven for 2025", "url": "https://www.engadget.com/home/kitchen-tech/best-pizza-oven-141550352.html?src=rss", "id_key": "33e3103984f346fb8127b43156a6823d255209f58f89153582ae3f2c24fc5a09", "summary": "Pizza ovens are having a moment. Companies like Ooni have popularized the ability to make restaurant-quality pies at home by giving you ovens that get hot enough for various pizza styles. Some burn wood while others run on gas, and some options can even do both with the proper accessories. I’ve broken down what to look for when you’re shopping for a pizza oven along with my top picks for the best pizza oven in various categories. If you prefer to stay in your kitchen, I’ve got options for you too. Plus, there’s a list of the pizza ovens on my upcoming slate of reviews. Table of contents Best outdoor pizza ovens for 2025 Best indoor pizza ovens in 2025 What to look for in a pizza oven How to prepare before outdoor cooking Upcoming pizza oven reviews The best pizza accessories for the oven you already have Best outdoor pizza ovens for 2025 Best indoor pizza ovens in 2025 Let me preface this section by saying you probably already have an indoor option that you can use to make some great pizza. Whether that’s the main oven in your kitchen or a multi-function countertop unit, with some affordable accessories, you can easily up your game without spending $1,000 on a dedicated appliance. For example, my Breville Smart Oven Air Fryer has a convection pizza setting that automatically adjusts cook time based on the size, oven temperature and whether the pie is fresh or frozen. A key consideration here is size. These things are massive, about the size of a large microwave, so you likely won’t want to keep them out all the time unless you have a huge kitchen. What to look for in a pizza oven When shopping for a home oven or dedicated pizza oven, you’ll first want to consider what types of pies you plan to make. Most portable pizza ovens from the likes of Ooni, Solo Stove and others use wood burning fuel and are primarily designed for the high-heat cooking required for light and airy Neapolitan-style pizzas. We’re talking high temperatures up to 900 degrees Fahrenheit. These units can certainly cook different styles of pizza at cooler temperatures, but the learning curve is easiest when you’re running them wide open with a full load of wood. You'll also want to consider alternate fuel types. If you purchase a propane or natural gas burner, you can adjust temperatures easily by turning a knob. For this reason, I recommend you spend the extra $100 or so on that accessory. This dual-fuel option makes your pizza oven a lot more versatile and gives you the option to still have a freshly fired pie when you don’t feel like messing with wood or charcoal. If you only want to cook with gas, there are models available that only use propane or natural gas. The other key consideration for aspiring pizza makers is size. Most companies make ovens that fit 12-inch pizzas, a perfect size for a personal pan pizza. They’re also great for pizza parties, since people can customize their own without having to pick off toppings they don’t like. If you want to make larger pizzas or plan to use your oven for other things (pans, etc), consider a larger version that can accommodate more than just small pies. The interior dimensions – or at the very least the pizza stone size – will be listed on most product pages. How to prepare before outdoor cooking Making good pizza at home requires a considerable amount of counter or table space. You’ll need room to stretch and prep your pizza dough, lay out your mozzarella, other cheeses and toppings and load pies onto a peel. Of course, some folks will be comfortable working in the tight confines of a small kitchen, but I’ve found it much easier to use extra space to make sure I’m not constantly moving things around during the various steps in the process. It’s also less hassle to set up your pizza-making station in close proximity to your oven. As a pizza-baking beginner, I did the running back and forth from the kitchen to the back porch. It’s far from ideal. It’s difficult to maintain your fire (if using wood or charcoal) when you’re unable to watch it closely. The good news is a patio table can be easily converted into a pizza station with a large cutting board. This also gets your oven off the ground so it’s easier to access. Ooni sells tables for its ovens that also offer shelving and storage for peels and other accessories. Solo Stove has a rolling stand for its Pi oven too, with small side shelves and a spot for your propane tank underneath. Of course, you can find other tables and stands to suit your needs, just make sure they can withstand any heat that may radiate from the bottom of the oven while cooking. Most ovens are either well insulated or don’t project too much excess heat toward the table, but you can never be too careful. For that reason, a stainless steel or metal surface is a good choice to set up an outdoor model. Most of these ovens heat up quickly and cook at high temperatures, especially if you’re making Neapolitan pizza. Having everything you need nearby so you can keep tabs on the oven and quickly make the next pie — especially the first pizza — will ease a lot of unnecessary headaches. When your cook time is two minutes or less, you don’t want to venture too far. The best pizza accessories for the oven you already have If you want to make a good pizza that rivals that of your favorite pizzeria (and without spending hundreds of dollars on a dedicated oven), you can definitely do it with the home oven you already have in your kitchen. With a few gadgets, you can improve your game without splurging on a Breville, Ooni or Solo Stove. First, I’d recommend a high quality baking steel or stone. Baking stones are great for getting better browning on the bottom of your pies than a pizza or sheet pan. You can also use them for bread, cookies and other items. The stone absorbs heat to cook pizza quickly, so you don’t need to worry about preheating it, and you’ll get that charred crust like a brick oven provides. They’re also more affordable compared to baking steels . Those metal slabs do have one key advantage: higher heat conductivity. This means a steel will cook your pizzas faster since it can absorb more heat from your oven. While baking steels can be used as griddles on your stovetop and for other types of baking, they’re not ideal for some leavened breads. The second item you’ll want is a pizza peel . These come in all shapes and sizes, made out of a variety of materials. I typically use a bamboo or wooden peel when topping and launching my pizzas and then a metal one for retrieving them. I’ve found that dough doesn’t stick as easily to bamboo during prep and the metal resists the high heat of the oven when turning or retrieving a finished pizza (bamboo will burn). There are also perforated peels which allow both steam and excess flour to escape. A peel is a great tool for loading and turning pizzas, getting them in the back of the oven, and since you’ll typically be cooking them with your oven at 500 degrees or hotter, using something like parchment paper to move them around won’t work. And if you’re going for a New York style pizza, just make sure your dough recipe and ingredients are geared toward that thinner, crispy crust — the right accessories alone won’t be enough. This article originally appeared on Engadget at https://www.engadget.com/home/kitchen-tech/best-pizza-oven-141550352.html?src=rss", "ingested_utc": "2025-08-19T09:40:12Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:21Z", "source": "AlJazeera_All", "title": "‘Shameful’: UN says 383 aid workers killed last year, nearly half in Gaza", "url": "https://www.aljazeera.com/news/2025/8/19/record-breaking-383-aid-workers-killed-in-2024-half-in-gaza-says-un?traffic_source=rss", "id_key": "d2d19c3f45a14df62ba7c87007822dca2eea47be32cced5eabf98cbc0353b58e", "summary": "The highest number of attacks on aid workers was in Palestinian territory, followed by Sudan, the UN says.", "ingested_utc": "2025-08-19T09:40:21Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:21Z", "source": "AlJazeera_All", "title": "Son of Norway’s crown princess charged with rape, domestic violence", "url": "https://www.aljazeera.com/news/2025/8/19/son-of-norways-crown-princess-charged-with-rape-domestic-violence?traffic_source=rss", "id_key": "f234b7a250160cb7d787316a3b82eb85f0c2ffb61ae34f265bdb1a5420109837", "summary": "Marius Borg Hoiby faces up to 10 years in prison after being charged with 32 criminal offences, including rape.", "ingested_utc": "2025-08-19T09:40:21Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:28Z", "source": "FinancialPost_Business", "title": "Trump Widens Metal Tariffs to Target Baby Gear and Motorcycles", "url": "https://financialpost.com/pmn/business-pmn/trump-widens-metal-tariffs-to-target-baby-gear-and-motorcycles", "id_key": "cf7238eb7bcd3935dd14c1e4abaf569f7dea8bd21fc007020086cdc8e0442bec", "summary": "President Donald Trump stunned the logistics industry on Friday by widening his steel and aluminum tariffs to include more than 400 consumer items that contain the metals, such as motorcycles and tableware. Customs brokers and importers in the US were given little notice to account for the change, which went into effect Monday and did not exclude goods in transit.", "ingested_utc": "2025-08-19T09:40:28Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:28Z", "source": "FinancialPost_Business", "title": "BlackRock® Canada Announces August Cash Distributions for the iShares® ETFs", "url": "https://financialpost.com/globe-newswire/blackrock-canada-announces-august-cash-distributions-for-the-ishares-etfs-6", "id_key": "cebd1fe5bc0661955bc65a25d42b69706430ba5daa61befd767b0b14d2fdeb88", "summary": "TORONTO, Aug. 19, 2025 (GLOBE NEWSWIRE) — BlackRock Asset Management Canada Limited (“BlackRock Canada”), an indirect, wholly-owned subsidiary of BlackRock, Inc. (NYSE: BLK), today announced the August 2025 cash distributions for the iShares ETFs listed on the TSX or Cboe Canada which pay on a monthly basis as well as XIU. Unitholders of record of […]", "ingested_utc": "2025-08-19T09:40:28Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:28Z", "source": "FinancialPost_Business", "title": "Digital Science’s 2025 Catalyst Grant seeking innovations to “see the future” with data visualization", "url": "https://financialpost.com/globe-newswire/digital-sciences-2025-catalyst-grant-seeking-innovations-to-see-the-future-with-data-visualization", "id_key": "d6e0fdb21cad05f290948c1663e16a99e1c91c5e71b5fe51854038c8190d82f1", "summary": "Teams working at intersection of science, design and data could win up to £25,000 for new tech ideas LONDON, Aug. 19, 2025 (GLOBE NEWSWIRE) — Digital Science, a technology company serving stakeholders across the research ecosystem, today launches its Catalyst Grant round for 2025 to support innovative tech ideas. Now in its 15th year, the […]", "ingested_utc": "2025-08-19T09:40:28Z"}
{"published_utc": "2025-08-19", "retrieved_date": "2025-08-19", "retrieved_utc": "2025-08-19T09:40:42Z", "source": "MIT_TechReview", "title": "How to make clean energy progress under Trump in the states—blue and red alike", "url": "https://www.technologyreview.com/2025/08/19/1122023/how-to-make-clean-energy-progress-under-trump-in-the-states-blue-and-red-alike/", "id_key": "d6ab1a0cc0e94d28657beedb3a2dfebfe670c3a8219522356a2a57d964dca584", "summary": "The second Trump administration is proving to be more disastrous for the climate and the clean energy economy than many had feared. Donald Trump’s One Big Beautiful Bill Act repealed most of the clean energy incentives in former president Joe Biden’s Inflation Reduction Act. Meanwhile, his EPA administrator moved to revoke the endangerment finding, the…", "ingested_utc": "2025-08-19T09:40:42Z"}
