{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:47:59Z", "source": "Guardian_World", "title": "Labour MSP Colin Smyth charged over indecent images", "url": "https://www.theguardian.com/uk-news/2025/aug/20/labour-msp-colin-smyth-charged-over-indecent-images", "id_key": "77fa0f40076bdd66a63e83899fdc8921f39ba813d47ac8ed182c29b90e260cb3", "summary": "Scottish Labour suspends Smyth after arrest in connection with possession of indecent images A Scottish MSP has been arrested and charged in connection with possession of indecent images. Colin Smyth, who has represented South Scotland since 2016, was arrested on Tuesday, resulting in his immediate suspension from Scottish Labour. He is due to appear in court at a later date. Continue reading...", "ingested_utc": "2025-08-20T17:47:59Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:48:15Z", "source": "Blockworks", "title": "Arbitrum Gaming Ventures offers Ronin 750K ARB to become Orbit chain", "url": "https://blockworks.co/news/arbitrum-offer-ronin-750k-arb", "id_key": "804dce8eb56ad7eb459949b312f0c6867b79ed1aef3a7a7a7479f99e2143885a", "summary": "Ronin’s L2 choice isn’t just up to its cofounders alone", "ingested_utc": "2025-08-20T17:48:15Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:48:20Z", "source": "CryptoSlate", "title": "Fed Governor Waller says ‘there is nothing scary’ in payments using DeFi rails", "url": "https://cryptoslate.com/fed-governor-waller-says-there-is-nothing-scary-in-payments-using-defi-rails/", "id_key": "54cb4fd26412570fa6890c13b2c7acf641a968234aee366beaebd8c33bb93ace", "summary": "Federal Reserve Governor Christopher Waller declared that “there is nothing scary” about DeFi simply because it operates outside traditional banking infrastructure. Speaking at Wyoming Blockchain Symposium 2025, Waller framed blockchain-based transactions as a natural technological evolution rather than disruptive threats. He compared DeFi operations to conventional purchases, noting that buying crypto with stablecoins through smart […] The post Fed Governor Waller says ‘there is nothing scary’ in payments using DeFi rails appeared first on CryptoSlate .", "ingested_utc": "2025-08-20T17:48:20Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T17:50:47Z", "source": "Engadget_All", "title": "Get up to a $300 Amazon gift card when you pre-order a Google Pixel 10 phone", "url": "https://www.engadget.com/deals/get-up-to-a-300-amazon-gift-card-when-you-pre-order-a-google-pixel-10-phone-174504117.html?src=rss", "id_key": "d9706e297a5578f66ff81f654c17d0dafd40fa619020361b1c14440186202d6c", "summary": "Google just revealed a spate of new devices , including a line of Pixel 10 smartphones . Amazon has joined the hype train early, as it now offers gift cards when pre-ordering one of these handsets . The gift cards range in value from $100 to $300, depending on what device is purchased. Perhaps the most notable is a $200 gift card when pre-ordering the Pixel 10 Pro with 128GB of storage. This model costs $1,000, so that basically drops the price down to $800. The Pixel 10 Pro offers wireless charging , an improved camera system, a brighter display and a bigger battery than last year's model. It ships on August 28. Pre-ordering the bigger and beefier Pixel 10 Pro XL with 256GB of storage provides a $200 Amazon gift card. This one costs $1,200 and ships on August 28. The base Pixel 10 smartphone with 128GB of storage also hits stores on that date and comes with a $100 gift card . The price for the entry-level handset is $800. Finally, there's the Pixel 10 Pro Fold. The 512GB version of this foldable comes with a $300 gift card , which is enough to really do some damage on Amazon. There are some caveats. This one costs $1,900 and doesn't ship until October 9 . All of this gift card madness ends on September 4. In other words, scoop up a pre-order in the near future to get one. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/get-up-to-a-300-amazon-gift-card-when-you-pre-order-a-google-pixel-10-phone-174504117.html?src=rss", "ingested_utc": "2025-08-20T17:50:47Z"}
