{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T19:38:47Z", "source": "BBC_World", "title": "Israel approves controversial West Bank settlement project", "url": "https://www.bbc.com/news/articles/cvg30l6myj3o?at_medium=RSS&at_campaign=rss", "id_key": "87fe9f7ebe5e311d96a34aca1fee40c77779645c7d57c87c331eaac6265ce337", "summary": "The Palestinian Authority says the decision is illegal and will \"destroy\" the prospects for a two-state solution.", "ingested_utc": "2025-08-20T19:38:47Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T19:41:11Z", "source": "NPR_Top", "title": "Dependent on foreign sales, U.S. wheat farmers hoping longtime partners stick with them", "url": "https://www.npr.org/2025/08/20/nx-s1-5502697/dependent-on-foreign-sales-u-s-wheat-farmers-hoping-longtime-partners-stick-with-them", "id_key": "d63f4f27e3c3d16a7c5a8ccba92d07ebc5f111ac54e8969d45e1215bb3836008", "summary": "As President Trump's tariffs kick in, American companies that rely on imports are worried about rising costs and passing them onto consumers. But some U.S. exporters are worried too.", "ingested_utc": "2025-08-20T19:41:11Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T19:41:30Z", "source": "TheVerge_All", "title": "Here are the best Kindle deals right now", "url": "https://www.theverge.com/21539047/best-amazon-kindle-deals", "id_key": "c91a68db2c75a11a9634094eecb3d3781b520e3c86c5fb098a28b74851f173e2", "summary": "When it comes to finding a device to read ebooks, you have a few options to choose from. You can always buy a tablet or use your phone, but those devices are multipurpose and can be used for a ton of things, like surfing the web or doom-scrolling on X or Bluesky. If you are […]", "ingested_utc": "2025-08-20T19:41:30Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T19:41:34Z", "source": "Engadget_All", "title": "Microsoft is working on a fix for PC shader stutter", "url": "https://www.engadget.com/gaming/xbox/microsoft-is-working-on-a-fix-for-pc-shader-stutter-193616440.html?src=rss", "id_key": "63a10a1530df9527b7f8ea896f99e6e3cf3fab9c34d94ad920c0b4a742dd18fa", "summary": "Microsoft is creating a new \"advanced shader delivery\" feature for the ASUS ROG Xbox Ally handhelds that might make loading games faster and more stutter-free. The company teased the upcoming feature alongside the announcement of the launch date for the first Xbox-branded handhelds and the company's new compatibility system for figuring out if games will run well on handhelds. Shader stutter is a widespread issue in PC gaming that doesn't occur on consoles because of their uniform hardware. You have to download shaders for a PC game to make sure that they run correctly on your specific hardware. Typically, a game downloads shaders when they're first launched, which can add to the wait before you can actually start playing, and lead to things like framerate drops as shaders are compiled in the background. Microsoft's system \"preloads game shaders during download\" which the company says will allow games to launch up to 10 times faster, \"run smoother, and use less battery on first play.\" It sounds like this new shader delivery system will require some amount of buy-in from developers, which means it likely won't impact every game at launch. It's just one of the ways Microsoft is trying to address the complexity and inefficiency Windows 11 can add to gaming. Besides including easier access to features like the Game Bar and ASUS' Armoury Crate software, the company also says that its handheld version of Windows will \"minimize background activity and defer non-essential tasks\" to devote more resources to playing games. Microsoft wants theses handhelds to be a success, so it makes sense to put in the work. But in a world where Xbox home consoles look even more like Windows PCs, the company might also be making improvements now that it can take advantage of later. This article originally appeared on Engadget at https://www.engadget.com/gaming/xbox/microsoft-is-working-on-a-fix-for-pc-shader-stutter-193616440.html?src=rss", "ingested_utc": "2025-08-20T19:41:34Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T19:41:50Z", "source": "FinancialPost_Business", "title": "Almadex Provides Review of Spences Bridge Gold Belt Projects in Southern British Columbia", "url": "https://financialpost.com/globe-newswire/almadex-provides-review-of-spences-bridge-gold-belt-projects-in-southern-british-columbia", "id_key": "262e3daec3c3cf4aa0472c6da7bea44c66e098cf049392844edb1da1713e4db5", "summary": "VANCOUVER, British Columbia, Aug. 20, 2025 (GLOBE NEWSWIRE) — Almadex Minerals Ltd. (“Almadex” or the “Company”) (TSX-V: DEX) is pleased to provide an overview of its wholly owned Nicoamen and Merit Projects, located within the Spences Bridge Gold Belt in southern British Columbia. The Spences Bridge Gold Belt (“SBGB”) is a 110 km northwest-trending belt […]", "ingested_utc": "2025-08-20T19:41:50Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T19:41:50Z", "source": "FinancialPost_Business", "title": "Integrated Power Services (IPS) to Present Industry-Leading Solar Infrastructure & BESS Solutions at RE+ 25", "url": "https://financialpost.com/globe-newswire/integrated-power-services-ips-to-present-industry-leading-solar-infrastructure-bess-solutions-at-re-25", "id_key": "5709c31eb143ad9e13fcca2c196f5d9cf434e0cf2d2eb9902ad2b083df20a0d7", "summary": "End-to-End System Lifecycle Products & Services, from Engineering, Procurement & Construction to Commissioning, Operating & Maintenance Greenville, SC, Aug. 20, 2025 (GLOBE NEWSWIRE) — Integrated Power Services (IPS), a leading provider of electrical, mechanical, and power management systems, will highlight comprehensive solar infrastructure and BESS solutions at RE+ 25, Monday – Thursday, September 8 – […]", "ingested_utc": "2025-08-20T19:41:50Z"}
