{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:29:49Z", "source": "BBC_Business", "title": "Denmark's state postal service calls time on letter deliveries", "url": "https://www.bbc.com/news/articles/c3v37plv2edo?at_medium=RSS&at_campaign=rss", "id_key": "e41a700eeacf1b73ed4c8f670f2dc712d5dc17c358722bf2dc20c829ce9c289b", "summary": "PostNord blames sharply falling demand - will other post firms around the world follow suit?", "ingested_utc": "2025-08-20T23:29:49Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:29:49Z", "source": "BBC_Business", "title": "Fed governor says she won't be 'bullied' as Trump demands she quit over mortgage claim", "url": "https://www.bbc.com/news/articles/cx276gg2gwro?at_medium=RSS&at_campaign=rss", "id_key": "284d1396822d89a8e9216a4852a1c2e3721a4ee10a32afb17877656ce80b333e", "summary": "He said Lisa Cook, one of the officials who sets interest rates at the Federal Reserve, should step down over unproven fraud allegations.", "ingested_utc": "2025-08-20T23:29:49Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:29:52Z", "source": "Guardian_World", "title": "Australia news live: ABC boss warns journalists over WhatsApp risks; search for two men missing after car goes into NSW river", "url": "https://www.theguardian.com/australia-news/live/2025/aug/21/australia-news-live-bruce-lehrmann-appeal-defamation-network-ten-lisa-wilkinson-economic-roundtable-tax-economic-reform-jim-chalmers-ntwnfb", "id_key": "a95610965df5a8a4f9f9e41291e34e9c7b7d4b74019d9cc29c394927c0f8ecd0", "summary": "Follow today’s news live Get our breaking news email , free app or daily news podcast Butler says Thriving Kids plan will help bolster NDIS long-term Health minister Mark Butler has said planned changes to the NDIS that will see children with mild to moderate developmental delays or autism diverted into a new program would both help kids and support the funding model behind the disability support service. Change will take some time, obviously, particularly to build a system for thriving kids that parents have confidence in, that has the right emphasis points. But I think what the community is saying is they want a sense from their government that we get the need to make change. They overwhelmingly think that this [the NDIS] is a scheme they should be proud of, that has transformed the lives of people with disabilities. But they’re concerned it’s costing too much and has too many inefficiencies and too many dodgy providers. Continue reading...", "ingested_utc": "2025-08-20T23:29:52Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:29:52Z", "source": "Guardian_World", "title": "Treatment that can double bladder cancer survival rates available to 1,000 patients in England", "url": "https://www.theguardian.com/society/2025/aug/21/treatment-that-can-double-bladder-cancer-survival-rates-available-to-1000-patients-in-england", "id_key": "f20e891b770b155b57c1b026450d2e44e62b5e3125e49951bb5ae355a081e6f6", "summary": "People with disease that has spread have been found to live twice as long when given treatment hailed as ‘hopeful’ More than 1,000 patients living with bladder cancer in England will be eligible for a treatment which can double survival rates from the disease. In England, 18,000 people are diagnosed with bladder cancer each year, and only about 10% of people with stage 4 bladder cancer will survive five years or more after they are diagnosed. Continue reading...", "ingested_utc": "2025-08-20T23:29:52Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:30:14Z", "source": "CryptoBriefing", "title": "Venice launches DIEM tokens as tradeable AI compute asset for VVV holders", "url": "https://cryptobriefing.com/askvenice-diem-onchain-ai-compute-base/", "id_key": "6a4d04a69a5d4f64bc13566ce74089372ca46694f32db86223141c61c400baab", "summary": "Venice launches DIEM, a tokenized AI compute asset giving holders $1 daily API credit, minted exclusively by VVV holders. The post Venice launches DIEM tokens as tradeable AI compute asset for VVV holders appeared first on Crypto Briefing .", "ingested_utc": "2025-08-20T23:30:14Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:30:16Z", "source": "CryptoNews", "title": "Bitcoin Price Forecast: Can BTC Recover After $112K Test and $1M Call?", "url": "https://cryptonews.com/news/bitcoin-price-forecast-can-btc-recover-after-112k-test-and-1m-call/", "id_key": "ef7470809a7b95fc24533dc07ad7a98df6c414826b436a369ec9fae5534ae2e9", "summary": "Bitcoin dips below $112K as ETF outflows weigh, but Coinbase CEO Brian Armstrong projects $1M by 2030. Explore BTC key levels, risks, and bullish outlook. The post Bitcoin Price Forecast: Can BTC Recover After $112K Test and $1M Call? appeared first on Cryptonews .", "ingested_utc": "2025-08-20T23:30:16Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:32:08Z", "source": "NYTimes_World", "title": "Rubio Takes on Tricky Task of Drafting Security Guarantees for Ukraine", "url": "https://www.nytimes.com/2025/08/20/us/politics/marco-rubio-ukraine.html", "id_key": "1ef5a732a4e3f6df060bc4d90c5d4043922414f86915bd3706ee0fab34d73a74", "summary": "The secretary of state and national security adviser will meet with European counterparts on Thursday in an effort to advance a peace process that so far has gotten little traction.", "ingested_utc": "2025-08-20T23:32:08Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:32:39Z", "source": "Engadget_All", "title": "Apple iPhone 17 launch date is rumored for September: Everything to know about the newest lineup", "url": "https://www.engadget.com/mobile/smartphones/apple-iphone-17-launch-date-is-rumored-for-september-everything-to-know-about-the-newest-lineup-153024220.html?src=rss", "id_key": "42aa3a3341160bcb5c5ccf99c616cdff6a03affe52d90ea2899b562d90c41794", "summary": "With August already two-thirds out the door, it means we're getting closer to the Apple iPhone event , which typically takes place in September. During that event, we'll finally get to put our eyes on the iPhone 17 lineup. The latest iOS 26 features will come preinstalled on the new models, as well as any additional features Apple reveals at the launch event. But since we still have to wait a few weeks (presumably) until the iPhone event, we can at least speculate what the new phones will look like. As with most unreleased iPhone models, rumors and leaks have trickled in about the hardware side ahead of the official introduction. Here's what we're expecting and what we can reasonably assume we'll get from Cupertino in September. What are the latest iPhone 17 rumors? Could new \"TechWoven\" cases be introduced with the latest iPhone 17 lineup? That's what leaker Majin Bu claims , per a MacRumors report . The cases match the rumored design on the iPhone 17 models, with the wide camera bump. MacRumors says this could be a revamped version of the much-maligned FineWoven case, which was discontinued due to being susceptible to scratches and stains. Here are the new TechWoven Cases for iPhone 17 Full Article: https://t.co/UGMdYQWPJX pic.twitter.com/BftqiD03jO — Majin Bu (@MajinBuOfficial) August 20, 2025 The leaker noted there are two lanyard holes for \"convenient and secure carrying,\" so it could be worn around your neck. This is just a rumor and we won't know what the actual iPhone 17 models or accessories will look like until Apple's iPhone event next month. That said, the shared photos (including the one embedded above) are more convincing than usual. How much will the iPhone 17 cost? Apple's announced plan to expand US-based manufacturing partners seems to give it at least some shielding from the steepest Trump administration tariffs that have already triggered price increases on everything from Switch consoles to high-end cameras to Sonos speakers . But given that President Trump's trade policies can change from week to week, and Apple's continuing reliance on Asia-based supply chains, price shocks remain an ongoing possibility. The bigger question is: Will Apple absorb any higher costs, or pass them on to consumers? If prices do creep up, Apple may choose to pair it with an \"upgrade.\" Consider this recent rumor posted by MacRumors from a leaker known as \" Instant Digital ,\" suggesting that the default storage of the iPhone 17 line may start at 256GB, doubling the current 128GB baseline. While that could be accompanied by a price increase of $50 , Apple could at least pitch it as a \"better value.\" That said, the company doubled the default RAM of its Mac computers from 8GB to 16GB at no extra cost in 2024 — but that was before the current Trump tariff cycle started. When will the iPhone 17 series be announced? Most years, the flagship smartphones are introduced in September. MacRumors highlighted a story originally reported by iphone-ticker.de that the Apple iPhone 17 event could be Tuesday, September 9, according to information gleaned from German mobile phone providers. It's still too early to have the specific dates; some years, Apple only gives a week or two of lead time between sending invites and hosting the event. But years of past precedent show that sometime in September should be when the 17 models make their debut. This family of smartphones may be the last to follow that trend, however. There have been hints that the introduction of the iPhone 18 collection in 2026 will be split into a pro-tier announcement in the fall and a standard model announcement the following spring. What will the new iPhone 17 lineup include? Design leaks suggest that Apple is building an ultra-thin smartphone , likely to be named the iPhone 17 Air to match Apple's ultralight laptop designation. Bloomberg 's Mark Gurman, often a solid source of advanced intel about Apple, reported in January that the iPhone 17 Air will be equipped with a basic A19 chip and will only have a single camera lens. It may also use Apple's new in-house modem, which was introduced in February on the iPhone 16e . More details about this development may leak ahead of September, but that's what we know for now. An investor note from Apple analyst Jeff Pu indicated that the Air will have a titanium frame. If his reports are accurate, the lightweight smartphone will be the only entry in the iPhone 17 lineup to use that metal; the iPhone 17, iPhone 17 Pro, and iPhone 17 Pro Max are expected to be made of aluminum, which is oddly a lighter material than titanium. Other speculation had suggested that the Air would use a blend of aluminum and titanium, so the exact materials may not be known until the official announcement. Additionally, an August 4 MacRumors report says the internal battery pack of the iPhone Air is just 2.49mm thick — half the thickness of the iPhone 17 Pro battery. The leak was posted on the Korean-language Naver blog , where they show the alleged batteries of the iPhone 17 Air and 17 Pro side by side. The same account claimed the 17 Air's battery capacity was a mere 2,800 mAh, MacRumors notes. (That's below the battery capacity of current iPhone 16 models.) On a similar topic, an iPhone 17 Pro production leak appears to have revealed an all-aluminum chassis, according to MacRumors . Originally posted by leaker Majin Bu , the image shows a shell that has a large round hole on the back (where the Apple logo typically is) to allow for MagSafe charging. MacRumors says this could just be a molding but notes that the aluminum frame (versus the current titanium in Pro iPhone models) would yield a significantly lower weight. That same leaker (Majin Bu), whom MacRumors classifies as a \"hit-or-miss leaker,\" suggests the iPhone 17 Pro will have better wireless signal strength thanks to an updated antenna design. The individual posted a render on X that shows a new antenna system that wraps around the iPhone 17 Pro's supposedly wider rear camera bump. Again, this is a render, not a real-world photo. That said, we can't knock the goal of better wireless reception, so we're hoping this one has a degree of truth to it. Each new roster includes a base model, but over the years, Apple has shaken up the variety of phones it offers. Most likely there will be an iPhone 17 and an iPhone 17 Pro. Apple has also committed to the size matters philosophy, and has been building an iPhone Pro Max option with an even bigger screen and better battery life; the 17 roster will almost certainly have one as well. The new Pro iPhones are said to have a full-width \"camera island\" on the rear, which would mark the first time an Apple model opted for that design. This feature can be seen in the purported iPhone 17 \"spotted in the wild.\" The pics, highlighted on MacRumors , show a black cased iPhone (17 Pro?) with the distinct back panel. Is it the real deal? The dual angles lend a degree of credibility in a social media landscape increasingly polluted with AI-enhanced fakes, but your guess is as good as ours. I just spotted a test development iPhone in the wild 🤩🤩🤩 pic.twitter.com/iS3PtKWqxJ — Fox Pupy 🦊🧡 (@Skyfops) July 28, 2025 The iPhone 17 Air seems primed to take the place of a potential iPhone 17 Plus. Since the iPhone 16e was only just introduced in February at a surprisingly high price point , it seems unlikely that there will be a new addition to that lower end of the spectrum, the models that were previously called SE. At the very least, it sounds like the iPhone 17 Air won't take away the charging port and rely only on wireless connectivity. Bloomberg said that while Apple had investigated making the iPhone 17 Air without a single port, the company (fortunately) changed plans. He also says that the rumored phone will have a 6.6-inch screen and include the Dynamic Island and Camera Control button. Finally, the price is rumored at $900 — likely more than the standard iPhone 17 but less than the Pro. We've also gotten what seems to be a reliable look at what the color lineup will be for the new smartphones. Macworld reported that the iPhone 17 will be available in black, white, steel gray, green, purple and light blue. The iPhone 17 Air will reportedly have four color options: black, white, light blue and light gold. While the Air colors will be less saturated, the visuals for the iPhone 17 Pro and iPhone 17 Pro Max will go bold. The options for the Pro models are expected to be black, white, gray, dark blue and orange. On July 30, Tom's Guide highlighted an X post from Sonny Dickson — a longtime and generally reliable leaker of unreleased iPhone information — showing \"dummy\" iPhone 17 models in the new colors that were the source of the aforementioned Macworld story. While these are literally just mock-ups — not real, leaked iPhones — it's interesting to see how the design and color rumors translate into a real-world look and feel. To add the the rumors, a Weibo leaker known as Digital Chat Station suggests the iPhone 17e will come equipped with a new design that includes the Dynamic Island, MacRumors reports . According to the post, the new phone will have the A19 chip and could have a 6.1-inch OLED display with a front-facing 12-megapixel camera and a rear-facing 48-megapixel camera. However, it's important to note this report refers to the 17e model that would be expected to launch no earlier than February 2026, if it followed the same release pattern as the iPhone 16e . What will iOS 26 be like? Apple upended its numbering conventions with WWDC 2025, and will match the name of each new operating system to the year it's released. So when the next wave of iPhones hits, they'll be running on iOS 26 . On the design side, the smartphone OS introduced during the big developer showcase took a contentious approach dubbed Liquid Glass. Apple has been scaling down the amount of transparency effects in the subsequent beta tests of iOS 26, but it will still have a glass-like visual. The feature list includes big and small updates. On the more impactful side, the Phone and Photos apps have been redesigned. There will be several features leveraging artificial intelligence, such as live translation capabilities coming to Phone, FaceTime and Messages. Apple is also currently testing a sensitive content warning for child accounts that will freeze FaceTime video if nudity is detected by on-device machine learning tools. And the company is also launching Visual Intelligence, which will use AI to search for elements in an image. iOS 26 also has a litany of minor, quality of life improvements. Group texts are getting support for polls. And for the slow risers out there, iOS 26 will finally let you escape the tyranny of the nine minute snooze alarm . The next iOS is now available as a public beta . Here are our initial impressions of the Liquid Glass design and other new features. iOS 26 is compatible with all models back through iPhone 11. What other products are expected to be released alongside the iPhone 17? If Apple follows its usual pattern, the iPhone 17 will be announced alongside new Apple Watch products. That would be the Apple Watch Series 11 (if Apple sticks to the same naming scheme), and maybe an Apple Watch Ultra 3 and/or an updated Apple Watch SE. (They'll all run watchOS 26 , of course.) Other possibilities — and this is, again, speculation — could include refreshed Apple AirPods Pro (which received its last big update in 2022 ) and maybe new AirTags trackers (first released in 2021). The Apple rumor mill got a big shot in the arm this week thanks to the reported inclusion of product ID numbers in recent beta software builds. Per MacRumors , it's a laundry list of new hardware, including long-rumored product updates like the Apple TV , HomePod mini , new Apple Studio Display monitor and two fresh iPads. Of course, even if that list is totally accurate, we may not see those products until 2026 — if ever. So don't expect all of products to share the stage with the iPhone 17, especially since Apple likes to keep its star performer at the center of attention. That said, keep in mind that Apple has recently been having Mac-centric announcements in late October (as it did last year to debut new M4 Macs ), so there's always the chance of another shoe dropping a few weeks down the road. Update, August 20, 2025, 7:12PM ET: Added new rumor about potential TechWoven case for iPhone 17 series. Update, August 18, 2025, 6:23PM ET: Added new rumor about the iPhone 17e potentially having the Dynamic Island. Update, August 15, 2025, 2:05PM ET: Added new rumor about the all-aluminum chassis on the iPhone 17. Update, August 13, 2025, 10:02PM ET: Added a list of the products that are expected to be released alongside the iPhone 17s. Update, August 11, 2025, 7:27PM ET: Added a render of a rumored new antenna design for the iPhone 17 Pro. Update, August 8, 2025, 4:43PM ET: Added new speculation and reports about iPhone 17 pricing. Update, August 6, 2025, 4:05PM ET: Added latest details about the potential iPhone 17 event date. Update, August 4, 2025, 5:23PM ET: Added latest battery leaks about the iPhone 17 models. Update, August 1, 2025, 8:15AM ET: Added new photos showing potential iPhone 17 colors. Update, July 30, 2025, 11:08AM ET: Added latest leaks and rumors about the iPhone 17, and updated information on the iOS 26 public beta. Update, July 17, 2025, 4:40PM ET: Added latest information about iOS 26, possible materials for the Air, and the color options for the different models. Update, March 17, 2025, 2PM ET: Added details about the rumored price and features of the iPhone 17 Air. Update, April 11, 2025, 3:45PM ET: Added details from Front Page Tech's new video that claims to reveal details from a leaked iOS 19 build. Katie Teague contributed to this story. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/apple-iphone-17-launch-date-is-rumored-for-september-everything-to-know-about-the-newest-lineup-153024220.html?src=rss", "ingested_utc": "2025-08-20T23:32:39Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:32:54Z", "source": "FinancialPost_Business", "title": "China Emissions Fall While Chemicals Emerge as New Hotspot", "url": "https://financialpost.com/pmn/business-pmn/china-emissions-fall-while-chemicals-emerge-as-new-hotspot", "id_key": "789bb4f467d23129e82dbb9354f944079c1b9c3e76c2c18c1c1012536743beb1", "summary": "A surge of renewable power led to declining emissions in China over the first half of the year even as a growing chemicals sector becomes a major new source of heat-trapping gases, according to new research.", "ingested_utc": "2025-08-20T23:32:54Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:32:54Z", "source": "FinancialPost_Business", "title": "ECB Urged to Target Banks Trailing on Climate", "url": "https://financialpost.com/pmn/business-pmn/ecb-urged-to-target-banks-trailing-on-climate", "id_key": "77a950c9a1b168807a83c4d9bdc05454993ffb3081eabb7d0c0e5634de8feed1", "summary": "The European Central Bank should impose greater so-called haircuts on the debt of banks most exposed to climate risk, in a move that would impact the funding costs of environmental laggards.", "ingested_utc": "2025-08-20T23:32:54Z"}
{"published_utc": "2025-08-20", "retrieved_date": "2025-08-20", "retrieved_utc": "2025-08-20T23:32:54Z", "source": "FinancialPost_Business", "title": "Canadian North Resources Inc. Reports Operational and Financial Results for the Second Quarter Ended June 30, 2025", "url": "https://financialpost.com/globe-newswire/canadian-north-resources-inc-reports-operational-and-financial-results-for-the-second-quarter-ended-june-30-2025", "id_key": "8ae74c9651b4636bcb5daabd3a995b5d979447905ca125d2c39234cfae44b362", "summary": "Highlights: Expanded bio-metallurgical programs from initial bio-leaching tests indicating metal extraction of 97.86-98.5% nickel and 96.9-97.7% cobalt, with the goal of achieving similarly high recoveries of copper and PGE metals from the Ferguson Lake Ni-Cu-Co PGE Project located in southeast Nunavut, Canada. Continued evaluation of multiple metal processing technologies to produce market-ready battery-grade nickel and […]", "ingested_utc": "2025-08-20T23:32:54Z"}
