{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Database to track childcare workers and mobile phone bans on the table as Australian ministers set to meet", "url": "https://www.theguardian.com/australia-news/2025/aug/22/database-to-track-childcare-workers-and-mobile-phone-bans-on-the-table-as-australian-ministers-set-to-meet", "id_key": "f79ee3da679e8a55c6cb47b0ab8f3ed260dfdfd8e66cfd8fcd856255a4b8e88b", "summary": "Governments scramble to establish national register of workers after allegations of abuse of children in early education, but states and territories yet to agree on personal device ban Get our breaking news email , free app or daily news podcast A national system to track childcare worker misconduct is key to keeping children safe, one of Australia’s largest early education providers has said, arguing every worker in every state should be subject to mandatory reporting. It comes amid disagreement among states and territories about moves to ban mobile phones in childcare centres, ahead of a critical meeting of education ministers to decide on new rules about safety training, CCTV and a database to track worker movements. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "‘Gender ideology’, quotas and anti-discrimination laws on the agenda for Queensland LNP state conference", "url": "https://www.theguardian.com/australia-news/2025/aug/22/gender-ideology-quotas-and-anti-discrimination-laws-on-the-agenda-for-queensland-lnp-state-conference", "id_key": "7b01b0064166c7cdad505c2e404cee93e4953056ff49b49f8ba2d997c0e3eac2", "summary": "Despite premier David Crisafulli’s wish for his party to maintain a moderate outlook, members have presented a number of divisive social issues for debate this weekend Get our breaking news email , free app or daily news podcast At this weekend’s state conference, Queensland Liberal National party members will debate banning gender-affirming care for children, repealing a ban on conversion practices and adopting a policy “whereby batteries, solar panels and wind turbines should no longer be deemed as renewables”. Seven separate motions reference “gender ideology”, gender-affirming care or transgender people, but the word “abortion” does not appear on the agenda for the LNP’s first convention since winning last year’s state election. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Giving Australians $2,700 tax back while widening GST could help generate $152bn windfall, economist says", "url": "https://www.theguardian.com/australia-news/2025/aug/22/giving-australians-2700-tax-back-while-widening-gst-could-help-generate-152bn-windfall-economist-says", "id_key": "b9202a7ca78734156d0e6d2c3f10a5cd014229599e9d76cbb12ddd0968409d90", "summary": "Economist who modelled GST estimates his proposed tax reform would lift real GDP by 6%, boost business investment by 11% and increase the number of homes by 8% Get our breaking news email , free app or daily news podcast Giving the average worker a $2,700 income tax cut in return for widening the GST would be part of a major tax overhaul that could add a combined $158bn to the Australian economy. Chris Murphy, an economist who provided the modelling for introduction of the GST and Ken Henry’s 2010 tax review, has outlined a $91bn shift in the tax mix, which includes replacing stamp duties with a land tax and taxing corporate super profits. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Nato leaders must ‘not be naive’ about any potential Ukraine deployment, says head of German soldiers’ union – Ukraine war live", "url": "https://www.theguardian.com/world/live/2025/aug/21/us-minimal-security-guarantees-ukraine-russia-diplomacy-europe-latest-updates-news", "id_key": "3d2632e91864448ff7ad55736da56e5bd3149cd01234b5ab5d48399ba91375ea", "summary": "Col Andre Wuestner tells European Nato leaders they would need to deploy tens of thousands of troops to the country for the long term We have just heard from the European Commission, confirming that the EU and the US have now agreed on the much-awaited “joint statement” advancing the political commitments on trade agreed by Ursula von der Leyen and Donald Trump in Scotland last month. The commission’s press release says the statement “lays out in detail the new US tariff regime towards the EU, with a clear maximum, all-inclusive, tariff rate of 15% for the vast majority of EU exports , including strategic sectors such as cars , pharmaceuticals , semiconductors and lumber .” Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Egypt retrieves parts of 2,000-year-old sunken city off coast of Alexandria", "url": "https://www.theguardian.com/world/2025/aug/21/egypt-retrieves-parts-of-2000-year-old-sunken-city-canopus-off-coast-of-alexandria", "id_key": "96161c2dae03d2556f71fc99ed30e2b7f84497674e2770a33523b63ce374d309", "summary": "Cranes hoisted statues from depths of submerged site that authorities say may be extension of ancient city of Canopus Egypt has unveiled parts of a sunken city submerged beneath waters off the coast of Alexandria, revealing buildings, artefacts and an ancient dock that date back more than 2,000 years. Egyptian authorities said the site, located in the waters of Abu Qir Bay, may be an extension of the ancient city of Canopus, a prominent centre during the Ptolemaic dynasty, which ruled Egypt for nearly 300 years, and the Roman empire, which governed for about 600 years. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Will at centre of legal battle over Shakespeare’s home unearthed after 150 years", "url": "https://www.theguardian.com/culture/2025/aug/21/will-at-centre-of-legal-battle-over-shakespeares-home-unearthed-after-150-years", "id_key": "9b065af8ea6191744dd5c7fe281632d1a6e9fd90e7140079a5daf1a8592ba47f", "summary": "Document from 1642 made by husband of Shakespeare’s granddaughter found in unlabelled box at National Archives A will that has been lost for more than 150 years and was at the centre of a bitter legal battle by William Shakespeare’s family over who owned the playwright’s final home has been unearthed in an unlabelled box at the National Archives . The original 1642 document was made by Thomas Nash, who was married to Shakespeare’s granddaughter Elizabeth Hall. In it, he bequeathed New Place, reputedly the second grandest house in Stratford-upon-Avon, to his own cousin Edward Nash. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Government takes control of UK’s third-largest steelworks after collapse into administration", "url": "https://www.theguardian.com/business/2025/aug/21/government-control-liberty-steel-south-yorkshire-sanjeev-gupta", "id_key": "01185205d77cd4897f6ee9883a29318c5a0087c486c015a9aae784286ddec591", "summary": "State steps in to run Speciality Steel UK plants in South Yorkshire in bid to protect 1,450 jobs The government has taken control of the UK’s third-largest steelworks as ministers try to protect 1,450 jobs at Liberty Steel in South Yorkshire after the company collapsed into administration. The high court in London said on Thursday that Speciality Steel UK (SSUK), which has plants in Rotherham and Stocksbridge, would be put into administration. The company was then placed under the control of special managers appointed by the government’s official receiver. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Hurricane Erin’s tail may bring wet and windy end to UK summer", "url": "https://www.theguardian.com/uk-news/2025/aug/21/hurricane-erins-tail-may-bring-wet-and-windy-end-to-uk-summer", "id_key": "ed6dd84b46483057072c4ab460720fa323ced316e6941a619c0c32b2ec6f2280", "summary": "Met Office says thundery showers possible next week along with ‘very large waves’ off western isles of Scotland Wet and windy weather could be on the way for the final days of the summer holidays as the tail end of Hurricane Erin may disrupt the UK’s dry spell. Forecasters are tracking the potential impact of Erin, which is currently a category two storm moving eastwards across the North Atlantic , but say any effect on the UK would not happen until at least the middle of next week. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:22Z", "source": "Guardian_World", "title": "Court throws out $500m civil fraud penalty against Donald Trump", "url": "https://www.theguardian.com/us-news/2025/aug/21/trump-civil-fraud-case-appeal-ruling", "id_key": "ce7e622fdccae5fb5704764c1ac4c9abdb1934178f89ccf226d79681b65ee41b", "summary": "Trump was sued by New York over inflated financial statements used for favorable terms from lenders and insurers An appeals court has thrown out the massive civil fraud penalty against Donald Trump , ruling on Thursday in New York state’s lawsuit accusing him of exaggerating his wealth. The decision came seven months after the Republican returned to the White House. A panel of five judges in New York’s mid-level appellate division said the verdict, which stood to cost Trump more than $515m and rock his real estate empire, was “excessive”. Continue reading...", "ingested_utc": "2025-08-21T15:39:22Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:38Z", "source": "Blockworks", "title": "Kraken completes full DVT integration for Ethereum staking", "url": "https://blockworks.co/news/kraken-full-dvt-integration-ethereum-staking", "id_key": "50eee933de864594df9af3bcbf86045eae4e8566757090e821056b3fa09f47a0", "summary": "Exchange says “essentially all” validators now run in distributed clusters, boosting decentralization and fault tolerance", "ingested_utc": "2025-08-21T15:39:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:38Z", "source": "Blockworks", "title": "Same game, new players — but retail’s now smarter", "url": "https://blockworks.co/news/same-game-new-players-top", "id_key": "6776c8d2d0cfbfb561d55137e6939686d84b40240beabe893b2c00002c4ffce2", "summary": "Retail FOMO is back, with CEX onboarding and search terms up", "ingested_utc": "2025-08-21T15:39:38Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:40Z", "source": "BitcoinMagazine", "title": "The UK Needs to Hear from Bitcoin Supporters — This App Sends Your MP a Message in 1 Click", "url": "https://bitcoinmagazine.com/politics/the-uk-needs-to-hear-from-bitcoin-supporters-this-app-sends-your-mp-a-message-in-1-click", "id_key": "2278f74a02757bb7b18fc8159753b04e2996fdcc5d6c8ee8683b5d527245004e", "summary": "Bitcoin Magazine The UK Needs to Hear from Bitcoin Supporters — This App Sends Your MP a Message in 1 Click Bitcoin Policy UK, the UK’s premier Bitcoin think tank and advocacy group, has launched an app that enables residents of the U.K. to contact their member of parliament (MP) to advocate for Bitcoin in just a few clicks. This post The UK Needs to Hear from Bitcoin Supporters — This App Sends Your MP a Message in 1 Click first appeared on Bitcoin Magazine and is written by Frank Corva .", "ingested_utc": "2025-08-21T15:39:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:42Z", "source": "CryptoSlate", "title": "MetaMask enters stablecoin scene with mUSD launch on Ethereum and Linea", "url": "https://cryptoslate.com/metamask-enters-stablecoin-scene-with-musd-launch-on-ethereum-and-linea/", "id_key": "e8ea6002ed49d8db82a7bebb1f9d7543a9cedf4d763fc1c9dae23f392540a02e", "summary": "MetaMask, the widely used self-custodial wallet, has revealed plans to launch its own stablecoin, MetaMask USD (mUSD), later this year. According to an Aug. 21 statement, mUSD will initially debut on Ethereum and Linea L2, where it will become a key component of Linea’s growing DeFi ecosystem. The project will be developed in collaboration with […] The post MetaMask enters stablecoin scene with mUSD launch on Ethereum and Linea appeared first on CryptoSlate .", "ingested_utc": "2025-08-21T15:39:42Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:39:43Z", "source": "CryptoBriefing", "title": "Coinbase adds World Liberty Financial’s USD1 stablecoin to listing roadmap", "url": "https://cryptobriefing.com/usd1-stablecoin-listing-coinbase/", "id_key": "851e2a8a8bd9b75edd1d3b353a9978bd06496d41ab6022377da0d749c4a6f77f", "summary": "Coinbase's potential listing of USD1 could enhance stablecoin adoption, impacting DeFi markets and increasing competition among stablecoins. The post Coinbase adds World Liberty Financial’s USD1 stablecoin to listing roadmap appeared first on Crypto Briefing .", "ingested_utc": "2025-08-21T15:39:43Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:41:40Z", "source": "NYTimes_Business", "title": "Walmart’s Earnings Show ‘Momentum’ as Tariffs Raise Prices", "url": "https://www.nytimes.com/2025/08/21/business/walmart-sales-retail-tariffs.html", "id_key": "c750dadd29cc7e07ac748b84bf0c96c1d16d3da877a99e504ca4f70033f16cc8", "summary": "After mixed reports from retail rivals, Walmart reported better-than-expected quarterly results and raised its sales forecast for the year.", "ingested_utc": "2025-08-21T15:41:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:41:40Z", "source": "NYTimes_Business", "title": "Powell Is on the Cusp of Taking a Big Gamble With the U.S. Economy", "url": "https://www.nytimes.com/2025/08/21/business/jerome-powell-fed-jackson-hole.html", "id_key": "b484e4590da54a601c8c8f6e2a7ad4bc51c3abbb2c76a1e8f26978122d3e90cf", "summary": "Jerome Powell, the Federal Reserve chair, is managing a high-stakes balancing act as he grapples with a cooling labor market, rising inflation and White House pressure to cut interest rates.", "ingested_utc": "2025-08-21T15:41:40Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:41:49Z", "source": "NPR_Top", "title": "'I regret that I didn't fight harder,' former labor secretary Robert Reich says", "url": "https://www.npr.org/2025/08/21/nx-s1-5507068/i-regret-that-i-didnt-fight-harder-former-labor-secretary-robert-reich-says", "id_key": "187f2bcc4034808926fc0b97f751504fc58b5b13e4c8b10742662f5ad364c873", "summary": "Reich served under President Clinton from 1993 to 1997. He opens his new memoir, Coming Up Short, with an apology on behalf of the Baby Boom generation for failing to build a more just society.", "ingested_utc": "2025-08-21T15:41:49Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:41:49Z", "source": "NPR_Business", "title": "Far fewer Canadians are visiting the U.S. this year, new numbers show", "url": "https://www.npr.org/2025/08/21/nx-s1-5508461/fewer-canadians-visiting-us", "id_key": "dd541f6e71849e43c551c85ff1fda8496a1962839313d7c812be61fcadca93b5", "summary": "Canadian residents made just 1.7 million return trips by motor vehicle back into their country from the U.S. in July, a nearly 37% decline over the same month in 2024, according to Statistics Canada.", "ingested_utc": "2025-08-21T15:41:49Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:09Z", "source": "TheVerge_All", "title": "How Burning Man VR rebuilt after Microsoft shut it down", "url": "https://www.theverge.com/lowpass-newsletter/762887/burning-man-vr-microsoft-rebuilt", "id_key": "6f797928dec306689f29dd6e824190cd5139917eca47c06fd5c07e9b6a93e453", "summary": "It was all just supposed to be a one-time thing. When Burning Man got canceled because of covid-19 in 2020, a number of attendees banded together to re-create the festival on the social VR platform Altspace. That virtual Burning Man experience not only attracted around 13,000 visitors, but also accolades from the Producers Guild of […]", "ingested_utc": "2025-08-21T15:42:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:09Z", "source": "TheVerge_All", "title": "Apple TV Plus is getting more expensive and will cost $12.99 per month", "url": "https://www.theverge.com/news/763486/apple-tv-plus-streaming-price-increase", "id_key": "17c545c40c86c0f60b0517b9097431942149a92bb5a2b5f9c2ad7bef9d62a17e", "summary": "Apple is raising the price of its streaming service. The company announced on Thursday that its $9.99 per month subscription will now cost $12.99 each month, marking a $3 price increase. The price increase will go into effect immediately for new subscribers, while existing ones will see the changes reflected 30 days after their billing […]", "ingested_utc": "2025-08-21T15:42:09Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:12Z", "source": "Engadget_All", "title": "Apple TV+ subscriptions just rose to $13 a month", "url": "https://www.engadget.com/entertainment/tv-movies/apple-tv-subscriptions-just-rose-to-13-a-month-150516370.html?src=rss", "id_key": "54652c99ae2a8743147ae734dcaa865852895c5bdffa812002b30c6cba2ec7f4", "summary": "Apple is once again raising the price of its streaming service. Apple TV+ is shooting up to $13 per month, from $10 per month. This is effective immediately. Current subscribers will see the price change 30 days after the next renewal date. There's one spot of good news here. The pricing for the yearly subscription remains unchanged, as does the cost of an Apple One bundle. Many platforms start cheap before slowly turning the heat up, using the drug dealer method of salesmanship. However, Apple really did a speed run here . The platform isn't very old and cost $7 per month as recently as 2023. Now it's nearly twice that amount. In a recent earnings call, the company said that overall Apple TV+ viewership rose \"strong double digits year over year.\" The platform has been generating mainstream buzz. Severance has proven to be a gigantic hit and The Studio scooped up plenty of Emmy nominations this year. The platform's also a sci-fi powerhouse, releasing shows like For All Mankind , Invasion , Foundation , Murderbot , Silo and Dark Matter , among others. This article originally appeared on Engadget at https://www.engadget.com/entertainment/tv-movies/apple-tv-subscriptions-just-rose-to-13-a-month-150516370.html?src=rss", "ingested_utc": "2025-08-21T15:42:12Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:12Z", "source": "Engadget_All", "title": "The first update for Proton's privacy-focused chatbot offers major performance improvements", "url": "https://www.engadget.com/ai/the-first-update-for-protons-privacy-focused-chatbot-offers-major-performance-improvements-145255425.html?src=rss", "id_key": "8a583cb5ca5cbe71d9f60c975c33423be2b65ab6d33912de7d981e0c9d95054c", "summary": "In July, Proton, the company behind Proton Mail , released Lumo , a privacy-focused AI chatbot. Now, just under a month later, Proton has begun rolling out Lumo 1.1 to both free and paying users, and according to the company, the updated assistant \"performs significantly better across the board\" relative to its predecessor. Just how much better is the new version of Lumo? Proton claims it offers a 170 percent improvement in context understanding, meaning the chatbot is able to more accurately answer questions based on documents and data users share with it. It's also 40 percent better at generating working code, and 200 percent better at working through multi-step problems, as well as using the right tools to tackle tricky prompts. Proton One area where the original release felt like it wasn't up to the level of the competition was when it came to providing answers about current events. Thanks to a better web search tool, Proton says Lumo 1.1 should provide more accurate answers while suffering from fewer hallucinations. Proton doesn't say how it measured those improvements, but the company did share a handful of screenshots that compare the responses generated by Lumo 1.1 and 1.0. If nothing else, the new chatbot does a better job of formatting its answers in a way that's easy to follow. As before, any conversations you have with Lumo are encrypted, with no logs shared with Proton or any other company. Proton is also releasing the code for Lumo's iOS and Android apps so the open source community can verify the company's security credentials. This article originally appeared on Engadget at https://www.engadget.com/ai/the-first-update-for-protons-privacy-focused-chatbot-offers-major-performance-improvements-145255425.html?src=rss", "ingested_utc": "2025-08-21T15:42:12Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:21Z", "source": "TheStreet_Top", "title": "Amazon has fresh recipe to disrupt Kroger, Publix, local grocery", "url": "https://www.thestreet.com/retail/amazon-has-fresh-recipe-to-disrupt-kroger-publix-local-grocery", "id_key": "9250f2f59dd5b47c4b4a80a8947ac5bc2b5c3618efde8bdb85cf1f449669ca6e", "summary": "After a lot of mistakes, the online retail giant has quietly figured out how to become a massive grocery chain.", "ingested_utc": "2025-08-21T15:42:21Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:28Z", "source": "FinancialPost_Business", "title": "Clairvest Provides Update on Head Digital Works Investment", "url": "https://financialpost.com/globe-newswire/clairvest-provides-update-on-head-digital-works-investment", "id_key": "46838ed2c6c927595470cfd161ec8e57b006e1ddb4ff220ee47c504768956258", "summary": "TORONTO, Aug. 21, 2025 (GLOBE NEWSWIRE) — Clairvest Group Inc. (TSX: CVG) (“CVG”) announced a material adverse regulatory development with respect to Head Digital Works (the “Company”), a leading online skill based gaming platform in India. CVG and Clairvest Equity Partners V invested in the Company in 2017. On August 21, 2025, the Parliament of […]", "ingested_utc": "2025-08-21T15:42:28Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:28Z", "source": "FinancialPost_Business", "title": "Small Canadian Firms Are Paying for Trade War Despite Exemptions", "url": "https://financialpost.com/pmn/business-pmn/small-canadian-firms-are-paying-for-trade-war-despite-exemptions", "id_key": "53ea84d7c63d8006e584f3901aa7ab054c9c3f34d214e118bdaba1517b4dbc0b", "summary": "After US President Donald Trump announced tariffs on imports from Canada in March, one small Ontario manufacturer saw orders plunge to nearly zero.", "ingested_utc": "2025-08-21T15:42:28Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:28Z", "source": "FinancialPost_Business", "title": "WEBTOON Entertainment Joins Fast Company Innovation Festival to Discuss Creator-Driven Content in Hollywood and the Future of Entertainment", "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/webtoon-entertainment-joins-fast-company-innovation-festival-to-discuss-creator-driven-content-in-hollywood-and-the-future-of-entertainment", "id_key": "49bbd4fce6ddbf8b8950bb8d22cb5587e4d533b1781014336540546132514a36", "summary": "Streaming sensation Valkyrae will join WEBTOON Entertainment for a panel about Creator Content in Hollywood alongside Halle Stanford, President, and Executive Producer of 7 Crow Stories; and TV writer and Producer Ray Utarnachitt LOS ANGELES — WEBTOON Entertainment Inc. (Nasdaq: WBTN), a leading global entertainment company and home to some of the world’s largest storytelling […]", "ingested_utc": "2025-08-21T15:42:28Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:28Z", "source": "FinancialPost_Business", "title": "Canada’s Best in Landscaping Honoured at 22nd Annual National Awards of Landscape Excellence", "url": "https://financialpost.com/globe-newswire/canadas-best-in-landscaping-honoured-at-22nd-annual-national-awards-of-landscape-excellence", "id_key": "fc4bb21ac9c7d5a40089ccb4219de6ddd35aee2232083e2928b40490e6aa0f74", "summary": "Industry leaders from across the country gathered in Regina, SK, to celebrate award-winning projects showcasing innovation, craftsmanship, and a commitment to raising professionalism in the landscape sector. Milton, Ontario, Aug. 21, 2025 (GLOBE NEWSWIRE) — August 13, Regina, SK —The 22nd annual National Awards of Landscape Excellence (NALE) winners were announced live on August 12, […]", "ingested_utc": "2025-08-21T15:42:28Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:28Z", "source": "FinancialPost_Business", "title": "MEDIA ALERT – Little Canada Celebrates Change with Sankofa Square", "url": "https://financialpost.com/globe-newswire/media-alert-little-canada-celebrates-change-with-sankofa-square", "id_key": "067fd0d7271d38d33f736793375307a855c6e013aed60eb536a8371bcef1f55c", "summary": "TORONTO, Aug. 21, 2025 (GLOBE NEWSWIRE) — What:On August 23, the City of Toronto will come together to mark Canada’s First Major Public Sankofa Day Celebration with the official renaming and programming at Sankofa Square (formerly Yonge-Dundas Square). Right next door, Little Canada is joining in the festivities by rebranding its miniature version of the […]", "ingested_utc": "2025-08-21T15:42:28Z"}
{"published_utc": "2025-08-21", "retrieved_date": "2025-08-21", "retrieved_utc": "2025-08-21T15:42:42Z", "source": "HackerNews_Top", "title": "Launch HN: Skope (YC S25) – Outcome-based pricing for software products", "url": "https://news.ycombinator.com/item?id=44973758", "id_key": "fd76d5a5561747f61fe7b79ada18c24ffb1fb8100f4859722d4ae4fcdf3eae7e", "summary": "Comments", "ingested_utc": "2025-08-21T15:42:42Z"}
